Repository: espindula/br-lfs
Catalog: blfs/traduc/po/lxqt/apps/juffed.xml.1.chaine.po
Languages: fr

source: 1.3 MB
fr: 1.3 Mo

source: 22 MB
fr: 22 Mo

source: Introduction to JuffEd
fr: Introduction à juffed

source: The _A632_ package is a Qt based editor with support for multiple tabs.
fr: Le paquet _A632_ est un éditeur basé sur Qt utilisant de multiples onglets.

source: It is simple and clear, but very powerful.
fr: Il est simple et clair, mais très puissant.

source: It supports language syntax highlighting, auto-indents in accordance with file type, code blocks folding, matching braces highlighting with instant jumps between them, powerful search and replacing text using regular expressions (including multiline ones) with the opportunity to use matches 1, 2, &hellip; in substitutions, a terminal emulator, saving named sessions and many other features.
fr: Avec la coloration syntaxique, auto-indentation en fonction des types de fichiers, gestion des blocs de code, coloration des accolades correspondantes avec des sauts instantanés entre elles, recherche puissante et remplacement de texte en utilisant les expressions rationnelles (incluant le multiligne) avec l'opportunité d'utiliser la correspondance 1, 2, &hellip; dans les remplacements, un émulateur de terminal, sauvegarde de sessions nommées et beaucoup d'autres fonctions.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: The source tarball shown above was created by the BLFS team by cloning the source code repository, finding the correct version to rename accordingly the source code directory, removing _F339_ directory and _F1158_ file, and finally making the compressed tarball.
fr: Le paquet source indiqué est créé par l'équipe BLFS en clonant les dépots des sources, en trouvant la bonne version pour renommer le répertoire des sources en fonction, en supprimant le répertoire _F339_ et le fichier _F1158_ , et finallement en faisant une archive compressée.

source: No other modification has been made.
fr: Aucune autre modification est effectuée.

source: JuffEd Dependencies
fr: Dépendances de juffed

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of JuffEd
fr: Installation de juffed

source: For compilation with _A399_ , see
fr: Pour la compilation avec _A399_ , voir

source: Command Explanations
fr: Explications des commandes

source: Install _A632_ by running the following commands:
fr: Installez _A632_ en lançant les commandes suivantes :

source: The choice of _F153_ prefix is due to the general characteristics of this program, which can be used without _A314_ .
fr: Le choix du préfixe _F153_ est à cause des caractéristiques générales de ce programme, qui peut être utilisé sans _A314_.

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: This switch is used in order to enable building the terminal.
fr: Ce paramètre est utilis pour pouvoir activer la construction du Terminal.

source: Toggle to
fr: Remplacez par

source: or remove the switch, if you do not wish it.
fr: ou supprimez le paramètre, si vous ne le vulez pas.

source: This switch is used in order to build this application linked to _A309_ .
fr: Ce paramètre est utilisé pour construire cette application liée à _A309_.

source: , if you prefer to use _A399_ .
fr: , si vous préférez utilisez _A399_.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: libjuff.so, libjuffed-engine-qsci.so and plugins under /usr/lib/juffed/plugins
fr: libjuff.so, libjuffed-engine-qsci.so et plugins under /usr/lib/juffed/plugins

source: Short Descriptions
fr: Descriptions courtes

source: is a _A105_ based text editor.
fr: est un éditeur basé sur _A105_.

source: contains the _A632_ API functions.
fr: contient les fonctions de l'API de _A632_.

source: contains the _A594_ bindings.
fr: contient les liaisons _A594_.
