Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/videoutils/ffmpeg.xml.1.chaine.po
Languages: fr

source: 6.9 MB
fr: 6.9 Mo

source: 156 MB (additional 2450 MB for the FATE suite and 2251 MB for the documentation, making a total of 4.8 GB for the complete build of this page)
fr: 156 Mo (additional 2450 Mo for the FATE suite and 2251 Mo for the documentation, making a total of 4.8 Go for the complete build of this page)

source: Introduction to FFmpeg
fr: Introduction à FFmpeg

source: It is a very fast video and audio converter and it can also acquire from a live audio/video source.
fr: C'est un convertisseur audio et vidéo très rapide et il peut aussi acquérir à partir d'une source audio et vidéo en direct.

source: Designed to be intuitive, the command-line interface (_C606_ ) tries to figure out all the parameters, when possible.
fr: Conçu pour être intuitif, l'interface en ligne de commande (_C606_) tente de couvrir tous les paramètres lorsque cela est possible.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: FFmpeg Dependencies
fr: Dépendances de FFmpeg

source: Recommended
fr: Recommandées

source: Recommended for desktop use
fr: Recommandées pour une utilisation de bureau

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Install _A365_ by running the following commands:
fr: Installez _A365_ en lançant les commandes suivantes :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This command adds the _A366_ library to the _A367_ _E14_ variable and enables the discovery of _A367_ .
fr: Cette commande ajoute la bibliothèque _A366_ dans la variable _E14_ de _A367_ et active la découverte de _A367_.

source: Fix some .texi files for documentation builds.
fr: Corrige des fichiers .texi pour la construction de la documentation.

source: Fix permissions of documentation files and directories.
fr: Corrige des droits de fichiers et de répertoires de documentation.

source: Enables _A368_ support.
fr: Active le support de _A368_.

source: Enables the use of GPL code and permits support for postprocessing, swscale and many other features.
fr: Ce paramètre autorise l'utilisation de code GPL et permet le support pour que postprocessing, swscale et bien d'autres fonctionnalités.

source: Enables the use of (L)GPL version 3 code.
fr: Active l'utilisation du code (L)GPL version 3.

source: Enables the use of nonfree code.
fr: Active l'utilisation de code non-libre.

source: Note that the resulting libraries and binaries will be unredistributable.
fr: Notez que les binaires et bibliothèques ne seront pas distribuable.

source: Enables building shared libraries, otherwise only static libraries are built and installed.
fr: Active la construction des bibliothèques partagées, sinon seulement les bibliothèques statiques sont construites et installées.

source: Disables building debugging symbols into the programs and libraries.
fr: Désactive la construction des symboles de déboguage dans les programmes et les bibliothèques.

source: Enables ASS/SSA subtitle format rendering via _F208_ .
fr: Active le moteur de rendu du format de sous-titre ASS/SSA via _F208_.

source: Enables currently the highest-quality AAC audio encoding via _F222_ .
fr: Active actuellement l'encodage et le décodage audio de plus grande qualité dans le format AAC via _F222_.

source: Enables MP3 audio encoding via _F209_ .
fr: Active l'encodage MP3 via _F209_.

source: Enables Theora video encoding via _F210_ and _F989_ .
fr: Active l'encodage vidéo Theora via _F210_ et _F989_.

source: Enables WebM encoding via _F210_ and _F211_ .
fr: Active l'encodage WebM via _F210_ et _F211_.

source: Enables high-quality H.264/MPEG-4 AVC encoding via _F223_ .
fr: Active l'encodage de haute qualité H.264/MPEG-4 AVC via _F223_.

source: Enables high-quality H.265/HEVC encoding via _F990_ .
fr: Active l'encodage haute qualité H.265/HEVC via _F990_.

source: Enables X11 grabbing.
fr: Active X11 grabbing.

source: Enables HTTPS protocol for network streams.
fr: Active le protocle HTTPS pour les flux réseaux.

source: This builds the _C614_ program which can modify QuickTime formatted movies (_F212_ or _F213_ ) so that the header information is located at the beginning of the file instead of the end.
fr: Cela construit le programme _C614_ qui peut modifier les films formatés en QuickTime (_F212_ ou _F213_) pour que les informations d'entête soit placées au début du fichier au lieu de la fin.

source: This allows the movie file to begin playing before the entire file has been downloaded.
fr: Cela permet de lire le film avant que le fichier entier ne soit téléchargé.

source: Support for most of the dependency packages requires using options passed to the _C101_ script.
fr: Le support de la plupart des paquets dépendants demande l'utilisation d'options passées au script _C101_.

source: View the output from _C320_ for complete information about enabling dependency packages.
fr: Regardez la sortie de _C320_ pour une information complète à propos de l'activation des paquets dépendants.

source: Configuring FFmpeg
fr: Configuration de FFmpeg

source: Config Files
fr: Fichiers de configuration

source: You'll find a sample _C615_ configuration file at _F993_ in the source tree.
fr: Vous trouverez un modèle de fichier de configuration pour _C615_ sur _F993_ dans l'arborescence des sources.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: /usr/include/libav{codec, device, filter, format, util}, /usr/include/libpostproc, /usr/include/libsw{resample, scale}, /usr/share/doc/ffmpeg-&ffmpeg-version;, and /usr/share/ffmpeg
fr: /usr/include/libav{codec, device, filter, format, util}, /usr/include/libpostproc, /usr/include/libsw{resample, scale}, /usr/share/doc/ffmpeg-&ffmpeg-version;, et /usr/share/ffmpeg

source: Short Descriptions
fr: Descriptions courtes

source: is a command-line tool to convert video files, network streams and input from a TV card to several video formats.
fr: est un outil en ligne de commande pour convertir des fichiers vidéo, des flux réseaux et des entrées d'une carte TV en divers formats vidéo.

source: is a very simple and portable media player using the _F994_ libraries and the SDL library.
fr: est un lecteur média très simple et portable utilisant les bibliothèques de _F994_ et la bibliothèque SDL.

source: gathers information from multimedia streams and prints it in a human and machine-readable fashion.
fr: rassemble des informations à partir de flux multimédia et les affiche d'une manière lisible par un homme ou une machine.

source: is a streaming server for everything that _C606_ could use as input (files, streams, TV card input, webcam, etc).
fr: est un serveur de flux pour toutes les entrées utilisables par _C606_ (fichiers, flux, entrées de carte TV, webcam, etc).

source: is a library containing the _A365_ codecs (both encoding and decoding).
fr: est une bibliothèque contenant les codecs _A365_ (pour l'encodage et le décodage).

source: is the _A365_ device handling library.
fr: est le periphérique _A365_ pour la manipulation de la bibliothèque.

source: is a library of filters that can alter video or audio between the decoder and the encoder (or output).
fr: est une bibliothèque ee filtres capables de modifier des vidéos ou des sons entre un décodeur et un encodeur (ou une sortie).

source: is a library containing the file formats handling (mux and demux code for several formats) used by _C616_ as well as allowing the generation of audio or video streams.
fr: est une bibliothèque contenant la gestion des formats de fichier (code mux et demux pour plusieurs formats) utilisée par _C616_ et permettant de générer des flux audio et vidéo.

source: is the _A365_ utility library.
fr: est la bibliothèque de l'utilitaire _A365_.

source: is the _A365_ audio rescaling library, it contains functions for converting audio sample formats.
fr: est la bibliothèque de _A365_ pour la transformation audio, elle contient des fonctions pour convertir les formats d'échantillon audio.
