Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/videoutils/vlc.xml.1.chaine.po
Languages: fr

source: 22 MB
fr: 22 Mo

source: 679 MB (with tests)
fr: 679 Mo (avec les tests)

source: 4.4 SBU (with tests)
fr: 4.4 SBU (avec les tests)

source: Introduction to VLC
fr: Introduction à VLC

source: It can play from many inputs, such as files, network streams, capture devices, desktops, or DVD, SVCD, VCD, and audio CD.
fr: Il peut afficher depuis différentes entrées comme des fichiers, des flux réseaux, des périphériques de capture, des ordinateurs, ou des DVD, des SVCD, des VCD, et des CD audio.

source: It can use most audio and video codecs (MPEG 1/2/4, H264, VC-1, DivX, WMV, Vorbis, AC3, AAC, etc. ), and it can also convert to different formats and/or send streams through the network.
fr: Il peut lire la plupart des codec audio et video (MPEG 1/2/4, H264, VC-1, DivX, WMV, Vorbis, AC3, AAC, etc), et il peut aussi convertir en différents formats et/ou envoyer les flux au travers du réseau.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: VLC Dependencies
fr: Dépendances de VLC

source: Recommended
fr: Recommandées

source: Optional features and packages
fr: Possibilités facultatives et paquets

source: Optional input plugins
fr: Greffons d'entrée facultatifs

source: Optional mux/demux plugins
fr: Greffons facultatifs de mux/demux

source: Optional codec plugins
fr: Greffons codec facultatifs

source: Optional video plugins
fr: Greffons video facultatifs

source: Optional audio plugins
fr: Greffons audio facultatifs

source: Optional interface plugins
fr: Greffons d'interface facultatifs

source: Optional visualisations and video filter plugins
fr: Greffons de visualisation facultatifs

source: Optional service discovery plugins
fr: Greffons facultatifs de découverte de service

source: Miscellaneous options
fr: Options diverses

source: User Notes:
fr: Notes utilisateur :

source: Install _A742_ by running the following commands:
fr: Installez _A742_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libvlccore.so, libvlc.so and several plugins in /usr/lib/vlc/plugins
fr: libvlccore.so, libvlc.so et plusieurs plugins dans /usr/lib/vlc/plugins

source: /usr/{include, lib, share}/vlc and /usr/share/doc/vlc-&vlc-version;
fr: /usr/{include, lib, share}/vlc et /usr/share/doc/vlc

source: Short Descriptions
fr: Descriptions courtes

source: is a script to run VLC with the dummy interface.
fr: est un script pour lancer VLC avec l'interface fictive.

source: is a script to run VLC with the ncurses interface.
fr: est un script pour lancer VLC avec l'interface ncurses.

source: is a script to run _A742_ with the _A105_ interface.
fr: est un script pour lancer _A742_ avec l'interface _A750_.

source: is a script to run _A742_ with a command line interface.
fr: est un script pour lancer _A742_ avec l'interface en ligne de commande.

source: is a script to run _A742_ with the skins interface.
fr: est un script pour lancer _A742_ avec l'interface paramétrable.

source: is the _A742_ media player.
fr: le lecteur de média _A742_.

source: is a wrapper to drop privileges with _A742_ .
fr: une enveloppe pour abandonner les privilèges avec _A742_.
