Repository: espindula/br-lfs
Catalog: faq/*.po
Languages: fr

source: <a href="#less-prints-ad">Why does less (and therefore man) print &lt;AD&gt; instead of hyphens?</a>
fr: <a href="#less-prints-ad">Pourquoi est-ce que less (et par conséquent man) affiche &lt;AD&gt; au lieu des tirets&nbsp;?</a>

source: Frequently Requested Enhancements
fr: Améliorations fréquemment demandées

source: Why not use LILO instead of GRUB?
fr: Pourquoi ne pas utiliser LILO plutôt que GRUB&nbsp;?

source: Since LFS-5.0, released 5 November 2003, LFS uses Grub instead of Lilo. Grub was chosen because it doesn't require reinstallation after a kernel upgrade and has a very nice rescue console.
fr: Depuis LFS-5.0, publiée le 5 novembre 2003, LFS utilise Grub plutôt que Lilo. Grub a été choisi parce qu'il n'a pas besoin d'être réinstallé après une mise à jour du noyau et a une très bonne console de secours.

source: If your current setup uses LILO or you'd like to use it anyway, you can, but beware you will also need to install BIN86 and, for the latest LILO versions, NASM. However, don't preach about it on the LFS mailinglists, since we've had many flamewars about it in the past.
fr: Si votre installation actuelle utilise LILO ou si vous souhaitez l'utiliser malgré tout, vous pouvez, mais soyez conscients que vous devrez aussi installer BIN86 et, pour les dernières versions de LILO, NASM. Cependant, ne prêchez pas cela sur les listes de diffusion de LFS, car nous avons déjà eu des discussions enflammées à ce propos.

source: Why not include the FAQ in the book?
fr: Pourquoi ne pas inclure la FAQ dans le livre ?

source: Marc Heerdink may have said it best in a post to lfs-dev:
fr: Marc Heerdink l'a sans doute mieux dit dans un post sur lfs-dev&nbsp;:

source: The problem is that the FAQ is a dynamic document. The FAQ for a book release is released only after the book version itself, because the FAQ is updated to reflect the Qs asked about the current version of the book. A link is better, since you'll always have the most up-to-date answers handy.
fr: Le problème c'est que la FAQ est un document dynamique. La FAQ pour une version du livre n'est publiée qu'après le livre, car la FAQ est mise à jour pour refléter les question posées à propos de la version actuelle du livre. Un lien c'est mieux, car vous aurez toujours la dernière information à jour à portée de main.

source: Why is vim in the book?
fr: Pourquoi vim est dans le livre ?

source: This is fairly well discussed in the thread starting at <a href="http://linuxfromscratch.org/pipermail/lfs-dev/2002-February/023030.html">http://linuxfromscratch.org/pipermail/lfs-dev/2002-February/023030.html</a>.
fr: Ça a bien été discuté dans le fil qui commence par <a href="http://linuxfromscratch.org/pipermail/lfs-dev/2002-February/023030.html">http://linuxfromscratch.org/pipermail/lfs-dev/2002-February/023030.html</a>.

source: Why is HJL's Binutils not in the book?
fr: Pourquoi est-ce que la version HJL de Binutils n'est pas dans le livre&nbsp;?

source: The binutils release that you typically find on ftp.gnu.org is commonly known as the &quot;FSF&quot; binutils. Noted hacker H.J. Lu also makes releases out of the main CVS repository and these are commonly known as the &quot;HJL&quot; binutils and can usually be found on ftp.kernel.org. Debate often arises over which version to use due to the fact that most mainstream distros tend to use the HJL releases even though they are typically marked as &quot;beta&quot;.
fr: La version de binutils que vous trouverez sur ftp.gnu.org est généralement appelée le binutils de la «&nbsp;FSF&nbsp;». Un hacker émérite, H. J. Lu, publie aussi un binutils en dehors du dépôt CVS principal et ces versions sont appelées les binutils «&nbsp;HJL&nbsp;» et peuvent souvent être trouvées sar ftp.kernel.org. Des débats éclatent souvent à propos de quelle version utiliser à cause du fait que la plupart des distributions connues utilisent plutôt les version HJL bien qu'elles sont souvent marquées «&nbsp;beta&nbsp;».

source: Here is our interpretation of the differences between the two:
fr: Voici notre interprétation sur les différences entre les deux&nbsp;:

source: HJL:
fr: HJL&nbsp;:

source: For Linux OS only
fr: Pour les OS linux seulement

source: Marked as &quot;beta&quot;
fr: Marqué comme &quot;beta&quot;

source: Closely follows the CVS HEAD
fr: Suit de très près le HEAD du CVS

source: Usually contains the latest subtle bug fixes
fr: Contient habituellement les dernières corrections de bogues subtiles

source: Usually has latest bug fixes for non-x86 arch's
fr: Contient habituellement les dernières corrections de bogues pour les architectures non x86

source: Usually a new release every time a significant bug that affects Linux gets fixed
fr: Habituellement une nouvelle version chaque fois qu'un bogue significatif qui affecte Linux est corrigé

source: Theoretically less stable due to newness of code
fr: Théoriquement moins stable à cause du code plus récent

source: FSF:
fr: FSF&nbsp;:

source: Supports more OS's (not only Linux)
fr: Supporte plus d'OS (pas seulement Linux)

source: Latest code from the stable branch of CVS
fr: Le code provient de la branche stable du CVS

source: Sometimes not up-to-date WRT to the latest bleeding edge kernel, gcc and glibc subtleties
fr: Parfois pas tout à fait à jours par rapport aux subtilités des versions ultra-récentes du noyau, de gcc et de la glibc

source: Often includes features backported from the CVS HEAD after a period of testing
fr: Inclus souvent des fonctionnalités récupérée depuis le HEAD du CVS après un période de test

source: Theoretically more stable
fr: Théoriquement plus stable

source: You'll notice in the above points words like &quot;usually&quot; and &quot;sometimes&quot;. This demonstrates how the situation can be different depending on which particular point in time you happen to be referring to. For example, from time to time there will be a new bleeding edge feature in gcc or glibc that requires support from binutils. During these times you will often hear the developers say &quot;you must be using the latest HJL binutils version x.y.z.a.b&quot;.
fr: Vous remarquerez dans les arguments ci-dessus des mots comme «&nbsp;habituellement&nbsp;» et «&nbsp;parfois&nbsp;». Cela montre que la situation peut différer en fonction du moment auquel on se réfère. Par exemple, de temps en temps il y a une nouvelle fonctionnalité dans gcc ou glibc qui requièrent un support de binutils. Pendant ces périodes, vous entendrez souvent les développeurs dire «&nbsp;vous devez utiliser la dernière version HJL de binutils x.y.z.a.b&nbsp;».

source: The only way to correctly choose the most appropriate release to use is to:-
fr: La seule manière de choisir correctement la version la plus appropriée à utiliser est de&nbsp;:

source: Stay abreast of the issues on the project mailing lists of the core toolchain packages
fr: Rester informés des problèmes sur les listes de diffusion des paquets du cœur de la chaîne d'outils

source: Have a large dose of technical prowess and/or programming talent to understand all the issues
fr: Avoir une large dose de prouesse technique et de talent en programmation pour comprendre tous les problèmes

source: Test like crazy by running the test suites
fr: Tester comme un fou en lançant les suites de tests

source: Test like crazy by building full systems
fr: Tester comme un fou en construisant des systèmes complets

source: The facts of the matter are that the core toolchain packages are all very tightly bound and must be tested to ensure they work together. You basically have to build a full working distro and test every aspect of it to be fully satisfied.
fr: Le vrai problème c'est que les paquets du cœur de la chaîne d'outils sont tous très liés entre eux et doivent être testés pour s'assurer qu'ils fonctionnent ensemble. Vous devez en gros construire une distribution complète et la tester sous toutes les coutures avant d'être satisfait.

source: If you follow the project mailing lists of the core toolchain packages for long enough, you'll soon realise that the developers do not care much whether a particular release of &quot;Package A&quot; works with a particular release of &quot;Package B&quot;. In other words, release coordination between the projects is not a priority. In reality, this means that Alan Cox is right when he says that you cannot just go to ftp.gnu.org and grab the latest of everything and always expect it to just work.
fr: Si vous suivez les listes de diffusion des paquet du cœur de la chaîne d'outils suffisamment longtemps, vous comprendrez que les développeurs ne se soucient pas vraiment qu'une version particulière du «&nbsp;Paquet A&nbsp;» fonctionne avec une version particulière du «&nbsp;Paquet B&nbsp;». En d'autres termes, la coordination des publications entre les projets n'est pas la priorité. En réalité, cela signifie que Alan Cox a raison lorsqu'il dit que vous ne pouvez pas simplement aller sur ftp.gnu.org et récupérer les dernière version de tout ce qui s'y trouve et vous attendre à ce que ça marche.

source: Why isn't some package manager in the book?
fr: Pourquoi n'y a-t'il pas de gestionnaire de paquets dans le livre&nbsp;?

source: Package management - beyond that provided by tarballs and makefiles - is beyond the scope of the book. If nothing else does, the number of different "solutions" should hint at some of the reasons.
fr: La gestion des paquets — au-delà de ce qui est fournit par des archives et des makefiles — est en dehors de la portée du livre. Si rien d'autre ne vous convainc, le nombre de «&nbsp;solutions&nbsp;» différentes devrait vous aider à en comprendre la raison.

source: Here are a few of the options:
fr: Voici quelques possibilités&nbsp;:

source: No package management is really necessary. Unless it is desirable to monitor package file placement minutely, any package large enough to warrent removal for disk space reasons can be installed in /opt as detailed by the FHS (perhaps in /opt/foo-x.x with a link from /opt/foo), and new releases can usually be installed over the old, although major upgrades and libraries are generally best done by rebuilding the system from the bottom up.
fr: Aucun gestionnaire de paquet n'est vraiment nécessaire. À moins que vous ne souhaitiez vérifier le placement des fichiers des paquets minutieusement, tout paquet suffisamment gros pour qu'on ait envie de le supprimer pour faire de la place sur le disque peut être installé dans /opt comme décrit par le FHS (peut-être dans /opt/foo-x.x avec un lien depuis /opt/foo) et les nouvelles versions peuvent généralement être réinstallées par dessus l'ancienne, bien que les mises à jour majeures et les bibliothèques soient mieux traitées en reconstruisant le système depuis le début.

source: RPM, the Redhat Package Manager, is used by a number of distributions. It is available from <a href="http://www.rpm.org/">http://www.rpm.org/</a>, and there is an <a href="../hints/downloads/files/">RPM Hint</a> to help with installation.
fr: RPM, le gestionnaire de paquet de Redhat, est utilisé par un certain nombre de distributions. Il est disponibles sur <a href="http://www.rpm.org/">http://www.rpm.org/</a> et il y a une <a href="../hints/downloads/files/">astuce RPM</a> pour vous aider à l'installer.

source: There are several implementations of symlink style package management:
fr: Il y a plusieurs implémentations d'une gestion de paquets par les liens symboliques&nbsp;:

source: Epkg is available from <a href="http://www.encap.org/epkg/">http://www.encap.org/epkg/</a>.
fr: Epkg est disponible sur <a href="http://www.encap.org/epkg/">http://www.encap.org/epkg/</a>.

source: Graft is available from <a href="http://peters.gormand.com.au/Home/tools" >http://peters.gormand.com.au/Home/tools</a>.
fr: Graft est disponible sur <a href="http://peters.gormand.com.au/Home/tools" >http://peters.gormand.com.au/Home/tools</a>.

source: GNU Stow is available from <a href="http://www.gnu.org/software/stow/">http://www.gnu.org/software/stow/</a>.
fr: GNU Stow est disponible sur <a href="http://www.gnu.org/software/stow/">http://www.gnu.org/software/stow/</a>.

source: And several more are listed in the Graft documentation at <a href="http://peters.gormand.com.au/Home/tools/graft/graft-html#research">http://peters.gormand.com.au/Home/tools/graft/graft-html#research</a>.
fr: Et bien d'autres sont listés dans la documentation de Graft sur <a href="http://peters.gormand.com.au/Home/tools/graft/graft-html#research">http://peters.gormand.com.au/Home/tools/graft/graft-html#research</a>.

source: The NetBSD package manager, pkgsrc, is available on other systems including Linux. It is at <a href="ftp://ftp.netbsd.org/pub/pkgsrc/stable/">ftp://ftp.netbsd.org/pub/pkgsrc/stable/</a>.
fr: Le gestionnaire de paquets de NetBSD, pkgsrc, est disponible sur d'autres systèmes, y compris Linux. Il se trouve sur <a href="ftp://ftp.netbsd.org/pub/pkgsrc/stable/">ftp://ftp.netbsd.org/pub/pkgsrc/stable/</a>.

source: Originally based on a script written by LFS' own Gerard Beekmans, install-log records a list of files installed by a package as the package is installed. It is available from <a href="http://install-log.sourceforge.net/">http://install-log.sourceforge.net/</a>.
fr: À l'origine basé sur un script écrit par notre Gerard Beekmans, install-log enregistre une liste de fichiers installés par un paquet à l'installation. Il est disponible sur <a href="http://install-log.sourceforge.net/">http://install-log.sourceforge.net/</a>.

source: Gerard has since made additions to his script. It is available from <a href="http://linuxfromscratch.org/~gerard/log-install">http://linuxfromscratch.org/~gerard/log-install</a>.
fr: Gerard a depuis fait des modifications à son script. Il est disponible sur <a href="http://linuxfromscratch.org/~gerard/log-install">http://linuxfromscratch.org/~gerard/log-install</a>.

source: CheckInstall attempts log system calls made by "make install". It is available from <a href="http://asic-linux.com.mx/%7Eizto/checkinstall/">http://asic-linux.com.mx/~izto/checkinstall/</a>.
fr: CheckInstall essaye d'enregistrer les appels systèmes effectués par «&nbsp;make install&nbsp;». Il est disponible sur <a href="http://asic-linux.com.mx/%7Eizto/checkinstall/">http://asic-linux.com.mx/~izto/checkinstall/</a>.

source: pkgutils, used by the CRUX distribution, is available from <a href="http://www.fukt.bsnet.se/%7Eper/pkgutils/">http://www.fukt.bsnet.se/~per/pkgutils/</a>.
fr: pkgutils, utilisé par la distribution CRUX, est disponible sur <a href="http://www.fukt.bsnet.se/%7Eper/pkgutils/">http://www.fukt.bsnet.se/~per/pkgutils/</a>.

source: There are some <a href="../hints/downloads/files/">hints</a> available for package managers.
fr: Il y a quelques <a href="../hints/downloads/files/">astuces</a> disponibles pour les gestionnaires de paquets.

source: If you have an addition to the list, please do email its id, URL, and other information, to the FAQ maintainer or an appropriate LFS mailing list so it can be added here.
fr: Si vous avez quelque chose à rajouter à la liste, merci d'envoyer son id, URL, et d'autres informations, au mainteneur de la FAQ ou à une liste de diffusion appropriée pour que ça soit ajouté.

source: How do I make my machine poweroff when shut down?
fr: Comment provoquer l'arrêt électrique de la machine à la sortie du système&nbsp;?

source: Power Management is a kernel function, you need to enable it in the kernel. In the 2.4 kernel, you have to enable the options for <code>Power Management Support</code> under <code>General Setup</code>. For older machines, you'll probably want the APM options, newer machines often require ACPI. Make sure that either APM or ACPI be enabled in the kernel, but definitely <strong>not</strong> both at the same time - this has been known to cause problems such as neither actually taking effect. Also try disabling SMP if you only have one processor; it's also known to prevent a proper poweroff. Make sure you read the help with each option.
fr: La gestion de l'énergie est une fonctionnalité du noyau, vous devez l'activer dans le noyau. Dans le noyau 2.4, vous devez active les options pour <code>Power Management Support</code> dans <code>General Setup</code>. Pour les vieilles machines, vous voudrez sans doute les options APM, les nouvelles machines requièrent souvent ACPI. Assurez-vous que soit APM soit ACPI soit activé dans le noyau, mais <strong>jamais</strong> les deux en même temps — c'est connu pour poser des problèmes comme par exemple aucun ne fait d'effet. Essayez aussi de désactiver SMP si vous n'avez qu'un processeur&nbsp;; il est connu pour empêcher l'extinction propre. Assurez-vous de lire l'aide de chaque option.

source: After rebooting into the new kernel you should be able to poweroff your machine with the command <code>shutdown -h now</code> or <code>poweroff</code> (also read <code>man shutdown</code> and <code>man halt</code>). If you compiled APM or ACPI as modules, make sure they are loaded before you try to power off. Some machines require that APM or ACPI is compiled into the kernel because it needs to be initialised at boottime.
fr: Après avoir redémarré dans le nouveau noyau vous devriez être capable d'éteindre votre machine avec la commande <code>shutdown -h now</code> ou <code>poweroff</code> (lisez aussi <code>man shutdown</code> et <code>man halt</code>). Si vous compilez APM ou ACPI en tant que modules, assurez-vous qu'ils soient chargés avant d'essayer d'éteindre la machine. Certaines machines requièrent que APM ou ACPI soit compilé dans le noyau car ils doivent être initialisés au démarrage.

source: <a href="#lfsfaq">Back to the top.</a>
fr: <a href="#lfsfaq">Haut de la page.</a>

source: When reading and building LFS
fr: Pendant la lecture et la construction de LFS

source: What distribution should I use to start from?
fr: Quelle distribution devrais-je utiliser, pour démarrer&nbsp;?

source: Most relatively recent distributions should be fine. Do not use Fedora Core 4 as its version of GCC does not work with the current stable version of LFS. Make sure you have installed and/or updated the development packages. (Look for ones starting in "gcc", "glibc", or "libstdc++" or ending in "-dev".). If you want to use LFS as your main system and you wish to install it without first installing a distribution, try <a href="http://www.knopper.net/knoppix/index-en.html">Knoppix</a>.
fr: La plupart des distributions relativement récentes devraient fonctionner. N'utilisez pas Fedora Core 4 car sa version de GCC ne fonction pas avec la versions stable actuelle de LFS. Assurez-vous d'avoir installé ou mis à jour les paquets de développement. (Recherchez ceux qui commencent par «&nbsp;gcc&nbsp;», «&nbsp;glibc&nbsp;» ou «&nbsp;libstdc++&nbsp;» ou qui finissent par «&nbsp;-dev&nbsp;»). Si vous souhaitez utiliser LFS comme système principal et souhaitez l'installer sans d'abord installer une distribution, essayez <a href="http://www.knopper.net/knoppix/index-en.html">Knoppix</a>.

source: How do I compile a kernel or set up modules?
fr: Comment compiler un noyau ou configurer un module&nbsp;?

source: In addition to the kernel documentation at <a href="file:///usr/src/linux/Documentation">/usr/src/linux/Documentation</a> or wherever you unpacked your kernel source and the help in kernel config tool (make menuconfig), see the Module-HOWTO at <a href="http://www.tldp.org/HOWTO/Module-HOWTO/">http://www.tldp.org/HOWTO/Module-HOWTO/</a>.
fr: En plus de la documentation du noyau sur <a href="file:///usr/src/linux/Documentation">/usr/src/linux/Documentation</a> ou là où vous avez décompressé les sources du noyau et de l'aide dans l'outil de configuration du noyau (make menuconfig), voyez le Module-HOWTO sur <a href="http://www.tldp.org/HOWTO/Module-HOWTO/">http://www.tldp.org/HOWTO/Module-HOWTO/</a>.

source: Are compiler warnings from GCC bad?
fr: Est-ce que c'est mal, les avertissements de compilation de Gcc&nbsp;?

source: Short answer: no.
fr: Réponse courte&nbsp;: non.

source: Long answer: probably, but only to someone working on the package you're trying to compile. Mostly, everything will be fine unless make quits with an error.
fr: Répons longue&nbsp;: sans doute, mais seulement pour quelqu'un qui travaille sur le paquet que vous essayez de compiler. Généralement, tout ira bien à moins que make ne quitte en erreur.

source: Here's an example:
fr: Voici un exemple&nbsp;:

source: sk ~/tmp $ ######## that worked ########
fr: sk ~/tmp $ ######## ça a fonctionné ########

source: sk ~/tmp $ ######## that failed ########
fr: sk ~/tmp $ ######## ça a échoué ########

source: How do I make that really small install the book mentions?
fr: Comment puis-je procéder à cette toute petite installation dont parle le livre&nbsp;?

source: Gerard describes the process of making a 5MB LFS install in <a href="http://linuxfromscratch.org/pipermail/lfs-support/2001-October/000202.html">an email to lfs-support</a>, and there are links to many resources in <a href="http://linuxfromscratch.org/pipermail/lfs-support/2002-June/007255.html">a post by Cor Lem</a> and a reply to it.
fr: Gerard a décrit comment créer une installation LFS de 5 Mo dans <a href="http://linuxfromscratch.org/pipermail/lfs-support/2001-October/000202.html">un courriel sur lfs-support</a> et il y a des liens vers plusieurs ressources dans <a href="http://linuxfromscratch.org/pipermail/lfs-support/2002-June/007255.html">un post de Cor Lem</a> et une réponse.

source: Is there information about building LFS on other processors?
fr: Existe-t'il des informations sur la façon de construire LFS sur d'autres architectures&nbsp;?

source: For information about building LFS for a wide array of systems, take a look at the <a href="http://trac.clfs.org/wiki/read">Cross-LFS branch</a> of LFS.
fr: Pour des informations sur la construction de LFS pour une vaste catégorie de systèmes, regardez <a href="http://trac.clfs.org/wiki/read">Cross LFS</a>.

source: For Alpha systems, Kelledin maintains a list of fixes for building on the Alpha platform at <a href="http://skarpsey.dyndns.org/alpha-lfs/alpha.html">http://skarpsey.dyndns.org/alpha-lfs/alpha.html</a>.
fr: Pour les systèmes Alpha, Kelledin maintient une liste de correctifs pour la construction sur la la plateforme Alpha sur <a href="http://skarpsey.dyndns.org/alpha-lfs/alpha.html">http://skarpsey.dyndns.org/alpha-lfs/alpha.html</a>.

source: How do I cross compile LFS?
fr: Comment faire une compilation croisée avec LFS&nbsp;?

source: It's often useful to compile LFS for one machine on another machine. Say using that fast 1Ghz Athlon to build an install for an old 486. While this is technically not cross compiling, binaries compiled for the Athlon cannot be run on the 486 because binaries compiled for the newer processor use features the older processor doesn't have.
fr: Il est souvent utile de compiler LFS pour une machine sur une autre machine. Disons que vous utilisez ce véloce Athlon 1 GHz pour construire et installer sur un vieux 486. Bien que ça ne soit pas techniquement de la compilation croisée, les binaires compilés sur l'Athlon ne peuvent pas être lancés sur le 486 can les binaires compilés sur les nouveaux processeurs utilisent des fonctionnalités que les vieux processeurs n'ont pas.

source: The LFS book specifically for cross compiling is the <a href="http://trac.clfs.org/wiki/read">Cross-LFS</a> book. Another source of information would be the <a href="/hints/downloads/files/">cross-compiling hint</a>.
fr: Le livre LFS spécifique à la compilation croisée est le livre <a href="http://trac.clfs.org/wiki/read">Cross-LFS</a>. Une autre source d'information serait <a href="/hints/downloads/files/">l'astuce sur la compilation croisée</a>.

source: What's a DOS format text file?
fr: Qu'est qu'un fichier texte au format DOS&nbsp;?
