Repository: espindula/br-lfs
Catalog: faq/*.po
Languages: fr

source: Is support for the filesystem compiled into the kernel. Again, not a module. Support for ext2 is enabled by default, but others like ext3, reiser, jfs, and xfs are not.
fr: Le support pour le système de fichier est-il compilé dans le noyau&nbsp;? De nouveau, pas en tant que module. Le support pour ext2 est activé par défaut, mais les autres comme ext3, reiser, jfs et xfs ne le sont pas.

source: When you see, in your syslogs, this line:
fr: Lorsque vous voyez dans votre journal système, cette ligne&nbsp;:

source: It means you have an error in the /etc/inittab line beginning with the given id ("1" in this example).
fr: Cela signifie que vous avez une erreur dans la ligne /etc/inittab qui commence avec l'id indiqué («&nbsp;1&nbsp;» dans l'exemple).

source: <code>char-major-10-135</code> refers to the character device, major 10, minor 135, which is /dev/rtc. It provides access to the BIOS clock, or RTC, the Real Time Clock. See /usr/src/linux/Documentation/rtc.txt for more information.
fr: <code>char-major-10-135</code> se rapporte au périphérique de caractère, majeur 10, mineur 135, qui est /dev/rtc. Il fournit l'accès à l'horloge du BIOS, ou RTC, l'Horloge Temps Réel. Voir /usr/src/linux/Documentation/rtc.txt pour plus d'information.

source: The error is because something, most likely hwclock, is trying to use /dev/rtc but you haven't configured kernel support for it in your kernel. Either delete /dev/rtc so hwclock won't try to use it or enable RTC support in your kernel. It's located in make menuconfig under "Character devices" -&gt; "Enhanced Real Time Clock Support".
fr: L'erreur provient du fait que quelque chose, probablement hwclock, essaye d'utiliser /dev/rtc sans que vous ayez configuré le noyau pour le supporter. Soit vous supprimez /dev/rtc pour que hwclock n'essaye plus de l'utiliser, soit vous activez le support RTC dans votre noyau. Il se trouve dans le make menuconfig dans la section «&nbsp;Character devices&nbsp;» -&gt; «&nbsp;Enhanced Real time Clock Support&nbsp;».

source: See the question <a href="#char-major-10-135">"modprobe: Can't locate module char-major-10-135"</a>.
fr: Voir la question <a href="#char-major-10-135">"modprobe: Can't locate module char-major-10-135"</a>

source: The full error looks like this:
fr: L'erreur complète ressemble à ceci&nbsp;:

source: eth0 is a virtual device with no /dev entry. It refers to the first detected network card in your system. The reason the kernel can't find this device is because you forgot to add support for your network card in the kernel. The kernel detected the card but doesn't have a driver for it. The LFS boot script tries to bring up the network but fails because of this.
fr: eth0 est un périphérique virtuel sans entrée dans /dev. Il se réfère à la première carte réseau détectée par votre système. La raison pour laquelle le noyau ne peut pas trouver le périphérique est que vous avez oublié d'ajouter le support pour votre carte réseau dans le noyau. Le noyau détecte la carte réseau mais n'a pas de pilote pour elle. Le script de démarrage de LFS essaye d'activer le réseau mais échoue à cause de cela.

source: Recompile your kernel with the proper driver, either built in or as a module. If you compiled the network driver as a module, then also adjust /etc/modules.conf to alias the network card module as eth0; for example: <code>alias eth0 8139too</code>. If you don't know which network card you have, you can use <code>dmesg</code>, /proc/pci or <code>lspci</code> to find out.
fr: recompilez votre noyau avec le bon pilote, soit en dur soit en tant que module. Si vous compilez le pilote réseau en tant que module, ajoutez-le aussi à /etc/modules.conf pour affecter la carte réseau à eth0&nbsp;; par exemple&nbsp;: <code>alias eth0 8139too</code>. Si vous ne savez pas quelle carte réseau vous avez, vous pouvez utiliser <code>dmesg</code>, /proc/pci ou <code>lspci</code> pour la trouver.

source: Short summary: It's a hardware problem (usually). Transient Line-noise/crosstalk persuades the PIC that something happened; this can result in a 'dummy' interrupt being raised, which happens to be IRQ7 with intel's 8259 design.The problem could possibly also be caused by (or instead be caused by) a device driver not properly masking its interrupts before servicing, this would be the suspect if the IRQ7's were happening in bursts, or more often than 'several' per day. (<a href="http://groups.google.com/groups?q=spurious+interrupt+8259&amp;hl=de&amp;scoring=d&amp;selm=3C174EDD.9090306%40hotmail.com&amp;rnum=10">Source and additional information</a>)
fr: Court résumé&nbsp;: C'est un problème matériel (généralement). Du bruit temporaire sur la ligne persuade le PIC que quelque chose est arrivé&nbsp;; cela peut faire lever une fausse interruption, qui se trouve être l'IRQ7 avec la conception du 8259 d'Intel. Le problème pourrait aussi être causé par (ou plutôt causé par) un pilote de périphérique qui ne masque pas proprement ses interruptions avant de les servir, ce qui pourrait bien être le cas lorsque les IRQ7 arrivent par paquets, ou plus souvent que «&nbps;plusieurs&nbsp;» par jour. (<a href="http://groups.google.com/groups?q=spurious+interrupt+8259&amp;hl=de&amp;scoring=d&amp;selm=3C174EDD.9090306%40hotmail.com&amp;rnum=10">Source et informations supplémentaires</a>)

source: Since the message itself is harmless, it's enough to adjust the default loglevel outplut of klogd (the -c opion) in the syslogd bootscript. See <code>man klogd</code> for details. You can also try recompiling the kernel and unset CONFIG_LOCAL_APIC.
fr: Puisque le message lui-même est sans conséquence, il est suffisant d'ajuster le niveau d'enregistrement par défaut de klogd (l'option -c) dans le script de démarrage de syslogd. Voir <code>man klogd</code> pour les détails. Vous pouvez aussi essayer de recompiler le noyau et désactiver CONFIG_LOCAL_APIC.

source: Why does less (and therefore man) print &lt;AD&gt; instead of hyphens?
fr: Pourquoi est-ce que less (et par conséquent man) affiche &lt;AD&gt; au lieu des tirets&nbsp;?

source: Because the LANG and LC_ALL environment variables aren't set. To fix that, set them in both the ~/.bash_profile and ~/.bashrc files for each user or in /etc/profile, which will take care of all users, by adding lines like this:
fr: Parce que les variables d'environnement LANG et LC_ALL ne sont pas initialisées. Pour corriger cela, initialisez-les dans les fichiers ~/.bash_profile et ~/.bashrc pour chaque utilisateur ou dans /etc/profile, qui s'occupe de tous les utilisateurs en ajoutant des lignes comme&nbsp;:

source: Those lines can be added to /etc/profile with the following command:
fr: Ces lignes peuvent être ajoutées au fichier /etc/profile avec la commande suivante&nbsp;:

source: If you don't use US English you'll have to change the "en_US" part and possibly the values of various LC_* variables as well. Running the locale command lists many (all?) of the LC_* variables.
fr: Si vous n'utilisez pas l'anglais américain, vous devrez changer les «&nbsp;en_US&nbsp;» et éventuellement les valeurs des diverses variables LC_*. Lancez la commande locale liste plusieurs (toutes&nbsp;?) les variables LC_*.
