Repository: espindula/br-lfs
Catalog: faq/*.po
Languages: fr

source: If you've built an LFS system and have extended it to become your primary system, the best thing to do is to decide on an upgrade policy. Do you want to keep the latest version of every package? Then be careful, because you're going to be burned. I recommend slight conservatism when upgrading to keep a healthy system. A general rule of thumb which works for most people is: only upgrade packages if they have security fixes. Subscribe to lfs-security and LWN to keep yourself informed about security fixes. Another rule of thumb is: don't upgrade the toolchain (gcc, glibc and binutils) unless you're going to rebuild your entire system. These packages form the heart of your LFS system, destroying them means destroying the ability to compile packages or even run binaries.
fr: Si vous avez construit un système LFS et l'avez complété pour qu'il devienne votre système principal, la meilleure chose à faire est de décider d'une stratégie de mise à niveau. Vous voulez conserver la dernière version de chaque paquet&nbsp;? Alors faites attention, parce que vous allez vous brûler. Je recommande d'être légèrement conservateur lors de la mise à niveau pour maintenir un système sain. Une règle générale qui fonctionne pour la plupart des gens est&nbsp;: mettre à jour seulement les paquets s'ils ont des correctifs de sécurité. Inscrivez-vous à lfs-security et LWN pour vous tenir au courant des correctifs de sécurité. Une autre règle est&nbsp;: ne pas mettre à jour la chaîne d'outils (gcc, glibc et binutils) à moins de reconstruire votre système entièrement. Ces paquets constituent le cœur de votre système LFS, les détruire signifie détruire la capacité de compiler des paquets ou même exécuter des fichiers binaires.

source: Remember that updating packages is at your own risk. LFS takes great care to present a stable mix of packages which are compatible all the way up to BLFS so you can compile OpenOffice.Org and Java (which are real dinosaurs to compile). This means that your LFS system may get slightly outdated but ensures compatibility and stability. You can compare this to Debian's stable and testing releases, although LFS stable is generally bleeding-edge compared to other distro's.
fr: Rappelez vous que la mise à jour des paquets se fait à vos risques et périls. LFS fait très attention à présenter un ensemble stable de paquets qui sont compatibles pour aller au bout de BLFS et que vous puissiez compiler OpenOffice.Org et Java (qui sont de vrais mastodontes à compiler). Cela signifie que votre système LFS peut être un peu dépassé mais assurer la compatibilité et la stabilité. Vous pouvez comparer cela aux versions Stable et testing de Debian, bien que la version LFS stable soit généralement très récente comparée aux autres distributions.

source: In general it is safe to upgrade single packages; they'll just overwrite the old contents. Package managers take care of uninstalling old versions, and it's really convenient to have some sort of package management system in place. Have a look at the hints; there are several, ranging from RPM to DEB to TGZ (Slackware) to Checkinstall to package users.
fr: En général il est possible de mettre à jour des paquets seuls&nbsp;; ils réécriront simplement le vieux contenu. Les gestionnaires de paquets prennent soin de désinstaller les anciennes versions, et c'est clairement pratique d'avoir une sorte de gestion de paquet en place. Regardez les astuces&nbsp;; il y en a plusieurs, de RPM à DEB en passant par TGZ (Slackware), Checkinstall et les utilisateurs paquets.

source: A final comment: what package instructions should you use when updating a package? In general, you can use the standard LFS instructions, although you shouldn't blindly assume they will apply to all packages. To keep yourself informed about upgrades and new package instructions, subscribe to lfs-dev. Keep in mind that this is not a support list but a development list.
fr: Un dernier commentaire : Quelles instructions devez vous utiliser pour la mise à jour d'un paquet ? En général, vous pouvez utiliser les instructions standards de LFS, bien que vous ne devez pas aveuglement penser qu'elles s'appliqueront pour tous les paquets. Pour rester informé des mises à jour et des nouvelles instructions, inscrivez vous à lfs-dev. Gardez en tête que ce n'est pas une liste de support mais une liste de développement.

source: Old and expired FAQ's
fr: FAQ anciennes et périmées

source: <a href="#version-not-in-book">I'm using a version not in the book. Is that a problem?</a>
fr: <a href="#version-not-in-book">J'ai utilisé une version qui n'est pas dans le livre. Est-ce un problème ?</a>

source: There's already a <a href="#why-not-version">FAQ entry</a> which describes this. Since hardly anyone refers to this entry it's now obsolete.
fr: Il y a déjà une <a href="#why-not-version">entrée dans la FAQ</a> qui décrit cela. Comme presque personne ne se réfère à cette entrée, elle est maintenant obsolète.

source: <a href="#wheres-which">Where's which?</a>
fr: <a href="#wheres-which">Où est-ce?</a>

source: Obsolete on account of the <a href="/blfs/view/stable/general/which.html">BLFS</a> book.
fr: Obsolète à cause du livre <a href="/blfs/view/stable/general/which.html">BLFS</a>.

source: <a href="#portmap">Where's portmap?</a>
fr: <a href="#portmap">Où est portmap?</a>

source: Obsolete on account of the <a href="/blfs/view/stable/basicnet/rpcbind.html">BLFS</a> book.
fr: Obsolète à cause du livre <a href="/blfs/view/stable/basicnet/rpcbind.html">BLFS</a>.

source: <a href="#lfs-logos">Where can I get LFS Logos?</a>
fr: <a href="#lfs-logos">Où puis-je avoir des Logos LFS?</a>

source: Obsolete on account of the <a href="/blfs/artwork/">BLFS artwork</a> webpage.
fr: Obsolète à cause de la page Web <a href="/blfs/artwork/">BLFS artwork</a>.

source: <a href="#optimized-glibc-fail">My optimized build of glibc is failing in spinlock.c</a>
fr: <a href="#optimized-glibc-fail">Ma construction optimisée de glibc échoue dans spinlock.c</a>

source: Let's not encourage people to optimize glibc. Besides, the <a href="/lfs/faq.html#optimizations">when using optimization flags (setting CFLAGS)</a> entry should take care of this question.
fr: Nous n'incitons pas les gens à optimiser la glibc. De plus, <a href="/lfs/faq.html#optimizations">lorsque vous utilisez des indicateurs d'optimisation (paramètres CFLAGS)</a>, il faudrait faire attention à cette question.

source: Thanks
fr: Merci

source: This FAQ is dedicated to all the hard-working people on the support lists who keep me busy with this FAQ ;-).
fr: Cette FAQ est dédiée à tous les gens durs à la tâche sur les listes de support qui me tiennent occupés avec cette FAQ ;-).

source: Thanks go to...
fr: Merci à...

source: Seth W. Klein for creating and maintaining this FAQ before me.
fr: Seth W. Klein pour la création et la maintenance de cette FAQ avant moi.

source: All the guys (and all of the few girls as well, wish there were more of you) on the lists, from whose answers so many of these answers come.
fr: Tous les gars (et toutes les quelques filles aussi, j'aimerai qu'il y en ai plus) des listes, de qui les réponses, beaucoup des réponses viennnent.

source: Especially those of you who sort out a question, its symptoms, and its answer and mail the lot to me. Your IDs are immortalized in the commit logs (though only for the span of a digital forever, but hey, I try :-)
fr: En particuliers ceux d'entre vous qui comprennent la question, ses symptômes et ses réponses et qui m'envoient le tout. Votre ID est immortalisée pour toujours dans le journal des modifications (enfin seulement pour la durée d'un toujours numérique, mais bon, au moins j'essaye :-))

source: Tushar Teredesai, Chris Lingard, Jeremy Utley, The Cheeze and countless other people who regularly post FAQ links to the support lists.
fr: Tushar Teredesai, Chris Lingard, Jeremy Utley, The Cheeze et les innombrables autres personnes qui régulièrement poste des liens de FAQ sur les listes d'aide.

source: The BLFS editors whose book produces so delightfully few FAQs.
fr: Les éditeurs de BLFS dont le livre produit si délicieusement quelques FAQ.

source: BLFS Frequently Asked Questions
fr: Foire aux questions de BLFS

source: The FAQ is divided in three documents. The <a href="/faq/index.html">General FAQ</a> has links to all questions and answers. The <a href="/lfs/faq.html">LFS FAQ</a> is a selection of LFS-specific FAQ's and the <a href="/blfs/faq.html">BLFS FAQ</a> is a selection of BLFS-specific FAQ's.
fr: La FAQ est divisée en trois documents. La <a href="/faq/index.html">FAQ générale</a> propose des liens vers toutes les questions et les réponses. La <a href="/lfs/faq.html">FAQ LFS</a> est une sélection des questions les plus fréquemment posées concernant LFS et la <a href="/blfs/faq.html">FAQ BLFS</a> est une sélection des questions les plus fréquemment posées spécifiques à BLFS.

source: <a href="#genblfs">General BLFS questions</a>
fr: <a href="#genblfs">Questions générales sur BLFS</a>

source: <a href="#bootcd">How do I make a bootable CD?</a>
fr: <a href="#bootcd">Comment faire un CD bootable?</a>

source: <a href="#seti">Where do I join the LFS SETI/Predictor/etc team?</a>
fr: <a href="#seti">Où puis-je joindre l'équipe LFS SETI/Predictor/etc&nbsp;?</a>

source: <a href="#compissues">Compilation issues</a>
fr: <a href="#compissues">Problèmes de compilation</a>

source: <a href="#gtk-2_0">I'm getting errors building a package that requires GTK+,but I've installed GTK+ 2.x.</a>
fr: <a href="#gtk-2_0">Je rencontre une erreur en construisant un paquet demandant GTK+, mais j'ai installé GTK+ 2.x</a>

source: <a href="#undefined-deflate">undefined reference to `deflate'</a>
fr: <a href="#undefined-deflate">référence indéfini à "deflate"</a>

source: <a href="#missing-x-includes">X11/Xlib.h: No such file or directory</a>
fr: <a href="#missing-x-includes">X11/Xlib.h&nbsp;: No such file or directory</a>

source: <a href="#gnome-versions">Any error while building part of Gnome</a>
fr: <a href="#gnome-versions">Toute erreur lors de la construction d'une partie de Gnome</a>

source: <a href="#confissues">Configuration issues</a>
fr: <a href="#confissues">Problèmes de configuration</a>

source: <a href="#how-to-print">How do I print?</a>
fr: <a href="#how-to-print">Comment faire pour imprimer?</a>

source: <a href="#konsole-ps1">How do I set PS1 in Konsole?</a>
fr: <a href="#konsole-ps1">Comment puis-je initialiser PS1 dans Konsole?</a>

source: General BLFS questions
fr: Questions générales de BLFS

source: How do I make a bootable CD?
fr: Comment faire un CD bootable?

source: The <a href="/livecd/index.html">LFS LiveCD</a> Project has already done the dirty work! The project has a <a href="/livecd/documentation.html">documentation page</a>. Information about how to obtain the project's makefiles, scripts and configurations are available on the <a href="/livecd/download.html">download page</a>.
fr: Le projet <a href="/livecd/index.html">LFS LiveCD</a> à déjà fait le plus gros du travail! Le projet a une <a href="/livecd/documentation.html">page de documentation</a>. Des informations sur comment faire pour obtenir les makefiles du projet, les scripts et les configurations sont disponibles sur la <a href="/livecd/download.html">page téléchargement</a>.

source: If that doesn't interest you, there are several <a href="/hints/downloads/files/">hints</a> related to boot CD's.
fr: Si cela ne vous intéresse pas, il y a plusieurs <a href="/hints/downloads/files/">astuces</a> relatives aux CD bootables.

source: Where do I join the LFS SETI/Predictor/etc team?
fr: Où puis-je joindre l'équipe LFS SETI/Predictor/etc&nbsp;?

source: Einstein@Home: <a href="http://einstein.phys.uwm.edu/create_account_form.php?teamid=3584">Join Team LFS</a>
fr: Einstein@Home: <a href="http://einstein.phys.uwm.edu/create_account_form.php?teamid=3584">Joindre l'équipe LFS</a>

source: LHC@Home: <a href="http://lhcathomeclassic.cern.ch/sixtrack/team_display.php?teamid=4461">Team LFS Page</a>
fr: LHC@Home: <a href="http://lhcathomeclassic.cern.ch/sixtrack/team_display.php?teamid=4461">Page de l'équipe LFS</a>

source: <a href="#blfsfaq">Back to the top.</a>
fr: <a href="#blfsfaq">Retour au debut.</a>

source: Compilation issues
fr: Problèmes de compilation

source: I'm getting errors building a package that requires GTK+, but I've installed GTK+ 2.x.
fr: Je rencontre une erreur en construisant un paquet demandant GTK+, mais j'ai installéGTK+ 2.x.

source: GTK+ 2.x and 1.2.x aren't compatible. The package you're installing may need GTK+ (and GLIB) 1.2.x. You can install GTK+ (and GLIB) 1.2.x next to 2.x.
fr: GTK+ 2.x et 1.2.x ne sont pas compatible. Le paquet que vous installez doit demander GTK+ (et GLIB) 1.2.x. Vous pouvez installer GTL+ (et GLIB) 1.2.x à coté de 2.x.

source: undefined reference to `deflate'
fr: référence indéfini à "deflate"

source: If, when compiling XFree86, ghostscript, or anything else that uses libpng, you get an error including the following line:<code>/usr/lib/gcc-lib/i686-pc-linux-gnu/3.2/../../../libpng.so: undefined reference to `deflate'</code>.
fr: Si, pendant la compilation de XFree86, ghostscript, ou n'importe quoi utilisant libpng, vous avec une erreur donnant la ligne suivante&nbsp;:<code>/usr/lib/gcc-lib/i686-pc-linux-gnu/3.2/../../../libpng.so: undefined reference to `deflate'</code>.

source: Then rebuild libpng with the patch at <a href="http://linuxfromscratch.org/%7Esklein/libpng-1.2.5-lz.patch">http://linuxfromscratch.org/~sklein/libpng-1.2.5-lz.patch</a>. Make sure you apply the patch immediately after unpacking the sources. Like this:
fr: Ensuite reconstruisez libpng avec le correctif <a href="http://linuxfromscratch.org/%7Esklein/libpng-1.2.5-lz.patch">http://linuxfromscratch.org/~sklein/libpng-1.2.5-lz.patch</a>. Assurez-vous d'appliquer le correctif immédiatement après avoir désarchivé les sources. Comme ceci&nbsp;:

source: Needless to say, if you originally put zlib in /usr/local or did something else different, you'll have to adjust those instructions accordingly.
fr: Inutile de le dire, si vous avez mis zlib dans /usr/local au départ ou avez fait quelque chose de différent, vous devrez ajuster ces instructions en fonction.

source: Typical symptoms look like this:
fr: Les symptômes typiques ressemblent à ceci&nbsp;:

source: Creating a couple symlinks will fix it. Here are the commands:
fr: La création de liens symboliques corrigera le problème. Il y a les commandes &nbsp;:

source: Any error while building part of Gnome
fr: N'importe quelle erreur en construisant une partie de Gnome

source: Using the latest version of every Gnome package doesn't work. You have to use versions that are known to work together and are used in the BLFS book.
fr: Utiliser la dernière version de chaque paquet Gnome ne fonctionne pas. Vous devez utiliser les versions qui sont connues pour fonctionner ensemble et sont utilisées dans le livre BLFS.

source: To find a list of such versions go to <a href="http://ftp.gnome.org/pub/GNOME/desktop/">http://ftp.gnome.org/pub/GNOME/desktop/</a>, drill down to the version which is mentioned in BLFS and use those.
fr: Pour trouver une liste de ces versions rendez-vous sur <a href="http://ftp.gnome.org/pub/GNOME/desktop/">http://ftp.gnome.org/pub/GNOME/desktop/</a>, descendez jusqu'à la version mentionnée dans BLFS et utilisez-la.

source: If you get the following error while building XFree86:
fr: Si vous avez l'erreur suivante en construisant XFree86&nbsp;:

source: Or something which resembles that, you've probably made a mistake in your host.def. Check the file carefully for errors and try recreating it by copying the example in BLFS.
fr: Ou quelque chose qui ressemble à ça, vous avez sans doute fait une erreur dans votre fichier host.def. Vérifiez le fichier consciencieusement et essayez de le recréer en copiant les exemples dans BLFS.

source: Configuration issues
fr: Problèmesde configuration

source: How do I print?
fr: Comment imprimer?

source: See <a href="/hints/downloads/files/">one of the various printing hints</a>
fr: Voir <a href="/hints/downloads/files/">l'une des astuces sur l'impression</a>

source: Before you try any of the advanced printer daemons (for example CUPS) make sure your printer works by following the <a href="/hints/downloads/files/pfs.txt">Printing From Scratch hint</a>. For most people, this hint is all that is required to setup basic printing.
fr: Avant d'essayer les démons d'impression avancés (par exemple CUPS), assurez-vous que votre imprimante fonctionne en suivant l'astuce <a href="/hints/downloads/files/pfs.txt">Imprimer de zéro</a>. Pour la plupart des gens, cette astuce est tout ce dont ils ont besoin pour une configuration basique.

source: When reporting problems with CUPS, please indicate whether the following commands work:
fr: Lorsque vous rapportez des problèmes avec CUPS, merci d'indiquer si les commandes suivantes fonctionnent&nbsp;:

source: # This is an image, so ghostscript is not called
fr: # Ceci est une image, donc ghostscript n'est pas appelé

source: # This PostScript file doesn't use any fonts
fr: # Ce fichier PostScript n'utilise aucune police de caractères

source: # This PostScript file uses fonts
fr: # Ce fichier PostScript utilise des polices de caractères

source: How do I set PS1 in Konsole?
fr: Comment initialiser PS1 dans Konsole?

source: Follow the instructions on the <a href="/blfs/view/svn/postlfs/profile.html">BLFS Bash Shell Startup Files</a> to properly setup your enviroment.
fr: Suivez les instructions sur <a href="/view/bsvn/postlfs/profile.html">Les fichiers de démarrage du shell Bash</a> pour configurer correctement votre environnement.

source: Alternatively, you can try the following solutions:
fr: Autrement, vous pouvez essayer les solutions suivantes&nbsp;:

source: Start konsole as a login shell:
fr: Démarrez konsole en tant que shell de connexion&nbsp;:

source: Change the session in Konsole to start <code>/bin/bash --login</code> instead of <code>/bin/bash</code>.
fr: Changez la session dans Konsole pour démarrer <code>/bin/bash --login</code> au lieu de <code>/bin/bash</code>.

source: LFS Frequently Asked Questions
fr: Foire Aux Questions

source: <a href="#fre">Frequently Requested Enhancements</a>
fr: <a href="#fre">Améliorations fréquemment demandées</a>

source: <a href="#add-grub">Why not use LILO instead of GRUB?</a>
fr: <a href="#add-grub">Pourquoi ne pas utiliser LILO plutôt que GRUB ?</a>

source: <a href="#why-not-new-lilo">Why not upgrade LILO to the latest version?</a>
fr: <a href="#why-not-new-lilo">Pourquoi ne pas mettre à jour LILO à la dernière version&nbsp;?</a>

source: <a href="#why-not-faq">Why not include the FAQ in the book?</a>
fr: <a href="#why-not-faq">Pourquoi ne pas inclure la FAQ au livre&nbsp;?</a>

source: <a href="#why-vim">Why is vim in the book?</a>
fr: <a href="#why-vim">Pourquoi est-ce que Vim est dans le livre&nbsp;?</a>

source: <a href="#hjl-binutils">Why is HJL's Binutils not in the book?</a>
fr: <a href="#hjl-binutils">Pourquoi est-ce que la version HJL de Binutils n'est pas dans le livre&nbsp;?</a>

source: <a href="#why-not-package-management">Why isn't some package manager in the book?</a>
fr: <a href="#why-not-package-management">Pourquoi n'y a-t'il pas de gestionnaire de paquets dans le livre&nbsp;?</a>

source: <a href="#no-poweroff">How do I make my machine poweroff when shut down?</a>
fr: <a href="#no-poweroff">Comment provoquer l'arrêt électrique de la machine à la sortie du système&nbsp;?</a>

source: <a href="#resources">When reading and building LFS</a>
fr: <a href="#resources">Pendant la lecture et la construction de LFS</a>

source: <a href="#what-dist">What distribution should I use to start from?</a>
fr: <a href="#what-dist">Quelle distribution devrais-je utiliser, pour démarrer&nbsp;?</a>

source: <a href="#kernel-modules">How do I compile a kernel or set up modules?</a>
fr: <a href="#kernel-modules">Comment compiler un noyau ou configurer un module&nbsp;?</a>

source: <a href="#gcc-warnings">Are compiler warnings from GCC bad?</a>
fr: <a href="#gcc-warnings">Est-ce que c'est mal, les avertissements de compilation de Gcc&nbsp;?</a>

source: <a href="#dirty-sources">Do I need to keep the source after installing?</a>
fr: <a href="#dirty-sources">Dois-je conserver les sources après l'installation&nbsp;?</a>

source: <a href="#really-small">How do I make that really small install the book mentions?</a>
fr: <a href="#really-small">Comment puis-je procéder à cette toute petite installation dont parle le livre&nbsp;?</a>

source: <a href="#procs-lfs">Is there information about building LFS on other processors?</a>
fr: <a href="#procs-lfs">Existe-t'il des informations sur la façon de construire LFS sur d'autres architectures&nbsp;?</a>

source: <a href="#cross-compile">How do I cross compile LFS?</a>
fr: <a href="#cross-compile">Comment faire une compilation croisée avec LFS&nbsp;?</a>

source: <a href="#dos-text">What's a DOS format text file?</a>
fr: <a href="#dos-text">Qu'est qu'un fichier texte au format DOS&nbsp;?</a>

source: <a href="#wget">Is there a way to download all current files at one time?</a>
fr: <a href="#wget">Y a-t-il moyen de télécharger tous les fichiers actuels en une seule fois&nbsp;?</a>

source: <a href="#generrors">General compilation errors</a>
fr: <a href="#generrors">Erreurs de compilation usuelles</a>

source: <a href="#gnu-patches">I used a patch from GNU to upgrade. Is that OK?</a>
fr: <a href="#gnu-patches">J'ai utilisé un patch provenant de GNU pour faire des mises à jour&nbsp;? C'est bon&nbsp;?</a>

source: <a href="#optimizations">When using optimization flags (setting CFLAGS)</a>
fr: <a href="#optimizations">Utilisation des paramètres d'optimisation (paramétrage des CFLAGS)</a>

source: <a href="#config-hang-size_t">Why does configure hang at &quot;checking for signed size_t type...&quot;?</a>
fr: <a href="#config-hang-size_t">Pourquoi est-ce que configure se fige à «&nbsp;checking for signed size_t type...&nbsp;»&nbsp;?</a>

source: <a href="#dirty-sources">I didn't delete the source tree after my last attempt. Do I need to?</a>
fr: <a href="#dirty-sources">Je n'ai pas effacé l'arborescence des sources après mon dernier essai. Faut-il le faire&nbsp;?</a>

source: <a href="#perm-denied">I'm getting `/dev/null: Permission denied'</a>
fr: <a href="#perm-denied">J'obtiens le message «&nbsp;/dev/null: Permission denied&nbsp;»</a>

source: <a href="#conf-guess-fail">configure can't guess my host type.</a>
fr: <a href="#conf-guess-fail">configure n'arrive pas à déterminer le type de mon hôte.</a>

source: <a href="#no-ptys">The system has no more ptys. Ask your system administrator to create more.</a>
fr: <a href="#no-ptys">Le système n'a plus de ptys. Demandez à votre administrateur d'en créer d'autres.</a>

source: <a href="#packerrors">Package-specific errors</a>
fr: <a href="#packerrors">Erreurs spécifiques à certains paquets</a>

source: <a href="#glibc-awk-fail">Glibc fails and mentions BEGIN and END.</a>
fr: <a href="#glibc-awk-fail">Glibc sort en erreur et évoque BEGIN et END.</a>

source: <a href="#glibc-nss">Glibc compilation errors out due to a missing nss.h header file</a>
fr: <a href="#glibc-nss">La compilation de Glibc sort en erreur à cause de l'absence de l'entête de fichier nss.h.</a>

source: <a href="#cpp-fails-sanity-check">Ncurses: C++ preprocessor &quot;/lib/cpp&quot; fails sanity check</a>
fr: <a href="#cpp-fails-sanity-check">Ncurses: le préprocesseur C++ "/lib/cpp" échoue lors de la vérification de conformité</a>

source: <a href="#confboot">Configuration and booting issues</a>
fr: <a href="#confboot">Problèmes de configuration et de démarrage</a>
