Repository: espindula/br-lfs
Catalog: faq/*.po
Languages: fr

source: Please remember to provide enough information when you post to the mailing lists. In <a href="/lfs/view/stable/chapter01/askforhelp.html">chapter 1 of LFS</a> you find a good method for posting. Additionally, someone has written <a href="/hints/downloads/files/errors.txt">a hint</a> which details the error reporting procedure.
fr: Souvenez-vous de fournir suffisamment d'informations quand vous postez sur la liste de diffusion. Au <a href="/lfs/view/stable/chapter01/askforhelp.html">chapitre 1 de LFS</a> vous trouverez des instructions pour utiliser ces listes. De plus, quelqu'un a écrit <a href="/hints/downloads/files/errors.txt">une astuce</a> qui détaille la procédure de remontée d'erreurs.

source: Which list should I use for what topic?
fr: Quelle liste de diffusion pour quel sujet&nbsp;?

source: Information about all the public mailing lists is available on the <a href="/mail.html">mailing list</a> page. Here are some general guidelines about which list to use:
fr: Des informations sur toutes les listes de diffusion publiques sont disponibles sur la page des <a href="/mail.html">listes de diffusion</a>. Voici quelques instructions pour déterminer quelle liste utiliser&nbsp;:

source: Send <em>support</em> questions for the stable released books to <a href="http://lists.linuxfromscratch.org/listinfo/lfs-support/">lfs-support</a>. For anything which doesn't belong in LFS, use <a href="http://lists.linuxfromscratch.org/listinfo/blfs-support/">blfs-support</a>. Bug reports are gladly accepted; you can <a href="http://wiki.linuxfromscratch.org/">create a ticket</a> for the appropriate project or report to the <a href="http://lists.linuxfromscratch.org/listinfo/lfs-dev/">lfs-dev</a> mailing list.
fr: Envoyez vos requêtes d'<em>assistance</em> sur les livres des versions stables sur <a href="http://lists.linuxfromscratch.org/listinfo/lfs-support/">lfs-support</a>. Pour tout ce qui ne concerne pas LFS, utilisez <a href="http://lists.linuxfromscratch.org/listinfo/blfs-support/">blfs-support</a>. Les rapports de bogues sont les bienvenus&nbsp;; vous pouvez <a href="http://wiki.linuxfromscratch.org/">créer un ticket</a> pour le projet adéquat ou envoyer un rapport sur la liste de diffusion <a href="http://lists.linuxfromscratch.org/listinfo/lfs-dev/">lfs-dev</a>.

source: If you are not having trouble following the <em>LFS</em> Book itself, do <em>not</em> email <a href="http://lists.linuxfromscratch.org/listinfo/lfs-support/"><em>lfs</em>-support</a>.
fr: Si vous n'avez aucune difficulté à suivre le Livre <em>LFS</em> lui-même, n'envoyez <em>pas</em> de courriel à <a href="http://lists.linuxfromscratch.org/listinfo/lfs-support/"><em>lfs</em>-support</a>.

source: Unless you are <em>suggesting an improvement</em> to the LFS Book itself, do not email <a href="http://lists.linuxfromscratch.org/listinfo/lfs-dev/">lfs-dev</a>.
fr: A moins que vous ne <em>suggériez une amélioration</em> au livre LFS lui-même, n'envoyez pas de courriel à <a href="http://lists.linuxfromscratch.org/listinfo/lfs-dev/">lfs-dev</a>.

source: Only suggestions concerning the BLFS Book are acceptable on <a href="http://lists.linuxfromscratch.org/listinfo/blfs-dev/">blfs-dev</a>.
fr: Seules les suggestions sur le Livre BLFS sont acceptées sur <a href="http://lists.linuxfromscratch.org/listinfo/blfs-dev/">blfs-dev</a>.

source: Things are a little different with <a href="http://lists.linuxfromscratch.org/listinfo/blfs-support/">blfs-support</a>. Everything that doesn't fit one of the preceding lists fits there except for the price of beer and GNU versus BSD flame wars.
fr: Les choses sont un peu différentes avec <a href="http://lists.linuxfromscratch.org/listinfo/blfs-support/">blfs-support</a>. Tout ce qui ne rentre pas dans une des listes précédentes rentre ici sauf si cela concerne le prix de la bière et les guerres GNU contre BSD.

source: The price of beer, GNU versus BSD, and Microsoft versus Linux flame wars are restricted to <a href="http://lists.linuxfromscratch.org/listinfo/lfs-chat/">lfs-chat</a>. These days, hardware discussion should go there as well.
fr: Le prix de la bière, les guerres GNU contre BSD ou Microsoft contre Linux sont limitées à <a href="http://lists.linuxfromscratch.org/listinfo/lfs-chat/">lfs-chat</a>. Aujourd'hui, c'est là également que les discussions sur la matériel devraient se dérouler.

source: Of special note is that if you mention XFree86, KDE or GNOME you may be sure that your post does not belong on <a href="http://lists.linuxfromscratch.org/listinfo/lfs-dev/">lfs-dev</a> or <a href="http://lists.linuxfromscratch.org/listinfo/lfs-support/">lfs-support</a>.
fr: Notez que si vous évoquez XFree86, KDE ou GNOME, vous pouvez être sûr que votre message n'est pas fait pour <a href="http://lists.linuxfromscratch.org/listinfo/lfs-dev/">lfs-dev</a> ou <a href="http://lists.linuxfromscratch.org/listinfo/lfs-support/">lfs-support</a>.

source: What about netiquette?
fr: Et la netiquette&nbsp;?

source: Here are some practical points of etiquette. They include only those items that will draw mention if missed. Those who've been around project mailing lists awhile will find the first few obvious. There are less obvious items toward the end.
fr: Voici quelques informations pratiques sur l'étiquette. Elles incluent seulement celles qui seront signalées si vous les avez omises. Ceux qui ont l'habitude des listes de diffusion de projets trouveront que les premières infos sont évidentes. Vers la fin, elles le sont un peu moins.

source: The reasons for these points are omitted for brevity, but rest assured, these guidelines are more than just an individual's personal preference.
fr: Les justifications de ces règles ne sont pas mentionnées mais soyez assurés que ces instructions sont bien plus que les préférences personnelles d'un individu.

source: While the text refers to "the lists" exclusively, it doesn't intend to ignore the news groups that mirror the mailing lists.
fr: Même si le texte mentionne exclusivement «&nbsp;les listes&nbsp;», le but n'est pas d'ignorer les newsgroups miroirs des listes de diffusion.

source: With that out of the way, here are a couple manners oriented items followed by more "mechanical" stuff:
fr: Ceci étant fait, voici quelques infos sur les comportements à adopter suivis de choses plus «&nbsp;mécaniques&nbsp;»&nbsp;:

source: Please remember that it is rude to post questions that are answered in commonly available documentation such as the LFS and BLFS Books, this FAQ, the LFS Hints, the appropriate man pages, the list archives, and Google searches. As long as you can demonstrate that you've made an effort to find the answer and you're not offended by a pointer to documentation, no reasonable person will object to your question.
fr: Souvenez-vous qu'il est incorrect de poser des questions dont les réponses figurent dans la documentation couramment accessible comme les livres LFS ou BLFS, cette FAQ, les astuces LFS, les pages de man correspondantes, les archives des listes et les recherches Google. Tant que vous pouvez montrer que vous avez fourni un effort pour trouver une réponse et que vous ne vous sentez pas offensé par un pointeur vers la documentation, aucune personne raisonnable n'opposera d'objection à votre question.

source: Most of the bothersome flame wars start when a newbie posts an obvious question, is then criticized (even in a kindly manner), and becomes publicly offended. Please try to avoid this situation. "Wordlessly" pointing to the exact spot in the documentation is sufficient. If you feel you must criticize, please do it via private email, not on the lists. The same applies to anything else that may become heated.
fr: La plupart des conflits embarrassants débutent lorsqu'un débutant pose une question dont la réponse est évidente, se fait alors critiquer (même gentiment) et se trouve publiquement offensé. Essayez, s'il vous plait, d'éviter cette situation. Le fait de diriger, sans autre explication, vers la réponse exacte dans la documentation est suffisant. Si vous ressentez le besoin de critiquer, faites le en privé, pas sur les listes. Le raisonnement est le même pour tout ce qui pourrait "s'enflammer".

source: The lists have an international membership so slang of all sorts and idioms are likely to be misunderstood. (Witness the recent discussion of "bootstrapping".) Any mention of profanity, politics, war, or religion (even in signatures) is likely to upset someone somewhere in the world so please avoid them as well. Finally, it is considered polite to post in English since many more people on the lists know it than any other language.
fr: Les membres des listes viennent du monde entier, donc l'argot et les expressions idiomatiques risquent d'être mal comprises (comme en témoigne la discussion récente sur le démarrage). Les propos injurieux, relatifs à la politique, à la guerre, à la religion (même dans les signatures) risquent de contrarier quelqu'un quelque part dans le monde, alors évitez les, s'il vous plait. Enfin, on considère qu'il est plus poli de rédiger en anglais car c'est une langue que la plupart des gens connaissent avant tout autre.

source: Now for the more "mechanical" stuff.
fr: Passons maintenant aux choses plus «&nbsp;mécaniques&nbsp;».

source: <strong>Do not post in HTML.</strong> If you use Yahoo, Hotmail, or Outlook and haven't turned HTML off, then it is on. If you're using another mail client, please do check before posting. If you don't know how to turn HTML off, see <a href="nomime.html">nomime.html</a>. <strong>All posts which contain HTML tags will be sent to /dev/null and never reach the list</strong>. Unfortunately, Spamassassin's HTML filter is very strict and will block all posts with HTML or XML-like tags, keep this in mind when posting XML snippets to a list. A commonly used trick is to replace the triangle brackets &lt; &gt; with angel brackets [].
fr: <strong>Ne postez pas en HTML</strong>. Si vous utilisez Yahoo, Hotmail, ou Outlook et n'avez pas désactivé le HTML, c'est qu'il est activé. Si vous utilisez un autre client de messagerie, vérifiez avant de poster. Si vous ne savez pas comment désactiver le HTML, allez lire <a href="nomime.html">nomime.html</a>. <strong>Tous les courriers contenant du HTML seront redirigés vers /dev/null et n'atteindront jamais la liste</strong>. Malheureusement, le filtre HTML de Spamassassin est très strict et bloquera tous les courriers avec du HTML ou des balises de type XML. Gardez bien cela en tête si vous postez des extraits de XML sur une liste. Un contournement largement utilisé consiste à remplacer les signes supérieur &lt; et inférieur &gt; par des crochets [].

source: <strong>Wrap text at 72 characters.</strong> If you do not wish to do this by hand, set your mail client to do it automatically when sending.
fr: <strong>Coupez les lignes à 72 caractères</strong>. Si vous ne voulez pas le faire à la main, configurez votre client de messagerie pour qu'il le fasse automatiquement à l'envoi des messages.

source: <strong>Reply <em>below</em> quoted text.</strong> Outlook makes this difficult. There is a <a href="http://home.in.tum.de/%7Ejain/software/outlook-quotefix/">plug-in to fix Outlook</a>, and <a href="http://home.in.tum.de/%7Ejain/software/oe-quotefix/">one for Outlook Express</a>.
fr: <strong>Répondez <em>sous</em> les citations</strong>. Ce n'est pas facile avec Outlook. Il existe un <a href="http://home.in.tum.de/%7Ejain/software/outlook-quotefix/">greffon pour corriger Outlook</a>, et <a href="http://home.in.tum.de/%7Ejain/software/oe-quotefix/">un pour Outlook Express</a>.

source: <strong>Limit signatures to four lines.</strong>
fr: <strong>Limitez vos signatures à quatre lignes.</strong>

source: <strong>Trim quoted text,</strong> especially signatures. But <strong>do not trim so that it is confusing to read your reply</strong> without consulting the original.
fr: <strong>Élaguez les citations</strong>, surtout les signatures. Mais <strong>n'élaguez pas au point de rendre votre message difficile à comprendre</strong> sans consulter le message original.

source: <strong>Do not click reply unless you're actually replying to a post.</strong> Use new, or compose, or whatever your mail client calls it, to ask a new question or start a new thread. Reply sets more than just the subject line and will cause your post to appear in the wrong place unless you're actually answering.
fr: <strong>Ne cliquez pas sur "Répondre" à moins que vous ne soyez vraiment en train de répondre à un message</strong>. Utilisez les boutons "Nouveau" ou "Écrire" ou quel que soit le nom que votre logiciel de messagerie lui donne, pour poser une nouvelle question ou commencer un nouveau fil de discussion. Le bouton "Répondre" ne fait pas que remplir le champs "Sujet", il enverra votre message à un mauvais endroit sauf si votre message est effectivement une réponse.

source: The following isn't major, but is useful to know. On the LFS lists, people usually clear the CC field and just mail the list with replies. This is probably not a good idea but is existing practice due to a political situation which is unlikely to change.
fr: Ce qui suit n'est pas de la plus grande importance, mais ça peut être utile de le savoir. Sur les listes LFS, les gens effacent généralement le champs CC et envoient leurs réponses à la liste. Ce n'est sans doute pas une bonne idée mais cette pratique existe. Elle est due à une situation politique qui n'est pas près de changer.

source: <a href="http://www.ietf.org/rfc/rfc1855.txt">RFC 1855</a> &quot;provides a minimum set of guidelines for Network Etiquette (Netiquette) and functions as a minimum set of guidelines for individuals, both users and administrators
fr: La <a href="http://www.ietf.org/rfc/rfc1855.txt">RFC 1855</a> «&nbsp;fournit un jeu d'instructions minimal concernant l'Étiquette sur la Toile (la Netiquette) et fonctionne comme un jeu d'instructions minimal à destination des individus, qu'ils soient utilisateurs ou administrateurs&nbsp;».

source: Frequently Reported Bugs
fr: Bogues fréquemment remontés

source: The &quot;ln -s&quot; commands in the Book are wrong.
fr: Dans le livre, les commandes «&nbsp;ln -s&nbsp;» sont incorrectes.

source: No, the &quot;ln -s&quot; commands in the Book are correct. A symlink is just a special file containing the given filename. So that filename is relative to the link, not the working directory when the link is created. Try it and see. More information in <code>man ln</code>.
fr: Non, les commandes «&nbsp;ln -s&nbsp;» du livre sont correctes. Un lien symbolique est juste un fichier spécial qui contient le nom de fichier donné. Le nom de fichier est donc relatif au lien, pas au répertoire courant au moment de la création du lien. Essayez pour voir. Plus d'informations avec <code>man ln</code>.

source: /bin/foo is a copy of /bin/bar.
fr: /bin/foo est une copie de /bin/bar.

source: Try &quot;ls -i /bin/foo /bin/bar&quot;. Are the inode numbers the same? If so, they're not copies, they're hard linked.
fr: Essayez "ls -i /bin/foo /bin/bar". Les numéros d'inodes sont-ils les mêmes&nbsp;? Si oui, ce ne sont pas des copies, ce sont des liens matériels.

source: For more information explaining the difference between hard and soft links, please take a look at the Q &amp; A article on Linux Gazette at <a href="http://linuxgazette.net/105/pitcher.html">http://linuxgazette.net/105/pitcher.html</a>.
fr: Pour plus d'explications sur les différences entre liens symboliques et liens matériels, consultez la page de Questions/Réponses sur Linux Gazette à cette adresse&nbsp;: <a href="http://linuxgazette.net/105/pitcher.html">http://linuxgazette.net/105/pitcher.html</a>.

source: Can I use a version newer than the one in the Book?
fr: Puis-je utiliser une version plus récente que celle du livre&nbsp;?

source: If this is your first time building LFS, using a version not in the book or varying from the book in any way is not a good idea. The IRC channel regulars have a saying, &quot;FBBG&quot;, meaning &quot;Follow Book, Book Good.&quot; They and the people on the lists have helped many an unhappy newbie who deviated from the book during that first build.
fr: Si c'est la première fois que vous construisez LFS, ce n'est pas une bonne idée d'utiliser une version qui n'est pas dans le livre, ou qui en diffère. Les utilisateurs réguliers des canaux IRC ont un proverbe, "FBBG" ("Follow Book, Book Good"), soit "Suivez livre, livre bon". Ils ont, avec les utilisateurs des listes, souvent aidé des débutants mécontents ayant dévié du livre pour leur première construction.

source: Once you've built a system &quot;by the book&quot;, you have a stable knowledge base from which to experiment to your heart's content (or pain, as is often the case.)
fr: Une fois que vous avez bâti un système «&nbsp;au plus près du livre&nbsp;», vous avez une base de connaissance solide à partir de laquelle vous allez pouvoir vous lancer à cœur joie (ou endolori le plus souvent) dans diverses expériences.

source: There's a new version of package Foo.
fr: Il y a une nouvelle version du paquet Foo.

source: If the new version is more than a day old, it is likely that someone has tested the release and reported it on the mailing lists. Please search the archives before posting questions about whether it works.
fr: Si cette nouvelle version a plus d'un jour, il est probable que quelqu'un l'ait déjà testé et mentionné dans les listes de diffusion. Cherchez dans les archives avant de poster une question pour savoir si ce paquet fonctionne.

source: If you'd like to report the new release, follow these steps to avoid making a duplicate report.
fr: Si vous voulez annoncer la sortie d'une nouvelle version, suivez ces étapes pour éviter de faire une annonce en double.

source: Check for open <a href="http://wiki.linuxfromscratch.org/lfs/">LFS tickets</a> or <a href="http://wiki.linuxfromscratch.org/blfs/">BLFS tickets</a> to see if the release has been posted there.
fr: Vérifiez s'il y a un <a href="http://wiki.linuxfromscratch.org/lfs/">ticket LFS</a> ou un <a href="http://wiki.linuxfromscratch.org/blfs/">ticket BLFS</a> ouvert pour voir si elle y a été postée.

source: If the release is not in an open ticket, report it to lfs-book (or blfs-book for packages in BLFS). And if you like, test it and report any problems or changes in compilation instructions, too.
fr: S'il n'y a pas de ticket ouvert concernant cette sortie, annoncez-la sur la liste lfs-book (ou sur blfs-book si le paquet concerne BLFS). Et si vous voulez, testez-le et rapportez tout problème ou changement dans les instructions de compilation.

source: The Delete key doesn't work.
fr: La touche Suppr. ne fonctionne pas.

source: Please read the LFS <a href="/lfs/view/stable/chapter07/inputrc.html">inputrc page</a>.
fr: Lisez la page <a href="/lfs/view/stable/chapter07/inputrc.html">inputrc</a> du livre LFS.

source: The system shuts down when fsck errors out!
fr: Le système s'éteint quand fsck sort en erreur&nbsp;!

source: Unix systems normally run sulogin if the normal bootup fsck run errors out so that root can log in and fix it. Because sulogin will accept any password if /etc/passwd is corrupt, the LFS developers decided this was a security risk. Therefore, the LFS bootscripts shut the machine down if fsck errors, and it must be booted with the "init=/bin/bash" kernel parameter to get a root shell. Whether this is wise is beyond the scope of the FAQ, but if it doesn't work for you you'll want to change that boot script before it's too late.
fr: Les système Unix lancent normalement sulogin quand le fsck d'un démarrage normal sort en erreur, afin que root puisse se connecter et résoudre le problème. Comme sulogin va accepter n'importe quel mot de passe si /etc/passwd est corrompu, les développeurs de LFS ont estimé que cela représentait un risque pour la sécurité. Les scripts de démarrage de LFS éteignent donc la machine en cas d'erreur de fsck, et elle doit être démarrée avec le paramètre de noyau "init=/bin/bash" afin d'obtenir un shell root. Savoir si cela est sage ne rentre pas dans le périmètre de cette FAQ, mais si cela ne vous convient pas, changez les scripts de démarrage avant qu'il ne soit trop tard.

source: Where are the lfs-packages tarballs or wget scripts?
fr: Où sont les archives des paquets LFS ou les scripts wget&nbsp;?

source: Package tarballs are available at <a href="http://anduin.linuxfromscratch.org/sources/LFS/lfs-packages/">the LFS file repository</a>. There is also a wget-list linked in the book, near the bottom of the <a href="/lfs/view/stable/chapter03/introduction.html">Packages and Patches Introduction page</a>.
fr: Les archives des paquets sont disponibles sur <a href="http://anduin.linuxfromscratch.org/sources/LFS/lfs-packages/">le dépôt de fichiers de LFS</a>. Il y a aussi un lien vers wget-list dans le livre, vers la fin de la page d'<a href="/lfs/view/stable/chapter03/introduction.html">Introduction</a> aux paquets et correctifs.

source: How do I find a package or command?
fr: Comment puis-je trouver un paquet ou une commande&nbsp;?

source: Please refer to the <a href="/lfs/download.html">download LFS</a> webpage.
fr: Consultez la page <a href="/lfs/download.html">téléchargement de LFS</a>.

source: How do I upgrade my LFS/BLFS system?
fr: Comment puis-je mettre à jour mon système LFS/BLFS&nbsp;?

source: You probably know this already, but LFS is not a distro in the traditional sense. Its primary goal is: <a href="/lfs/index.html">teaching people how a Linux system works internally</a>.
fr: Vous le savez probablement déjà mais LFS n'est pas un distribution au sens traditionnel du terme. Son but premier est&nbsp;: <a href="/lfs/index.html">enseigner aux gens comment un système Linux fonctionne en interne</a>.

source: While this means you have great control over your system (&quot;Your distro. Your rules.&quot;), it also has the drawback of having to take care of updating it yourself.
fr: Bien que cela signifie que vous aillez un grand contrôle sur votre système ("Votre distro. Vos règles."), Il a aussi l'inconvénient d'avoir à prendre soin de la mise à jour vous-même.
