Repository: espindula/br-lfs
Catalog: faq/*.po
Languages: fr

source: Frequently Asked Questions
fr: Foire Aux Questions

source: The FAQ is divided in three documents. The <a href="/faq/index.html">General FAQ</a> has links to all questions and answers. The <a href="/lfs/faq.html">LFS FAQ</a> is a selection of LFS-specific FAQ's and the <a href="/blfs/faq.html">BLFS FAQ</a> is a selection of BLFS-specific FAQ's.
fr: La FAQ est divisée en trois documents. La <a href="/faq/index.html">FAQ générale</a> propose des liens vers toutes les questions et les réponses. La <a href="/lfs/faq.html">FAQ LFS</a> est une sélection des questions les plus fréquemment posées concernant LFS et la <a href="/blfs/faq.html">FAQ BLFS</a> est une sélection des questions les plus fréquentes et spécifiques à BLFS.

source: General FAQ
fr: FAQ générale

source: <a href="#intro">General information about these FAQ's</a>
fr: <a href="#intro">Informations générales à propos de ces FAQ</a>

source: <a href="#why-faq">Why this FAQ?</a>
fr: <a href="#why-faq">Pourquoi cette FAQ&nbsp;?</a>

source: <a href="#what-is-lfs">What is LFS?</a>
fr: <a href="#what-is-lfs">Qu'est ce que LFS&nbsp;?</a>

source: <a href="#what-is-blfs">What is BLFS?</a>
fr: <a href="#what-is-blfs">Qu'est ce que BLFS&nbsp;?</a>

source: <a href="#contribute">How can I contribute to this FAQ?</a>
fr: <a href="#contribute">Comment puis-je contribuer à cette FAQ&nbsp;?</a>

source: <a href="#support">Support guidelines</a>
fr: <a href="#support">Instructions sur l'assistance</a>

source: <a href="#newbie">I'm a newbie to Linux or LFS and I need some help?</a>
fr: <a href="#newbie">Je débute sur Linux ou LFS et j'ai besoin d'aide</a>

source: <a href="#getting-help">Where is the best place to get help?</a>
fr: <a href="#getting-help">Quel est le meilleur endroit pour trouver de l'aide&nbsp;?</a>

source: <a href="#which-list">Which list should I use for what topic?</a>
fr: <a href="#which-list">Quelle liste de diffusion pour quel sujet&nbsp;?</a>

source: <a href="#netiquette">How do I address the LFS community?</a>
fr: <a href="#netiquette">Comment dois-je m'adresser à la communauté LFS&nbsp;?</a>

source: <a href="#frb">Frequently Reported Bugs</a>
fr: <a href="#frb">Bugs fréquemment remontés</a>

source: <a href="#wrong-ln-s-command">The "ln -s" commands in the Book are wrong.</a>
fr: <a href="#wrong-ln-s-command">Les commandes "ln -s" du livre sont fausses.</a>

source: <a href="#its-hardlink-not-copy">/bin/foo is a copy of /bin/bar.</a>
fr: <a href="#its-hardlink-not-copy">/bin/foo est une copie de /bin/bar.</a>

source: <a href="#why-not-version">Can I use a version newer than the one in the Book?</a>
fr: <a href="#why-not-version">Puis-je utiliser une version plus récente que celle du livre&nbsp;?</a>

source: <a href="#new-version">There's a new version of package Foo.</a>
fr: <a href="#new-version">Il y a une nouvelle version du paquet Foo.</a>

source: <a href="#delete_key_not_work">The Delete key doesn't work.</a>
fr: <a href="#delete_key_not_work">La touche Del ne fonctionne pas.</a>

source: <a href="#shutdown-on-fsck-error">The system shuts down when fsck errors out!</a>
fr: <a href="#shutdown-on-fsck-error">Le système s'éteint après que fsck soit sorti en erreur&nbsp;!</a>

source: <a href="#where-lfs-packages">Where are the lfs-packages tarballs or wget scripts?</a>
fr: <a href="#where-lfs-packages">Où sont les archives des paquets de lfs ou les scripts wget&nbsp;?</a>

source: <a href="#how-to-find">How do I find a package or command?</a>
fr: <a href="#how-to-find">Comment puis-je trouver un paquet ou une commande&nbsp;?</a>

source: <a href="#how-to-upgrade">How do I upgrade my LFS/BLFS system?</a>
fr: <a href="#how-to-upgrade">Comment faire pour mettre à jour mon système LFS/BLFS&nbsp;?</a>

source: LFS FAQ:
fr: La FAQ LFS&nbsp;:

source: <a href="/lfs/faq.html#fre">Frequently Requested Enhancements</a>
fr: <a href="/lfs/faq.html#fre">Améliorations fréquemment demandées</a>

source: <a href="/lfs/faq.html#add-grub">Why not use LILO instead of GRUB?</a>
fr: <a href="/lfs/faq.html#add-grub">Pourquoi ne pas utiliser LILO plutôt que GRUB&nbsp;?</a>

source: <a href="/lfs/faq.html#why-not-faq">Why not include the FAQ in the book?</a>
fr: <a href="/lfs/faq.html#why-not-faq">Pourquoi ne pas inclure la FAQ au livre&nbsp;?</a>

source: <a href="/lfs/faq.html#why-vim">Why is vim in the book?</a>
fr: <a href="/lfs/faq.html#why-vim">Pourquoi est-ce que Vim est dans le livre&nbsp;?</a>

source: <a href="/lfs/faq.html#hjl-binutils">Why is HJL's Binutils not in the book?</a>
fr: <a href="/lfs/faq.html#hjl-binutils">Pourquoi est-ce que la version HJL de Binutils n'est pas dans le livre&nbsp;?</a>

source: <a href="/lfs/faq.html#why-not-package-management">Why isn't some package manager in the book?</a>
fr: <a href="/lfs/faq.html#why-not-package-management">Pourquoi n'y a-t'il pas de gestionnaire de paquets dans le livre&nbsp;?</a>

source: <a href="/lfs/faq.html#no-poweroff">How do I make my machine poweroff when shut down?</a>
fr: <a href="/lfs/faq.html#no-poweroff">Comment provoquer l'arrêt électrique de la machine à la sortie du système&nbsp;?</a>

source: <a href="/lfs/faq.html#resources">When reading and building LFS</a>
fr: <a href="/lfs/faq.html#resources">Pendant la lecture et la construction de LFS</a>

source: <a href="/lfs/faq.html#what-dist">What distribution should I use to start from?</a>
fr: <a href="/lfs/faq.html#what-dist">Quel distribution dois-je utiliser pour commencer?</a>

source: <a href="/lfs/faq.html#kernel-modules">How do I compile a kernel or set up modules?</a>
fr: <a href="/lfs/faq.html#kernel-modules">Comment compiler le noyau ou configurer un module?</a>

source: <a href="/lfs/faq.html#gcc-warnings">Are compiler warnings from GCC bad?</a>
fr: <a href="/lfs/faq.html#gcc-warnings">Est-ce que c'est mal, les avertissements de compilation de Gcc&nbsp;?</a>

source: <a href="/lfs/faq.html#dirty-sources">Do I need to keep the source after installing?</a>
fr: <a href="/lfs/faq.html#dirty-sources">Dois-je conserver les sources après l'installation&nbsp;?</a>

source: <a href="/lfs/faq.html#really-small">How do I make that really small install the book mentions?</a>
fr: <a href="/lfs/faq.html#really-small">Comment puis-je procéder à cette toute petite installation dont parle le livre&nbsp;?</a>

source: <a href="/lfs/faq.html#procs-lfs">Is there information about building LFS on other processors?</a>
fr: <a href="/lfs/faq.html#procs-lfs">Existe-t'il des informations sur la façon de construire LFS sur d'autres architectures&nbsp;?</a>

source: <a href="/lfs/faq.html#cross-compile">How do I cross compile LFS?</a>
fr: <a href="/lfs/faq.html#cross-compile">Comment faire une compilation croisée avec LFS&nbsp;?</a>

source: <a href="/lfs/faq.html#dos-text">What's a DOS format text file?</a>
fr: <a href="/lfs/faq.html#dos-text">Qu'est qu'un fichier texte au format DOS&nbsp;?</a>

source: <a href="/lfs/faq.html#no-ptys">The system has no more ptys. Ask your system administrator to create more.</a>
fr: <a href="/lfs/faq.html#no-ptys">Le système n'a plus de ptys. Demandez à votre administrateur d'en créer d'autres.</a>

source: <a href="/lfs/faq.html#generrors">General compilation errors</a>
fr: <a href="/lfs/faq.html#generrors">Erreurs de compilation usuelles.</a>

source: <a href="/lfs/faq.html#gnu-patches">I used a patch from GNU to upgrade. Is that OK?</a>
fr: <a href="/lfs/faq.html#gnu-patches">J'ai utilisé un patch provenant de GNU pour faire des mises à jour. C'est bon&nbsp;?</a>

source: <a href="/lfs/faq.html#optimizations">When using optimization flags (setting CFLAGS)</a>
fr: <a href="/lfs/faq.html#optimizations">Utilisation des paramètres d'optimisation (paramétrage des CFLAGS)</a>

source: <a href="/lfs/faq.html#config-hang-size_t">Why does configure hang at &quot;checking for signed size_t type...&quot;?</a>
fr: <a href="/lfs/faq.html#config-hang-size_t">Pourquoi est-ce que configure se fige sur «&nbsp;checking for signed size_t type...&nbsp;»&nbsp;?</a>

source: <a href="/lfs/faq.html#dirty-sources">I didn't delete the source tree after my last attempt. Do I need to?</a>
fr: <a href="/lfs/faq.html#dirty-sources">Je n'ai pas effacé l'arborescence des sources après mon dernier essai. Faut-il le faire&nbsp;?</a>

source: <a href="/lfs/faq.html#perm-denied">I'm getting `/dev/null: Permission denied'</a>
fr: <a href="/lfs/faq.html#perm-denied">J'obtiens le message «&nbsp;/dev/null: Permission denied&nbsp;»</a>

source: <a href="/lfs/faq.html#conf-guess-fail">configure can't guess my host type.</a>
fr: <a href="/lfs/faq.html#conf-guess-fail">configure n'arrive pas à déterminer le type de mon hôte.</a>

source: <a href="../lfs/faq.html#packerrors">Package-specific errors</a>
fr: <a href="../lfs/faq.html#packerrors">Erreurs spécifiques à certains paquets</a>

source: <a href="/lfs/faq.html#glibc-awk-fail">Glibc fails and mentions BEGIN and END.</a>
fr: <a href="/lfs/faq.html#glibc-awk-fail">Glibc sort en erreur et évoque BEGIN et END.</a>

source: <a href="/lfs/faq.html#glibc-nss">Glibc compilation errors out due to a missing nss.h header file</a>
fr: <a href="/lfs/faq.html#glibc-nss">La compilation de Glibc sort en erreur à cause de l'absence du fichier d'entête nss.h</a>

source: <a href="/lfs/faq.html#cpp-fails-sanity-check">Ncurses: C++ preprocessor &quot;/lib/cpp&quot; fails sanity check</a>
fr: <a href="/lfs/faq.html#cpp-fails-sanity-check">Ncurses: le préprocesseur C++ "/lib/cpp" échoue lors de la vérification de conformité</a>

source: <a href="/lfs/faq.html#confboot">Configuration and booting issues</a>
fr: <a href="/lfs/faq.html#confboot">Problèmes de configuration et de démarrage</a>

source: <a href="/lfs/faq.html#net-pf-x">I'm getting errors about net-pf-?.</a>
fr: <a href="/lfs/faq.html#net-pf-x">J'obtiens des erreurs à propos de net-pf-?.</a>

source: <a href="/lfs/faq.html#less-prints-ad">Why does less (and therefore man) print &lt;AD&gt; instead of hyphens?</a>
fr: <a href="/lfs/faq.html#less-prints-ad">Pourquoi est-ce que less (et par conséquent man) affiche &lt;AD&gt; au lieu des tirets&nbsp;?</a>

source: BLFS FAQ:
fr: FAQ de BLFS&nbsp;:

source: <a href="/blfs/faq.html#genblfs">General BLFS questions</a>
fr: <a href="/blfs/faq.html#genblfs">Questions d'ordre général sur BLFS</a>

source: <a href="/blfs/faq.html#bootcd">How do I make a bootable CD?</a>
fr: <a href="/blfs/faq.html#bootcd">Comment faire un CD de démarrage&nbsp;?</a>

source: <a href="/blfs/faq.html#seti">Where do I join the LFS SETI/Predictor/etc teams?</a>
fr: <a href="/blfs/faq.html#seti">Où puis-je joindre les équipes LFS SETI/Predictor/etc&nbsp;?</a>

source: <a href="/blfs/faq.html#compissues">Compilation issues</a>
fr: <a href="/blfs/faq.html#compissues">Problèmes de compilation</a>

source: <a href="/blfs/faq.html#gtk-2_0">I'm getting errors building a package that requires GTK+,but I've installed GTK+ 2.x.</a>
fr: <a href="/blfs/faq.html#gtk-2_0">J'obtiens des erreurs quand je construis un paquet qui requiert GTK+, mais j'ai bien installé GTK+ 2.x.</a>

source: <a href="/blfs/faq.html#gnome-versions">Any error while building part of Gnome</a>
fr: <a href="/blfs/faq.html#gnome-versions">Toute erreur survenant lors de la compilation d'un élément de Gnome</a>

source: <a href="/blfs/faq.html#confissues">Configuration issues</a>
fr: <a href="/blfs/faq.html#confissues">Problème de configuration</a>

source: <a href="/blfs/faq.html#how-to-print">How do I print?</a>
fr: <a href="/blfs/faq.html#how-to-print">Comment imprimer&nbsp;?</a>

source: <a href="/blfs/faq.html#konsole-ps1">How do I set PS1 in Konsole?</a>
fr: <a href="/blfs/faq.html#konsole-ps1">Comment paramétrer PS1 dans Konsole&nbsp;?</a>

source: General information about these FAQ's
fr: Informations générales à propos de ces FAQ

source: Why this FAQ?
fr: Pourquoi cette FAQ&nbsp;?

source: The FAQ tries to answer questions before they're asked. This saves the trouble of asking them, and sometimes, the trouble of encountering a problem.
fr: La FAQ essaye de répondre aux questions avant qu'elles soient posées. Ça vous évite le souci de poser les questions et parfois, celui de rencontrer le problème.

source: This does reduce traffic and improve the signal to noise ratio but that is merely a useful side effect.
fr: Cela réduit le trafic et améliore le ratio signal/bruit, même si cela n'est qu'un effet de bord bien utile.

source: Since the FAQ isn't the natural place to look for information, items should be added to it only if they can't be added to the appropriate documentation. Sometimes it will be necessary to add a pointer to the information in the documentation.
fr: Comme la FAQ n'est pas l'emplacement naturel où chercher l'information, on ne devrait y ajouter que ce qui ne peut pas aller dans la documentation adéquate. Il sera parfois nécessaire d'ajouter à la documentation un pointeur vers cette information.

source: What is LFS?
fr: Qu'est ce que LFS&nbsp;?

source: LFS stands for Linux From Scratch which is a project that aims to teach you about the inner workings of Linux by building a Linux system by downloading, building, and installing the packages yourself.
fr: LFS signifie Linux From Scratch et c'est un projet qui a pour but de vous apprendre le fonctionnement interne de Linux en vous faisant construire un système Linux par le téléchargement, la compilation et l'installation des paquets.

source: Also check out the <a href="/lfs/index.html">introduction to LFS</a>.
fr: Vous pouvez aussi aller lire <a href="/lfs/index.html">l'introduction à LFS</a>.

source: What is BLFS?
fr: Qu'est ce que BLFS&nbsp;?

source: LFS is a very basic system, in massive contrast to traditional distributions. The reason is this: LFS is not intended to create your system as you want it. It's intended to be just enough to allow you to build your system as you want it. It's not an end, it's a beginning. When you're done with LFS, you've just started building your system.
fr: LFS est un système très basique, qui contraste beaucoup avec les distributions traditionnelles. La raison est la suivante&nbsp;: LFS n'est pas prévu pour créer un système à votre guise. Il est prévu pour être juste suffisant pour vous permettre de créer un système à votre guise. Ce n'est pas une fin, c'est un commencement. Quand vous en avez terminé avec LFS, vous venez seulement de commencer à bâtir votre système.

source: This can be a problem if you're new to Unix systems and want a typical desktop install with X and a web browser but have no idea what packages you need. For this reason, there is Beyond Linux From Scratch, or <a href="/blfs/index.html">BLFS</a>.
fr: Ça peut être un problème si vous débutez avec les systèmes Unix et voulez une installation bureautique classique avec X et un navigateur internet sans savoir de quels paquets vous avez besoin. C'est pour cela qu'il existe Beyond Linux From Scratch, ou <a href="/blfs/index.html">BLFS</a>.

source: Contributing to this FAQ.
fr: Contribuer à cette FAQ.

source: Suggestions are more than welcome. The FAQ maintainer can be reached either via direct email or on the <a href="http://lists.linuxfromscratch.org/listinfo/faq/">FAQ mailing list</a>.
fr: Les suggestions sont plus que bienvenues. Le mainteneur de la FAQ peut être joint par courrier électronique directement ou sur la <a href="http://lists.linuxfromscratch.org/listinfo/faq/">Liste de diffusion de la FAQ</a>.

source: Useful suggestions include the addition of questions that are actually frequently asked (with well researched answers) and the removal of questions that are obsolete.
fr: Les suggestions pertinentes comprennent l'ajout de questions fréquemment posées (avec des réponses fouillées) et la suppression des questions obsolètes.

source: If you intend to regularly contribute to this FAQ, you might want to subscribe to the FAQ mailing list. All suggestions, additions (and sometimes removals) of the FAQ's are discussed there. Patches against the FAQ's are also welcome, although regular text-based contributions are accepted as well.
fr: Si vous pensez contribuer régulièrement à cette FAQ, vous devriez vous inscrire à la liste de diffusion. Toutes les suggestions, tous les ajouts (et parfois suppressions) y sont débattues. Il est possible d'appliquer des patches à la FAQ, même si les contributions au classique format texte sont également acceptées.

source: Everything intended to go in the FAQ without substantial editing must be well thought out, checked, and researched; and written in a style consistent with the existing content.
fr: Tout ce qui est censé intégrer la FAQ, sans qu'il s'agisse d'une révision complète, doit être réfléchi, vérifié, approfondi ; et écrit dans un style qui se marie bien avec le contenu actuel.

source: <a href="#generalfaq">Back to the top.</a>
fr: <a href="#generalfaq">Haut de page.</a>

source: Support guidelines
fr: Instructions sur l'assistance

source: What if I'm a newbie to Linux or LFS?
fr: Et si je débute avec Linux ou LFS&nbsp;?

source: If you've read the <a href="/lfs/view/stable/prologue/prerequisites.html">prerequisites</a> and <a href="/lfs/view/stable/prologue/audience.html">audience</a> pages you know that the target audience of LFS are intermediate and advanced Linux users. Anybody who has a couple of months experience with Linux and especially the console should be able to successfully assemble an LFS system.
fr: Si vous avez lu les pages <a href="/lfs/view/stable/prologue/prerequisites.html">prérequis</a> et <a href="/lfs/view/stable/prologue/audience.html">public</a>, vous savez que LFS vise les utilisateurs de Linux qui ont un niveau intermédiaire et avancé. Quiconque a quelques mois d'expérience sur Linux et en particulier la console devrait pouvoir monter avec succès son système LFS.

source: While LFS seems like a good guide for newbies to Linux, the reality is actually quite different. Experience with the support channels shows that LFS is hard to grasp and a frustrating experience for newbies because they lack understanding of the basic concepts.
fr: LFS semble être un bon guide pour débuter sous Linux, cependant la réalité est bien différente. Notre expérience sur les canaux d'assistance montre que LFS est difficile à appréhender, et se révèle être une expérience frustrante pour les débutants parce qu'il leur manque la compréhension des concepts de base.

source: Practically, this means that newbies should get some experience before starting with LFS. The <a href="/lfs/view/stable/prologue/prerequisites.html">prerequisites page</a> lists the minimal required Linux knowledge, but please also read the <a href="/hints/downloads/files/">&quot;Essential pre-reading for life with LFS&quot;</a> hint.
fr: Concrètement, cela signifie que les débutants devraient acquérir de l'expérience avant de commencer avec LFS. La <a href="/lfs/view/stable/prologue/prerequisites.html">page des prérequis</a> liste les connaissances minimales à avoir sur Linux, et s'il vous plaît, lisez également l'astuce sur la <a href="/hints/downloads/files/">«&nbsp;Pré-lecture essentielle pour vivre avec une LFS&nbsp;»</a>.

source: These documents and this FAQ are your basic Linux survival guide. You'll have a great time with LFS if you've read them, and may have some difficulty with LFS and the community, but most likely yourself, if you haven't read them.
fr: Ces documents et cette FAQ sont votre petit guide de survie sous Linux. Vous allez bien vous amuser avec LFS si vous les avez lu, ce sera beaucoup plus difficile avec LFS et avec la communauté, et plus probablement avec vous-même, si vous ne les avez pas lu.

source: Where is the best place to get help?
fr: Quel est le meilleur endroit où trouver de l'aide&nbsp;?

source: When this FAQ fails to help, there are several places to go.
fr: Si vous n'avez pas trouvé de réponse dans cette FAQ, il y a d'autres endroits où aller chercher.

source: If you're having a problem with something in the book, it never hurts to go back over the book. It's surprising how easy it is to overlook little things.
fr: Si vous rencontrez un problème avec un passage du livre, ça ne peut pas faire de mal de revenir quelques pages en arrière. C'est surprenant avec quelle facilité certaines petites choses peuvent nous échapper.

source: If nothing else, reading the appropriate man and info pages will yield useful information on some subject, if not what you were looking for, and ensure that you know enough not to embarrass yourself if you have to ask someone.
fr: Enfin, la lecture des pages de man et d'info vous apportera des informations pratiques sur certains sujets, si ce n'est la réponse à ce que vous cherchez. Cela vous assurera également d'en savoir assez pour ne pas vous mettre dans l'embarras si vous devez poser une question à quelqu'un.

source: <a href="http://www.tldp.org/">The Linux Documentation Project</a> has the HOW-TOs and a great deal of other documentation. You might find something there.
fr: <a href="http://www.tldp.org/">Le Projet de Documentation de Linux</a> propose des tutoriels et une tonne de documentation. Vous devriez y trouver quelque chose.

source: The <a href="/search.html">website's search</a> includes the mailing lists. Many questions have been discussed there at least once.
fr: La <a href="/search.html">page de recherche</a> du site inclut les listes de diffusion. Beaucoup de questions y ont été débattues au moins une fois.

source: For support-type help, IRC is often best. It's faster, and doesn't clog the mailing lists. There's more information about the <a href="/support.html#irc">IRC channels</a> on the <a href="/support.html">support</a> webpage.
fr: Pour une aide de type «&nbsp;assistance&nbsp;», IRC est souvent le meilleur. C'est plus rapide et ça n'encombre pas la liste de diffusion. Plus d'informations sur les <a href="/support.html#irc">canaux IRC</a> sur la <a href="/support.html">page de support</a>.

source: There are a few IRC channels of interest.
fr: Il y a quelques canaux IRC dignes d'intérêt.

source: <a href="irc://irc.freenode.net/lfs">#lfs</a> - the LFS community channel.
fr: <a href="irc://irc.freenode.net/lfs">#lfs</a> - le canal communautaire de LFS.

source: <a href="irc://irc.freenode.net/lfs-support">#lfs-support</a> - Support for LFS and BLFS.
fr: <a href="irc://irc.freenode.net/lfs-support">#lfs-support</a> - Support pour LFS et BLFS.

source: <a href="irc://irc.freenode.net/hlfs">#hlfs</a> - Support for the HLFS book.
fr: <a href="irc://irc.freenode.net/hlfs">#hlfs</a> - Support pour le livre HLFS.

source: If you are asking a support question, you are more likely to attract competent and friendly help in <a href="irc://irc.freenode.net/lfs-support">#lfs-support</a>.
fr: Si vous formulez une requête d'assistance, vous aurez plus de chances d'obtenir une aide amicale et compétente sur <a href="irc://irc.freenode.net/lfs-support">#lfs-support</a>.

source: As a last resort, there are the mailing lists. People will get frustrated with you if you use the wrong one or cross post. Mailing list information is on the <a href="/support.html#mailinglists">support webpage</a> and tells which list to use.
fr: En dernier recours, on trouve les listes de diffusion. Les gens risquent de vous en vouloir si vous utilisez la mauvaise liste ou si vous postez sur plusieurs listes à la fois. Les informations sur les listes de diffusions se trouvent sur la <a href="/support.html#mailinglists">page assistance</a> et indiquent quelle liste utiliser.
