Repository: espindula/br-lfs
Catalog: faq/*.po
Languages: fr

source: It has to do with the characters used to end lines.
fr: Cela a à voir avec les caractères en fin de ligne.

source: There are two that may be used:
fr: Il y en a deux qui sont utilisés&nbsp;:

source: Line Feed: (LF) Octal:012 Decimal:10 Hex:0A C Style Escape:'\n' Moves down one line.
fr: Saut de Ligne&nbsp;: (LF) Octal&nbsp;: 012 Décimal&nbsp;:10 Hexa&nbsp;:0A Échappement à la C&nbsp;:'\n'. Déplace d'une ligne vers le bas.

source: Carriage Return: (CR) Octal:015 Decimal:13 Hex:0D C Style Excape:'\r' Move to the left margin.
fr: Retour Charriot: (CR) Octal&nbsp;:015 Décimal&nbsp;:13 Hexa&nbsp;:0D Échappement à la C:'\r'. Déplace le curseur vers la marge à gauche.

source: Unix, DOS, and MacOS each use a different combination to end lines in text files:
fr: Unix, DOS et MacOS utilisent chacun une combinaison différent pour terminer les lignes des fichiers textes&nbsp;:

source: Unix: LF only. This is why when a Unix format text file is sent to a printer raw, it prints out
fr: Unix&nbsp;: LF seulement. C'est pour cela que lorsqu'un text au format Unix est envoyé à une imprimante directement, il sort ainsi&nbsp;:

source: &nbsp;&nbsp;like
fr: &nbsp;&nbsp;comme

source: &nbsp;&nbsp;&nbsp;&nbsp;stairs
fr: &nbsp;&nbsp;&nbsp;&nbsp;des marches

source: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;steps.
fr: &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;d'escaliers.

source: DOS: CRLF both. Which is why if you do "cat -v" on a DOS file you'll see a "^M" (control m is carriage return) at the end of each line. And that is why scripts don't work when written with Microsoft Notepad. The kernel looks for "/bin/sh^M" which doesn't exist. There's a "/bin/sh", but nothing with a "^M" appended.
fr: DOS&nbsp;: CRLF (les deux). C'est pourquoi en faisant «&nbsp;cat -v&nbsp;» sur un fichier DOS vous verrez un «&nbsp;^M&nbsp;» (contrôle M est le retour charriot) à la fin de chaque liggne. Et c'est pourquoi les scripts ne fonctionnent pas lorsqu'ils sont écrits avec le bloc-notes de Microsoft. Le noyau cherche «&nbsp;/bin/sh^M&nbsp;» qui n'existe pas. Il y a bien un «&nbsp;/bin/sh&nbsp;» mais rien avec un «&nbsp;^M&nbsp;» à la fin.

source: MacOs: CR only. Printers probably print every line atop the first, and Unix tools think the whole file is one line with "^M" all through it.
fr: MacOS&nbsp;: CR seulement. Les imprimantes impriment sans doute les lignes par dessus les autres et les outils Unix pensent que le fichier ne fait qu'une ligne avec des «&nbsp;^M&nbsp;» partout dedans.

source: To change DOS to Unix, use
fr: Pour convertir du format DOS à Unix, utilisez

source: Or in <code>vim</code>, you can convert a file with <code>:set ff={unix, dos, mac}</code>. Other conversions will probably require sed or a different use of tr and are left as an exercise for the reader.
fr: Ou dans <code>vim</code>, vous pouvez convertir un fichier avec <code>:set ff={unix, dos, mac}</code>. Les autres conversions demanderont sans doute sed ou une utilisation différente de tr et sont laissé en exercice au lecteur.

source: Is there a way to download all current files at one time?
fr: Y a-t-il moyen de télécharger tous les fichiers actuels d'un coup&nbsp;?

source: Yes. You can download the file LFS-BOOK-x.y-wget-list <a href= "http://www.linuxfromscratch.org/lfs/downloads/stable"> http://www.linuxfromscratch.org/lfs/downloads/stable</a>. To download all the files, use the version of <code>wget</code> on your host distribution to run:
fr: Oui. Vous pouvez télécharger le fichier LFS-BOOK-x.y-wget-list sur <a href= "http://www.linuxfromscratch.org/lfs/downloads/stable"> http://www.linuxfromscratch.org/lfs/downloads/stable</a>. Pour télécharger tous les fichiers, utilisez la version de <code>wget</code> de votre distribution hôte et lancez&nbsp;:

source: General compilation errors
fr: Erreurs de compilation usuelles

source: I used a patch from GNU to upgrade. Is that OK?
fr: J'ai utilisé un patch provenant de GNU pour faire des mises à jour. C'est bon&nbsp;?

source: Patches from GNU don't usually work. You can either download the full archive and try again or try the solution given by Gerard Beekmans:
fr: Les correctifs de GNU ne marchent pas en général. Vous pouvez soit télécharger l'archive complète et essayer de nouveau, soit essayer la solution proposée par Gerard Beekmans&nbsp;:

source: The problem is that executable marked scripts are patched too and they then lose the executable bit, so you can't execute those scripts anymore until you run a "chmod +x" on them (or something similar, like chmod 755) before installing Glibc. Try chmod +x glibc-2.2.5/scripts/* (not 100% sure about the directory paths but it should be obvious where to do it when running an 'ls' on the glibc-2.2.5 directory).
fr: Le problème est que les scripts marqués exécutables sont corrigés aussi et ils perdent leur bit exécutable, donc vous ne pouvez plus les exécuter jusqu'à ce que vous lanciez «&nbsp;chmod +x&nbsp;» dessus (ou quelque chose de similaire comme chmod 755) avant d'installer Glibc. Essayez chmod +x glibc-2.2.5/scripts/* (je ne suis pas 100% sûr des chemins mais ça devrait être évident à trouver en lançant «&nbsp;ls&nbsp;» dans le répertoire glibc-2.2.5).

source: When using optimization flags (setting CFLAGS)
fr: Utilisation des flags d'optimisation (paramétrage des CFLAGS)

source: If you're getting errors and you're setting CFLAGS or otherwise passing optimization flags to the compiler that may be the problem.
fr: Si vous obtenez des erreurs et que vous initialisez CFLAGS ou changez les paramètres d'optimisation du compilateur, cela pourrait être le problème.

source: If you ask on the list and they can't figure it out immediately, they'll likely suggest trying it without optimization. So if you just retry it without before asking, you'll be one step ahead of them :)
fr: Si vous demandez sur la liste et qu'ils ne trouvent pas tout de suite, ils vous suggéreront sans doute d'essayer sans optimisation. Donc si vous réessayez seulement sans demander, vous aurez un coup d'avance sur eux :)

source: Of particular note is that optimizing binutils, gcc, or glibc may cause any other package to fail to compile or run or to otherwise misbehave in strange and mysterious ways. Also, optimization that works for someone else may not work for you. Flags that used to work may mysteriously stop working. Even some small innocent hardware change can make the difference.
fr: Il est important de noter qu'optimiser binutils, gcc ou glibc peut provoquer des échecs à la compilation ou au lancement d'autres paquets ou les faire se comporter de manière étrange et mystérieuse. Aussi, une optimisation qui fonctionne pour quelqu'un d'autre peut ne pas fonctionner pour vous. Les drapeaux qui marchaient peuvent mystérieusement arrêter de fonctionner. Même de petits changements innocents dans le matériel peut faire la différence.

source: (If you don't know what optimization flags are, don't worry, you really don't need to.)
fr: (Si vous ne savez pas ce que sont les drapeaux d'optimisation, ne vous en faîtes pas, vous n'avez vraiment pas besoin de savoir.)

source: Why does configure hang at "checking for signed size_t type..."?
fr: Pourquoi est-ce que configure se fige sur «&nbsp;checking for signed size_t type...&nbsp;»&nbsp;?

source: You over optimized gcc.
fr: Vous avez sur-optimisé gcc.

source: I didn't delete the source tree after my last attempt. Do I need to?
fr: Je n'ai pas effacé l'arborescence des sources après mon dernier essai. Faut-il le faire&nbsp;?

source: Yes. In general <code>make clean</code> or <code>make dist-clean</code> can't be relied upon for clean sources. Especially when you have manually hacked the sources or applied patches to it you should first try again with a fresh unpacked package. The only exception to this rule is the linux kernel, which requires its sources to be present when third-party modules, such as the NVidia drivers, are needed.
fr: Oui. En général on ne peut pas compter sur <code>make clean</code> ou <code>make dist-clean</code> pour nettoyer les sources. Surtout quand vous avez modifié les sources à la main ou appliqué un correctif, vous devriez essayer de nouveau avec un paquet fraîchement décompressé. La seule exception à cette règle est le noyau linux, qui requière que ses sources soient présentes lorsque des modules tiers, comme ceux des pilotes NVidia, sont requis.

source: I'm getting `/dev/null: Permission denied'
fr: J'obtiens le message «&nbsp;/dev/null: Permission denied&nbsp;»

source: Does /dev/null look like this:
fr: Est-ce que /dev/null ressemble à ça&nbsp;:

source: If not, it should. See the chmod(1), chown(1), and mknod(1) man pages and /usr/src/linux/Documentation/devices.txt if you need help fixing it.
fr: Si non, il devrait. Regardez les pages de manuel de chmod(1), chown(1) et mknod(1) et /usr/src/linux/Documentation/devices.txt si vous avez besoin d'aide pour corriger ça.

source: If it does look right, the problem is probably your mount options. See the answer to "<a href="#bad-interpreter-permission-denied">./configure: bad interpreter: Permission denied</a>", above.
fr: Si ça semble juste, le problème est probablement vos options de montage. Regardez la réponse à «&nbsp;<a href="#bad-interpreter-permission-denied">./configure: bad interpreter: Permission denied</a>&nbsp;», au dessus.

source: The long answer is at <a href="http://www.bitwizard.nl/sig11/">http://www.bitwizard.nl/sig11/</a>.
fr: La réponse longue se trouve sur <a href="http://www.bitwizard.nl/sig11/">http://www.bitwizard.nl/sig11/</a>.

source: The short answer is that if restarting make gets a little further every time, you have a hardware problem. (If make, or whatever you're running, fails at the same place every time, then it is not hardware.)
fr: La répons courte est que si redémarrer make avance un peu à chaque fois, vous avez un problème matériel. (Si make ou quoi que ce soit que vous lanciez, échoue au même endroit à chaque fois, ce n'est pas matériel).

source: Assuming you're not overclocking, the most likely hardware problem is bad memory which you can check with Memtest86 from <a href="http://www.memtest86.com/">http://www.memtest86.com/</a>. If that isn't it, see the long answer.
fr: En supposant que vous n'êtes pas overclocké, le problème matériel le plus probable est une mauvaise mémoire que vous pouvez vérifier avec Memtest86 de <a href="http://www.memtest86.com/">http://www.memtest86.com/</a>. Si ça n'est pas ça, regardez la répons longue.

source: Examples of this error are:
fr: Des exemples de cette erreur sont&nbsp;:

source: This usually indicates a typo in the GCC Pass 2 installation. For older LFS versions, the most common cause of this problem would be forgetting to apply the specs patch.
fr: Cela signifie généralement une coquille dans l'installation de GCC Pass 2. Pour les anciennes versions de LFS, la cause principale été d'oublier d'appliquer le correctif à specs.

source: What happens is that the path to the dynamic linker embedded inside the executable is still pointing at /lib/ld-linux.so.2 and when one goes to run the binary inside the chroot where /lib/ld-linux.so.2 does not exist yet, the very unhelpful <code>No such file or directory</code> error message is shown.
fr: Ce qui se passe, c'est que le chemin du chargeur de lien dynamique inclus dans l'exécutable pointe toujours sur /lib/ld-linux.so.2 et lorsqu'on lance le binaire dans le chroot où /lib/ld-linux.so.2 n'existe pas encore, le message d'erreur peu explicite <code>No such file or directory</code> apparaît.

source: You can test this with <code>readelf -l {binary} | grep interpreter</code>. Its output should be: <code>Requesting program interpreter: /tools/lib/ld-linux.so.2</code>.
fr: Vous pouvez tester cela avec <code>readelf -l {binary} | grep interpreter</code>. Sa sortie devrait être <code>Requesting program interpreter: /tools/lib/ld-linux.so.2</code>.

source: You forgot to <code>cd</code> into the extracted directory of the package after you've extracted it.
fr: Vous avez oublié de <code>cd</code> dans le répertoire extrait du paquet après l'avoir extrait.

source: You're most likely getting this while building binutils in Chapter 5 of the LFS Book. The problem is most likely your mount options. You probably have a line in /etc/fstab like:
fr: Vous obtenez probablement ça en construisant binutils dans le chapitre 5 du livre LFS. Le problème est probablement vos options de montage. Vous avez sans doute une ligne dans /etc/fstab qui ressemble à&nbsp;:

source: 'user' is the mount flag, and it's the problem. To quote from the mount man page:
fr: «&nbsp;user&nbsp;» est un drapeau de montage, et ce n'est pas le problème. Pour citer la page de manuel de mount&nbsp;:

source: <cite>user: Allow an ordinary user to mount the file system. This option implies the options noexec, nosuid, and nodev (unless overridden by subsequent options, as in the option line user,exec,dev,suid).</cite>
fr: <cite>user: Permet à une utilisateur ordinaire de monter le système de fichiers. Cette option implique les options noexec, nosuid et nodev (à moins d'être écrasé par les options suivantes, comme dans la ligne d'options user,exec,dev,suid).</cite>

source: So change the line in /etc/fstab like this:
fr: Donc changez la ligne dans /etc/fstab ainsi&nbsp;:

source: configure can't guess my host type.
fr: configure n'arrive pas à déterminer le type de mon hôte.

source: The problem is usually that the script can't run the compiler. Usually it's just a missing /usr/bin/cc symlink. You can fix it like this:
fr: Le problème est généralement que le script ne peut pas lancer le compilateur. Généralement c'est juste un lien symbolique /usr/bin/cc manquant. Vous pouvez le modifier ainsi&nbsp;:

source: If that doesn't do it, check the file config.log created by configure. Errors are recorded there and may indicate the problem.
fr: Si ça ne marche pas, vérifiez le fichier config.log créé par configure. Les erreurs sont enregistrées là et peuvent indiquer le problème.

source: If you're getting an error from configure like:
fr: Si vous obtenez une erreur de configure comme ça&nbsp;:

source: It may be because egrep isn't working. Since egrep is a shell-script which calls grep, this actually means there's a problem with grep.
fr: Cela pourrait signifier que egrep ne fonctionne pas. Comme egrep est un script shell qui appelle grep, cela signifie qu'il y a un problème avec grep.

source: To test if grep is working <em>before</em> reinstalling the grep package in Chapter 6, run the following command from <em>outside</em> chroot:
fr: Pour tester si grep fonctionne <em>avant</em> de réinstaller le paquet grep dans le chapitre 6, lancez la commande suivante depuis <em>l'extérieur</em> du chroot&nbsp;:

source: If it doesn't say <code>statically linked</code> you have a problem and need to reinstall the grep package according to the instruction in chapter 5.
fr: Si ça n'indique pas <code>statically linked</code>, vous avez un problème et devez réinstaller le paquet grep conformément aux instructions du chapitre 5.

source: To test if egrep is working <em>after</em> reinstalling the grep package in Chapter 6, run the following command from <em>inside</em> chroot:
fr: Pour tester si egrep fonctionne <em>après</em> avoir réinstallé le paquet grep dans le chapitre 6, lancez la commande suivante depuis <em>l'intérieur</em> du chroot&nbsp;:

source: If it doesn't print root's line from /etc/passwd, again, you have a problem. (This test also works if you encounter the problem after rebooting into the new LFS system.)
fr: Si cela n'affiche pas la ligne de root du fichier /etc/passwd, de nouveau, vous avez un problème. (Ce test fonctionne aussi si vous rencontrez un problème après avoir redémarré dans votre nouveau système LFS).

source: If you run
fr: Si vous lancez

source: and get the following error:
fr: et obtenez cette erreur&nbsp;:

source: then your linux distribution is either not setup to use Unix98 PTYs or to use the /dev/pts file system.
fr: alors votre distribution Linux n'est soit pas configurée pour utiliser les PTY Unix98 soit pour utiliser le système de fichiers /dev/pts.

source: The solution may require recompiling your kernel. First, go to your kernel's source directory and look at the .config file. If you do not have a .config file, and you are running the pre-compiled kernel that was installed with rpm, aptget, or whatever your distribution uses, then you need to seek support from your distribution's support FAQ's, mailing lists or IRC channels.
fr: La solution peut demander de recompiler votre noyau. Tout d'abord allez dans le répertoire des sources de votre noyau et regardez le fichier .config. Si vous ne trouvez pas le fichier .config et que vous tournez sur un noyau précompilé installé avec rpm, apt-get ou ce que votre distribution utilise, alors vous devrez trouver du support auprès de la FAQ, des listes de diffusion ou les canaux IRC de votre distribution.

source: If you do have a .config file, look inside it for the following 2 options:
fr: Si vous avez un fichier .config, cherchez dedans les deux option suivantes&nbsp;:

source: If either of these has 'n' instead of 'y', then change it and recompile the kernel.
fr: Si l'une des deux a «&nbsp;n&nbsp;» au lieu de «&nbsp;y&nbsp;», alors changez-la et recompilez le noyau.

source: If they both have 'y', then you probably will not have to recompile the kernel.
fr: Si elles sont toutes les deux à «&nbsp;y&nbsp;», alors vous n'aurez probablement pas besoin de recompiler le noyau.

source: Next, we need to ensure that the system is actually using both Unix98 PTYs and the /dev/pts file system.
fr: Ensuite, nous devons nous assurer que le système utilise bien les PTY Unix98 et le système de fichiers /dev/pts.

source: First, look for a device called /dev/ptmx. If it doesn't exist, create it with:
fr: Tout d'abord, cherchez un périphérique nommé /dev/ptmx. S'il n'existe pas, créez-le avec&nbsp;:

source: Then, whether it existed or you just created it, run:
fr: Ensuite, qu'il ait existé ou que vous veniez de le créer, lancez&nbsp;:

source: Next, ensure that there is a directory called /dev/pts. The permissions should be 755. Create it and/or chmod it if needed.
fr: Puis, assurez-vous qu'il y a bien un répertoire nommé /dev/pts. Les permissions devraient être 755. Créez-le ou chmodez-le si besoin.

source: The final setup is to add the following line to /etc/fstab:
fr: L'étape finale consiste à ajouter la ligne suivante à /etc/fstab&nbsp;:

source: NOTE: Look for the tty group in /etc/group and note the group id number. Change the gid=5 option to match the group id number of the tty group. The group id of 5 is just an example and may differ on your system.
fr: REMARQUE&nbsp;: Cherchez le groupe tty dans /etc/group et notez le numéro d'id du groupe. Changez l'option gid=5 pour correspondre au numéro d'id du groupe tty. L'id du groupe de 5 n'est qu'un exemple et peut être différent sur votre système.

source: Now that everything is setup, you have two options.
fr: Maintenant que tout est configuré, vous avez deux options.

source: 1. Mount /dev/pts and test it by rerunning the above expect command.
fr: 1. Montez /dev/pts et testez-le en relançant la commande expect ci-dessus.

source: 2. Reboot the computer and test it by rerunning the above expect command.
fr: 2. Redémarrez l'ordinateur et testez-le en relançant la commande expect ci-dessus.

source: Package-specific errors
fr: Erreurs spécifiques à certains paquets

source: If compiling GCC in Chapter 5 errors out with
fr: Si la compilation de GCC dans le chapitre 5 échoue avec

source: Try the solution given in <a href="http://linuxfromscratch.org/pipermail/lfs-support/2002-September/009562.html">the lfs-support archives</a> and replies.
fr: Essayez la solution donnée dans <a href="http://linuxfromscratch.org/pipermail/lfs-support/2002-September/009562.html">les archives de lfs-support</a> et ses réponses.

source: Glibc fails and mentions BEGIN and END.
fr: Glibc sort en erreur et évoque BEGIN et END.

source: If glibc fails to build with an error like this:
fr: Si la construction de glibc échoue avec une erreur comme ceci&nbsp;:

source: then gawk is failing. The key is the BEGIN and END in the output. The probable reason is that it is linked incorrectly. This can be fixed by recompiling it as the lfs user, according to the directions in Chapter 5.
fr: alors gawk échoue. La clef est le BEGIN et le END dans la sortie. La raison probable est qu'il est lié incorrectement. Cela peut être corrigé en le recompilant en tant qu'utilisateur lfs, en suivant les instructions du chapitre 5.

source: Glibc compilation errors out due to a missing nss.h header file
fr: La compilation de Glibc sort en erreur à cause de l'absence de l'entête de fichier nss.h.

source: This usually indicates that you are compiling LFS onto a Reiser4 partition. Unfortunately, there is currently no known solution, other than to use a different type of filesystem.
fr: Cela indique en général que vous compilez LFS sur une partition Reiser4. Malheureusement, il n'y a aucune solution actuellement connue, autre que d'utiliser un autre type de système de fichier.

source: NCurses: C++ preprocessor &quot;/lib/cpp&quot; fails sanity check
fr: Ncurses&nbsp;: le préprocesseur C++ "/lib/cpp" échoue lors de la vérification de conformité

source: Ncurses in chapter six ends with:
fr: Ncurses au chapitre six se termine par&nbsp;:

source: The problem is that you have no c++ compiler. In chapter five, gcc is first built without the C++ compiler. Before building ncurses, gcc is rebuilt with the C++ compiler. Most probably, you forgot to extract the g++ tarball, or did not specify "c++" in the --enable-languages configure switch, on the 2nd gcc build. There are more details in <a href="http://archives.linuxfromscratch.org/mail-archives/lfs-support/2003-July/018757.html">the mail archive</a>.
fr: Le problème est que vous n'avez pas de compilateur c++. Dans le chapitre cinq, gcc a été construit sans le compilateur C++. Avant de construire ncurses, gcc est reconstruit avec le compilateur C++. Probablement que vous avez oublié d'extraire l'archive de g++ ou n'avez pas spécifié «&nbsp;c++&nbsp;» dans l'option de configure --enable-languages, à la deuxième construction de gcc. Il y a plus de détails dans <a href="http://archives.linuxfromscratch.org/mail-archives/lfs-support/2003-July/018757.html">l'archive de la liste</a>.

source: Configuration and booting issues
fr: Problèmes de configuration et de démarrage

source: There are several reasons why the kernel might be unable to mount the root filesystem.
fr: Il y a plusieurs raisons pour expliquer pourquoi le noyau n'arrive pas à monter le système de fichiers racine.

source: Did you specify the correct partition in <code>/boot/grub/menu.lst</code>?
fr: Avez-vous spécifié la bonne partition dans <code>/boot/grub/menu.lst</code>&nbsp;?

source: Is support for the hard drive enabled in the kernel. For SCSI this means support for the specific SCSI adapter.
fr: Le support pour votre disque dur est-il activé dans le noyau&nbsp;? Pour SCSI cela signifie le support pour l'adaptateur SCSI spécifique.

source: Is support for the hard drive compiled into the kernel, not just as a module. (Modules are stored on the filesystem. If a driver needed to access the filesystem is stored as a module on that filesystem, well ... you know ... ;)
fr: Le support pour le disque dur est-il compilé dans le noyau, pas seulement en tant que module&nbsp;? (Les modules sont stockés sur le système de fichiers. Si un pilote requis pour accéder au système de fichier est stocké en tant que module sur ce même système de fichier, eh bien… vous voyez… ;))
