Repository: espindula/br-lfs
Catalog: blfs/*/x/installing/TTF-and-OTF-fonts.po
Languages: fr

source: TTF and OTF fonts
fr: Les polices TTF et OTF

source: About TTF and OTF fonts
fr: À propos des polices TTF et OTF

source: Originally, Xorg provided only bitmap fonts. Later, some scalable Type1 fonts were added, but the desktop world moved on to using TrueType and Open Type fonts. To support these, Xorg uses Xft, the X FreeType interface library.
fr: Au départ, Xorg fournissait seulement des polices bitmap. Ensuite, certaines polices redimensionnables Type1 ont été ajoutées, mais le monde du bureau a changé et utilise des polices TrueType et Open Type. Pour les supporter, Xorg utilise Xft, la bibliothèque d'interface FreeType X.

source: These fonts can provide hints, which <application>fontconfig</application> uses to adjust them for maximum readability on computer monitors. On linux you should always prefer the hinted versions, if available (in general the latin, cyrillic and greek alphabets can use hints, most other writing systems do not use hinting).
fr: Ces polices peuvent fournir des directives (Hints), que <application>fontconfig</application> utilise pour les ajuster pour une lisibilité maximale sur les écrans. Sur Linux, vous devriez toujours préférer les versions avec directives, si disponibles (en général, les alphabets latins, cyrilliques et grecs peuvent utiliser les directives, la plupart des autres systèmes d'écriture n'utilisent pas les directives).

source: A few fonts are provided as collections (TTC or OTC) where font data is shared between different fonts, thus saving disk space. Treat these in exactly the same way as individual TTF or OTF files.
fr: Certaines polices sont fournies en tant que collection (TTC ou OTC) où les données des polices sont partagées entre les différentes polices, préservant ainsi de l'espace disque. Traitez-les exactement comme les fichiers de polices TTF ou OTF individuels.

source: If a font provides both TTF and OTF forms, prefer the OTF form in linux, it may provide more features for programs which know how to use them (such as xelatex).
fr: Si une police est fournie sous forme TTF et OTF, préférez la version OTF sous Linux, elle peut fournir plus de fonctionnalités pour les programmes qui savent comment les utiliser (comme xelatex).

source: For some scripts <application>pango</application> is required to render things correctly, either by selecting different glyph forms, or by combining glyphs - in both cases, according to the context. This applies particularly to arabic and indic scripts.
fr: Pour certains scripts <application>pango</application> est requis pour un rendu correct, soit en sélectionnant différentes formes de glyphes, soit en combinant des glyphes – dans les deux cas, d'après le contexte. Cela s'applique en particulier aux scripts arabiques et indiens.

source: Standard scalable fonts that come with <application>X</application> provide very poor Unicode coverage. You may notice in applications that use <application>Xft</application> that some characters appear as a box with four binary digits inside. In this case, a font with the required glyphs has not been found. Other times, applications that don't use other font families by default and don't accept substitutions from <application>Fontconfig</application> will display blank lines when the default font doesn't cover the orthography of the user's language.
fr: Les polices redimensionnables standardisées fournies avec <application>X</application> fournissent une très faible couverture de l’Unicode. Vous pourriez remarquer dans les applications qui utilisent <application>Xft</application> que certains caractères apparaissent comme des carrés avec quatre caractères binaires à l'intérieur. Dans ce cas, aucune police avec les glyphes requis n'a été trouvée. D'autres fois, les applications qui n'utilisent pas d'autres familles de polices par défaut et qui n'acceptent pas les substitutions de <application>Fontconfig</application> afficheront des lignes vides quand la police par défaut ne couvre pas le système d'écriture de l'utilisateur.

source: The fonts available to a program are those which were present when it was started, so if you add an extra font and wish to use it in a program which is currently running, then you will have to close and restart that program.
fr: Les polices disponibles pour un programme sont celles qui étaient présentes lorsqu'il a été démarré, donc si vous ajoutez une police supplémentaire et souhaitez l'utiliser dans un programme qui est actuellement lancé, vous devrez le fermer et le redémarrer.

source: Some people are happy to have dozens, or even hundreds, of font files available, but if you ever wish to select a specific font in a desktop application (for example in a word processor) then scrolling through a lot of fonts to find the right one is slow and awkward - fewer is better. So, for some font packages you might decide to install only one of the fonts - but nevertheless install the different variants (italic, bold, etc) as these are all variations for the same font name.
fr: Certaines personnes sont contentes avec des dizaine voire des centaines de fichiers de polices disponibles, mais si vous souhaitez sélectionner une police spécifique dans une application de bureau (par exemple dans un traitement de texte), faire défiler toutes les polices pour trouver la bonne est long et ennuyeux – il vaut mieux en installer moins. Donc pour certains paquets de polices, vous pourriez décider d'installer seulement l'une des polices – mais néanmoins installer les différentes variantes (italique, gras, etc) comme il s'agit de variantes pour le même nom de police.

source: In the past, everybody recommended running <command>fc-cache</command> as the <systemitem class="username">root</systemitem> user after installing or removing fonts, but this is no-longer necessary on linux, <application>fontconfig</application> will do it automatically if needed and if its caches are more than 30 seconds old. But if you add a font and want to immediately use it then you can run that command (as a normal user).
fr: Avant tout le monde recommandait de lancer <command>fc-cache</command> en tant qu'utilisateur <systemitem class="username">root</systemitem> après l'installation et la suppression de polices, mais ce n'est plus nécessaire sur Linux, <application>fontconfig</application> le fera automatiquement au besoin et si ses caches sont vieux de plus de 30 secondes. Mais si vous ajoutez une police et souhaitez l'utiliser immédiatement alors vous devrez lancer cette commande (en tant qu'utilisateur normal).

source: There are several references below to CJK characters. This stands for Chinese, Japanese and Korean, although modern Korean is now almost all written using the phonetic Hangul glyphs (it used to sometimes use Hanja glyphs which are similar to Chinese and Japanese). Unicode decided to go for <ulink url="https://en.wikipedia.org/wiki/Han_unification">Han Unification</ulink> and to map some Chinese and Japanese glyphs to the same codepoints. This was very unpopular in Japan, and the result is that different fonts will render some codepoints in quite different shapes. In addition, Simplified Chinese will sometimes use the same codepoint as Traditional Chinese but will show it differently, somewhat analagous to the different shapes used for the letters 'a' and 'g' in English (single-storey and two-storey), except that in a language context one will look "wrong" rather than just "different".
fr: Plus loin dans cette page se trouvent plusieurs références pour les caractères CJK. Cela signifie en anglais Chinois, Japonais et Coréen, bien que le coréen moderne soit maintenant écrit essentiellement avec les caractères phonétiques Hangul (il était écrit en Hanja qui est un système d'écriture similaire au chinois et au japonais). Unicode a choisi d'utiliser <ulink url="https://en.wikipedia.org/wiki/Han_unification">UniHan</ulink> et de faire correspondre certains caractères chinois et japonais avec le même point de code. Cela a été très critiqué au Japon et différentes polices afficheront certains points de code avec des formes assez différentes. De plus, le chinois simplifié utilisera parfois le même point de code que le chinois traditionnel mais le montrera différemment, un peu comme les différentes formes des lettres 'a' et 'g' en français (avec une ou deux boucles), sauf que dans le contexte l'une des variantes aura l'air «&nbsp;erronée&nbsp;» plutôt que juste «&nbsp;différente&nbsp;».

source: Unlike most other packages in this book, the BLFS editors do not monitor the versions of the fonts on this page - once a font is good enough for general use, the typical additions in a new version are minor (e.g. new currency symbols, or glyphs not for a modern language, such as emojis or playing cards). Therefore, none of these fonts show version or md5 information.
fr: Contrairement à la plupart des autres paquets de ce livre, les éditeurs de BLFS ne surveillent pas les versions des polices de cette page – lorsqu'une police est correcte pour l'utilisation, les ajouts dans les nouvelles versions sont mineures (par exemple de nouveaux symboles de monnaie, ou des glyphes inutiles pour la langue moderne, comme les émojis ou les cartes à jouer). Ainsi, aucune de ces polices ne montre d'information de version ou de md5.

source: The list below will not provide complete Unicode coverage. Unicode is updated every year, and most additions are now for historic writing systems. For almost-complete coverage you can install <xref linkend="noto-fonts"/> (about 180 fonts when last checked) but that number of fonts makes it <emphasis>much</emphasis> less convenient to select a specific font in a document, and most people will regard many of them as a waste of space. We used to recommend the <ulink url="http://unifont.org/fontguide/">Unicode Font Guide</ulink>, but that has not been updated since 2008 and many of its links are dead.
fr: La liste ci-dessous ne fournira pas une couverture complète Unicode. Unicode est mis à jour chaque année, et la plupart des ajouts sont maintenant pour les systèmes d'écriture historique. Pour une couverture presque complète, vous pouvez installer <xref linkend="noto-fonts"/> (environ 180 polices lors de la dernière vérification) mais ce nombre de polices rend <emphasis>beaucoup</emphasis> moins commode la sélection d'une police spécifique dans un document, et la plupart des gens considéreront beaucoup d'entre elles comme un gaspillage d'espace. Nous recommandons le <ulink url="http://unifont.org/fontguide/">Guide des polices Unicode</ulink>, mais qui n'a pas été mis à jour depuis 2008 et dont beaucoup de liens sont morts.

source: Rendered examples of most of these fonts, and many others, with details of what languages they cover, some examples of latin fonts with the same metrics (listed as "Substitute latin fonts") and various files of dummy text to compare fonts of similar types, can be found at this <ulink url="http://zarniwhoop.uk/ttf-otf-notes.html#examples"> font comparison</ulink> page. That site also covers other current writing systems.
fr: Des exemples de rendus de la plupart de ces polices, et beaucoup d'autres, avec les détails des langues couvertes, des exemples de polices latines avec les mêmes métriques (listées comme «&nbsp;remplacement de polices latines&nbsp;») et divers fichiers de texte factices pour comparer des polices de types similaires, peut être trouvé sur cette page&nbsp;: <ulink url="http://zarniwhoop.uk/ttf-otf-notes.html#examples">comparaison de police</ulink>. Ce site couvre également d'autres systèmes d'écriture actuels.

source: Fonts are often supplied in zip files, requiring <xref linkend="unzip"/> to list and extract them, but even if the current release is a tarball you should still check to see if it will create a directory (scatterring the contents of a zipfile or tarball across the current directory can be very messy, and a few fonts create odd __MACOSX/ directories. In addition, many fonts are supplied with permissions which do not let 'other' read them - if a font is to be installed for system-wide use, any directories must be mode 755 and all the files mode 644, so change them if necessary. If you forget, the root user may be able to see a particular font in <command>fc-list</command> but a normal user will not.
fr: Les polices sont souvent fourni dans des fichiers zip, demandant <xref linkend="unzip"/> pour les lister et les extraire, mais même si la version actuelle est une archive vous devriez toujours vérifier pour voir si elle va créer un répertoire (la dispersion du contenu d'un fichier zip ou d'une archive à travers le répertoire actuel peut être très désordonné, et quelques polices créent des répertoires étranges __MACOSX/. De plus, de nombreuses polices sont fournies avec des permissions qui ne permettent pas à «&nbsp;autres&nbsp;» de les lire – si une police doit être installée pour une utilisation à l'échelle du système, tous les répertoires doivent avoir le mode 755 et tous les fichiers le mode 644, donc modifiez-les si nécessaire. Si vous oubliez de le faire, l'utilisateur root peut être capable de voir une police particulière dans <command>fc-list</command>, mais un utilisateur normal ne pourra pas.

source: As a font installation example, consider the installation of the <xref linkend="dejavu-fonts"/>. In this particular package, the TTF files are in a subdirectory. From the unpacked source directory, run the following commands as the <systemitem class="username">root</systemitem> user:
fr: En tant qu'exemple d'installation, considérez l'installation de <xref linkend="dejavu-fonts"/>. Dans ce paquet, les fichiers TTF sont dans un sous-répertoire. Depuis le répertoire des sources déballées, lancez la commande suivante en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: If you wish, you can also install any licenses or other documentation, either alongside the font or in a corresponding directory under <filename class="directory">/usr/share/doc/</filename>.
fr: Si vous le souhaitez, vous pouvez également installer les licences ou les autres documentations, soit à coté de la police ou dans un répertoire correspondant sous <filename class="directory">/usr/share/doc/</filename>.

source: A few fonts ship with source as well as with the completed TTF or OTF file(s). Unless you intend to modify the font, and have the correct tools (sometimes <xref linkend="fontforge"/>, but often commercial tools), the source will provide no benefit, so do not install it. One or two fonts even ship with Web Open Font Format (WOFF) files - useful if you run a webserver and want to use that font on it, but not useful for desktops.
fr: Quelques polices sont fournies avec les sources ainsi qu'avec les fichiers TTF ou OTF. Sauf si vous avez l'intention de modifier la police, et avez les bons outils (parfois <xref linkend="fontforge"/>, mais souvent des outils commerciaux), les sources ne fourniront aucun avantage, ne les installez pas. Une ou deux polices sont même livrées avec des fichiers Web Open Font Format (WOFF) – utiles si vous exécutez un serveur web et que vous souhaitez utiliser cette police, mais pas utile pour les ordinateurs de bureau.

source: To provide greater Unicode coverage, you are recommended to install some of the following fonts, depending on what webistes and languages you wish to read. The next part of this page details some fonts which cover at least latin alphabets, the final part deals with come CJK issues.
fr: Pour fournir une meilleure couverture d'Unicode, il est recommandé d'installer certaines des polices suivantes, selon les langues et les sites web que vous souhaitez lire. La partie suivante de cette page détaille quelques polices qui couvrent au moins les alphabets latins, la dernière partie traite des questions avec les problématiques CJK.

source: You are strongly recommended to install the <xref linkend="dejavu-fonts"/>.
fr: Il est fortement recommandé d'installer <xref linkend="dejavu-fonts"/>.

source: <ulink url="http://gsdview.appspot.com/chromeos-localmirror/distfiles/crosextrafonts-20130214.tar.gz">Caladea</ulink> (created as a Chrome OS extra font, hence the 'crosextrafonts' tarball name) is metrically compatible with MS Cambria and can be used if you have to edit a document which somebody started in Microsoft Office using Cambria and then return it to them.
fr: <ulink url="http://gsdview.appspot.com/chromeos-localmirror/distfiles/crosextrafonts-20130214.tar.gz">Caladea</ulink> (créée comme une police supplémentaire de Chrome OS, d'où le nom de l'archive 'crosextrafonts') a les mêmes métriques que Cambria MS et peut être utilisée si vous avez à éditer un document que quelqu'un a commencé dans Microsoft Office en utilisant Cambria, puis lui retourner.

source: Cantarell fonts
fr: Polices Cantarell

source: <ulink url="&gnome-download-http;/cantarell-fonts/0.0/">Cantarell fonts</ulink> - The Cantarell typeface family provides a contemporary Humanist sans serif. It is particularly optimised for legibility at small sizes and is the preferred font family for the <application>GNOME-3</application> user interface.
fr: <ulink url="&gnome-download-http;/cantarell-fonts/0.0/">Cantarell fonts</ulink> – La famille typeface Cantarell fourni une police Humanist contemporaine sans serif. Elle est particulièrement optimisée pour la lisibilité dans les petites tailles et est la famille de polices préférée pour l'interface utilisateur <application>GNOME-3</application>.

source: <ulink url="http://gsdview.appspot.com/chromeos-localmirror/distfiles/crosextrafonts-carlito-20130920.tar.gz">Carlito</ulink> (created as another Chrome OS extra font, again the 'crosextrafonts-' prefix in the tarball name) is metrically compatible with MS Calibri and can be used if you have to edit a document which somebody started in Microsoft Office using Calibri and then return it to them.
fr: <ulink url="http://gsdview.appspot.com/chromeos-localmirror/distfiles/crosextrafonts-carlito-20130920.tar.gz">Carlito</ulink> (créée comme une autre police supplémentaire de Chrome OS, d'où le préfixe 'crosextrafonts-' dans le nom de l'archive) a la même métrique que MS Calibri et peut être utilisée si vous avez à éditer un document que quelqu'un a commencé dans Microsoft Office en utilisant Calibri, puis lui retourner.

source: DejaVu fonts
fr: Polices DejaVu

source: <ulink url="https://sourceforge.net/projects/dejavu/files/dejavu/">DejaVu fonts</ulink> - These fonts are an extension of, and replacement for, the Bitstream Vera fonts and provide Latin-based scripts with accents and punctuation such as "smart-quotes" and variant spacing characters, as well as Cyrillic, Greek, Arabic, Hebrew, Armenian, Georgian and some other glyphs. In the absence of the Bitstream Vera fonts (which had much less coverage), these are the default fallback fonts.
fr: <ulink url="https://sourceforge.net/projects/dejavu/files/dejavu/">DejaVu fonts</ulink> – Ces polices sont une extension de, et un remplacement pour, les polices Bitstream Vera et fournissent les scripts basés sur le latin avec les accents et la ponctuation comme les «&nbsp;guillemets intelligents&nbsp;» et des caractères d'espacement variables, aussi bien que cyrillique, grec, arabe, hébreu, arménien, géorgien et quelques autres glyphes. En l'absence des polices Bitstream Vera (qui avaient beaucoup moins de couverture), ce sont les polices de repli par défaut.

source: GNU FreeFont
fr: FreeFont GNU

source: <ulink url="http://download.savannah.nongnu.org/releases/freefont/">GNU FreeFont</ulink> - This set of fonts covers many non-CJK characters, in particular some of the variants of latin and cyrillic letters used in minority languages, but the glyphs are comparatively small (unlike DejaVu fonts which are comparatively large) and rather light weight ("less black" when black on white is used) which means that in some contexts such as terminals they are not visually pleasing, for example when most other glyphs are provided by another font. On the other hand, some fonts used primarily for printed output, and many CJK fonts, are also light weight.
fr: <ulink url="http://download.savannah.nongnu.org/releases/freefont/">GNU FreeFont</ulink> – Cet ensemble de polices couvre de nombreux caractères non-CJK, en particulier certaines des variantes des lettres latines et cyrilliques utilisées dans les langues minoritaires, mais les glyphes sont comparativement petits (contrairement aux polices DejaVu qui sont comparativement grandes) et assez légers («&nbsp;moins noirs&nbsp;» quand on écrit en noir sur blanc) ce qui signifie que dans certains contextes tels que les terminaux ce n'est pas visuellement agréable, par exemple lorsque la plupart des autres glyphes sont fournis par une autre police. D'autre part, certaines polices utilisées principalement pour la production imprimée, et de nombreuses polices CJK, sont aussi légères.

source: <ulink url="https://fontlibrary.org/ru/font/gelasio">Gelasio</ulink> is metrically compatible with MS Georgia and <application>fontconfig</application> will use it if ever Georgia is requested but not installed.
fr: <ulink url="https://fontlibrary.org/ru/font/gelasio">Gelasio</ulink> a les mêmes métriques que MS Georgia et <application>fontconfig</application> l'utilisera si jamais Georgia est requise mais pas installée.

source: Liberation fonts
fr: Polices Liberation

source: The <ulink url="http://sources.openelec.tv/mirror/liberation-fonts-ttf/"> Liberation fonts</ulink> provide libre substitutes for Arial, Courier New, and Times New Roman. <application>Fontconfig</application> will use them as substitutes for those fonts, and also for the similar Helvetica, Courier, Times Roman although for these latter it can prefer a different font (see the examples in the 'Substitutes' PDFs at <ulink url="http://zarniwhoop.uk/files/PDF-substitutes/"> zarniwhoop.uk).</ulink>
fr: <ulink url="http://sources.openelec.tv/mirror/liberation-fonts-ttf/"> Liberation fonts</ulink> fournit un remplacement libre pour Arial, Courier New, et Times New Roman. <application>Fontconfig</application> l'utilisera comme remplaçant pour ces polices, et aussi pour les polices similaires Helvetica, Courier, Times Roman bien que pour ces dernières il peut préférer une police différente (voir les exemples dans les PDF de 'remplacement' à <ulink url="http://zarniwhoop.uk/files/PDF-substitutes/"> zarniwhoop.uk</ulink>).

source: Many people will find the Liberation fonts useful for pages where one of those fonts is requested.
fr: Beaucoup de personnes trouveront que les polices Liberation sont utiles pour les pages où une de ces polices est requise.

source: Microsoft Core Fonts
fr: Polices Microsoft Core
