Repository: espindula/br-lfs
Catalog: blfs/*/x/installing/TTF-and-OTF-fonts.po
Languages: fr

source: The <ulink url="http://corefonts.sourceforge.net/">Microsoft Core fonts</ulink> date from 2002. They were supplied with old versions of Microsoft Windows and were apparently made available for general use. You can extract them from the 'exe' files using <application>bsd-tar</application> from <xref linkend="libarchive"/>. Be sure to read the license before using them. At one time some of these fonts (particularly Arial, Times New Roman, and to a lesser extent Courier New) were widely specified on web pages. The full set contains Andale Mono, Arial, Arial Black, Comic Sans MS, Courier New, Georgia, Impact, Times New Roman, Trebuchet MS, Verdana and Webdings.
fr: <ulink url="http://corefonts.sourceforge.net/">Microsoft Core fonts</ulink> date de 2002. Elles ont été fournies avec les anciennes versions de Microsoft Windows et ont apparemment été mises à disposition pour un usage général. Vous pouvez les extraire des fichiers exe en utilisant <application>bsd-tar</application> de <xref linkend="libarchive" />. Lisez la licence avant de les utiliser. À un certain moment, certaines de ces polices (notamment Arial, Times New Roman et, dans une moindre mesure, Courier New) ont été largement spécifiées dans les pages Web. L'ensemble contient Andale Mono, Arial, Arial Black, Comic Sans MS, Courier New, Géorgie, Impact, Times New Roman, Trebuchet MS, Verdana et Webdings.

source: Please note that if you only want to use a font with the same metrics (character size, etc) as Arial, Courier New, or Times New Roman you can use the libre Liberation Fonts (above), and similarly you can replace Georgia with Gelasio.
fr: Merci de noter que si vous voulez seulement utiliser une police avec les mêmes métriques (taille des caractères, etc) comme Arial, Courier New, ou Times New Roman, vous pouvez utiliser les polices libres Liberation (ci-dessus), et de même vous pouvez remplacer Georgia par Gelasio.

source: Although many old posts recommend installing these fonts for better-looking output, there are more recent posts that these are ugly or 'broken'. One suggestion is that they do not support anti-aliasing.
fr: Bien que de nombreux anciens posts recommandent l'installation de ces polices pour un meilleur affichage, il y a des posts plus récents disant qu'elles sont laides ou «&nbsp;cassées&nbsp;». Une suggestion est qu'elles ne prennent pas en charge l'anticrénelage.

source: The newer fonts which Microsoft made their defaults in later releases of MS Windows or MS Office (Calibri and Cambria) have never been freely available. But if you do not have them installed you can find metric equivalents (Carlito, Caladea) above.
fr: Les polices plus récentes que Microsoft a prises par défaut dans les dernières versions de MS Windows ou MS Office (Calibri et Cambria) n'ont jamais été libre. Mais si vous ne les avez pas installées, vous pouvez trouver des équivalents métriques (Carlito, Caladea) ci-dessus.

source: Noto fonts
fr: polices Noto

source: The <ulink url="https://www.google.com/get/noto/">Noto fonts</ulink> ('No Tofu', i.e. avoiding boxes with dots [hex digits] when a glyph cannot be found) is a set of fonts which aim to cover <emphasis>every glyph in unicode, no matter how obscure</emphasis>. These fonts, or at least the Sans Serif fonts, are used by KF5 (initially only for gtk applications). If you want to cover historic languages, you can download all the fonts by clicking on the link at the top of that page.
fr: <ulink url="https://www.google.com/get/noto/">polices Noto</ulink> ('No Tofu", c'est à dire sans boites avec des points [chiffres hexadécimaux] quand un glyphe n'est pas trouvé) est un ensemble de polices qui visent à couvrir <emphasis> chaque glyphe en Unicode, peu importe comment</emphasis>. Ces polices, ou du moins les polices Sans Serif, sont utilisées par KF5 (initialement uniquement pour les applications gtk). Si vous voulez couvrir des langues historiques, vous pouvez télécharger toutes les polices en cliquant sur le lien en haut de cette page.

source: People using languages written in Latin, Greek or Cyrillic alphabets need only install Noto Sans itself, and perhaps Noto Sans Symbols for currency symbols. For more details on the CJK fonts see <xref linkend="NotoSansCJK"/> below. There are also separate fonts for every other current writing system, but these too will also require Noto Sans (or Noto Serif) and perhaps Noto Symbols.
fr: Les personnes utilisant des langues écrites en alphabet latin, grec ou cyrillique doivent seulement installer Noto Sans lui-même, et peut-être Noto Sans Symboles pour les symboles monétaires. Pour plus de détails sur les polices CJK, voir <xref linkend="NotoSansCJK"/> ci-dessous. Il existe également des polices distinctes pour tous les autres systèmes d'écriture actuels, mais ceux-ci nécessiteront également Noto Sans (ou Noto Serif) et peut-être Noto Symboles.

source: However, you should be aware that <application>fontconfig</application> knows nothing about Noto fonts. The 'Noto Sans Something' fonts are each treated as separate fonts (and for Arabic there is not a specifically Sans name), so if you have other fonts installed then the choice of which font to use for missing glyphs where 'Noto Sans' is specified will be random, except that Sans fonts will be preferred over <emphasis>known</emphasis> Serif and Monospace fonts because Sans is the fallback for unknown fonts.
fr: Cependant, vous devez être attentif au fait que <application>fontconfig</application> ne connaît pas les polices Noto. Les polices «&nbsp;Noto Sans quelque chose&nbsp;» sont traitées comme des polices distinctes (et pour l'arabe il n'y a pas de nom Sans spécifique), donc si vous avez d'autres polices installées, le choix de la police à utiliser pour les glyphes manquants où «&nbsp;Noto Sans&nbsp;» est spécifié sera aléatoire, sauf que les polices Sans seront préférées aux polices Serif et Monospace <emphasis>connues</emphasis> parce que Sans est le repli pour les polices inconnues.

source: Oxygen fonts
fr: Polices Oxygen

source: When KDE Frameworks 5 was first released, it used the <ulink url="http://download.kde.org/stable/plasma/5.4.3/oxygen-fonts-5.4.3.tar.xz">Oxygen fonts</ulink> which were designed for integrated use with the KDE desktop. Those fonts are no-longer actively maintained, so KDE made a decision to switch to <xref linkend="noto-fonts"/>, but for the moment they are still <emphasis>required</emphasis> by 'startkde'.
fr: Quand KDE Frameworks 5 a été publié pour la première fois, il utilisait <ulink url="http://download.kde.org/stable/plasma/5.4.3/oxygen-fonts-5.4.3.tar.xz">les polices Oxygen</ulink> qui étaient conçues pour être intégrées avec le bureau KDE. Ces polices ne sont plus maintenues, alors KDE a pris la décision de passer sur <xref linkend="noto-fonts"/>, mais pour le moment elles sont restées <emphasis>requises</emphasis> par 'startkde'.

source: Originally these fonts were only supplied as source, needing <xref linkend="cmake"/> and <xref linkend="fontforge"/> to create the TTF files. But for a while the source has also included the prepared TTF. The only unusual feature is that each TTF file is in its own subdirectory (<filename class="directory">oxygen-fonts/{*-?00}/</filename>) with the source in further subdirectories. You could just install the whole tarball if you prefer, although that will waste space.
fr: À l'origine, ces polices étaient uniquement fournies en tant que source, nécessitant <xref linkend="cmake"/> et <xref linkend="fontforge" /> pour créer les fichiers TTF. Mais, pendant un certain temps, la source a également inclus le fichier TTF préparé. La seule caractéristique inhabituelle est que chaque fichier TTF est dans son propre sous-répertoire (<filename class="directory">oxygen-fonts/{*-?00}/</filename>) avec la source dans d'autres sous-répertoires. Vous pourriez simplement installer l'ensemble de l'archive si vous préférez, même si cela va gaspiller de l'espace.

source: CJK fonts:
fr: Polices CJK&nbsp;:

source: As indicated earlier, usage of a combination of Chinese, Japanese and Korean can be tricky - each font only covers a subset of the available codepoints, the preferred shapes of the glyphs can differ between the languages, and many of the CJK fonts do not actually support modern Korean.
fr: Comme indiqué précédemment, l'utilisation d'une combinaison de chinois, de japonais et de coréen peut être délicate – chaque police ne couvre qu'un sous-ensemble des points de codes disponibles, les formes préférées des glyphes peuvent différer entre les langues, et beaucoup de polices CJK ne supportent pas réellement le coréen moderne.

source: Also, by default <application>fontconfig</application> prefers Chinese to Japanese. Tuning that is covered at <xref linkend="prefer-chosen-CJK-fonts"/>.
fr: Aussi, par défaut <application>fontconfig</application> préfère le chinois au japonais. Le paramétrage de cela est couvert dans <xref linkend="prefer-chosen-CJK-fonts"/>.

source: Although Unicode has been extended to allow a very large number of CJK codepoints, those outside the Base Plane (greater than U+0xFFFF) are not commonly used in Mandarin (the normal form of written Chinese, whether Simplified (PRC) or Traditional (Taiwan)), or Japanese.
fr: Bien que Unicode ait été étendu pour permettre un très grand nombre de codes CJK, ceux en dehors du plan de base (plus grand que U+0xFFFF) ne sont pas couramment utilisés en mandarin (la forme normale du chinois écrit, qu'il soit simplifié (PRC) ou traditionnel (Taiwan)), et en japonais.

source: For Hong Kong, which uses Traditional Chinese and where Cantonese is the dominant language, the Hong Kong Supplementary Character Set was added to Unicode in 2005 and revised in 2009 (it is part of CJK Extension B and contains more than 1900 characters). Earlier fonts will not be able to support either Cantonese or use of these characters where local names are written in Mandarin. The UMing HK, Noto Sans CJK HK and WenQuanYi Zen Hei fonts all seem to cover Hong Kong usage (<application>fontconfig</application> disagrees about Noto Sans CJK HK).
fr: Pour Hong Kong, qui utilise le chinois traditionnel et où le cantonais est la langue dominante, le jeu de caractères supplémentaire de Hong Kong a été ajouté à Unicode en 2005 et révisé en 2009 (il fait partie de l'Extension B de CJK et contient plus de 1900 caractères). Les polices précédentes ne seront pas en mesure de prendre en charge le cantonais ou l'utilisation de ces caractères quand les noms locaux sont écrits en mandarin. Les polices UMing HK, Noto Sans CJK HK et WenQuanYi Zen Hei semblent couvrir l'utilisation de Hong Kong (<application>fontconfig</application> n'approuve pas Noto Sans CJK HK)

source: The Han glyphs are double-width, other glyphs in the same font may be narrower. For their CJK content, all of these fonts can be regarded as monospaced (i.e. fixed width).
fr: Les glyphes Han sont à double largeur, d'autres glyphes dans la même police peuvent être plus étroits. Pour leur contenu CJK, toutes ces polices peuvent être considérées comme étant à chasse fixe (c'est-à-dire à largeur fixe).

source: If all you wish to do is to be able to render CJK glyphs, installing <xref linkend="wenquanyi-zenhei"/> may be a good place to start if you do not already have a preference.
fr: Si tout ce que vous voulez faire est de pouvoir afficher des glyphes CJK, l'installation de <xref linkend="wenquanyi-zenhei"/> peut être un bon commencement si vous n'avez pas déjà une préférence.

source: Chinese fonts:
fr: Polices chinoises&nbsp;:

source: In Chinese, there are three font styles in common use: Sung (also known as Song or Ming) which is the most-common ornamented ("serif") form, Kai ("brush strokes") which is an earlier ornamented style that looks quite different, and modern Hei ("sans"). Unless you appreciate the differences, you probably do not want to install Kai fonts.
fr: En chinois, il y a trois styles de police d'usage courant&nbsp;: Sung (également connu sous le nom de Song ou Ming) qui est la forme décorée ("Serif") la plus ordinaire, Kai ("coups de pinceau") qui est un style décoré plus ancien qui semble tout à fait différent, et la moderne Hei ("sans"). Sauf si vous appréciez les différences, vous ne voulez probablement pas installer des polices Kai.

source: <ulink url="https://www.google.com/get/noto/help/cjk/">Noto Sans CJK</ulink> - Sans-Serif sets of all CJK fonts in a ttc - as the link says, you can choose to install the TTC and cover all the languages in all weights in a 110MB file, or you can download subsets. There are also Monospace versions.
fr: <ulink url="https://www.google.com/get/noto/help/cjk/">Noto Sans CJK</ulink> – Ensembles Sans-Serif de toutes les polices CJK dans un TTC - comme le dit le lien, vous pouvez choisir d'installer le TTC et de couvrir toutes les langues dans toutes les épaisseurs dans un fichier de 110 Mo, ou vous pouvez télécharger des sous-ensembles. Il existe aussi des versions Monospace.

source: Opendesktop fonts
fr: Polices Opendesktop

source: A copy of version 1.4.2 of the <ulink url="https://sources.archlinux.org/other/opendesktop-fonts/">opendesktop-fonts</ulink> is preserved at Arch. This was a later development of fireflysung which BLFS used to recommend, adding Kai and Mono fonts. The name of the Sung font remains 'AR PL New Sung' so they cannot both be installed together.
fr: Une copie de la version 1.4.2 des polices <ulink url="https://sources.archlinux.org/other/opendesktop-fonts/">opendesktop-fonts</ulink> est conservée chez Arch. C'était un développement ultérieur de fireflysung que BLFS recommandait, ajoutant les polices Kai et Mono. Le nom de la police Sung reste 'AR PL New Sung' afin qu'elles ne puissent pas être toutes les deux installées.

source: At one time there was a 1.6 release, and more recently some versions at github, which also included a Sans font (Odohei), but those have dropped off the web and it is unclear if there was a problem. <application>Fontconfig</application> does not know anything about the later fonts (AR PL New Kai, AR PL New Sung Mono) and will default to treating them as Sans.
fr: À une certaine époque il y avait une version 1.6, et plus récemment quelques versions sur github, qui comprenaient également une police Sans (Odohei), mais elles ont été enlevées du web et il n'est pas clair s'il y avait un problème. <application>Fontconfig</application> ne sait rien sur les dernières polices (AR PL New Kai, AR PL Nouveau Sung Mono) et par défaut les traitera comme Sans.

source: <ulink url="http://packages.debian.org/sid/fonts-arphic-uming">UMing fonts</ulink> - sets of Chinese Ming fonts (from Debian, use the '.orig' tarball) in a ttc which contain variations of Simplified and Traditional Chinese (Taiwanese, with second variant for different <ulink url="https://en.wikipedia.org/wiki/Bopomofo">bopomofo</ulink>, and Cantonese for Hong Kong). This ships with old-syntax files which you can install to <filename class="directory">/etc/fonts/conf.d/</filename> but see <xref linkend="editing-old-style-conf-files"/>.
fr: <ulink url="http://packages.debian.org/sid/fonts-arphic-uming">Polices UMing</ulink> – ensemble de polices Ming chinoises (à partir de Debian, utilisez l'archive 'orig') dans un TTC qui contiennent des variantes du chinois simplifié et traditionnel (taïwanais, avec la seconde variante pour différents <ulink url="https://en.wikipedia.org/wiki/Bopomofo">bopomofo</ulink>, et le cantonais pour Hong Kong). Ils sont livrés avec des fichiers avec l'ancienne syntaxe que vous pouvez installer dans <filename class="directory">/etc/fonts/conf.d/</filename> mais voir <xref linkend="editing-old-style-conf-files"/>.

source: <ulink url="https://sourceforge.net/projects/wqy/files/wqy-zenhei/">WenQuanYi Zen Hei</ulink> provides a Sans-Serif font which covers all CJK scripts including Korean. Although it includes old-style conf files, these are not required: <application>fontconfig</application> will already treat these fonts (the 'sharp' contains bitmaps, the monospace appears not to be Mono in its ASCII part) as Sans, Serif, and Monospace. If all you wish to do is to be able to render Han and Korean text without worrying about the niceties of the shapes used, the main font from this package is a good font to use.
fr: <ulink url="https://sourceforge.net/projects/wqy/files/wqy-zenhei/">WenQuanYi Zen Hei </ulink> fournit une police Sans-Serif qui couvre tous les scripts CJK y compris le coréen. Bien qu'il contienne des fichiers de configuration d'anciennes versions, ceux-ci ne sont pas requis&nbsp;: <application>fontconfig</application> traitera déjà ces polices (le 'sharp' contient des bitmaps, le monospace ne semble pas Mono dans sa partie ASCII) en tant que Sans, Serif et Monospace. Si tout ce que vous voulez faire est d'afficher du texte Han et coréen sans se soucier des finesses des formes utilisées, la police principale de ce paquet est une bonne police à utiliser.

source: Japanese fonts:
fr: Polices Japonaises&nbsp;:

source: In Japanese, Gothic fonts are Sans, Mincho are Serif. BLFS used to only mention the Kochi fonts, but those appear to now be the least-preferred of the Japanese fonts.
fr: En japonais, les polices gothiques sont Sans, les polices Mincho sont Serif. Dans les versions précédentes, BLFS ne mentionnait que les polices Kochi, mais celles-ci semblent maintenant être les moins préférées des polices japonaises.

source: Apart from the fonts detailed below, also consider <xref linkend="NotoSansCJK"/>.
fr: En plus des polices détaillées ci-dessous, considérez aussi <xref linkend="NotoSansCJK"/>.

source: IPAex fonts
fr: Polices IPAex

source: The <ulink url="http://ipafont.ipa.go.jp/">IPAex fonts</ulink> are the current version of the IPA fonts. Click on 'English' at the link and then click on the Download icon to find IPAex Font Ver.003.01. Unfortunately, <application>fontconfig</application> only knows about the older IPAfonts and the forked IPA Mona font (which is not easily available and which apparently does not meet Debian's Free Software guidelines). Therefore if you install the IPAex fonts you may wish to make it known to fontconfig, see <xref linkend="prefer-chosen-CJK-fonts"/> for one possible way to do this.
fr: Les <ulink url="http://ipafont.ipa.go.jp/">polices IPAex</ulink> sont la version actuelle des polices IPA. Cliquez sur 'Anglais' dans lien puis cliquez sur l'icône Download pour trouver la police IPAex Ver.003.01. Malheureusement, <application>fontconfig</application> ne connaît seulement que les anciennes polices IPA et la police IPA Mona dérivée (qui n'est pas facilement disponible et qui apparemment ne répond pas aux directives de Debian). Par conséquent, si vous installez les polices IPAex, vous pouvez le faire prendre en compte par fontconfig, voir <xref linkend="prefer-chosen-CJK-fonts"/> pour une façon possible de le faire.

source: Kochi fonts
fr: Polices Kochi

source: The <ulink url="https://osdn.net/projects/efont/releases/p1357">Kochi Substitute fonts</ulink> were the first truly libre Japanese fonts (the earlier Kochi fonts were allegedly plagiarized from a commercial font).
fr: Les <ulink url="https://osdn.net/projects/efont/releases/p1357">polices Kochi Substitute</ulink> étaient les premières polices japonaises véritablement libres (les polices Kochi précédentes auraient été plagiées d'une police commerciale) .

source: The <ulink url="https://osdn.net/projects/vlgothic/releases/">VL Gothic</ulink> font is a modern Japanese font in two variants with monotonic or proportional spacing for the non-Japanese characters.
fr: La police <ulink url="https://osdn.net/projects/vlgothic/releases/">VL Gothic</ulink> est une police japonaise avec deux variantes, un espacement monotonique ou proportionnel pour les caractères non japonais.

source: Korean fonts:
fr: Polices Coréennes&nbsp;:

source: In Korean, Batang or Myeongjo (the older name) are Serif, Dotum or Gothic are the main Sans fonts. BLFS previously recommended the Baekmuk fonts, but the Nanum and Un fonts are now preferred to Baekmuk by <application>fontconfig</application> because of user requests.
fr: En Coréen, Batang ou Myeongjo (le nom plus ancien) sont Serif. Dotum ou gothique sont les principales polices Sans. BLFS a précédemment recommandé les poulces Baekmuk, mais les polices Nanum et les polices Un sont désormais préférées à Baekmuk par <application>fontconfig</application> à cause des demandes utilisateurs.

source: A convenient place to see examples of these and many other Korean fonts is <ulink url="http://www.freekoreanfont.com/">Free Korean Fonts</ulink>. Click on 'Gothic Fonts' or 'All Categories -> Myeongjo Fonts', then click on the font example to see more details including the License, and click on the link to download it. For Nanum, you will need to be able to read Korean to find the download link on the page you get to. For Un there are direct links and you can find the un-fonts-core tarball in the <filename class="directory">releases/</filename> directory.
fr: Un endroit commode pour voir des exemples de celles-ci et de beaucoup d'autres polices coréennes est <ulink url="http://www.freekoreanfont.com/">Polices coréennes libres</ulink>. Cliquez sur 'Gothic Fonts' ou 'All Categories -> Myeongjo Fonts', puis cliquez sur l'exemple de la police pour voir plus de détails, y compris la licence, et cliquez sur le lien pour la télécharger. Pour Nanum, vous devrez pouvoir lire le coréen pour trouver le lien de téléchargement sur la page où vous arrivez. Pour Un, il existe des liens directs et vous pouvez trouver l'archive un-fonts-core dans le répertoire <filename class="directory">releases/</filename>.

source: Alternatively, consider <xref linkend="NotoSansCJK"/> (a11 of the variants cover Hangul) or <xref linkend="wenquanyi-zenhei"/>.
fr: Sinon, considérez <xref linkend="NotoSansCJK" /> (toutes les variantes couvrent Hangul) ou <xref linkend="wenquanyi-zenhei"/>.
