Repository: espindula/br-lfs
Catalog: blfs/*/x/installing/xbitmaps.po
Languages: fr

source: 126 KB
fr: 126 Ko

source: 1.6 MB
fr: 1.6 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to xbitmaps
fr: Introduction à xbitmaps

source: The <application>xbitmaps</application> package contains bitmap images used by multiple applications built in Xorg chapter.
fr: Le paquet <application>xbitmaps</application> contient des images bitmap utilisés par de nombreuses applications.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&xbitmaps-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&xbitmaps-download-http;"/>

source: Download (FTP): <ulink url="&xbitmaps-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&xbitmaps-download-ftp;"/>

source: Download MD5 sum: &xbitmaps-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &xbitmaps-md5sum;

source: Download size: &xbitmaps-size;
fr: Taille du téléchargement&nbsp;: &xbitmaps-size;

source: Estimated disk space required: &xbitmaps-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &xbitmaps-buildsize;

source: Estimated build time: &xbitmaps-time;
fr: Estimation du temps de construction&nbsp;: &xbitmaps-time;

source: xbitmaps Dependencies
fr: Dépendances de xbitmaps

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/xbitmaps"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/xbitmaps"/>

source: Installation of xbitmaps
fr: Installation de xbitmaps

source: Install <application>xbitmaps</application> by running the following commands:
fr: Installez <application>xbitmaps</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: None
fr: Aucun
