Repository: espindula/br-lfs
Catalog: blfs/*/x/installing/xcb-util-image.po
Languages: fr

source: 284 KB
fr: 284&nbsp;Ko

source: 2.9 MB
fr: 2,9&nbsp;Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to xcb-util-image
fr: Introduction à xcb-util-image

source: The <application>xcb-util-image</application> package provides additional extensions to the <application>XCB</application> library.
fr: Le paquet <application>xcb-util-image</application> fournit des extensions supplémentaires à la bibliothèque <application>XCB</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&xcb-util-image-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&xcb-util-image-download-http;"/>

source: Download (FTP): <ulink url="&xcb-util-image-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&xcb-util-image-download-ftp;"/>

source: Download MD5 sum: &xcb-util-image-md5sum;
fr: Somme de contrôle MD5&nbsp;: &xcb-util-image-md5sum;

source: Download size: &xcb-util-image-size;
fr: Taille du téléchargement&nbsp;: &xcb-util-image-size;

source: Estimated disk space required: &xcb-util-image-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &xcb-util-image-buildsize;

source: Estimated build time: &xcb-util-image-time;
fr: Estimation du temps de construction&nbsp;: &xcb-util-image-time;

source: xcb-util-image Dependencies
fr: Dépendances de xcb-util-image

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: <xref linkend="doxygen"/> (for documentation)
fr: <xref linkend="doxygen"/> (pour la documentation)

source: User Notes: <ulink url="&blfs-wiki;/xcb-util-image"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/xcb-util-image"/>

source: Installation of xcb-util-image
fr: Installation de xcb-util-image

source: Install <application>xcb-util-image</application> by running the following commands:
fr: Installez <application>xcb-util-image</application> en exécutant les commandes suivantes&nbsp;:

source: To test the results, issue: <command>LD_LIBRARY_PATH=$XORG_PREFIX/lib make check</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>LD_LIBRARY_PATH=$XORG_PREFIX/lib make check</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: Is a port of Xlib's XImage and XShmImage functions
fr: Est un portage des fonctions XImage et XShmImage de Xlib
