Repository: espindula/br-lfs
Catalog: clfs/*/bootable/x86/kernel.po
Languages: fr

source: The Linux package contains the Linux kernel.
fr: Le paquet Linux contient le noyau Linux.

source: Installation of the kernel
fr: Installation de the kernel

source: Building the kernel involves a few steps&mdash;configuration, compilation, and installation. Read the <filename>README</filename> file in the kernel source tree for alternative methods to the way this book configures the kernel.
fr: La construction du noyau contient plusieurs étapes &mdash; configuration, compilation et installation. Lisez le fichier <filename>README</filename> dans l'arborescence des sources du noyau pour trouver des méthodes alternatives à la manière dont ce livre configure le noyau.

source: Apply the latest Linux sublevel patch:
fr: Appliquez le dernier correctif du noyau Linux&nbsp;:

source: Prepare for compilation by running the following command:
fr: Préparez la compilation en lançant la commande suivante&nbsp;:

source: This ensures that the kernel tree is absolutely clean. The kernel team recommends that this command be issued prior to each kernel compilation. Do not rely on the source tree being clean after un-tarring.
fr: Cela s'assure que l'arborescence du noyau est absolument propre. L'équipe du noyau recommande de lancer cette commande avant chaque compilation du noyau. Ne comptez pas sur les sources pour être propres après les avoir décompressés.

source: A good starting place for setting up the kernel configuration is to run <command>make defconfig</command>. This will set the base configuration to a good state that takes your current system architecture into account.
fr: Un bon point de départ pour configurer le noyau est de lancer <command>make defconfig</command>. Cela initialisera une configuration de base à un état sain qui prend l'architecture de votre système en compte.

source: Be sure to configure the following options as shown, or the system might not work correctly or boot at all. Refer to <filename>/usr/share/doc/systemd-&systemd-version;/README</filename>:
fr: Assurez-vous de configurer les options suivantes telles que montrées, ou le système pourrait ne pas fonctionner ou démarrer du tout. Reportez-vous à <filename>/usr/share/doc/systemd-&systemd-version;/README</filename>&nbsp;:

source: While "The IPv6 Protocol" is not strictly required, it is highly recommended by the Systemd developers. "EFI Variable support" and "EFI GUID Partition support" are for UEFI systems. "Collect scheduler debugging info" and "Collect scheduler statistics" is for systemd-bootchart.
fr: Tandis que «&nbsp;le Protocol IPv6&nbsp;» n'est pas strictement nécessaire, il est hautement recommandé par les développeurs de Systemd. «&nbsp;EFI Variables support&nbsp;» et «&nbsp;EFI GUID Partition support&nsbp;» sont faits pour les système UEFI. «&nbsp;Collect scheduler debugging info&nbsp;» et «&nbsp;Collect scheduler statistics&nbsp;» sont faits pour systemd-bootchart.

source: Configure the kernel via a menu-driven interface. CBLFS has some information regarding particular kernel configuration requirements of packages outside of CLFS at <ulink url="&cblfs-root;"/>:
fr: Configurez le noyau via une interface à menu. CBLFS a des informations concernant les prérequis de configuration du noyau pour les paquets hors de CLFS sur <ulink url="&cblfs-root;"/>&nbsp;:

source: Alternatively, <command>make oldconfig</command> may be more appropriate in some situations. See the <filename>README</filename> file for more information.
fr: Autrement, <command>make oldconfig</command> peut être plus approprié dans certaines situations. Regardez le fichier <filename>README</filename> pour plus de détails.

source: If desired, skip kernel configuration by copying the kernel config file, <filename>.config</filename>, from the host system (assuming it is available) to the root directory of the unpacked kernel sources. However, we do not recommend this option. It is often better to explore all the configuration menus and create the kernel configuration from scratch.
fr: Si vous le souhaitez, sautez la configuration du noyau en copiant le fichier de configuration du noyau, <filename>.config</filename>, depuis le système hôte (en supposant qu'il est disponible) dans le répertoire racine des sources déballées du noyau. Cependant, nous ne recommandons pas cette option. Il est souvent préférable d'explorer tous les menus et de créer la configuration de noyau de zéro.

source: Compile the kernel image and modules:
fr: Compilez l'image noyau et ses modules&nbsp;:

source: If using kernel modules, a configuration file in <filename class="directory">/etc/modprobe.d</filename> file may be needed. Information pertaining to modules and kernel configuration is located in the kernel documentation in the <filename class="directory">Documentation</filename> directory of the kernel sources tree. Also, <filename>modprobe.d(5)</filename> may be of interest.
fr: Si vous utilisez des modules du noyau, un fichier de configuration dans <filename class="directory">/etc/modprobe.d</filename> peut être requis. Des informations à propos des modules et de la configuration du noyau se trouve dans la documentation du noyau, dans le répertoire <filename class="directory">Documentation</filename> des sources. <filename>modprobe.d(5)</filename> peut aussi être intéressant.

source: Install the modules, if the kernel configuration uses them:
fr: Installez les modules, si la configuration du noyau en utilise&nbsp;:

source: Install the firmware, if the kernel configuration uses them:
fr: Installez les microprogrammes, si la configuration du noyau en utilise&nbsp;:

source: After kernel compilation is complete, additional steps are required to complete the installation. Some files need to be copied to the <filename class="directory">/boot</filename> directory.
fr: Après la compilation du noyau, des étapes supplémentaires sont requises pour compléter l'installation. Certains fichiers ont besoin d'être copiés dans le répertoire <filename class="directory">/boot</filename>.

source: Issue the following command to install the kernel:
fr: Lancez la commande suivante pour installer le noyau&nsbp;:

source: <filename>System.map</filename> is a symbol file for the kernel. It maps the function entry points of every function in the kernel API, as well as the addresses of the kernel data structures for the running kernel. Issue the following command to install the map file:
fr: <filename>System.map</filename> est un fichier de symboles pour le noyau. Il contient tous les points d'entrées de chaque fonction dans l'API du noyau, ainsi que les adresses des structures de données du noyau pour le noyau courant. Lancez la commande suivante pour installer le fichier&nbsp;:

source: The kernel configuration file <filename>.config</filename> produced by the <command>make menuconfig</command> step above contains all the configuration selections for the kernel that was just compiled. It is a good idea to keep this file for future reference:
fr: Le fichier de configuration du noyau <filename>.config</filename> produit par l'étape <command>make menuconfig</command> précédente contient toute la configuration du noyau qui vient d'être compilé. C'est une bonne idée de garder ce fichier pour plus tard&bnsp;

source: It is important to note that the files in the kernel source directory are not owned by <systemitem class="username">root</systemitem>. Whenever a package is unpacked as user <systemitem class="username">root</systemitem> (like we do inside the final-system build environment), the files have the user and group IDs of whatever they were on the packager's computer. This is usually not a problem for any other package to be installed because the source tree is removed after the installation. However, the Linux source tree is often retained for a long time. Because of this, there is a chance that whatever user ID the packager used will be assigned to somebody on the machine. That person would then have write access to the kernel source.
fr: Il est important de noter que les fichiers du répertoire des sources du noyau n'appartiennent pas à <systemitem class="username">root</systemitem>. Lorsqu'un paquet est décompressé par <systemitem class="username">root</systemitem> (comme nous le faisons dans l'environnement de construction du système final), les fichiers gardent les ID de l'utilisateur et du groupe telles qu'ils étaient sur l'ordinateur de l'emballeur. Ce n'est généralement pas un problème pour les autres paquets parce que les sources sont supprimées après installation. Cependant, l'arborescence des sources du noyau Linux est souvent gardée pendant un long moment. À cause de cela, il est possible que l'ID de l'utilisateur de l'emballeur soit utilisé par quelqu'un sur la machine. Cette personne pourrait alors accéder en écriture aux sources du noyau.

source: If the kernel source tree is going to retained, run <command>chown -R 0:0</command> on the <filename class="directory">linux-&linux-version;</filename> directory to ensure all files are owned by user <systemitem class="username">root</systemitem>.
fr: Si les sources du noyau vont être gardées, lancez <command>chown -R 0:0</command> dans le répertoire <filename class="directory">linux-&linux-version;</filename> pour s'assurer que tous les fichiers appartiennent à l'utilisateur <systemitem class="username">root</systemitem>.

source: Some kernel documentation recommends creating a symlink from <filename class="symlink">/usr/src/linux</filename> pointing to the kernel source directory. This is specific to kernels prior to the 2.6 series and <emphasis>must not</emphasis> be created on a CLFS system as it can cause problems for packages you may wish to build once your base CLFS system is complete.
fr: Certaines documentation du noyau recommandent de créer un lien symbolique de <filename class="symlink">/usr/src/linux</filename> vers le répertoire des sources. Cela est spécifiques aux noyau avant les 2.6 et <emphasis>ne doit pas</emphasis> être créé sur un système CLFS comme cela causerait des problème avec des paquets que vous pourriez vouloir construire une fois le système CLFS de base terminé.

source: Also, the headers in the system's <filename class="directory">include</filename> directory should <emphasis>always</emphasis> be the ones against which Glibc was compiled and should <emphasis>never</emphasis> be replaced by headers from a different kernel version.
fr: Aussi, les en-têtes dans le répertoire <filename class="directory">include</filename> du système devraient <emphasis>toujours</emphasis> être celles avec lesquelles Glibc a été compilé, et ne devraient <emphasis>jamais</emphasis> être remplacées par des en-têtes d'une version différente du noyau.

source: Contents of Linux
fr: Contenu de Linux

source: Installed files
fr: Fichiers installés

source: Installed directory
fr: Répertoire installé

source: config-[linux-version], clfskernel-[linux-version], and System.map-[linux-version]
fr: config-[linux-version], clfskernel-[linux-version] et System.map-[linux-version]

source: Short Descriptions
fr: Descriptions courtes

source: Contains all the configuration selections for the kernel
fr: Contient toute la configuration du noyau

source: The engine of the Linux system. When turning on the computer, the kernel is the first part of the operating system that gets loaded. It detects and initializes all components of the computer's hardware, then makes these components available as a tree of files to the software and turns a single CPU into a multitasking machine capable of running scores of programs seemingly at the same time.
fr: Le moteur du système Linux. Lorsque vous démarrez votre ordinateur, le noyau est la première partie du système d'exploitation qui est chargée. Il détecte et initialise tous les composants du matériel de l'ordinateur, puis les rend disponibles dans un arbre de fichiers aux logiciels et transforme un simple CPU en une machine multi-tâche capable de lancer des tonnes de programmes apparemment en même temps.

source: A list of addresses and symbols; it maps the entry points and addresses of all the functions and data structures in the kernel
fr: Une liste d'adresses et de symboles. Elle liste les points d'entrées et les adresses de toutes les fonctions et des structures de données du noyau.
