Repository: espindula/br-lfs
Catalog: po/chapter11/whatnow.po
Languages: pt_br

source: Additional Resources
pt_br: Recursos Adicionais

source: Thank you for reading this LFS book. We hope that you have found this book helpful and have learned more about the system creation process.
pt_br: Obrigado por você ler este livro LFS. Nós esperamos que você tenha achado este livro útil e tenha aprendido mais a respeito do processo de criação do sistema.

source: Now that the LFS system is installed, you may be wondering <quote>What next?</quote> To answer that question, we have compiled a list of resources for you.
pt_br: Agora que o sistema LFS está instalado, você possivelmente esteja questionando: <quote>E agora?</quote> Para responder a essa pergunta, nós compilamos uma lista de recursos para você.

source: Maintenance
pt_br: Manutenção

source: Bugs and security notices are reported regularly for all software. Since an LFS system is compiled from source, it is up to you to keep abreast of such reports. There are several online resources that track such reports, some of which are shown below:
pt_br: Defeitos e avisos de segurança são informados regularmente para todo software. Uma vez que um sistema LFS é compilado a partir do fonte, cabe a você se manter a par de tais informativos. Existem vários recursos online que rastreiam tais informativos, alguns dos quais estão mostrados abaixo:

source: <ulink url="&lfs-root;lfs/advisories/">LFS Security Advisories</ulink>
pt_br: <ulink url="&lfs-root;lfs/advisories/">Avisos de Segurança do LFS</ulink>

source: This is a list of security vulnerabilities discovered in the LFS book after it's published.
pt_br: Essa é uma lista de vulnerabilidades de segurança descobertas no livro LFS depois que ele é publicado.

source: <ulink url="https://seclists.org/oss-sec/">Open Source Security Mailing List</ulink>
pt_br: <ulink url="https://seclists.org/oss-sec/">Lista de Discussão de Segurança de Código Aberto</ulink>

source: This is a mailing list for discussion of security flaws, concepts, and practices in the Open Source community.
pt_br: Essa é uma lista de discussão para discussão de falhas de segurança, conceitos e práticas na comunidade do Fonte Aberto.

source: LFS Hints
pt_br: Dicas do LFS

source: The LFS Hints are a collection of educational documents submitted by volunteers in the LFS community. The hints are available at <ulink url="&hints-root;"/>.
pt_br: As Dicas do LFS são uma coleção de documentos educacionais submetidos por voluntários(as) na comunidade do LFS. As dicas estão disponíveis em <ulink url="&hints-root;"/>.

source: Mailing lists
pt_br: Listas de discussão

source: There are several LFS mailing lists you may subscribe to if you are in need of help, want to stay current with the latest developments, want to contribute to the project, and more. See <xref linkend="ch-intro-maillists"/> for more information.
pt_br: Existem várias listas de discussão do LFS que você possivelmente assine se estiver necessitado(a) de ajuda; quiser se manter atualizado(a) com os mais recentes desenvolvimentos; quiser contribuir para o projeto; e mais. Veja-se <xref linkend="ch-intro-maillists"/> para mais informação.

source: The Linux Documentation Project
pt_br: O Projeto de Documentação do Linux

source: The goal of The Linux Documentation Project (TLDP) is to collaborate on all of the issues of Linux documentation. The TLDP features a large collection of HOWTOs, guides, and man pages. It is located at <ulink url="https://tldp.org/"/>.
pt_br: O objetivo do The Linux Documentation Project (TLDP) é o de colaborar em todos os problemas de documentação do Linux. O TLDP apresenta uma grande coleção de HOWTOs, guias e páginas de manual. Ele está localizado em <ulink url="http://www.tldp.org/"/>.
