Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/databases/mariadb.xml.1.chaine.po
Languages: fr

source: 53 MB
fr: 53 Mo

source: 1.2 GB (with tests)
fr: 1.2 Go (avec les tests)

source: Introduction to MariaDB
fr: Introduction à MariaDB

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: MariaDB Dependencies
fr: Dépendances de MariaDB

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of MariaDB
fr: Installation de MariaDB

source: MariaDB and MySQL cannot be installed on the same system without extensive changes to the build configuration of one of the two applications.
fr: MariaDB et MuSQL ne peuvent pas être installées sur le même système sans des modifications dans la configuration de la construction de une des deux applications.

source: For security reasons, running the server as an unprivileged user and group is strongly encouraged.
fr: Pour des raisons de sécurité, l'exécution du serveur en tant qu'utilisateur et groupe non privilégiés est fortement conseillée.

source: Issue the following (as _U1_ ) to create the user and group:
fr: Tapez la suite () :

source: Install _A737_ by running the following commands:
fr: Installez _A737_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Set correct installation directory for some components.
fr: Initialise correctement le répertoire d'installation pour quelques composants.

source: This switch enables compiling the embedded server library needed by certain applications, such as _A739_ . .
fr: Ce paramètre active la compilation de la bibliothèque serveur embarquée nécessaire pour certaines applications, comme _A739_ . .

source: This switch enables support for the complex character sets.
fr: Ce paramètre active le support pour les ensembles de caractères complexes.

source: There are numerous options available to _C583_ .
fr: Il y a de nombreuses options disponible pour _C583_.

source: Check the output of the _C1860_ for additional customization options.
fr: Vérifier la sortie de _C1860_ pour des options de personnalisation supplémentaires.

source: Configuring MySQL
fr: Configuration de MySQL

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Create basic _F760_ using the following command as the _U1_ user:
fr: Créez un fichier _F760_ basique en utilisant la commande suivante en tant qu'utilisateur _U1_ :

source: You can now install a database and change the ownership to the unprivileged user and group (perform as the _U1_ user):
fr: Vous pouvez maintenant installez une base de données et changer le propriétaire en utilisateur et groupe sans privilèges (effectuez ceci en tant qu'utilisateur _U1_) :

source: Further configuration requires that the _A737_ server is running.
fr: Les configurations suivantes demandent que le serveur _A737_ soit lancé.

source: Start the server using the following commands as the _U1_ user:
fr: Démarrez le serveur en utilisant les commandes suivantes en tant qu'utilisateur _U1_ :

source: A default installation does not set up a password for the administrator, so use the following command as the _U1_ user to set one.
fr: Une installation par défaut n'initialise pas un mot de passe pour l'administrateur, aussi utilisez la commande suivante en tant qu'utilisateur _U1_ pour l'initialiser.

source: Configuration of the server is now finished.
fr: La configuration du serveur est maintenant terminée.

source: Shut the server down using the following command as the _U1_ user:
fr: Arrêtez le serveur en utilisant la commande suivante en tant qu'utilisateur _U1_ :

source: Boot Script
fr: Script de démarrage

source: Install the _F762_ init script included in the _X203_ package as the _U1_ user to start the _A737_ server during system boot-up.
fr: Installez le script d'initialisation _F762_ inclus dans le paquet _X203_ en tant qu'utilisateur _U1_ pour démarrer le serveur _A737_ au démarrage du système.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: /etc/mysql, /usr/{include, lib, share}/mysql, and /usr/share/doc/mariadb-&mariadb-version;
fr: /etc/mysql, /usr/{include, lib, share}/mysql, et /usr/share/doc/mariadb-&mariadb-version;

source: Short Descriptions
fr: Descriptions courtes

source: The _A107_ DBI modules must be installed for some of the _A737_ support programs to function properly.
fr: Les modules DBI de _A107_ doivent être installés pour que le support de certains programmes de _A737_ fonctionnent correctement.

source: is used to check, repair, optimize, sort and get information about Aria tables.
fr: est utilisé pour vérifier, réparer, optimiser, trier et obtenir des informations sur les tables Aria.

source: is a tool to dump content of Aria log pages.
fr: est un outil pour enregistrer le contenu des pages de log d'Aria.

source: displays full-text index information.
fr: affiche les informations d'index en texte.

source: is a tool to generate compressed, read-only Aria tables.
fr: est un outil pour générer des tables Aria compressées en lecture seule.

source: displays Aria log file contents.
fr: affiche le contenu des fichiers de log Aria.

source: prints checksums for InnoDB files.
fr: imprime les sommes de contrôle pour les fichiers InnoDB.

source: this script creates stored procedures required by the OpenGIS standards, and is is prepared to be run with the --bootstrap server option.
fr: ce script crée les procedures d'enregistrement requises par le standard OpenGIS, et il est préparé pour être lancé avec l'option serveur --bootstrap.

source: is a tool to convert mSQL programs for use with MySQL.
fr: est un outil pour convertir les programmes mSQL pour utiliser avec MySQL.

source: displays the options from option groups of option files.
fr: affiche les options des groupes d'options des fichiers d'options.

source: displays information about FULLTEXT indexes in MyISAM tables.
fr: affiche les informations à propos des index FULLTEXT dans les tables MyISAM.

source: gets information about your database tables or checks, repairs, or optimizes them.
fr: obtient des informations à propos de vos tables de base de données ou les vérifie, les répare, ou les optimise.

source: displays MyISAM log file contents.
fr: affiche le contenu des fichiers de log MyISAM.

source: is a tool for compressing MyISAM tables.
fr: est un outil pour compresser les tables MyISAM.

source: is a simple SQL shell with input line editing capabilities.
fr: est un simple shell SQL avec des possibilités d'édition de la ligne d'entrée.

source: is used for testing aspects of the MySQL client API that cannot be tested using mysqltest and its test language.
fr: est utilisé pour tester les API clients Mysql qui ne peuvent pas être testées en utilisant mysqltest et les langages de tests.

source: is a tool to test client API for embedded server.
fr: est un outil pour tester les API client des serveurs embarqués.

source: provides you with useful information for compiling your MySQL client and connecting it to MySQL.
fr: vous fournit des informations utiles pour compiler vos clients MySQL et les connecter à MySQL.

source: converts the tables in a database to use a particular storage engine.
fr: convertit les tables dans une base de données pour utiliser un moteur de stockage particulier.

source: is a MySQL client statically linked to libmysqld.
fr: est un client MySQL lié statiquement à libmysqld.

source: reads files containing SQL statements and extracts statements that match a given regular expression or that contain USE db_name or SET statements.
fr: lit les fichiers contenant les états SQL et extrait les états qui correspondent à une expression régulière donnée ou qui contiennent USE db_name ou SET statements.

source: initializes the MySQL data directory and creates the system tables that it contains, if they do not exist.
fr: initialise les répertoires de données MySQL et crée les tables systèmes qui les contiennent, si elles n'existent pas.

source: is a utility that enable MySQL administrators to manage which plugins a MySQL server loads.
fr: est un utilitaire qui autorise les administrateurs MySQL à gérer les greffons serveurs MySQL chargés.

source: is a tool to improve MySQL installation security.
fr: est un outil pour tester la sécurité de l'installation MySQL.

source: sets permissions in the MySQL grant tables.
fr: initialise les permissions dans les tables grant MySQL.

source: loads the time zone tables in the mysql database.
fr: charge les tables de zone de temps dans les bases de données mysql.

source: examines all tables in all databases for incompatibilities with the current version of MySQL Server.
fr: examine toutes les tables dans toutes les bases de données pour les imcompatibilités avec les versions actuelles du serveur MySQL.

source: signals a process to terminate and waits for the process to exit.
fr: signale à un processus de se terminer et attend que le processus soit terminé.

source: is a tool to kill processes that match a pattern.
fr: est un outil pour tuer les processus qui correspondent à un filtre.

source: checks the access privileges for a host name, user name, and database combination.
fr: vérifie les privilèges d'accès pour le nom d'hôte, le nom d'utilisateur et les combinaison de bases de données.

source: is a client for performing administrative operations.
fr: est un client pour réaliser les opérations administratives.

source: read binary log files.
fr: lit les fichiers de log binaire.

source: is a tool to generate bug report.
fr: est un outil pour générer un rapport de bogue.

source: performs table maintenance:
fr: réalise la maintenance des tables :

source: It checks, repairs, optimizes, or analyzes tables.
fr: il vérifie, répare, optimise ou analyse les tables.

source: is the MySQL server daemon.
fr: est le démon du serveur MySQL.

source: is designed to manage several mysqld processes that listen for connections on different Unix socket files and TCP/IP ports.
fr: est conçu pour gérer plusieurs processus mysqld qui écoutent sur différents sockets Unix et ports TCP/IP.

source: is the recommended way to start a mysqld server on Unix and NetWare.
fr: est la façon recommandée de démarrer un serveur mysqld sur Unix et NetWare.

source: is a backup program.
fr: est un programme de sauvegarde.

source: parses MySQL slow query log files and prints a summary of their contents.
fr: analyse les fichiers de log de demandes lentes de MySQL et affiche un résumé de leurs contenus.

source: locks the table, flush the table and then performs a copy of the database.
fr: verrouille la table, nettoie la table et ensuite effectue une copie de la base de données.

source: reads a range of data formats, and inserts the data into a database.
fr: lit plusieurs de formats de données, et insert les données dans une base de données.

source: shows the structure of a MariaDB database.
fr: montre la structure d'une basee de données MariaDB.

source: is a diagnostic program designed to emulate client load for a MySQL server and to report the timing of each stage.
fr: est un programme de diagnostique conçu pour émuler la charge d'un clier pour un serveur MySQL et pour signaler les temps de chaque étape.

source: runs a test case against a MySQL server and optionally compares the output with a result file.
fr: lance un cas de tests contre un serveur MySQL et facultativement compare la sortie avec un fichier résultat.

source: is similar to the _C1904_ command but is built with support for the libmysqld embedded server.
fr: est similaire à la commande _C1904_ mais est construit avec le support libmysqld pour serveur embarqué.

source: is a console-based tool for monitoring the threads and overall performance of a MySQL server.
fr: est un outil console pour surveiller les threads et les performances d'un serveur MySQL.

source: is a utility that displays descriptions for system or storage engine error codes.
fr: est un utilitaire qui affiche les descriptions pour les codes d'erreur du système ou du moteur d'enregistrement.

source: is a MariaDB/MySQL extension to the SQL standard.
fr: est une extension MariaDB/MySQL pour le SQL standard.

source: resolves a numeric stack dump to symbols.
fr: résoud une pile numérique en symboles.

source: is a utility for resolving IP addresses to host names and vice versa.
fr: est un utilitaire pour résoudre les adresses IP en noms d'hote et vice-versa.
