Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/databases/postgresql.xml.1.chaine.po
Languages: fr

source: 18 MB
fr: 18 Mo

source: 234 MB (with tests)
fr: 234 Mo (avec les tests)

source: 1.7 SBU (with tests)
fr: 1.7 SBU (avec les tests)

source: Introduction to PostgreSQL
fr: Introduction à PostgreSQL

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: PostgreSQL Dependencies
fr: Dépendances de PostgreSQL

source: Optional
fr: Optionnelles

source: Optional (To Regenerate Documentation)
fr: Optionnelles (To Regenerate Documentation)

source: User Notes:
fr: Notes utilisateur :

source: Install _A732_ with the following commands:
fr: Installez _A732_ avec les commandes suivantes :

source: with
fr: avec

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Configuring PostgreSQL
fr: Configuration de PostgreSQL

source: Config Files
fr: Fichiers de configuration

source: The _E34_ environment variable is used to distinguish database clusters from one another by setting it to the value of the directory which contains the cluster desired.
fr: La variable d'environnement _E34_ est utilisée pour distinguer les clusters de base de données entre eux en la réglant sur la valeur du répertoire qui contient le cluster désiré.

source: The three configuration files exist in every _F746_ directory.
fr: Les trois fichiers de configuration existent dans tout répertoire _F746_ directory.

source: Details on the format of the files and the options that can be set in each can be found in _L1311_ .
fr: Vous pouvez trouver des détails sur le format des fichiers et les options qu'on peut régler dans chacun d'eux sur _L1311_.

source: Boot Script
fr: Script de démarrage

source: Install the _F747_ init script included in the _X203_ package.
fr: Installez le script de démarrage _F747_ fourni dans le script de démarrage _X203_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: clusterdb, createdb, createlang, createuser, dropdb, droplang, dropuser, ecpg, initdb, pg_archivecleanup, pg_basebackup, pg_config, pg_controldata, pg_ctl, pg_dump, pg_dumpall, pg_isready, pg_receivexlog, pg_recvlogical, pg_resetxlog, pg_restore, pg_rewind, pg_test_fsync, pg_test_timing, pg_upgrade, pg_xlogdump, pgbench, pltcl_delmod, pltcl_listmod, pltcl_loadmod, postgres, postmaster (deprecated), psql, reindexdb, vacuumdb, and optionally (in contrib/) oid2name, pg_standby, vacuumlo, and many others
fr: clusterdb, createdb, createlang, createuser, dropdb, droplang, dropuser, ecpg, initdb, pg_archivecleanup, pg_basebackup, pg_config, pg_controldata, pg_ctl, pg_dump, pg_dumpall, pg_isready, pg_receivexlog, pg_recvlogical, pg_resetxlog, pg_restore, pg_rewind, pg_test_fsync, pg_test_timing, pg_upgrade, pg_xlogdump, pgbench, pltcl_delmod, pltcl_listmod, pltcl_loadmod, postgres, postmaster (obsolete), psql, reindexdb, vacuumdb, et facultativement (dans contrib/) oid2name, pg_standby, vacuumlo, et beaucoup d'autres

source: libecpg.{so, a}, libecpg_compat.{so, a}, libpgcommon.a, libpgport.a, libpgtypes.{so, a}, libpq.{so, a}, various charset modules, and optionally programming language modules under /usr/lib/postgresql
fr: libecpg.{so, a}, libecpg_compat.{so, a}, libpgcommon.a, libpgport.a, libpgtypes.{so, a}, libpq.{so, a}, des modules variés de caractères, et facultativement des modules de programmation sous /usr/lib/postgresql

source: Short Descriptions
fr: Descriptions courtes

source: is a utility for reclustering tables in a _A732_ database.
fr: est un outil pour reconstruire.

source: creates a new _A732_ database.
fr: crée une nouvelle base de données _A732_.

source: defines a new _A732_ procedural language.
fr: définit un nouveau langage procédural _A732_.

source: defines a new _A732_ user account.
fr: définit un nouveau compte utilisateur _A732_.

source: removes a _A732_ database.
fr: supprime une base de données _A732_.

source: removes a _A732_ procedural language.
fr: supprime un langage procédural _A732_.

source: removes a _A732_ user account.
fr: supprime un compte utilisateur _A732_.

source: is the embedded SQL preprocessor.
fr: est le préprocesseur SQL embarqué.

source: creates a new database cluster.
fr: crée un nouveau cluster de base de données.

source: resolves OIDs (Object IDs) and file nodes in a PostgreSQL data directory.
fr: résoud les OIDs (Object IDs) et les noeuds de fichier dans le répertoire des données de PostgreSQL.

source: takes base backups of a running _A732_ cluster.
fr: fait des sauvegardes de la base sur une grappe _A732_.

source: retrieves _A732_ version information.
fr: récupère des informations sur la version de _A732_.

source: returns information initialized during _C1809_ , such as the catalog version and server locale.
fr: retourne des informations initialisées pendant _C1809_ , telles que la version du catalogue et la locale du serveur.

source: controls stopping and starting the database server.
fr: contrôle l'arrêt et le démarrage du serveur de base de données.

source: dumps database data and metadata into scripts which are used to recreate the database.
fr: place dans un script des données et des méta-données de base de données, elles sont utilisées pour recréer la base de données.

source: recursively calls _C1816_ for each database in a cluster.
fr: appelle de manière récursive _C1816_ pour chaque base de données d'un cluster.

source: check the connection status of a PostgreSQL server.
fr: vérifie le statut de la connexion du serveur PostgreSQL.

source: is used to stream transaction log from a running PostgreSQL cluster.
fr: est utiliser pour écouter un log de transaction depuis un cluster PostgreSQL.

source: controls PostgreSQL logical decoding streams.
fr: contrôle les flux de décodage logique de PostgreSQL.

source: clears the write-ahead log and optionally resets some fields in the _F748_ file.
fr: nettoie le journal écrit et réinitialise éventuellement des champs dans le fichier _F748_.

source: creates databases from dump files created by _C1816_ .
fr: crée des bases de données à partir de fichiers cachés créés par _C1816_.

source: synchronizes a PostgreSQL data directory with another data directory that was forked from the first one.
fr: synchronise un répertoire de données PostgreSQL avec un autre répertoire qui a été copié depuis le premier.

source: supports the creation of a PostgreSQL warm standby server.
fr: supporte la création d'un serveur PostgreSQL de secours à chaud.

source: determine fastest wal_sync method for PostgreSQL.
fr: détermine la méthode wal_sync la plus rapide pour PostgreSQL.

source: measure timing overhead.
fr: mesure le temps de synchronisation.

source: upgrade a PostgreSQL server instance.
fr: met à jour une instance de serveur PostgreSQL.

source: display a human-readable rendering of the write-ahead log of a PostgreSQL database cluster.
fr: affiche une sortie lisible par un humain du log d'écriture d'un cluster de base de données PostgreSQL.

source: run a benchmark test on PostgreSQL.
fr: lane un test de performance sur PostgreSQL.

source: is a support script used to delete a module from a PL/_A309_ table.
fr: est un script de support utilisé pour effacer un module d'une table PL/_A309_.

source: The command requires the _L1312_ package to be installed also.
fr: La commande exige que le paquet _L1312_ soit aussi installé.

source: is a support script used to list the modules in a PL/_A309_ table.
fr: est un script support utilisé pour lister les modules d'une table PL/_A309_.

source: The command requires the _L1313_ package to be installed also.
fr: La commande exige que le paquet _L1313_ soit aussi installé.

source: is a support script used to load a module into a PL/_A309_ table.
fr: est un script support utilisé pour charger un module d'une table PL/_A309_.

source: is the PostgreSQL database server.
fr: est le serveur de bases de données PostgreSQL.

source: (deprecated, a symlink to _C1833_ ) is a multi-user database daemon.
fr: (déprécié, un lien symbolique vers _C1833_) est un démon de base de données multi-utilisateurs.

source: is a console based database shell.
fr: est un shell de base de données en console.

source: is a utility for rebuilding indexes in a database.
fr: est un outil pour reconstruire les index d'une base de données.

source: compacts databases and generates statistics for the query analyzer.
fr: compacte des bases de données et génère des statistiques pour l'analyseur de demandes.

source: remove orphaned large objects from a PostgreSQL database.
fr: efface les gros objets orphelins d'une base de données PostgreSQL.

source: contains functions to support embedded SQL in C programs.
fr: contient des fonctions pour supporté du SQL embarqué dans des programmes C.

source: is the ecpg compatibility library.
fr: est la bibliothèque de compatibilité ecpg.

source: is the port-specific subsystem of the Postgres backend.
fr: est le sous-système de port spécifique du backend Postgres.

source: contains functions for dealing with Postgres data types.
fr: contient des fonctions pour traiter des types de données Postgres.
