Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/wm/openbox.xml.1.chaine.po
Languages: fr

source: 944 KB
fr: 944 Ko

source: 21 MB
fr: 21 Mo

source: Introduction to openbox
fr: Introduction à openbox

source: It allows you to control almost every aspect of how you interact with your desktop.
fr: Il vous permet de contrôler presque tous les aspects de la manière dont interagissez avec votre bureau.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Openbox Dependencies
fr: Dépendances d'Openbox

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Openbox
fr: Installation d'Openbox

source: If XORG_PREFIX is not _F190_ , tell _C169_ about it:
fr: Si XORG_PREFIX n'est pas _F190_ , appelez _C169_ comme cela :

source: If you installed only Python 3 PyXDG module convert one of the scripts to Python 3:
fr: Si vous installez seulement le module Python 3 PyXDG convertissez l'un des scripts pour Python 3 :

source: Install _A547_ by running the following commands:
fr: Installez _A547_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: this puts a few files in a versioned directory in _F1053_ .
fr: ceci met quelques fichiers dans un répertoire versionné de _F1053_.

source: Configuring Openbox
fr: Configurer Openbox

source: Config Files
fr: Fichiers de configuration

source: /etc/xdg/openbox/autostart, /etc/xdg/openbox/menu.xml, /etc/xdg/openbox/rc.xml, ~/.config/openbox/autostart, ~/.config/openbox/menu.xml and ~/.config/openbox/rc.xml
fr: /etc/xdg/openbox/autostart, /etc/xdg/openbox/menu.xml, /etc/xdg/openbox/rc.xml, ~/.config/openbox/autostart, ~/.config/openbox/menu.xml et ~/.config/openbox/rc.xml

source: Configuration Information
fr: Informations de configuration

source: The menu itself is configured with 2 files, _F1054_ and _F1055_ .
fr: Le menu lui-même est configuré par 2 fichiers, _F1054_ et _F1055_.

source: To make changes to the menu, copy /etc/xdg/openbox/menu.xml to ~/.config/openbox/menu.xml and edit it:
fr: Pour faire des modifications dans le menu, copiez /etc/xdg/openbox/menu.xml vers ~/.config/openbox/menu.xml et editez le :

source: To have icons in your right click menu requires installing _X436_ before you install _A547_ .
fr: Pour avoir des icônes dans votre menu accessible avec le clic droit, il vous faut installer _X436_ avant d'install _A547_.

source: To set an icon for an entry in the menu edit _F1055_ and add an icon to the &lt;item&gt; tag like this:
fr: Pour définir une icône pour une entrée de menu, éeitez _F1055_ et ajoutez une icône au tag &lt;item&gt; comme ceci :

source: Details of the theme that _A547_ applies to window decorations are configured in _F1056_ .
fr: Les détails sur le thème appliqué par _A547_ aux décors de la fenêtre sont configurés dans _F1056_.

source: You can get a list of the available themes with the command:
fr: Vous pouvez avoir une liste des thèmes disponibles par la commande :

source: Starting Openbox
fr: Démarrer Openbox

source: To automatically start _C2446_ when you start _A200_ :
fr: Pour démarrer automatiquement _C2446_ au démarrage de _A200_ :

source: If you want to set a background image to your desktop you can use _X498_ and launch it from ~/.xinitrc just before openbox:
fr: Si vous souhaitez avoir une image de fond sur votre bureau vous pouvez utiliser _X498_ et le lancer depuis ~/.xinitrc juste avant openbox :

source: Or if you like a bit of variety, put a selection of images in a folder (in this example, the directory ~/.config/backgrounds) and choose one at random each time you _C2447_ :
fr: Ou si vous aimez un peu de variété, mettez une sélection d'images dans un dossier (dans cet exemple, le répertoire ~/.config/backgrounds) et choisissez en une au hasard chaque fois que vous lancez _C2447_ :

source: If you like to have the numlock key set whan you start Xorg, install_L1873_ and add that to your xinitrc.
fr: Si vous préférez avoir le verrouillage du pavé numérique d'activé quand vous démarrez Xorg, installez _L_ et ajoutez le à votre xinitrc. .

source: Another useful application is _X46_ :
fr: Une autre application utile est _X46_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: gdm-control, gnome-panel-control, obxprop, openbox, openbox-gnome-session, openbox-kde-session and openbox-session
fr: gdm-control, gnome-panel-control, obxprop, openbox, openbox-gnome-session, openbox-kde-session et openbox-session

source: libobrender.so and libobt.so
fr: libobrender.so et libobt.so

source: /etc/xdg/openbox, /usr/include/openbox, /usr/share/doc/openbox-&openbox-version; and /usr/share/themes.
fr: /etc/xdg/openbox, /usr/include/openbox, /usr/share/doc/openbox-&openbox-version; et /usr/share/themes.

source: Short Descriptions
fr: Descriptions courtes

source: is a command line tool to send signals to _A873_ .
fr: est un outil en ligne de commande pour envoyer des signaux à _A873_.

source: is a command line utility to invoke the _A880_ run dialog/menu.
fr: est un outil en ligne de commande pour appeler la boîte de dialogue/le menu de _A880_.

source: is a tool for displaying the properties on an x window.
fr: est un outil pour afficher les propriété d'un système x window.

source: It has a similar functionality to _C2451_ , but allows you to see UTF-8 strings as text.
fr: Il comporte une fonctionnalité similaire à _C2451_ , mais il vous permet de voir des chaînes UTF-8 comme du texte.

source: is a standards compliant, highly configurable, window manager.
fr: est un gestionnaire de fenêtres respectant les standards et très configurable.

source: is a script to launch an _A687_ session with _A547_ as your window manager from your _F283_ .
fr: est un script pour lancer une session _A687_ avec _A547_ comme gestionnaire de fenêtres à partir de votre _F283_.

source: is a script to launch an _A163_ session with _A547_ as your window manager from your _F283_ .
fr: est un script pour lancer une session _A163_ avec _A547_ comme gestionnaire de fenêtres à partir de votre _F283_.

source: is a script to launch an _A547_ session from your _F283_ .
fr: est un script pour lancer une session _A547_ à partir de votre _F283_.

source: contains the functions used by _A547_ for theme rendering.
fr: contient les fonctions utilisées par _A547_ pour l'affichage du thème.

source: is the _A547_ toolkit library.
fr: est la bibliothèque d'outils d'_A547_.
