Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/wm/wm.xml.1.chaine.po
Languages: fr

source: Window Managers
fr: Gestionnaires de fenêtre

source: Window Managers and Desktop Environments are the primary user interfaces into the _A502_ Window System.
fr: Les gestionnaires de fenêtres et les environnements de bureau sont les interfaces primaires pour l'utilisateur dans le système _A502_ Window.

source: A window manager is a program that controls the appearance of windows and provides the means by which the user can interact with them.
fr: Un gestionnaire de fenêtre est un programme qui contrôle l'apparence des fenêtres et qui fournit aux utilisateurs les moyens d'interagir avec elles.

source: A Desktop Environment provides a more complete interface to the operating system, and provides a range of integrated utilities and applications.
fr: Un environnement de bureau fournit une interface plus complète avec le système d'exploitation, et il offre un gamme d'outils et d'applications intégrés.

source: There are many Window Managers available.
fr: Beaucoup de gestionnaires de fenêtre sont disponibles.

source: Some of the more well known ones include _A1119_ , _A1120_ , _A1121_ , _A580_ , _A1122_ , and _A584_ .
fr: Parmi les plus connus, on a _A1119_ , _A1120_ , _A1121_ , _A580_ , _A1122_ , et _A584_.

source: The Desktop Environments available for Linux are _A58_ , _A225_ , and _A581_ .
fr: Les environnements de bureau disponibles pour Linux sont _A58_ , _A225_ et _A581_.

source: Choosing a Window Manager or Desktop Environment is highly subjective.
fr: Le choix d'un gestionnaire de fenêtres ou d'un environnement de bureau est fortement subjectif.

source: The choice depends on the look and feel of the packages, the resources (RAM, disk space) required, and the utilities included.
fr: Le choix dépend de l'aspect et de la sensation des paquets, des ressources (RAM, espace disque) requises, et des outils inclus.

source: One web site that provides a very good summary of what is available, screenshots, and their respective features is _L2743_ .
fr: Un site Internet qui offre un très bon résumé de ce qui est disponible, des captures d'écran et de leurs fonctionnalités respectives est _L2743_.

source: In this chapter, the installation instructions of several Window Managers and one lightweight Desktop Environment are presented.
fr: Dans ce chapitre, sont présentées les instructions d'installation de plusieurs gestionnaires de fenêtre et d'un environnement de bureau léger.

source: Later in the book, both _A225_ and _A58_ have their own sections.
fr: Plus tard dans le livre, tant _A225_ que _A58_ ont leurs propres sections.
