Repository: espindula/br-lfs
Catalog: blfs/*/lxqt/desktop/lxqt-themes.po
Languages: fr

source: 25 MB
fr: 25&nbsp;Mo

source: 55 MB
fr: 55&nbsp;Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to lxqt-themes
fr: Introduction à lxqt-themes

source: The <application>lxqt-themes</application> package provides a number of graphics files and themes for the <application>LXQt</application> desktop.
fr: Le paquet <application>lxqt-themes</application> fournit un certain nombre de fichiers graphiques et de thèmes pour le bureau <application>LXQt</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&lxqt-themes-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&lxqt-themes-download-http;"/>

source: Download (FTP): <ulink url="&lxqt-themes-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&lxqt-themes-download-ftp;"/>

source: Download MD5 sum: &lxqt-themes-md5sum;
fr: Somme de contrôle MD5&nbsp;: &lxqt-themes-md5sum;

source: Download size: &lxqt-themes-size;
fr: Taille du téléchargement&nbsp;: &lxqt-themes-size;

source: Estimated disk space required: &lxqt-themes-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &lxqt-themes-buildsize;

source: Estimated build time: &lxqt-themes-time;
fr: Estimation du temps de construction&nbsp;: &lxqt-themes-time;

source: lxqt-themes Dependencies
fr: Dépendances de lxqt-themes

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/lxqt-themes"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/lxqt-themes"/>

source: Installation of lxqt-themes
fr: Installation de lxqt-themes

source: Install <application>lxqt-themes</application> by running the following commands:
fr: Installez <application>lxqt-themes</application> en exécutant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the &root; user:
fr: Maintenant, en tant qu'utilisateur &root;&nbsp;:

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
