Repository: espindula/br-lfs
Catalog: blfs/*/lxqt/desktop/lxqt-about.po
Languages: fr

source: 22 KB
fr: 22 Ko

source: 1.8 MB
fr: 1.8 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to lxqt-about
fr: Introduction à lxqt-about

source: The <application>lxqt-about</application> package provides the standalone <application>LXQt</application> <quote>About</quote> dialog.
fr: Le paquet <application>lxqt-about</application> fournit la boîte de dialogue indépendante <quote>À propos</quote> de <application>LXQT</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&lxqt-about-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&lxqt-about-download-http;"/>

source: Download (FTP): <ulink url="&lxqt-about-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&lxqt-about-download-ftp;"/>

source: Download MD5 sum: &lxqt-about-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &lxqt-about-md5sum;

source: Download size: &lxqt-about-size;
fr: Taille du téléchargement&nbsp;: &lxqt-about-size;

source: Estimated disk space required: &lxqt-about-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &lxqt-about-buildsize;

source: Estimated build time: &lxqt-about-time;
fr: Estimation du temps de construction&nbsp;: &lxqt-about-time;

source: lxqt-about Dependencies
fr: Dépendances de lxqt-about

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: <xref linkend="git"/> (to download translation files) or <xref linkend="lxqt-l10n"/> (to add localization files)
fr: <xref linkend="git"/> (pour télécharger les fichiers de traductions) ou <xref linkend="lxqt-l10n"/> (pour ajouter les fichiers de localisations)

source: User Notes: <ulink url="&blfs-wiki;/lxqt-about"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/lxqt-about"/>

source: Installation of lxqt-about
fr: Installation de lxqt-about

source: Install <application>lxqt-about</application> by running the following commands:
fr: Installez <application>lxqt-about</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <parameter>-DPULL_TRANSLATIONS=no</parameter>: Removes the need for <xref linkend="git"/>, which would otherwise be requested to download the translation files.
fr: <parameter>-DPULL_TRANSLATIONS=no</parameter>&nbsp;: Supprime le besoin de <xref linkend="git"/>, qui serait sinon demandé pour télécharger les fichiers de traduction.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: None
fr: Aucune

source: Short Descriptions
fr: Descriptions courtes

source: is the <application>LXQt</application> <quote>About</quote> dialog.
fr: est la boîte de dialogue <quote>À propos</quote> de <application>LXQT</application>.
