Repository: espindula/br-lfs
Catalog: blfs/*/lxqt/desktop/pre-install.po
Languages: fr

source: LXQt Desktop Pre-Install Instructions
fr: Instruction de pré-installation du bureau LXQt

source: LXQt Pre-Install
fr: Pré-installation de LXQt

source: Due to recent changes in <command>grep</command> it is essential that the installing system be set to an UTF-8 locale. An example is <command>export LANG=en_US.UTF-8</command>, but any UTF-8 locale is sufficient. Failure to do this will result in a faulty installation.
fr: À cause de changements récents dans <command>grep</command>, il est nécessaire que le système d'installation soit configuré avec une locale UTF-8. Par exemple, utilisez <command>export LANG=fr_FR.utf8</command>, mais toute locale UTF-8 fera l'affaire. Si vous ne le faites pas, votre installation sera incorrecte.

source: LXQt can be installed in /usr or /opt/lxqt.
fr: LXQt peut être installé dans /usr ou /opt/lxqt.

source: Installing in /usr
fr: Installation dans /usr

source: Installing in <filename class="directory">/usr</filename> creates a simpler setup. Run:
fr: Installer dans <filename class="directory">/usr</filename> crée une installation plus simple. Lancez&nbsp;:

source: Either add that to your own <filename>.bash_profile</filename> so that it will still be set if you build the packages over a period of time, or else add it to the system profile as the <systemitem class="username">root</systemitem> user:
fr: Ajoutez-le à votre propre <filename>.bash_profile</filename> pour qu'il soit toujours activé si vous construisez les paquets sur une longue période de temps, ou ajoutez-le au profil du système en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: There is no other configuration needed to install LXQt in <filename class="directory">/usr</filename>.
fr: Il n'y a pas d'autre configuration requise pour installer LXQt dans <filename class="directory">/usr</filename>.

source: Installing in /opt/lxqt
fr: Installation dans /opt/lxqt

source: Installing in <filename class="directory">/opt/lxqt</filename> may simplify upgrading to a later version of LXQt.
fr: Installer dans <filename class="directory">/opt/lxqt</filename> peut simplifier la mise à jour vers une version ultérieure de LXQt.

source: Some variables need to be defined in your system profile, as the <systemitem class="username">root</systemitem> user:
fr: Certaines variables doivent être définie dans votre profil système, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Expand your <filename>/etc/ld.so.conf</filename> file:
fr: Étoffez votre fichier <filename>etc/ld.so.conf</filename>&nbsp;:

source: Before starting to install the packages in the following pages, remember to execute:
fr: Avant de commencer à installer les paquets dans les pages suivantes, rappelez-vous d'exécuter&nbsp;:

source: Some packages from the KDE Frameworks 5 bundle install files into D-Bus directories. In order to have D-Bus find those files, the easiest way is to create a symlink. Some packages may also install icons from the <quote>hicolor</quote> icon set. Since that icon set is used by many packages, it is a good idea to create a symlink to the one in <filename class="directory">/usr/share</filename> to avoid having multiple installations of <xref linkend="hicolor-icon-theme"/>. Run the following commands as the <systemitem class="username">root</systemitem> user:
fr: Certains paquets de l'ensemble KDE Frameworks 5 installent des fichiers dans les répertoires D-Bus. Pour que D-Bus trouve ces fichiers, la manière la plus simple est de créer un lien symbolique. Certains paquets peuvent aussi installer des icônes de l'ensemble <quote>hicolor</quote>. Comme cet ensemble d'icônes est utilisé par beaucoup de paquets, c'est une bonne idée de créer un lien symbolique vers celui de <filename class="directory">/usr/share</filename> pour éviter d'avoir des installations multiples de <xref linkend="hicolor-icon-theme"/>. Lancez la commande suivante en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Sometimes, the installation paths are hardcoded into installed files. This is the reason why <filename class="directory">/opt/lxqt</filename> is used as installation prefix instead of <filename class="directory">/opt/lxqt-&lxqt-version;</filename>. After installing <application>LXQt Desktop</application>, you may rename the directory and create a symlink:
fr: Parfois, les chemins d'installation sont codés en dur dans les fichiers installés. C'est pourquoi <filename class="directory">/opt/lxqt</filename> est utilisé comme préfixe d'installation au lieu de <filename class="directory">/opt/lxqt-&lxqt-version;</filename>. Après l'installation de <application>LXQt Desktop</application>, vous pouvez renommer le répertoire et créer un lien symbolique&nbsp;:

source: Later on, you may want to install other versions of <application>LXQt Desktop</application>. To do that, just remove the symlink and use <filename class="directory">/opt/lxqt</filename> as the prefix again. Which version of <application>LXQt Desktop</application> you use depends only on where the symlink points. No other reconfiguration will be needed.
fr: Ensuite, vous pourriez vouloir installer d'autres versions de <application>LXQt Desktop</application>. Pour cela, supprimez simplement le lien symbolique et utilisez de nouveau <filename class="directory">/opt/lxqt</filename> comme préfixe. La version de <application>LXQt Desktop</application> que vous utilisez dépend seulement du répertoire pointé par le lien symbolique. Aucune autre reconfiguration ne sera nécessaire.

source: Notes about building LXQt dependencies
fr: Remarques à propos de la construction des dépendances de LXQt

source: <application>LXQt</application> obviously needs <xref linkend="qt5"/>, but not all Qt5 modules and dependencies are necessary. Since the aim of <application>LXQt</application> is to be light weight, it may be interesting to cut down the Qt5 overhead, and to build only parts of it. To build Qt and LXQT dependencies, the proposed order is the following:
fr: <application>LXQt</application> a évidemment besoin de <xref linkend="qt5"/>, mais tous les modules Qt5 et ses dépendances ne sont pas requis. Comme le but de <application>LXQt</application> est d'être léger, il peut être intéressant de réduire la taille de Qt5 et de n'en construire que certaines parties. Pour construire les dépendances de Qt et LXQt, l'ordre proposé est le suivant&nbsp;:

source: Build <xref linkend="linux-pam"/>, <xref linkend="shadow"/>, and <xref linkend="sudo"/>, with their dependencies
fr: Construisez <xref linkend="linux-pam"/>, <xref linkend="shadow"/> et <xref linkend="sudo"/> avec leurs dépendances

source: Build the whole <xref linkend="x-window-system"/> chapter, with Wayland support, and replacing twm vith <xref linkend="openbox"/> (and its required dependencies). Some Xorg applications and fonts may be omitted, but with a negligible impact on build time and size
fr: Construisez tout le chapitre <xref linkend="x-window-system"/>, avec le support de Wayland en remplaçant twm par <xref linkend="openbox"/> (et ses dépendances requises). Certaines applications et polices Xorg peuvent être oubliées, mais elles ont un impact négligeable sur le temps de construction et la taille.

source: Build <xref linkend="gtk2"/> and its required and recommended dependencies. GTK+2 is needed for <xref linkend="libfm"/>, and brings the <command>gtk-update-icon-cache</command> executable, which is needed by libqtxdg
fr: Construisez <xref linkend="gtk2"/> et ses dépendances requises et recommandées. GTK+2 est requis pour <xref linkend="libfm"/>, et apporte l'exécutable <command>gtk-update-icon-cache</command> qui est requis par libqtxdg.

source: Build required Qt dependencies, and some of the recommended or optional dependencies, namely: <xref linkend="dbus"/>, <xref linkend="alsa-lib"/>, <xref linkend="pulseaudio"/>, and <xref linkend="libxkbcommon"/>
fr: Construisez les dépendances requises de Qt et certaines des dépendances recommandées ou facultatives, c'est-à-dire&nbsp;: <xref linkend="dbus"/>, <xref linkend="alsa-lib"/>, <xref linkend="pulseaudio"/> et <xref linkend="libxkbcommon"/>

source: Build the required parts of <xref linkend="qt5"/>. To skip all modules but the four needed for LXQt, do:
fr: Construisez les parties requises de <xref linkend="qt5"/>. Pour passer tous les modules sauf les quatre requis par LXQt, faîtes&nbsp;:

source: The time needed to complete the Qt installation is thus reduced to around 6 SBU
fr: Le temps demandé pour finir l'installation de Qt est ainsi réduit à environ 6 SBU

source: Build miscellaneous dependencies (with their required ones): <xref linkend="libstatgrab"/>, <xref linkend="polkit"/>, <phrase revision="sysv"> <xref linkend="consolekit"/>, <xref linkend="pm-utils"/>, </phrase> <xref linkend="lm_sensors"/>, <xref linkend="upower"/>, and <xref linkend="libfm"/>. If <xref linkend="cmake"/> has not been built during the preceding steps, build it now
fr: Construisez diverses dépendances (avec leurs dépendances requises)&nbsp;: <xref linkend="libstatgrab"/>, <xref linkend="polkit"/>, <phrase revision="sysv"><xref linkend="consolekit"/>, <xref linkend="pm-utils"/>, </phrase><xref linkend="lm_sensors"/>, <xref linkend="upower"/> et <xref linkend="libfm"/>. Si <xref linkend="cmake"/> n'a pas été construit durant les étapes précédentes, construisez-le maintenant.

source: Build KDE frameworks dependencies: <xref linkend="extra-cmake-modules"/>, <xref linkend="libdbusmenu-qt"/>, and <xref linkend="polkit-qt"/>
fr: Construisez les dépendances de KDE frameworks&nbsp;: <xref linkend="extra-cmake-modules"/>, <xref linkend="libdbusmenu-qt"/> et <xref linkend="polkit-qt"/>

source: Finally, build some desktop utilities: <xref linkend="xdg-utils"/> (needs only xmlto), <xref linkend="xdg-user-dirs"/>, <xref linkend="oxygen-icons5"/> or other sets of icons
fr: Enfin, construisez certains utilitaires du bureau&nbsp;: <xref linkend="xdg-utils"/> (requiert seulement xmlto), <xref linkend="xdg-user-dirs"/>, <xref linkend="oxygen-icons5"/> ou d'autres ensembles d'icônes.
