Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netprogs/bridgeutils.xml.1.chaine.po
Languages: fr

source: 36 KB
fr: 36 Ko

source: 1 MB
fr: 1 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to bridge-utils
fr: Introduction à bridge-utils

source: The _A1174_ package contains a utility needed to create and manage bridge devices.
fr: Le paquet _A1174_ contient un utilitaire necessaire pour créer et gérer un périphérique de pont.

source: This is useful in setting up networks for a hosted virtual machine (VM).
fr: Il est pratique dans l'initialisation d'un réseau pour une machine virtuelle (VM).

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: bridge-utils Dependencies
fr: Dépendances de bridge-utils

source: Optional (to run tests)
fr: Optionnelles (pour lancer les tests)

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: Enable the following options in the kernel configuration and recompile the kernel if necessary:
fr: Activez les options suivantes dans la configuration du noyau et recompilez le noyau si nécessaire :

source: Installation of bridge-utils
fr: Installation de bridge-utils

source: Install _A1174_ by running the following commands:
fr: Installez _A1174_ en lançant les commandes suivantes :

source: Testing the results requires running the six shell scripts in the _F304_ directory.
fr: Le test des résultats demande de lancer les six scripts dans le répertoire _F304_.

source: Two of the tests require two ethernet ports.
fr: Deux des tests demandent d'avoir 2 ports ethernet.

source: Some tests will not preserve the current network configuration.
fr: Quelques tests ne garderont pas la configuration actuelle du réseau.

source: See _F1510_ for details.
fr: Voir pour les détails _F1510_.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Configuring bridge-utils
fr: Configurer bridge-utils

source: Configuration Information
fr: Informations de configuration

source: To automate bridge creation and configuration, install the _F1511_ service script included in the _X194_ package.
fr: Pour automatiser la création et la configuration d'un pont, installez script de service _F1511_ inclu dans le paquet _X194_.

source: The _F1512_ script depends on the commands _C2412_ and _C2413_ and the service script
fr: Le script _F1512_ dépend des comamndes _C2412_ et _C2413_ et le script de service

source: from the
fr: des scripts de démarrage

source: bootscripts dated January 27, 2012 or later.
fr: en date du 27 janvier 2012 ou plus tard.

source: The following configuration file will create a bridge device at boot time and attach the eth0 device to it.
fr: Le fichier de configuration suivant va créer un périphérique de bridge au moment du démarrage et y rattacher l'eth0.

source: If more than one device is desired, use a space separated list of INTERFACE_COMPONENTS.
fr: Si vous désirez plus d'un périphérique, utilisez une liste d'INTERFACE_COMPONENTS séparés chacun par un espace.

source: This configuration is useful when planning to run a virtual machine such as kvm/qemu.
fr: Cette configuration est utile lorsqu'on envisage de faire fonctionner une machine virtuelle telle que kvm/qemu.

source: Other SERVICE combinations are possible, for example, SERVICES="bridge dhcp".
fr: D'autres combinaisons de SERVICE sont possibles, par exemple, SERVICES="bridge dhcp".

source: In that case, the address parameters are not needed, but do not interfere if present.
fr: Dans ce cas, les paramètres d'adresse ne sont pas nécessaires mais ils n'interfèrent pas s'ils sont présents.

source: The bridge service may also be used alone, but will require additional subsequent configuration.
fr: Vous pouvez utiliser le service bridge seul, mais vous aurez besoin d'une configuration consécutive supplémentaire.

source: Do not run a parallel configuration for a device in the INTERFACE_COMPONENTS list.
fr: Ne lancez pas de configuration parallèle pour un périphérique dans la liste INTERFACE_COMPONENTS.

source: For instance, in the example below, do not configure _F1089_ to run at boot time.
fr: Par exemple, dans l'exemple ci-dessous, ne configurez pas _F1089_ pour se lancer au moment du démarrage.

source: The command _C2414_ followed by command _C2415_ will work, but don't try to have both up at the same time.
fr: La commande _C2414_ suivie de la commande _C2415_ fonctionnera, mais n'essayez pas de faire marcher les deux en même temp.

source: All addresses should be changed to meet your circumstance.
fr: Vous devriez changer toutes les adresses pour correspondre à votre contexte.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a program used to set up, maintain, and inspect the ethernet bridge configuration in the linux kernel.
fr: est un programme utilisé pour initialiser, maintenir, et analyser la configuration ethernet en mode pont dans le noyau linux.
