Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netprogs/ncftp.xml.1.chaine.po
Languages: fr

source: 452 KB
fr: 452 Ko

source: 6.4 MB
fr: 6.4 Mo

source: Introduction to NcFTP
fr: Introduction à NcFTP

source: The _A801_ package contains a powerful and flexible interface to the Internet standard File Transfer Protocol.
fr: Le paquet _A801_ contient une interface puissante et flexible avec le standard Internet _fpo_File Transfer Protocol_fpf_.

source: It is intended to replace or supplement the stock _C765_ program.
fr: Il vise à remplacer ou compléter le programme de stockage _C765_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: User Notes:
fr: Notes utilisateur :

source: Installation of NcFTP
fr: Installation de NcFTP

source: There are two ways to build _A801_ .
fr: Il y a deux façons de construire _A801_.

source: The first (and optimal) way builds most of the functionality as a shared library and then builds and installs the program linked against this library.
fr: La première (et optimale) façon construit la plupart des fonctionnalités comme une bibliothèque partagée puis construit et installe le programme lié à cette bibliothèque.

source: The second method simply links all of the functionality into the binary statically.
fr: La seconde méthode lie simplement tous les fonctionnalités au binaire de façon statique.

source: You need to choose which method best suits you.
fr: Vous devez choisir quelle méthode vous convient le mieux.

source: Note that the second method does
fr: Notez que la seconde méthode

source: not
fr: non

source: create an entirely statically linked binary; only the _F972_ parts are statically linked in, in this case.
fr: un binaire lié entièrement de façon dynamique; dans ce cas seules les parties _F972_ sont liées de façon statique.

source: Be aware that building and using the shared library is covered by the Clarified Artistic License; however, developing applications that utilize the shared library is subject to a different license.
fr: Sachez que la construction et l'utilisation de la bibliothèque partagée est couverte par la _fpo_Clarified Artistic License_fpf_; cependant le développement d'applications utilisant la bibliothèque partagée est soumis à une autre licence.

source: To install _A801_ using the first (and optimal) method, run the following commands:
fr: Pour installer _A801_ en utilisant la première (et optimale) méthode, lancez les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: To install _A801_ using the second method (with the _F972_ functionality linked in statically) run the following commands:
fr: Pour installer _A801_ en utilisant la seconde meéthode (avec la fonctionnalité _F972_ liée de façon statique) lancez les commandes suivantes :

source: Command Explanations
fr: Explications des commandes

source: These commands make and install the dynamic library _F972_ which is then used to link against when compiling the main program.
fr: Ces commandes fabriquent et installent la bibliothèque dynamique _F972_ qui est ensuite utilisée pour s'y lier lors de la compilation du programme principal.

source: Configuring NcFTP
fr: Configuration de NcFTP

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Most _A801_ configuration is done while in the program, and the configuration files are dealt with automatically.
fr: La plupart de la configuration de _A801_ se fait dans le programme et les fichiers de configuration sont gérés automatiquement.

source: One exception to this is _F976_ .
fr: Une exception réside dans _F976_.

source: There are various options to alter in there, including:
fr: Il y a plusieurs options à y modifier notamment :

source: This disables the splash screen advertising the _A802_ server.
fr: Ceci désactive la publicité à l'écran d'accueil du serveur _A802_.

source: There are other options in the _F977_ file.
fr: Il y a d'autres options dans le fichier _F977_.

source: Most of these are self-explanatory.
fr: La plupart d'entre elles s'expliquent d'elles-mêmes.

source: Global defaults can be set in _F975_ .
fr: Vous pouvez mettre les paramètres globaux par défaut dans _F975_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a browser program for File Transfer Protocol.
fr: est un programme de navigation pour _fpo_File Transfer Protocol_fpf_.

source: is an individual batch FTP job processor.
fr: est un processeur de tâches FTP batch individuelles.

source: is the _A801_ Bookmark Editor (_A803_ -based).
fr: est l'éditeur de signets _A801_ (basé sur _A803_).

source: is an internet file transfer program for scripts used to retrieve files.
fr: est un programme de transfert de fichiers par Internet pour des scripts, utilisé pour récupérer les fichiers.

source: is an internet file transfer program for scripts used to list files.
fr: est un programme de transfert de fichiers par Internet pour des scripts, utilisé pour lister des fichiers.

source: is an internet file transfer program for scripts used to transfer files.
fr: est un programme de transfert de fichiers par Internet pour des scripts, utilisé pour transférer les fichiers.

source: is a global batch FTP job processor daemon.
fr: est un processeur de tâches FTP batch globales.
