Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netprogs/net-tools.xml.1.chaine.po
Languages: fr

source: 222 KB
fr: 222 Ko

source: 7.0 MB
fr: 7.0 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Net-tools
fr: Introduction à Net-tools

source: The _A1507_ package is a collection of programs for controlling the network subsystem of the Linux kernel.
fr: Le paquet _A1507_ contient un ensemble de programmes de contrôle du sous-système réseau du noyau Linux.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: User Notes:
fr: Notes utilisateur :

source: Installation of Net-tools
fr: Installation de Net-tools

source: The instructions below automate the configuration process by piping _C2539_ to the _C2852_ command.
fr: Les instructions ci-dessous automatisent le processus de configuration en mettant _C2539_ dans une tube vers la commande _C2852_.

source: If you wish to run the interactive configuration process (by changing the instruction to just _C2852_ ), but you are not sure how to answer all the questions, then just accept the defaults.
fr: Si vous souhaitez lancer le processus de configuration interactif (en modifiant les instruction en _C2852_), mais si vous n'êtes pas sûr de savoir comment répondre à toutes les questions, acceptez simplement les réponses par défaut.

source: This will be just fine in the majority of cases.
fr: Ceci ira très bien dans la majorité des cas.

source: What you're asked here is a bunch of questions about which network protocols you've enabled in your kernel.
fr: Vous sont ici posées une série de questions sur les protocoles réseau que vous avez activés dans votre noyau.

source: The default answers will enable the tools from this package to work with the most common protocols:
fr: Les réponses par défaut activeront les outils de ce paquet pour fonctionner avec les protocoles les plus courants :

source: TCP, PPP, and several others.
fr: TCP, PPP et plusieurs autres.

source: You still need to actually enable these protocols in the kernel&mdash;what you do here is merely tell the package to include support for those protocols in its programs, but it's up to the kernel to make the protocols available.
fr: Vous avez enfin besoin d'activer ces protocoles dans le noyau &mdash; ce que vous faites ici n'est que de dire au paquet d'inclure le support de ces protocoles dans ses programmes, mais c'est au noyau de rendre les protocoles disponibles.

source: This package has several unneeded protocols and hardware device specific functions that are obsolete.
fr: Ce paquet contient plusieurs fonctions inutiles, spécifiques à des protocoles inutiles ou des périphériques, qui sont obsolètes.

source: To only build the minimum needed for your system, skip the _C2539_ command and answer each question interactively.
fr: Pour ne construire que le minimum nécessaire pour votre système, passez la commande _C2539_ et répondez à chaque question de façon interactive.

source: The minimum needed options are 'UNIX protocol family' and 'INET (TCP/IP) protocol family'.
fr: Les options minimales nécessaires sont 'UNIX protocol family' et 'INET (TCP/IP) protocol family'.

source: The patch below cleans up the installation so that it does not overwrite the _A1508_ and _A1509_ programs that were installed in LFS.
fr: Le correctif nettoie l'installation pour qu'elle n'écrase pas les programmes _A1508_ et _A1509_ qui sont installés par LFS.

source: Install _A1507_ by running the following commands:
fr: Installez _A1507_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: Piping _C2539_ to _C2852_ skips the interactive configuration and accepts the defaults.
fr: En mettant _C2539_ dans un tuyau vers _C2852_ , on saute la configuration interactive et on accepte les réponses par défaut.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: arp, ipmaddr, iptunnel, mii-tool, nameif, netstat, plipconfig, rarp, route, and slattach
fr: arp, ipmaddr, iptunnel, mii-tool, nameif, netstat, plipconfig, rarp, route, et slattach

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is used to manipulate the kernel's ARP cache, usually to add or delete an entry, or to dump the entire cache.
fr: est utilisé pour manipuler le cache A du noyau, souvent pour ajouter ou supprimer une entrée ou pour vider le cache entier.

source: adds, deletes and shows an interface's multicast addresses.
fr: ajoute, supprime et montre des adresses multicast d'une interface.

source: adds, changes, deletes and shows an interface's tunnels.
fr: ajoute, modifie, supprime et montre les tunnels d'une interface.

source: checks or sets the status of a network interface's Media Independent Interface (MII) unit.
fr: vérifie ou paramètre le statut d'une _fpo_Media Independent Interface_fpf_ (MII) d'une interface.

source: names network interfaces based on MAC addresses.
fr: nomme les interfaces réseau basées sur les adresses MAC.

source: is used to report network connections, routing tables, and interface statistics.
fr: est utilisé pour signaler les connexions réseau, les tables de routage, et les statistiques d'une interface.

source: is used to fine tune the PLIP device parameters, to improve its performance.
fr: est utilisé pour bien ajuster les paramètres du périphérique PLIP, pour améliorer ses performances.

source: is used to manipulate the kernel's RARP table.
fr: est utilisé pour manipuler la table RARP du noyau.

source: is used to manipulate the IP routing table.
fr: est utilisé pour manipuler la table de routage IP.

source: attaches a network interface to a serial line.
fr: attache une interface réseau à une ligne série.

source: This allows you to use normal terminal lines for point-to-point links to other computers.
fr: Ceci vous permet d'utiliser les lignes du terminal normal pour des liaisons point-à-point avec d'autres ordinateurs.
