Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netprogs/nfs-utils.xml.1.chaine.po
Languages: fr

source: 776 KB
fr: 776 Ko

source: 14 MB
fr: 14 Mo

source: nfs-utils-&nfs-utils-version;
fr: NFS Utilities-&nfs-utils-version;

source: Introduction to NFS Utilities
fr: Introduction à NFS Utilities

source: NFS is a protocol that allows sharing file systems over the network.
fr: NFS est un protocole qui permet le partage de systèmes de fichiers sur un réseau.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: NFS Utilities Dependencies
fr: Dépendances de NFS Utilities

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: Required (runtime)
fr: Requises (exécution)

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: Enable the following options in the kernel configuration and recompile the kernel if necessary:
fr: Activez les options suivantes dans la configuration du noyau et recompilez le noyau si nécessaire :

source: Select the appropriate sub-options that appear when the above options are selected.
fr: Sélectionnez les sous-options adéquates qui apparaissent quand les options ci-dessus sont sélectionnées.

source: Install _A792_ by running the following commands:
fr: Installez _A792_ en lançant les commandes suivantes :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This option is needed because TCP Wrappers is not in BLFS.
fr: Cette option est nécessaire car TCP Wrappers n'est pas dans BLFS.

source: Disables support for NFS version 4.
fr: Désactive le support des versions 4 de NFS.

source: Disables support for RPCSEC GSS (RPC Security).
fr: Désactive le support de RPCSEC GSS (RPC Security).

source: Configuring NFS Utilities
fr: Configuration de NFS Utilities

source: Server Configuration
fr: Configuration du serveur

source: Boot Script
fr: Script de démarrage

source: Client Configuration
fr: Configuration du client

source: Alternately the partitions can be mounted by using the _C1454_ command with the proper options.
fr: Les partitions peuvent aussi être montées par l'utilisation de _C1454_ command avec les bonnes options.

source: To mount the _F650_ and _F291_ partitions, add the following to the _F625_ :
fr: Pour monter les partitions _F650_ et _F291_ , ajoutez ce qui suit au fichier _F625_ :

source: The options which can be used are specified in _C2241_ .
fr: Les options qui peuvent être utilisées sont spécifiées dans _C2241_.

source: If both the client and server are running recent versions of linux, most of the options will be negotiated.
fr: Si le client et le server utilisent des versions récentes de linux, la plupart des options pourront être négociées.

source: You can specify either
fr: vous pouvez spécifier soit

source: or
fr: ou

source: if the filesystem is to be automatically mounted at boot, or
fr: si le système de fichier doit être monté automatiquement au démarrage, ou

source: (and perhaps
fr: (et peut être

source: ) for other filesystems.
fr: ) pour les autres systèmes de fichiers.

source: If the fileserver is not running a recent version of linux, you may need to specifiy other options.
fr: Si le serveur de fichiers n'utilise pas une version récente de linux, vous devrez spécifier d'autres options.

source: If you are using systemd, you may need to enable autofs v4 in your kernel, and add the option
fr: Si vous utilisez systemd, vous devrez activer autofs v4 dans votre noyau, et ajouter l'option

source: Some machines need this, because systemd tries to mount the external fs&apos;s before the network is up, others do not need it.
fr: Certaines machines ont besoin de cela, car systemd tente de monter les fs externes avant que le réseau soit actif, les autres n'ont pas besoin de cela.

source: An alternative is for _U1_ to run _C2242_ .
fr: Une alternative est pour _U1_ de lancer _C2242_.

source: The following boot script is not required if the nfs-server script is installed.
fr: Le script de démarrage suivant n'est pas requis si vous avez installé le script nfs-server.

source: Install the _F962_ init script included in the _X203_ package to start the client services at boot.
fr: Installez le script de démarrage _F962_ fourni dans le paquet _X203_ pour lancer les services clients au démarrage.

source: To automatically mount _U23_ filesystems, clients will also need to install the _F963_ bootscript as described in _X384_ .
fr: Pour monter automatiquement des systèmes de fichiers _U23_, les clients devront également installer le script de démarrage the _F963_ comme décrit au chapitre _X384_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: exportfs, mountstats, mount.nfs, mount.nfs4 (link to mount.nfs), nfsiostat, nfsstat, osd_login, rpc.mountd, rpc.nfsd, rpc.statd, rpcdebug, showmount, sm-notify, start-statd, umount.nfs (link to mount.nfs), and umount.nfs4 (link to mount.nfs)
fr: exportfs, mountstats, mount.nfs, mount.nfs4 (link to mount.nfs), nfsiostat, nfsstat, osd_login, rpc.mountd, rpc.nfsd, rpc.statd, rpcdebug, showmount, sm-notify, start-statd, umount.nfs (link to mount.nfs), et umount.nfs4 (link to mount.nfs)

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: maintains a list of NFS exported file systems.
fr: maintient une liste des systèmes de fichiers exportés par NFS.

source: displays NFS client per-mount statistics.
fr: affiche des statistiques par montage des clients NFS.

source: Used to mount a network share using NFS
fr: Utilisé pour monter un partage réseau en utilisant NFS

source: Used to mount a network share using NFSv4
fr: Utilisé pour monter un partage réseau en utilisant NFSv4

source: Report input/output statistics for network filesystems.
fr: Signale les statistiques d'entrée/sortie des systèmes de fichiers réseaux.

source: displays statistics kept about NFS client and server activity.
fr: affiche des statistiques sur le client NFS et l'activité du serveur.

source: is a script that is a part of the autologin feature mandated by the pnfs-objects standard.
fr: est un script qui fait partie de la fonction autologin fournit par le standard pnfs-objects.

source: implements the NFS mount protocol on an NFS server.
fr: implémente le protocole de montage NFS sur un serveur NFS.

source: implements the user level part of the NFS service on the server.
fr: implémente la partie du serveur niveau utilisateur du service ou du serveur NFS.

source: is used by the NFS file locking service.
fr: est utilisé par le service de verrouillage de fichier NFS.

source: Run on both sides, client as well as server, when you want file locking enabled.
fr: Lancé des deux côtés, côté client et serveur, quand vous voulez activer le verrouillage de fichier.

source: displays mount information for an NFS server.
fr: affiche des informations de montage d'un serveur NFS.

source: is used to send Network Status Monitor reboot messages.
fr: est utilisé pour envoyer des messages de redémarrage au _fpo_Network Status Monitor_fpf_.

source: is a script called by nfsmount when mounting a filesystem with locking enabled, if statd does not appear to be running.
fr: est un script appelé par nfsmount lors du montage d'un système de fichiers avec le verrouillage activé, si statd ne semble pas fonctionner.

source: It can be customised with whatever flags are appropriate for the site.
fr: On peut l'automatiser avec n'importe quel drapeau approprié à la situation.

source: Used to unmount a network share using NFS
fr: Utilisé pour démonter un partage réseau utilisant NFS

source: Used to unmount a network share using NFSv4
fr: Utilisé pour démonter un partage réseau utilisant NFSv4
