Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netprogs/ntp.xml.1.chaine.po
Languages: fr

source: 6.9 MB
fr: 6.9 Mo

source: 104 MB (with tests)
fr: 104 Mo (avec les tests)

source: less than 1 SBU (with tests)
fr: moins de 1 SBU (avec les tests)

source: Introduction to ntp
fr: Introduction à ntp

source: The _A793_ package contains a client and server to keep the time synchronized between various computers over a network.
fr: Le paquet _A793_ contient un client et un serveur pour synchroniser le temps entre divers ordinateurs d'un réseau.

source: This package is the official reference implementation of the NTP protocol.
fr: Ce paquet est l'implémentation de référence officiel du protocole NTP.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: ntp Dependencies
fr: Dépendances de ntp

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of ntp
fr: Installation de ntp

source: There should be a dedicated user and group to take control of the _C2259_ daemon after it is started.
fr: Il doit y avoir un utilisateur et un groupe dédié pour prendre le contrôle du démon _C2259_ après son démarrage.

source: Issue the following commands as the _U1_ user:
fr: Tapez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Install _A793_ by running the following commands:
fr: Installez _A793_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This parameter places the administrative programs in _F474_ .
fr: Ce paramètre met les programmes d'administration dans _F474_.

source: ntpd is run as user ntp, so use Linux capabilities for non-root clock control.
fr: ntpd est lancé en tant qu'utilisateur ntp, donc utilisation des possibilités de pour le contrôle de l'horloge en non-root.

source: This option enables _A109_ support for _C2260_ and _C2261_ programs.
fr: Cette option active le support _A109_ pour les programmes _C2260_ et _C2261_.

source: If omitted, _A794_ will be used if installed, otherwise no readline capabilites will be compiled.
fr: En ne le mettant pas, _A794_ sera utilisé s'il est installé, sinon aucune fonctionnalités readline ne sera compilée.

source: Configuring ntp
fr: Configuration de ntp

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: The following configuration file first defines various ntp servers with open access from different continents.
fr: Le fichier de configuration suivant définit en premier plusieurs serveurs ntp libres d'accès sur différents continents.

source: Second, it creates a drift file where _C2259_ stores the frequency offset and a pid file to store the _C2259_ process ID.
fr: En second, il crée aussi un fichier drift où _C2259_ conserve la fréquence de temps et un fichier pid pour stocker l'ID du processus _C2259_.

source: Third, it defines the location for the leap-second definition file _F964_ , that the _C2258_ script checks and updates, when necessary.
fr: En troisième, il défini l'endroit pour le fichier de définition leap-second _F964_ , que le script _C2258_ vérifie et met à jours, quand nécessaire.

source: This script can be run as a cron job and the _A793_ developers recommend a frequency of about three weeks for the updates.
fr: Ce script peut être lancé comme une tache cron et les developpeurs de _A793_ recommande une fréquence de trois semaines pour les mises à jour.

source: Since the documentation included with the package is sparse, visit the ntp website at _L326_ and _L327_ for more information.
fr: Comme il y a peu de documentation fournie avec le paquet, visitez le site Internet de ntp sur _L326_ et _L327_ pour plus informations.

source: You may wish to add a
fr: Vous pouvez souhaiter ajouter une

source: Security session
fr: Session de sécurité

source: For explanations, see _L328_ .
fr: Pour les explications voir _L328_.

source: Synchronizing the Time
fr: Sychroniser le temps

source: There are two options.
fr: Il y a deux options.

source: Option one is to run _C2259_ continuously and allow it to synchronize the time in a gradual manner.
fr: L'option un est de lancer _C2259_ en permanence et de l'autoriser à synchroniser le temps de façon graduée.

source: The other option is to run _C2259_ periodically (using cron) and update the time each time _C2259_ is scheduled.
fr: L'autre option est de lancer _C2259_ périodiquement (en utilisant cron) et de mettre à jour l'heure chaque fois que _C2259_ est modifié.

source: If you choose Option one, then install the _F965_ init script included in the _X203_ package.
fr: Si vous choisissez l'option un, installez le script de démarrage _F965_ inclu dans le paquet _X203_.

source: Execute the following command if you would like to set the hardware clock to the current system time at shutdown and reboot:
fr: Exécutez la commande suivante si vous aimeriez régler l'heure matérielle à l'heure actuelle du système lorsqu'il s'éteint et redémarre :

source: The other way around is already set up by LFS.
fr: L'autre façon est déjà réglée par LFS.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: calc_tickadj, ntp-keygen, ntp-wait, ntpd, ntpdate, ntpdc, ntpq, ntptime, ntptrace, sntp, tickadj and update-leap
fr: calc_tickadj, ntp-keygen, ntp-wait, ntpd, ntpdate, ntpdc, ntpq, ntptime, ntptrace, sntp, tickadj et update-leap

source: None
fr: Aucun

source: /usr/share/ntp, /usr/share/doc/ntp-4.2.8 and /var/lib/ntp
fr: /usr/share/ntp, /usr/share/doc/ntp-&ntp-version; et /var/lib/ntp

source: Short Descriptions
fr: Descriptions courtes

source: calculates optimal value for tick given ntp drift file.
fr: calcule la valeur optimal pour les tops donnés par le fichier drift de ntp.

source: generates cryptographic data files used by the NTPv4 authentication and identification schemes.
fr: génère des fichiers de données encryptées utilisés par les schèmes NTPv4 d'authentification et d'identification.

source: is useful at boot time, to delay the boot sequence until _C2259_ has set the time.
fr: est utile au moment du démarrage, pour faire attendre la séquence de démarrage jusqu'à ce que _C2259_ ait réglé l'heure.

source: is a ntp daemon that runs in the background and keeps the date and time synchronized based on response from configured ntp servers.
fr: est un démon ntp qui se lance en tâche de fond et qui maintient la date et l'heure synchronizés à partir des réponses des serveurs ntp configurés.

source: It also functions as a ntp server.
fr: Il fonctionne aussi comme un serveur NTP.

source: is a client program that sets the date and time based on the response from an ntp server.
fr: est un programme client qui règle la date et l'heure à partir des réponses d'un serveur NTP.

source: This command is deprecated.
fr: Cette commande est obsolète.

source: is used to query the ntp daemon about its current state and to request changes in that state.
fr: est utilisé pour interroger le démon ntp sur son état actuel et pour demander des changements de cet état.

source: is a utility program used to monitor _C2259_ operations and determine performance.
fr: est un outil utilisé pour gérer les opérations de _C2259_ et déterminer les performances.

source: reads and displays time-related kernel variables.
fr: lit et affiche les variables du noyau relatives à l'heure.

source: traces a chain of ntp servers back to the primary source.
fr: établit une chaîne entre les serveurs ntp et la source primaire.

source: is a Simple Network Time Protocol (SNTP) client.
fr: est un client _fpo_Simple Network Time Protocol_fpf_ (SNTP ou simple protocole de temps réseau) client.

source: reads, and optionally modifies, several timekeeping-related variables in older kernels that do not have support for precision timekeeping.
fr: lit et, éventuellement, modifies plusieurs variables relatives à la conservation du temps dans des noyaux anciens qui n'ont pas de support pour la conservation du temps de précision.

source: is a script to verify and, if necessary, update the leap-second definition file.
fr: est un script pour vérifier et , si nécessaire, mettre à jour le fichier de définition leap-second.
