Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netprogs/rsync.xml.1.chaine.po
Languages: fr

source: 872 KB
fr: 872 Ko

source: 11 MB (with tests - additional 45 MB for HTML API documentation)
fr: 11 Mo (avec les tests - additional 45 Mo for HTML API documentation)

source: 0.5 SBU (with tests)
fr: 0.5 SBU (avec les tests)

source: Introduction to rsync
fr: Introduction à rsync

source: The _A791_ package contains the _C2175_ utility.
fr: Le paquet _A791_ contient l'outil _C2175_.

source: This is useful for synchronizing large file archives over a network.
fr: C'est utile pour synchroniser de grosses archives de fichiers sur un réseau.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: rsync Dependencies
fr: Dépendances de rsync

source: Recommended
fr: Recommandées

source: User Notes:
fr: Notes utilisateur :

source: Installation of rsync
fr: Installation de rsync

source: For security reasons, running the _A791_ server as an unprivileged user and group is encouraged.
fr: Pour des raisons de sécurité, il est recommandé d'exécuter le serveur _A791_ en tant qu'utilisateur et que groupe non privilégiés.

source: If you intend to run _C2175_ as a daemon, create the _U21_ user and group with the following commands issued by the _U1_ user:
fr: Si vous souhaitez lancer _C2175_ en tant que démon, créez l'utilisateur et le groupe _U21_ avec les commandes suivantes lancées en tant qu'utilisateur _U1_ :

source: Install _A791_ by running the following commands:
fr: Installez _A791_ en lançant les commandes suivantes :

source: If you have _X68_ installed and wish to build HTML API documentation, issue _C203_ .
fr: Si vous avez installé _X68_ et si vous souhaitez construire la documentation de l'API en HTML, lancez _C203_.

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you built the documentation, install it using the following commands as the _U1_ user:
fr: Si vous avez construit la documentation, installez-la en utilisant les commandes suivantes en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch enables compilation with system-installed zlib library.
fr: Ce paramètre active la compilation avec la bibliothèque zlib installée sur le système.

source: Configuring rsync
fr: Configuration de rsync

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: For client access to remote files, you may need to install the _X49_ package to connect to the remote server.
fr: Pour un accès client aux fichiers distants, il se peut que vous deviez installer le paquet _X49_ pour vous connecter au serveur distant.

source: This is a simple download-only configuration to set up running _C2175_ as a server.
fr: C'est une configuration simple pour le téléchargement seulement pour régler un _C2175_ fonctionnant comme un serveur.

source: See the rsyncd.conf (5) man-page for additional options (i.e., user authentication).
fr: Voir la page de man de rsyncd.conf (5) pour des options supplémentaires (donc l'authentication utilisateur).

source: You can find additional configuration information and general documentation about _C2175_ at _L45_ .
fr: Vous pouvez trouver des informations de configuration et de la documentation générale concernant _C2175_ sur _L45_.

source: Boot Script
fr: Script de démarrage

source: Note that you only want to start the _A791_ server if you want to provide an _A791_ archive on your local machine.
fr: Remarquez que vous ne voudrez démarrer le serveur _A791_ que si vous voulez fournir une archive _A791_ sur votre machine locale.

source: Install the _F940_ init script included in the _X203_ package.
fr: Installez le script de démarrage _F940_ fourni dans le script de démarrage _X203_.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: Optionally, /usr/share/doc/rsync-&rsync-version;
fr: Facultativesly, /usr/share/doc/rsync-&rsync-version;

source: Short Descriptions
fr: Descriptions courtes

source: is a replacement for _C1207_ (and _C1206_ ) that has many more features.
fr: est le remplaçant de _C1207_ (et _C1206_) qui a beaucoup plus de fonctionnalités.

source: It uses the
fr: Il utilise l'

source: rsync algorithm
fr: algorithme rsync

source: which provides a very fast method of syncing remote files.
fr: qui fournit une méthode de synchronisation des fichiers distants très rapide.

source: It does this by sending just the differences in the files across the link, without requiring that both sets of files are present at one end of the link beforehand.
fr: Il fait cela en n'envoyant que les différences dans les fichiers à travers le lien, sans exiger que les deux ensembles de fichiers soient présents à l'avance à une fin de lien.
