Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netprogs/wireless-tools.xml.1.chaine.po
Languages: fr

source: 288 KB
fr: 288 Ko

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Wireless Tools
fr: Introduction à Wireless Tools

source: The Wireless Extension (WE) is a generic API in the Linux kernel allowing a driver to expose configuration and statistics specific to common Wireless LANs to user space.
fr: L'extension Wireless (WE) est une API générique du noyau Linux qui permet à un pilote de produire des statistiques et de la configuration spécifique à des LAN sans fil courants dans l'espace de l'utilisateur.

source: A single set of tools can support all the variations of Wireless LANs, regardless of their type as long as the driver supports Wireless Extensions.
fr: Un seul chaîne d'outils peut supporter tous les types de LANs sans fil selon leur type, tant que le pilote supporte les extensions Wireless.

source: WE parameters may also be changed on the fly without restarting the driver (or Linux).
fr: Vous pouvez aussi modifier les paramètres WE à la volée sans redémarrer le pilote (ou Linux).

source: The _A795_ (WT) package is a set of tools allowing manipulation of the Wireless Extensions.
fr: Le paquet _A795_ (WT) est une chaîne d'outils qui permet de manipuler les extensions Wireless.

source: They use a textual interface to support the full Wireless Extension.
fr: Ils utilise une interface textuelle pour supporter toute l'extension Wireless.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: To use _A795_ , the kernel must have the appropriate drivers and other support available.
fr: Pour utiliser _A795_ , le noyau doit avoir les pilotes adéquats et les autres supports disponibles.

source: The appropriate bus must also be available.
fr: Le bus adéquat doit être également disponible.

source: For many laptops, the PCMCIA bus (CONFIG_PCCARD) needs to be built.
fr: Pour la plupart des portables, le bus PCMCIA (CONFIG_PCCARD) doit être construit.

source: In some cases, this bus support will also need to be built for embedded wireless cards.
fr: Dans certains cas, le support de ce bus devra aussi être construit pour les cartes Wifi internes.

source: The appropriate bridge support also needs to be built.
fr: Le support pour le pont adéquat doit aussi être construit.

source: For many modern laptops, the CardBus host bridge (CONFIG_YENTA) will be needed.
fr: Pour la plupart des portables récents, le pont hôte CardBus (CONFIG_YENTA) sera nécessaire.

source: In addition to the bus, the actual driver for the specific wireless card must also be available.
fr: En plus du bus, le pilote actuel pour la carte Wifi spécifique doit aussi être disponible.

source: The first place to look for card support is the kernel.
fr: Le premier endroit pour trouver le support des cartes est le noyau.

source: The drivers are located in Device Drivers &rarr; Network Device Support &rarr; Wireless LAN (non-hamradio).
fr: Les pilotes se trouvent dans Device Drivers &rarr; Network Device Support &rarr; Wireless LAN (non-hamradio).

source: There are also external drivers available for some very common cards.
fr: Il y a aussi des pilotes externes disponibles pour des cartes très classiques.

source: For more information, look at the user notes.
fr: Pour des informations, regardez les notes utilisateur.

source: After the correct drivers are loaded, the interface will appear in _F967_ .
fr: Après que les bons pilotes ont été chargés, l'interface apparaîtra dans _F967_.

source: Installation of Wireless Tools
fr: Installation de Wireless Tools

source: To install _A795_ , use the following commands:
fr: Pour installer _A795_ , utilisez les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Install manual pages in /usr/share/man instead of /usr/man
fr: Installez les pages de manuel dans /usr/share/man au lieu de /usr/man

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: ifrename, iwconfig, iwevent, iwgetid, iwlist, iwpriv, and iwspy
fr: ifrename, iwconfig, iwevent, iwgetid, iwlist, iwpriv, et iwspy

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: renames network interfaces based on various static criteria.
fr: renomme les interfaces réseau basées sur divers critères statiques.

source: configures a wireless network interface.
fr: configure une interface de réseau sans fil.

source: displays wireless events generated by drivers and setting changes.
fr: affiche les événements Wifi générés par les pilotes et les changements de paramétrage.

source: reports ESSID, NWID or AP/Cell Address of wireless networks.
fr: signale une adresse ESSID, NWID ou AP/Cell de réseaux sans fil.

source: gets detailed wireless information from a wireless interface.
fr: obtient des informations détaillées du Wifi à partir d'une interface Wifi.

source: configures optional (private) parameters of a wireless network interface.
fr: configure des paramètres facultatifs (privés) de l'interface d'un réseau sans fil.

source: gets wireless statistics from specific node.
fr: obtient des statistiques du sans fil depuis un n&oelig;ud spécifique.

source: contains functions required by the wireless programs and provides an API for other programs.
fr: contient les fonctions requises par les programmes Wifi et fournit une API pour d'autres programmes.
