Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netprogs/wpa_supplicant.xml.1.chaine.po
Languages: fr

source: 2.5 MB
fr: 2.5 Mo

source: 31 MB
fr: 31 Mo

source: Introduction to WPA Supplicant
fr: Introduction à wpa_supplicant

source: It implements WPA key negotiation with a WPA Authenticator and Extensible Authentication Protocol (EAP) authentication with an Authentication Server.
fr: Il implémente la négociation de clé WPA avec une authentification WPA et le protocole d'authentification étendue (EAP) avec un serveur d'authentification.

source: In addition, it controls the roaming and IEEE 802.11 authentication/association of the wireless LAN driver.
fr: De plus, il contrôle l'itinérance et l'authentification/association IEEE 802.11 des pilotes.

source: This is useful for connecting to a password protected wireless access point.
fr: Il est pratique pour se connecter à un point d'accès protégé par mot de passe.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: WPA Supplicant Dependencies
fr: Dépendances de wpa_supplicant

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: Enable the following options in the kernel configuration as well as specific device drivers for your hardware and recompile the kernel if necessary:
fr: Activez les options suivantes dans la configuration du noyau aussi bien que les pilotes spécifiques pour votre matériel et recompilez si nécessaire :

source: Open the submenu and select the options that support your hardware:
fr: Ouvrez le sous-menu et selectionnez les options que supportent votre matériel :

source: Installation of WPA Supplicant
fr: Installation de wpa_supplicant

source: First you will need to create an initial configuration file for the build process.
fr: En premier vous devez créer un fichier de configuration initial pour la construction.

source: You can read _F982_ and _F983_ for the explanation of the following options as well as other options that can be used.
fr: Vous pouvez lire _F982_ et _F983_ pour les explications des options suivantes aussi bien que pour les autres options qui peuvent être utilisées.

source: Create a build configuration file that should work for standard WiFi setups by running the following command:
fr: Créer un fichier de configuration qui peut fonctionner avec les initialisations standards pour le WiFi en lançant les commandes suivantes :

source: If you wish to use _A805_ with _X299_ , make sure that you have installed _X46_ and _X79_ , then add the following options to the _A805_ build configuration file by running the following command:
fr: Si vous souhaitez utiliser _A299_ avec _X46_ , soyez certain d'avoir installé _X79_ et _X805_ , ensuite ajoutez les options suivantes dans le fichier de configuration de _A805_ en lançant les commandes suivantes :

source: Install _A805_ by running the following commands:
fr: Installez _A805_ en lançant les commandes suivantes :

source: If you have installed _X105_ and wish to build the _A805_ GUI program, run the following commands:
fr: Si vous avez installé _X105_ et souhaitez construire l'interface graphique de _A805_ , lancez les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you have built _A805_ with _A5_ support, you will need to install _A5_ configuration files.
fr: Si vous avez construit _A805_ avec le support _A5_ , vous devez installer les fichiers de configuration de _A5_.

source: Install them by running the following commands as the _U1_ user:
fr: Installez les en lançant les commandes suivantes en tant qu'utilisateur _U1_ :

source: If you have built the _A805_ GUI program, install it by running the following commands as the _U1_ user:
fr: Si vous avez construit l'interface graphique de _A805_ , installez le en lançant les commandes suivantes en tant qu'utilisateur _U1_ :

source: You will need to restart the system _A5_ daemon before you can use the _A805_ _A5_ interface.
fr: Vous devrez redémarrer le démon du système _A805_ avant que vous puissiez utiliser l'interface _A5_ de _A5_.

source: Configuring wpa_supplicant
fr: Configuration de wpa_supplicant

source: Config File
fr: Fichier de configuration

source: Configuration Information
fr: Informations de configuration

source: To connect to an access point that uses a password, you need to put the pre-shared key in _F985_ .
fr: Pour se connecter à un point d'acces qui utilise un mot de passe vous devez mettre la clé public dans _F985_.

source: SSID is the string that the access point/router transmits to identify itself.
fr: SSID est la chaîne que le point d'accès ou le routeur transmet pour s'identifier.

source: Run the following command as the _U1_ user:
fr: En tant qu'utilisateur _U1_ :

source: When _C2295_ is started, it will scan for the SSIDs it can see and choose the appropriate password to connect.
fr: Quand vous lancez _C2295_ il scannera les SSIDs qu'il peut voir et choisira le mot de passe approprié pour se connecter.

source: Replace "Some-SSID" with the SSID of the access point/router.
fr: Remplacez "Some-SSID" avec le SSID du point d'accès/routeur.

source: There are many options that you could use to tweak how you connect to each access point.
fr: Il y a beaucoup d'options que vous pouvez utiliser pour personnaliser la façon de se connecter à chaque point d'accès.

source: They are described in some detail in the _F987_ file in the source tree.
fr: Elles sont décrites en détails dans le fichier _F987_ dans les sources.

source: If you want to configure network interfaces at boot using _C2295_ , you need to install the _F988_ script included in _X203_ package:
fr: Si vous voulez configurer des interfaces réseaux au démarrage en utilisant _C2295_ , vous devez installer le script _F988_ inclus dans le paquet _X203_ :

source: Replace
fr: Remplacez

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: wpa_gui, wpa_supplicant, wpa_passphrase and wpa_cli
fr: wpa_gui, wpa_supplicant, wpa_passphrase et wpa_cli

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a graphical frontend program for interacting with _A806_ .
fr: est une interface graphique pour interagir avec _A806_.

source: is a daemon that can connect to a password protected wireless access point.
fr: est un démon qui peut se connecter à un point d'accès protégé par un mot de passe.

source: takes an SSID and a password and generates a simple configuration that _C2295_ can understand.
fr: prend un SSID et un mot de passe et génère une configuration simple que _C2295_ peut comprendre.

source: is a command line interface used to control a running _C2295_ daemon.
fr: est une interface en ligne de commandes pour contrôler le lancement du démon _C2295_.
