Repository: espindula/br-lfs
Catalog: lfs/*/chapter03/introduction.po
Languages: fr

source: This chapter includes a list of packages that need to be downloaded in order to build a basic Linux system. The listed version numbers correspond to versions of the software that are known to work, and this book is based on their use. We highly recommend against using different versions, because the build commands for one version may not work with a different version, unless the different version is specified by an LFS erratum or security advisory. The newest package versions may also have problems that require work-arounds. These work-arounds will be developed and stabilized in the development version of the book.
fr: Ce chapitre inclut une liste de paquets devant être téléchargés pour construire un système Linux de base. Les numéros de versions affichés correspondent aux versions des logiciels qui sont connues pour fonctionner, et ce livre est basé sur leur utilisation. Nous déconseillons fortement l’utilisation de versions différentes. En effet, les commandes de construction d’une version pourraient ne pas fonctionner sur une version différente, à moins que cette version différente ne soit mentionné dans un errata ou une information de sécurité. Le s versions plus récentes pourraient aussi avoir des problèmes nécessitant des contournements. Ces derniers seront développés et stabilisés dans la version de développement du livre.

source: For some packages, the release tarball and the (Git or SVN) repository snapshot tarball for that release may be published with similar file names. A release tarball contains generated files (for example, a <command>configure</command> script generated by <command>autoconf</command>), in addition to the contents of the corresponding repository snapshot. The book uses release tarballs whenever possible. Using a repository snapshot instead of a release tarball specified by the book will cause problems.
fr: Pour certains paquets, l'archive de version et l'instantané du dépôt (Git ou SVN) pour cette version peuvent être publiés avec des noms similaires. Une archive de version contient des fichiers générés (par exemple, un script <command>configure</command> généré par <command>autoconf</command>) en plus du contenu de l'instantané du dépôt. Le livre utilise les archives de version chaque fois que cela est possible. Utiliser des instantanés de dépôt au lieu des archives de version spécifiées dans le livre causera des problèmes.

source: Download locations may not always be accessible. If a download location has changed since this book was published, Google (<ulink url="https://www.google.com/"/>) provides a useful search engine for most packages. If this search is unsuccessful, try one of the alternative means of downloading at <ulink url="&lfs-root;lfs/mirrors.html#files"/>.
fr: Il se peut que les emplacements de téléchargement ne soient pas toujours accessibles. Si un emplacement de téléchargement a changé depuis la publication de ce livre, Google (<ulink url="https://www.google.com/"/>) offre un moteur de recherche utile pour la plupart des paquets. Si cette recherche est infructueuse, essayez un des autres moyens de téléchargement disponible sur <ulink url="&lfs-root;lfs/mirrors.html#files"/>.

source: Downloaded packages and patches will need to be stored somewhere that is conveniently available throughout the entire build. A working directory is also required to unpack the sources and build them. <filename class="directory">$LFS/sources</filename> can be used both as the place to store the tarballs and patches and as a working directory. By using this directory, the required elements will be located on the LFS partition and will be available during all stages of the building process.
fr: Les paquets et les correctifs téléchargés doivent être stockés à un emplacement où ils seront facilement disponibles pendant toute la construction. Un répertoire fonctionnel est aussi requis pour déballer les sources et pour les construire. Vous pouvez utiliser le répertoire <filename class="directory">$LFS/sources</filename> à la fois comme emplacement de stockage pour les archives tar et les correctifs, mais aussi comme répertoire fonctionnel. En utilisant ce répertoire, les éléments requis seront situés sur la partition&nbsp;LFS et seront disponibles à toutes les étapes du processus de construction.

source: To create this directory, execute the following command, as user <systemitem class="username">root</systemitem>, before starting the download session:
fr: Pour créer ce répertoire, lancez, en tant qu'utilisateur, la commande <systemitem class="username">root</systemitem>, avant de commencer la session de téléchargement&nbsp;:

source: Make this directory writable and sticky. <quote>Sticky</quote> means that even if multiple users have write permission on a directory, only the owner of a file can delete the file within a sticky directory. The following command will enable the write and sticky modes:
fr: Donnez le droit d'écriture et le droit sticky sur ce répertoire. <quote>Sticky</quote> signifie que même si de nombreux utilisateurs peuvent écrire sur un répertoire, seul le propriétaire du fichier peut supprimer ce fichier à l'intérieur du répertoire sticky. La commande suivante activera les droits d'écriture et sticky&nbsp;:

source: There are several ways to obtain all the necessary packages and patches to build LFS:
fr: Il y a plusieurs moyen d'obtenir tous les paquets nécessaires et les correctifs requis pour construire LFS&nbsp;:

source: The files can be downloaded individually as described in the next two sections.
fr: Vous pouvez télécharger les fichiers individuellement comme décrit dans les deux prochaines sections.

source: For stable versions of the book, a tarball of all the needed files can be downloaded from one of the mirror sites listed at <ulink url="https://www.linuxfromscratch.org/mirrors.html#files"/>.
fr: Pour les versions stables du livre, une archive de tous les fichiers nécessaires est disponible au téléchargement sur l'un des miroirs de LFS listés sur <ulink url="https://www.linuxfromscratch.org/mirrors.html#files"/>.

source: The files can be downloaded using <command>wget</command> and a wget-list as described below.
fr: Vous pouvez télécharger les fichiers avec <command>wget</command> et un wget-list comme décrit ci-dessous.

source: To download all of the packages and patches by using <ulink url="../&wget-list;">&wget-list;</ulink> as an input to the <command>wget</command> command, use:
fr: Pour télécharger tous les paquets et les correctifs en utilisant <ulink url="../&wget-list;">wget-list</ulink> comme entrée pour la commande <command>wget</command>, utilisez&nbsp;:

source: Additionally, starting with LFS-7.0, there is a separate file, <ulink url="../md5sums">md5sums</ulink>, which can be used to verify that all the correct packages are available before proceeding. Place that file in <filename class="directory">$LFS/sources</filename> and run:
fr: En outre, à partir de LFS-7.0, un fichier séparé, <ulink url="../md5sums">md5sums</ulink>, peut être utilisé pour vérifier que tous les paquets sont disponibles avant de continuer. Mettez ce fichier dans <filename class="directory">$LFS/sources</filename> et lancez&nbsp;:

source: This check can be used after retrieving the needed files with any of the methods listed above.
fr: Vous pouvez utiliser cette vérification après avoir récupéré les fichiers nécessaires avec une des méthodes proposées plus haut.

source: If the packages and patches are downloaded as a non-&root; user, these files will be owned by the user. The file system records the owner by its UID, and the UID of a normal user in the host distro is not assigned in LFS. So the files will be left owned by an unnamed UID in the final LFS system. If you won't assign the same UID for your user in the LFS system, change the owners of these files to &root; now to avoid this issue:
fr: Si vous téléchargez les paquets et les correctifs en tant qu’utilisateur non-&root;, ces fichiers appartiendront à l’utilisateur. Le système de fichiers identifie le propriétaire par son UID et l’UID d’un utilisateur normal dans la distribution hôte n’est pas attribué dans LFS. Dans ce cas, le propriétaire par défaut des fichiers sera un UID sans nom dans le système LFS final. Si vous n’attribuez pas le même UID à votre utilisateur dans le système LFS, changez dès maintenant les propriétaires de ces fichiers à &root; afin d’éviter le problème suivant&nbsp;:
