Repository: espindula/br-lfs
Catalog: lfs/*/chapter03/packages.po
Languages: fr, pt_br

source: Home page: <ulink url="&iproute2-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&iproute2-home;"/>
pt_br: Página inicial: <ulink url="&iproute2-home;"/>

source: Download: <ulink url="&iproute2-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&iproute2-url;"/>
pt_br: Transferência: <ulink url="&iproute2-url;"/>

source: MD5 sum: <literal>&iproute2-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&iproute2-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&iproute2-md5;</literal>

source: Home page: <ulink url="&jinja2-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&jinja2-home;"/>
pt_br: Página inicial: <ulink url="&jinja2-home;"/>

source: Download: <ulink url="&jinja2-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&jinja2-url;"/>
pt_br: Transferência: <ulink url="&jinja2-url;"/>

source: MD5 sum: <literal>&jinja2-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&jinja2-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&jinja2-md5;</literal>

source: Home page: <ulink url="&kbd-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&kbd-home;"/>
pt_br: Página inicial: <ulink url="&kbd-home;"/>

source: Download: <ulink url="&kbd-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&kbd-url;"/>
pt_br: Transferência: <ulink url="&kbd-url;"/>

source: MD5 sum: <literal>&kbd-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&kbd-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&kbd-md5;</literal>

source: Home page: <ulink url="&kmod-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&kmod-home;"/>
pt_br: Página inicial: <ulink url="&kmod-home;"/>

source: Download: <ulink url="&kmod-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&kmod-url;"/>
pt_br: Transferência: <ulink url="&kmod-url;"/>

source: MD5 sum: <literal>&kmod-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&kmod-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&kmod-md5;</literal>

source: Home page: <ulink url="&less-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&less-home;"/>
pt_br: Página inicial: <ulink url="&less-home;"/>

source: Download: <ulink url="&less-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&less-url;"/>
pt_br: Transferência: <ulink url="&less-url;"/>

source: MD5 sum: <literal>&less-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&less-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&less-md5;</literal>

source: Home page: <ulink url="&lfs-bootscripts-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&lfs-bootscripts-home;"/>
pt_br: Página inicial: <ulink url="&lfs-bootscripts-home;"/>

source: Download: <ulink url="&lfs-bootscripts-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&lfs-bootscripts-url;"/>
pt_br: Transferência: <ulink url="&lfs-bootscripts-url;"/>

source: MD5 sum: <literal>&lfs-bootscripts-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&lfs-bootscripts-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&lfs-bootscripts-md5;</literal>

source: Libcap (&libcap-version;) - <token>&libcap-size;</token>:
fr: Libcap (&libcap-version;) — <token>&libcap-size;</token>&nbsp;:

source: Home page: <ulink url="&libcap-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&libcap-home;"/>
pt_br: Página inicial: <ulink url="&libcap-home;"/>

source: Download: <ulink url="&libcap-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&libcap-url;"/>
pt_br: Transferência: <ulink url="&libcap-url;"/>

source: MD5 sum: <literal>&libcap-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&libcap-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&libcap-md5;</literal>

source: Home page: <ulink url="&libffi-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&libffi-home;"/>
pt_br: Página inicial: <ulink url="&libffi-home;"/>

source: Download: <ulink url="&libffi-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&libffi-url;"/>
pt_br: Transferência: <ulink url="&libffi-url;"/>

source: MD5 sum: <literal>&libffi-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&libffi-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&libffi-md5;</literal>

source: Libpipeline (&libpipeline-version;) - <token>&libpipeline-size;</token>:
fr: Libpipeline (&libpipeline-version;) — <token>&libpipeline-size;</token>&nbsp;:

source: Home page: <ulink url="&libpipeline-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&libpipeline-home;"/>
pt_br: Página inicial: <ulink url="&libpipeline-home;"/>

source: Download: <ulink url="&libpipeline-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&libpipeline-url;"/>
pt_br: Transferência: <ulink url="&libpipeline-url;"/>

source: MD5 sum: <literal>&libpipeline-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&libpipeline-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&libpipeline-md5;</literal>

source: Home page: <ulink url="&libtool-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&libtool-home;"/>
pt_br: Página inicial: <ulink url="&libtool-home;"/>

source: Download: <ulink url="&libtool-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&libtool-url;"/>
pt_br: Transferência: <ulink url="&libtool-url;"/>

source: MD5 sum: <literal>&libtool-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&libtool-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&libtool-md5;</literal>

source: Home page: <ulink url="&linux-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&linux-home;"/>
pt_br: Página inicial: <ulink url="&linux-home;"/>

source: Download: <ulink url="&linux-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&linux-url;"/>
pt_br: Transferência: <ulink url="&linux-url;"/>

source: MD5 sum: <literal>&linux-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&linux-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&linux-md5;</literal>

source: The Linux kernel is updated quite frequently, many times due to discoveries of security vulnerabilities. The latest available stable kernel version may be used, unless the errata page says otherwise.
fr: Le noyau Linux est régulièrement mis à jour, souvent suite à la découverte de nouvelles failles de sécurité. Vous devriez utiliser la version &linux-major-version;.&linux-minor-version;.x la plus récente disponible du noyau, sauf si la page d'errata indique le contraire.
pt_br: O kernel do Linux é atualizado com bastante frequência, muitas vezes devido a descobertas de vulnerabilidades de segurança. A mais recente versão estável do kernel disponível pode ser usada, a menos que a página da errata diga o contrário.

source: For users with limited speed or expensive bandwidth who wish to update the Linux kernel, a baseline version of the package and patches can be downloaded separately. This may save some time or cost for a subsequent patch level upgrade within a minor release.
fr: Pour les utilisateurs ayant un débit limité ou une bande passante chère, si vous souhaitez mettre à jour le noyau Linux, une version en ligne de commande du paquet et des correctifs peuvent être téléchargées séparément. Ceci peut économiser du temps ou de l'argent pour une mise à jour d'un niveau de correctif mineure (subsequent) à l'intérieur d'une version mineure.
pt_br: Para usuárias(os) com largura de banda de velocidade limitada ou cara que desejem atualizar o kernel Linux, uma versão da linha base do pacote e dos remendos pode ser transferida separadamente. Isso possivelmente economize algum tempo ou custo para uma posterior atualização de nível de remendo contendo um lançamento menor.

source: Home page: <ulink url="&m4-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&m4-home;"/>
pt_br: Página inicial: <ulink url="&m4-home;"/>

source: Download: <ulink url="&m4-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&m4-url;"/>
pt_br: Transferência: <ulink url="&m4-url;"/>

source: MD5 sum: <literal>&m4-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&m4-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&m4-md5;</literal>

source: Home page: <ulink url="&make-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&make-home;"/>
pt_br: Página inicial: <ulink url="&make-home;"/>

source: Download: <ulink url="&make-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&make-url;"/>
pt_br: Transferência: <ulink url="&make-url;"/>

source: MD5 sum: <literal>&make-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&make-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&make-md5;</literal>

source: Home page: <ulink url="&man-db-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&man-db-home;"/>
pt_br: Página inicial: <ulink url="&man-db-home;"/>

source: Download: <ulink url="&man-db-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&man-db-url;"/>
pt_br: Transferência: <ulink url="&man-db-url;"/>

source: MD5 sum: <literal>&man-db-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&man-db-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&man-db-md5;</literal>

source: Home page: <ulink url="&man-pages-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&man-pages-home;"/>
pt_br: Página inicial: <ulink url="&man-pages-home;"/>

source: Download: <ulink url="&man-pages-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&man-pages-url;"/>
pt_br: Transferência: <ulink url="&man-pages-url;"/>

source: MD5 sum: <literal>&man-pages-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&man-pages-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&man-pages-md5;</literal>

source: Home page: <ulink url="&markupsafe-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&markupsafe-home;"/>
pt_br: Página inicial: <ulink url="&markupsafe-home;"/>

source: Download: <ulink url="&markupsafe-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&markupsafe-url;"/>
pt_br: Transferência: <ulink url="&markupsafe-url;"/>

source: MD5 sum: <literal>&markupsafe-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&markupsafe-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&markupsafe-md5;</literal>

source: Home page: <ulink url="&meson-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&meson-home;"/>
pt_br: Página inicial: <ulink url="&meson-home;"/>

source: Download: <ulink url="&meson-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&meson-url;"/>
pt_br: Transferência: <ulink url="&meson-url;"/>

source: MD5 sum: <literal>&meson-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&meson-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&meson-md5;</literal>

source: Home page: <ulink url="&mpc-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&mpc-home;"/>
pt_br: Página inicial: <ulink url="&mpc-home;"/>

source: Download: <ulink url="&mpc-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&mpc-url;"/>
pt_br: Transferência: <ulink url="&mpc-url;"/>

source: MD5 sum: <literal>&mpc-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&mpc-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&mpc-md5;</literal>

source: MPFR (&mpfr-version;) - <token>&mpfr-size;</token>:
fr: MPFR (&mpfr-version;) — <token>&mpfr-size;</token>&nbsp;:

source: Home page: <ulink url="&mpfr-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&mpfr-home;"/>
pt_br: Página inicial: <ulink url="&mpfr-home;"/>

source: Download: <ulink url="&mpfr-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&mpfr-url;"/>
pt_br: Transferência: <ulink url="&mpfr-url;"/>

source: MD5 sum: <literal>&mpfr-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&mpfr-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&mpfr-md5;</literal>

source: Home page: <ulink url="&ncurses-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&ncurses-home;"/>
pt_br: Página inicial: <ulink url="&ncurses-home;"/>

source: Download: <ulink url="&ncurses-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&ncurses-url;"/>
pt_br: Transferência: <ulink url="&ncurses-url;"/>

source: MD5 sum: <literal>&ncurses-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&ncurses-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&ncurses-md5;</literal>

source: Home page: <ulink url="&ninja-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&ninja-home;"/>
pt_br: Página inicial: <ulink url="&ninja-home;"/>

source: Download: <ulink url="&ninja-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&ninja-url;"/>
pt_br: Transferência: <ulink url="&ninja-url;"/>

source: MD5 sum: <literal>&ninja-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&ninja-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&ninja-md5;</literal>

source: Home page: <ulink url="&openssl-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&openssl-home;"/>
pt_br: Página inicial: <ulink url="&openssl-home;"/>

source: Download: <ulink url="&openssl-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&openssl-url;"/>
pt_br: Transferência: <ulink url="&openssl-url;"/>

source: MD5 sum: <literal>&openssl-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&openssl-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&openssl-md5;</literal>

source: Home page: <ulink url="&patch-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&patch-home;"/>
pt_br: Página inicial: <ulink url="&patch-home;"/>

source: Download: <ulink url="&patch-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&patch-url;"/>
pt_br: Transferência: <ulink url="&patch-url;"/>

source: MD5 sum: <literal>&patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&patch-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&patch-md5;</literal>

source: Home page: <ulink url="&perl-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&perl-home;"/>
pt_br: Página inicial: <ulink url="&perl-home;"/>

source: Download: <ulink url="&perl-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&perl-url;"/>
pt_br: Transferência: <ulink url="&perl-url;"/>

source: MD5 sum: <literal>&perl-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&perl-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&perl-md5;</literal>

source: Pkg-config (&pkgconfig-version;) - <token>&pkgconfig-size;</token>:
fr: Pkg-config (&pkgconfig-version;) — <token>&pkgconfig-size;</token>&nbsp;:

source: Home page: <ulink url="&pkgconfig-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&pkgconfig-home;"/>
pt_br: Página inicial: <ulink url="&pkgconfig-home;"/>

source: Download: <ulink url="&pkgconfig-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&pkgconfig-url;"/>
pt_br: Transferência: <ulink url="&pkgconfig-url;"/>

source: MD5 sum: <literal>&pkgconfig-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&pkgconfig-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&pkgconfig-md5;</literal>

source: Home page: <ulink url="&procps-ng-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&procps-ng-home;"/>
pt_br: Página inicial: <ulink url="&procps-ng-home;"/>

source: Download: <ulink url="&procps-ng-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&procps-ng-url;"/>
pt_br: Transferência: <ulink url="&procps-ng-url;"/>

source: MD5 sum: <literal>&procps-ng-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&procps-ng-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&procps-ng-md5;</literal>

source: Home page: <ulink url="&psmisc-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&psmisc-home;"/>
pt_br: Página inicial: <ulink url="&psmisc-home;"/>

source: Download: <ulink url="&psmisc-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&psmisc-url;"/>
pt_br: Transferência: <ulink url="&psmisc-url;"/>

source: MD5 sum: <literal>&psmisc-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&psmisc-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&psmisc-md5;</literal>

source: Home page: <ulink url="&python-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&python-home;"/>
pt_br: Página inicial: <ulink url="&python-home;"/>

source: Download: <ulink url="&python-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&python-url;"/>
pt_br: Transferência: <ulink url="&python-url;"/>

source: MD5 sum: <literal>&python-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&python-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&python-md5;</literal>

source: Python Documentation (&python-version;) - <token>&python-docs-size;</token>:
fr: Documentation Python (&python-version;) — <token>&python-docs-size;</token>:
pt_br: Documentação do Python (&python-version;) - <token>&python-docs-size;</token>:

source: Download: <ulink url="&python-docs-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&python-docs-url;"/>
pt_br: Transferência: <ulink url="&python-docs-url;"/>

source: MD5 sum: <literal>&python-docs-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&python-docs-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&python-docs-md5;</literal>

source: Home page: <ulink url="&readline-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&readline-home;"/>
pt_br: Página inicial: <ulink url="&readline-home;"/>

source: Download: <ulink url="&readline-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&readline-url;"/>
pt_br: Transferência: <ulink url="&readline-url;"/>

source: MD5 sum: <literal>&readline-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&readline-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&readline-md5;</literal>

source: Home page: <ulink url="&sed-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&sed-home;"/>
pt_br: Página inicial: <ulink url="&sed-home;"/>

source: Download: <ulink url="&sed-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&sed-url;"/>
pt_br: Transferência: <ulink url="&sed-url;"/>

source: MD5 sum: <literal>&sed-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&sed-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&sed-md5;</literal>

source: Home page: <ulink url="&shadow-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&shadow-home;"/>
pt_br: Página inicial: <ulink url="&shadow-home;"/>

source: Download: <ulink url="&shadow-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&shadow-url;"/>
pt_br: Transferência: <ulink url="&shadow-url;"/>

source: MD5 sum: <literal>&shadow-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&shadow-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&shadow-md5;</literal>

source: Home page: <ulink url="&sysklogd-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&sysklogd-home;"/>
pt_br: Página inicial: <ulink url="&sysklogd-home;"/>

source: Download: <ulink url="&sysklogd-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&sysklogd-url;"/>
pt_br: Transferência: <ulink url="&sysklogd-url;"/>

source: MD5 sum: <literal>&sysklogd-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&sysklogd-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&sysklogd-md5;</literal>

source: Home page: <ulink url="&systemd-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&systemd-home;"/>
pt_br: Página inicial: <ulink url="&systemd-home;"/>

source: Download: <ulink url="&systemd-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&systemd-url;"/>
pt_br: Transferência: <ulink url="&systemd-url;"/>

source: MD5 sum: <literal>&systemd-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&systemd-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&systemd-md5;</literal>

source: Systemd Man Pages(&systemd-version;) - <token>&systemd-man-size;</token>:
fr: Pages de manuel de Systemd (&systemd-version;) — <token>&systemd-man-size;</token>:
pt_br: Páginas de Manual do Systemd (&systemd-version;) - <token>&systemd-man-size;</token>:

source: Download: <ulink url="&systemd-man-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&systemd-man-url;"/>
pt_br: Transferência: <ulink url="&systemd-man-url;"/>

source: MD5 sum: <literal>&systemd-man-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&systemd-man-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&systemd-man-md5;</literal>

source: The Linux From Scratch team generates its own tarball of the man pages using the systemd source. This is done in order to avoid unnecessary dependencies.
fr: L'équipe systemd de Linux From Scratch génère sa propre archive des pages de manuel à partir des sources de systemd. Cela est fait pour éviter des dépendances inutiles.
pt_br: A equipe do Linux From Scratch gera o próprio tarball dela das páginas de manual usando o fonte do systemd. Isso é feito com a finalidade de evitar dependências desnecessárias.

source: Home page: <ulink url="&sysvinit-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&sysvinit-home;"/>
pt_br: Página inicial: <ulink url="&sysvinit-home;"/>

source: Download: <ulink url="&sysvinit-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&sysvinit-url;"/>
pt_br: Transferência: <ulink url="&sysvinit-url;"/>

source: MD5 sum: <literal>&sysvinit-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&sysvinit-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&sysvinit-md5;</literal>

source: Home page: <ulink url="&tar-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&tar-home;"/>
pt_br: Página inicial: <ulink url="&tar-home;"/>

source: Download: <ulink url="&tar-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&tar-url;"/>
pt_br: Transferência: <ulink url="&tar-url;"/>

source: MD5 sum: <literal>&tar-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&tar-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&tar-md5;</literal>

source: Home page: <ulink url="&tcl-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&tcl-home;"/>
pt_br: Página inicial: <ulink url="&tcl-home;"/>

source: Download: <ulink url="&tcl-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&tcl-url;"/>
pt_br: Transferência: <ulink url="&tcl-url;"/>

source: MD5 sum: <literal>&tcl-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&tcl-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&tcl-md5;</literal>

source: Tcl Documentation (&tcl-version;) - <token>&tcl-docs-size;</token>:
fr: Documentation de Tcl (&tcl-version;) — <token>&tcl-docs-size;</token>&nbsp;:
pt_br: Documentação do Tcl (&tcl-version;) - <token>&tcl-docs-size;</token>:

source: Download: <ulink url="&tcl-docs-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&tcl-docs-url;"/>
pt_br: Transferência: <ulink url="&tcl-docs-url;"/>

source: MD5 sum: <literal>&tcl-docs-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&tcl-docs-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&tcl-docs-md5;</literal>

source: Home page: <ulink url="&texinfo-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&texinfo-home;"/>
pt_br: Página inicial: <ulink url="&texinfo-home;"/>

source: Download: <ulink url="&texinfo-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&texinfo-url;"/>
pt_br: Transferência: <ulink url="&texinfo-url;"/>

source: MD5 sum: <literal>&texinfo-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&texinfo-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&texinfo-md5;</literal>

source: Time Zone Data (&tzdata-version;) - <token>&tzdata-size;</token>:
fr: Time Zone Data (&tzdata-version;) — <token>&tzdata-size;</token>&nbsp;:
pt_br: Dados de Fuso Horário (&tzdata-version;) - <token>&tzdata-size;</token>:

source: Home page: <ulink url="&tzdata-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&tzdata-home;"/>
pt_br: Página inicial: <ulink url="&tzdata-home;"/>

source: Download: <ulink url="&tzdata-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&tzdata-url;"/>
pt_br: Transferência: <ulink url="&tzdata-url;"/>

source: MD5 sum: <literal>&tzdata-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&tzdata-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&tzdata-md5;</literal>

source: Udev-lfs Tarball (&udev-lfs-version;) - <token>&udev-lfs-size;</token>:
fr: Udev-lfs Archive Tar (&udev-lfs-version;) — <token>&udev-lfs-size;</token>&nbsp;:
pt_br: Tarball do Udev-lfs (&udev-lfs-version;) - <token>&udev-lfs-size;</token>:

source: Download: <ulink url="&udev-lfs-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&udev-lfs-url;"/>
pt_br: Transferência: <ulink url="&udev-lfs-url;"/>
