Repository: espindula/br-lfs
Catalog: lfs/*/chapter03/packages.po
Languages: fr, pt_br

source: All Packages
fr: Tous les paquets
pt_br: Todos os Pacotes

source: Read the <ulink url='&secadv;'>security advisories</ulink> before downloading packages to figure out if a newer version of any package should be used to avoid security vulnerabilities.
fr: Lisez les <ulink url='&secadv;'>annonces de sécurité</ulink> avant de télécharger les paquets pour découvrir s'il y a de nouvelles versions de paquets qui pourraient être utilisées pour éviter des problèmes de sécurité.
pt_br: Leia os <ulink url='&secadv;'>avisos de segurança</ulink> antes de transferir os pacotes para descobrir se uma versão mais nova de qualquer pacote deveria ser usada para evitar vulnerabilidades de segurança.

source: The upstream sources may remove old releases, especially when those releases contain a security vulnerability. If one URL below is not reachable, you should read the security advisories first to figure out if a newer version (with the vulnerability fixed) should be used. If not, try to download the removed package from a mirror. Although it's possible to download an old release from a mirror even if this release has been removed because of a vulnerability, it's not a good idea to use a release known to be vulnerable when building your system.
fr: Les développeurs en amont peuvent supprimer les anciennes versions surtout si elles contiennent des vulnérabilités. Si une URL ci-dessous est injoignable, vous pouvez lire les annonces de sécurité avant pour savoir si vous devriez utiliser une version plus récente (avec la vulnérabilité corrigée). Sinon, essayez de télécharger le paquets supprimé depuis un miroir. Bien qu'il soit possible de télécharger une ancienne version à partir d'un miroir même si la version a été supprimée à cause d'une vulnérabilité, nous ne vous recommandons pas d'utiliser une version connue pour être vulnérable pour construire votre système.
pt_br: Os fontes do(a) desenvolvedor(a) possivelmente removam lançamentos antigos, especialmente quando esses lançamentos contenham uma vulnerabilidade de segurança. Se um URL abaixo não estiver alcançável, [então] você deveria ler os avisos de segurança primeiro para descobrir se uma versão mais nova (com a vulnerabilidade consertada) deveria ser usada. Se não, [então] tente transferir o pacote removido a partir de um espelho. Apesar de ser possível transferir um lançamento antigo a partir de um espelho, mesmo se esse lançamento tiver sido removido por causa de uma vulnerabilidade, não é uma boa ideia usar um lançamento conhecido por ser vulnerável quando da construção do seu sistema.

source: Download or otherwise obtain the following packages:
fr: Téléchargez ou obtenez d'une autre façon les paquets suivants&nbsp;:
pt_br: Transfira ou de outra forma obtenha os seguintes pacotes:

source: Acl (&acl-version;) - <token>&acl-size;</token>:
fr: Acl (&acl-version;) — <token>&acl-size;</token>&nbsp;:

source: Home page: <ulink url="&acl-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&acl-home;"/>
pt_br: Página inicial: <ulink url="&acl-home;"/>

source: Download: <ulink url="&acl-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&acl-url;"/>
pt_br: Transferência: <ulink url="&acl-url;"/>

source: MD5 sum: <literal>&acl-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&acl-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&acl-md5;</literal>

source: Attr (&attr-version;) - <token>&attr-size;</token>:
fr: Attr (&attr-version;) — <token>&attr-size;</token>&nbsp;:

source: Home page: <ulink url="&attr-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&attr-home;"/>
pt_br: Página inicial: <ulink url="&attr-home;"/>

source: Download: <ulink url="&attr-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&attr-url;"/>
pt_br: Transferência: <ulink url="&attr-url;"/>

source: MD5 sum: <literal>&attr-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&attr-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&attr-md5;</literal>

source: Home page: <ulink url="&autoconf-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&autoconf-home;"/>
pt_br: Página inicial: <ulink url="&autoconf-home;"/>

source: Download: <ulink url="&autoconf-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&autoconf-url;"/>
pt_br: Transferência: <ulink url="&autoconf-url;"/>

source: MD5 sum: <literal>&autoconf-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&autoconf-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&autoconf-md5;</literal>

source: Home page: <ulink url="&automake-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&automake-home;"/>
pt_br: Página inicial: <ulink url="&automake-home;"/>

source: Download: <ulink url="&automake-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&automake-url;"/>
pt_br: Transferência: <ulink url="&automake-url;"/>

source: MD5 sum: <literal>&automake-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&automake-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&automake-md5;</literal>

source: SHA256 sum: <literal>&automake-sha256;</literal>
fr: Somme de contrôle SHA256&nbsp;: <literal>&automake-sha256;</literal>
pt_br: Soma de verificação SHA256: <literal>&automake-sha256;</literal>

source: Home page: <ulink url="&bash-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&bash-home;"/>
pt_br: Página inicial: <ulink url="&bash-home;"/>

source: Download: <ulink url="&bash-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&bash-url;"/>
pt_br: Transferência: <ulink url="&bash-url;"/>

source: MD5 sum: <literal>&bash-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&bash-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&bash-md5;</literal>

source: Home page: <ulink url="&bc-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&bc-home;"/>
pt_br: Página inicial: <ulink url="&bc-home;"/>

source: Download: <ulink url="&bc-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&bc-url;"/>
pt_br: Transferência: <ulink url="&bc-url;"/>

source: MD5 sum: <literal>&bc-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&bc-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&bc-md5;</literal>

source: Home page: <ulink url="&binutils-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&binutils-home;"/>
pt_br: Página inicial: <ulink url="&binutils-home;"/>

source: Download: <ulink url="&binutils-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&binutils-url;"/>
pt_br: Transferência: <ulink url="&binutils-url;"/>

source: MD5 sum: <literal>&binutils-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&binutils-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&binutils-md5;</literal>

source: Home page: <ulink url="&bison-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&bison-home;"/>
pt_br: Página inicial: <ulink url="&bison-home;"/>

source: Download: <ulink url="&bison-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&bison-url;"/>
pt_br: Transferência: <ulink url="&bison-url;"/>

source: MD5 sum: <literal>&bison-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&bison-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&bison-md5;</literal>

source: Download: <ulink url="&bzip2-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&bzip2-url;"/>
pt_br: Transferência: <ulink url="&bzip2-url;"/>

source: MD5 sum: <literal>&bzip2-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&bzip2-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&bzip2-md5;</literal>

source: Check (&check-version;) - <token>&check-size;</token>:
fr: Check (&check-version;) — <token>&check-size;</token>&nbsp;:

source: Home page: <ulink url="&check-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&check-home;"/>
pt_br: Página inicial: <ulink url="&check-home;"/>

source: Download: <ulink url="&check-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&check-url;"/>
pt_br: Transferência: <ulink url="&check-url;"/>

source: MD5 sum: <literal>&check-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&check-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&check-md5;</literal>

source: Home page: <ulink url="&coreutils-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&coreutils-home;"/>
pt_br: Página inicial: <ulink url="&coreutils-home;"/>

source: Download: <ulink url="&coreutils-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&coreutils-url;"/>
pt_br: Transferência: <ulink url="&coreutils-url;"/>

source: MD5 sum: <literal>&coreutils-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&coreutils-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&coreutils-md5;</literal>

source: Home page: <ulink url="&dbus-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&dbus-home;"/>
pt_br: Página inicial: <ulink url="&dbus-home;"/>

source: Download: <ulink url="&dbus-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&dbus-url;"/>
pt_br: Transferência: <ulink url="&dbus-url;"/>

source: MD5 sum: <literal>&dbus-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&dbus-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&dbus-md5;</literal>

source: Home page: <ulink url="&dejagnu-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&dejagnu-home;"/>
pt_br: Página inicial: <ulink url="&dejagnu-home;"/>

source: Download: <ulink url="&dejagnu-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&dejagnu-url;"/>
pt_br: Transferência: <ulink url="&dejagnu-url;"/>

source: MD5 sum: <literal>&dejagnu-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&dejagnu-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&dejagnu-md5;</literal>

source: Home page: <ulink url="&diffutils-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&diffutils-home;"/>
pt_br: Página inicial: <ulink url="&diffutils-home;"/>

source: Download: <ulink url="&diffutils-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&diffutils-url;"/>
pt_br: Transferência: <ulink url="&diffutils-url;"/>

source: MD5 sum: <literal>&diffutils-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&diffutils-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&diffutils-md5;</literal>

source: Home page: <ulink url="&e2fsprogs-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&e2fsprogs-home;"/>
pt_br: Página inicial: <ulink url="&e2fsprogs-home;"/>

source: Download: <ulink url="&e2fsprogs-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&e2fsprogs-url;"/>
pt_br: Transferência: <ulink url="&e2fsprogs-url;"/>

source: MD5 sum: <literal>&e2fsprogs-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&e2fsprogs-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&e2fsprogs-md5;</literal>

source: Home page: <ulink url="&elfutils-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&elfutils-home;"/>
pt_br: Página inicial: <ulink url="&elfutils-home;"/>

source: Download: <ulink url="&elfutils-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&elfutils-url;"/>
pt_br: Transferência: <ulink url="&elfutils-url;"/>

source: MD5 sum: <literal>&elfutils-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&elfutils-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&elfutils-md5;</literal>

source: Download: <ulink url="&eudev-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&eudev-url;"/>
pt_br: Transferência: <ulink url="&eudev-url;"/>

source: MD5 sum: <literal>&eudev-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&eudev-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&eudev-md5;</literal>

source: Expat (&expat-version;) - <token>&expat-size;</token>:
fr: Expat (&expat-version;) — <token>&expat-size;</token>&nbsp;:

source: Home page: <ulink url="&expat-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&expat-home;"/>
pt_br: Página inicial: <ulink url="&expat-home;"/>

source: Download: <ulink url="&expat-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&expat-url;"/>
pt_br: Transferência: <ulink url="&expat-url;"/>

source: MD5 sum: <literal>&expat-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&expat-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&expat-md5;</literal>

source: Home page: <ulink url="&expect-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&expect-home;"/>
pt_br: Página inicial: <ulink url="&expect-home;"/>

source: Download: <ulink url="&expect-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&expect-url;"/>
pt_br: Transferência: <ulink url="&expect-url;"/>

source: MD5 sum: <literal>&expect-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&expect-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&expect-md5;</literal>

source: Home page: <ulink url="&file-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&file-home;"/>
pt_br: Página inicial: <ulink url="&file-home;"/>

source: Download: <ulink url="&file-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&file-url;"/>
pt_br: Transferência: <ulink url="&file-url;"/>

source: MD5 sum: <literal>&file-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&file-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&file-md5;</literal>

source: Home page: <ulink url="&findutils-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&findutils-home;"/>
pt_br: Página inicial: <ulink url="&findutils-home;"/>

source: Download: <ulink url="&findutils-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&findutils-url;"/>
pt_br: Transferência: <ulink url="&findutils-url;"/>

source: MD5 sum: <literal>&findutils-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&findutils-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&findutils-md5;</literal>

source: Home page: <ulink url="&flex-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&flex-home;"/>
pt_br: Página inicial: <ulink url="&flex-home;"/>

source: Download: <ulink url="&flex-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&flex-url;"/>
pt_br: Transferência: <ulink url="&flex-url;"/>

source: MD5 sum: <literal>&flex-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&flex-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&flex-md5;</literal>

source: Home page: <ulink url="&flit-core-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&flit-core-home;"/>
pt_br: Página inicial: <ulink url="&flit-core-home;"/>

source: Download: <ulink url="&flit-core-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&flit-core-url;"/>
pt_br: Transferência: <ulink url="&flit-core-url;"/>

source: MD5 sum: <literal>&flit-core-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&flit-core-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&flit-core-md5;</literal>

source: Home page: <ulink url="&gawk-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&gawk-home;"/>
pt_br: Página inicial: <ulink url="&gawk-home;"/>

source: Download: <ulink url="&gawk-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&gawk-url;"/>
pt_br: Transferência: <ulink url="&gawk-url;"/>

source: MD5 sum: <literal>&gawk-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&gawk-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&gawk-md5;</literal>

source: Home page: <ulink url="&gcc-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&gcc-home;"/>
pt_br: Página inicial: <ulink url="&gcc-home;"/>

source: Download: <ulink url="&gcc-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&gcc-url;"/>
pt_br: Transferência: <ulink url="&gcc-url;"/>

source: MD5 sum: <literal>&gcc-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&gcc-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&gcc-md5;</literal>

source: SHA256 sum: <literal>&gcc-sha256;</literal>
fr: Somme de contrôle SHA256&nbsp;: <literal>&gcc-sha256;</literal>
pt_br: Soma de verificação SHA256: <literal>&gcc-sha256;</literal>

source: GDBM (&gdbm-version;) - <token>&gdbm-size;</token>:
fr: GDBM (&gdbm-version;) — <token>&gdbm-size;</token>&nbsp;:

source: Home page: <ulink url="&gdbm-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&gdbm-home;"/>
pt_br: Página inicial: <ulink url="&gdbm-home;"/>

source: Download: <ulink url="&gdbm-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&gdbm-url;"/>
pt_br: Transferência: <ulink url="&gdbm-url;"/>

source: MD5 sum: <literal>&gdbm-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&gdbm-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&gdbm-md5;</literal>

source: Home page: <ulink url="&gettext-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&gettext-home;"/>
pt_br: Página inicial: <ulink url="&gettext-home;"/>

source: Download: <ulink url="&gettext-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&gettext-url;"/>
pt_br: Transferência: <ulink url="&gettext-url;"/>

source: MD5 sum: <literal>&gettext-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&gettext-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&gettext-md5;</literal>

source: Glibc (&glibc-version;) - <token>&glibc-size;</token>:
fr: Glibc (&glibc-version;) — <token>&glibc-size;</token>&nbsp;:

source: Home page: <ulink url="&glibc-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&glibc-home;"/>
pt_br: Página inicial: <ulink url="&glibc-home;"/>

source: Download: <ulink url="&glibc-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&glibc-url;"/>
pt_br: Transferência: <ulink url="&glibc-url;"/>

source: MD5 sum: <literal>&glibc-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&glibc-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&glibc-md5;</literal>

source: The Glibc developers maintain a <ulink url='https://sourceware.org/git/?p=glibc.git;a=shortlog;h=refs/heads/release/&glibc-version;/master'>Git branch</ulink> containing patches considered worthy for Glibc-&glibc-version; but unfortunately developed after Glibc-&glibc-version; release. The LFS editors will issue a security advisory if any security fix is added into the branch, but no actions will be taken for other newly added patches. You may review the patches yourself and incorporate some patches if you consider them important.
fr: Les développeurs de Glibc maintiennent une <ulink url='https://sourceware.org/git/?p=glibc.git;a=shortlog;h=refs/heads/release/&glibc-version;/master'>branche Git</ulink> qui contient des correctifs jugés utiles pour Glibc-&glibc-version;, mais malheureusement développés après la publication de &glibc-version;. Les éditeurs de LFS publieront un avis de sécurité si une correction de sécurité est ajoutée à la branche, mais aucune action ne sera entreprise pour les autres correctifs ajoutés. Vous pouvez relire les correctifs vous-même et les incorporer si vous les jugez importants.
pt_br: Os(As) desenvolvedores(as) da Glibc mantém uma <ulink url='https://sourceware.org/git/?p=glibc.git;a=shortlog;h=refs/heads/release/&glibc-version;/master'>ramificação Git</ulink> contendo remendos considerados valiosos para a Glibc-&glibc-version;, porém infelizmente desenvolvidos depois do lançamento da Glibc-&glibc-version;. Os(As) editores(as) do LFS emitirão um aviso de segurança se alguma correção de segurança for acrescentada na ramificação, porém nenhuma ação será tomada para outros remendos acrescentados recentemente. Você possivelmente reveja os remendos você mesmo(a) e incorpore alguns remendos se você os considerar importantes.

source: Home page: <ulink url="&gmp-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&gmp-home;"/>
pt_br: Página inicial: <ulink url="&gmp-home;"/>

source: Download: <ulink url="&gmp-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&gmp-url;"/>
pt_br: Transferência: <ulink url="&gmp-url;"/>

source: MD5 sum: <literal>&gmp-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&gmp-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&gmp-md5;</literal>

source: Gperf (&gperf-version;) - <token>&gperf-size;</token>:
fr: Gperf (&gperf-version;) — <token>&gperf-size;</token>&nbsp;:

source: Home page: <ulink url="&gperf-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&gperf-home;"/>
pt_br: Página inicial: <ulink url="&gperf-home;"/>

source: Download: <ulink url="&gperf-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&gperf-url;"/>
pt_br: Transferência: <ulink url="&gperf-url;"/>

source: MD5 sum: <literal>&gperf-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&gperf-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&gperf-md5;</literal>

source: Home page: <ulink url="&grep-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&grep-home;"/>
pt_br: Página inicial: <ulink url="&grep-home;"/>

source: Download: <ulink url="&grep-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&grep-url;"/>
pt_br: Transferência: <ulink url="&grep-url;"/>

source: MD5 sum: <literal>&grep-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&grep-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&grep-md5;</literal>

source: Home page: <ulink url="&groff-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&groff-home;"/>
pt_br: Página inicial: <ulink url="&groff-home;"/>

source: Download: <ulink url="&groff-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&groff-url;"/>
pt_br: Transferência: <ulink url="&groff-url;"/>

source: MD5 sum: <literal>&groff-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&groff-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&groff-md5;</literal>

source: Home page: <ulink url="&grub-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&grub-home;"/>
pt_br: Página inicial: <ulink url="&grub-home;"/>

source: Download: <ulink url="&grub-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&grub-url;"/>
pt_br: Transferência: <ulink url="&grub-url;"/>

source: MD5 sum: <literal>&grub-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&grub-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&grub-md5;</literal>

source: Home page: <ulink url="&gzip-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&gzip-home;"/>
pt_br: Página inicial: <ulink url="&gzip-home;"/>

source: Download: <ulink url="&gzip-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&gzip-url;"/>
pt_br: Transferência: <ulink url="&gzip-url;"/>

source: MD5 sum: <literal>&gzip-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&gzip-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&gzip-md5;</literal>

source: Home page: <ulink url="&iana-etc-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&iana-etc-home;"/>
pt_br: Página inicial: <ulink url="&iana-etc-home;"/>

source: Download: <ulink url="&iana-etc-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&iana-etc-url;"/>
pt_br: Transferência: <ulink url="&iana-etc-url;"/>

source: MD5 sum: <literal>&iana-etc-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&iana-etc-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&iana-etc-md5;</literal>

source: Home page: <ulink url="&inetutils-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&inetutils-home;"/>
pt_br: Página inicial: <ulink url="&inetutils-home;"/>

source: Download: <ulink url="&inetutils-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&inetutils-url;"/>
pt_br: Transferência: <ulink url="&inetutils-url;"/>

source: MD5 sum: <literal>&inetutils-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&inetutils-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&inetutils-md5;</literal>

source: SHA256 sum: <literal>&inetutils-sha256;</literal>
fr: Somme de contrôle SHA256&nbsp;: <literal>&inetutils-sha256;</literal>
pt_br: Soma de verificação SHA256: <literal>&inetutils-sha256;</literal>

source: Intltool (&intltool-version;) - <token>&intltool-size;</token>:
fr: Intltool (&intltool-version;) — <token>&intltool-size;</token>&nbsp;:

source: Home page: <ulink url="&intltool-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&intltool-home;"/>
pt_br: Página inicial: <ulink url="&intltool-home;"/>

source: Download: <ulink url="&intltool-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&intltool-url;"/>
pt_br: Transferência: <ulink url="&intltool-url;"/>

source: MD5 sum: <literal>&intltool-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&intltool-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&intltool-md5;</literal>
