Repository: espindula/br-lfs
Catalog: lfs/*/chapter03/packages.po
Languages: fr, pt_br

source: MD5 sum: <literal>&udev-lfs-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&udev-lfs-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&udev-lfs-md5;</literal>

source: Home page: <ulink url="&util-linux-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&util-linux-home;"/>
pt_br: Página inicial: <ulink url="&util-linux-home;"/>

source: Download: <ulink url="&util-linux-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&util-linux-url;"/>
pt_br: Transferência: <ulink url="&util-linux-url;"/>

source: MD5 sum: <literal>&util-linux-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&util-linux-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&util-linux-md5;</literal>

source: Home page: <ulink url="&vim-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&vim-home;"/>
pt_br: Página inicial: <ulink url="&vim-home;"/>

source: Download: <ulink url="&vim-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&vim-url;"/>
pt_br: Transferência: <ulink url="&vim-url;"/>

source: MD5 sum: <literal>&vim-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&vim-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&vim-md5;</literal>

source: The version of vim changes daily. To get the latest version, go to <ulink url="https://github.com/vim/vim/releases"> https://github.com/vim/vim/tags</ulink>.
fr: La version de vim change tous les jours. Pour récupérer la dernière version, visitez <ulink url="https://github.com/vim/vim/releases">https://github.com/vim/vim/tags</ulink>.
pt_br: A versão do vim muda diariamente. Para obter a versão mais recente, vá para <ulink url="https://github.com/vim/vim/releases"> https://github.com/vim/vim/tags</ulink>.

source: Wheel (&wheel-version;) - <token>&wheel-size;</token>:
fr: Wheel (&wheel-version;) — <token>&wheel-size;</token>&nbsp;:

source: Home page: <ulink url="&wheel-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&wheel-home;"/>
pt_br: Página inicial: <ulink url="&wheel-home;"/>

source: Download: <ulink url="&wheel-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&wheel-url;"/>
pt_br: Transferência: <ulink url="&wheel-url;"/>

source: MD5 sum: <literal>&wheel-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&wheel-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&wheel-md5;</literal>

source: XML::Parser (&xml-parser-version;) - <token>&xml-parser-size;</token>:
fr: XML::Parser (&xml-parser-version;) — <token>&xml-parser-size;</token>&nbsp;:

source: Home page: <ulink url="&xml-parser-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&xml-parser-home;"/>
pt_br: Página inicial: <ulink url="&xml-parser-home;"/>

source: Download: <ulink url="&xml-parser-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&xml-parser-url;"/>
pt_br: Transferência: <ulink url="&xml-parser-url;"/>

source: MD5 sum: <literal>&xml-parser-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&xml-parser-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&xml-parser-md5;</literal>

source: Home page: <ulink url="&xz-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&xz-home;"/>
pt_br: Página inicial: <ulink url="&xz-home;"/>

source: Download: <ulink url="&xz-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&xz-url;"/>
pt_br: Transferência: <ulink url="&xz-url;"/>

source: MD5 sum: <literal>&xz-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&xz-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&xz-md5;</literal>

source: Home page: <ulink url="&zlib-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&zlib-home;"/>
pt_br: Página inicial: <ulink url="&zlib-home;"/>

source: Download: <ulink url="&zlib-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&zlib-url;"/>
pt_br: Transferência: <ulink url="&zlib-url;"/>

source: MD5 sum: <literal>&zlib-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&zlib-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&zlib-md5;</literal>

source: Zstd (&zstd-version;) - <token>&zstd-size;</token>:
fr: Zstd (&zstd-version;) — <token>&zstd-size;</token>&nbsp;:

source: Home page: <ulink url="&zstd-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&zstd-home;"/>
pt_br: Página inicial: <ulink url="&zstd-home;"/>

source: Download: <ulink url="&zstd-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&zstd-url;"/>
pt_br: Transferência: <ulink url="&zstd-url;"/>

source: MD5 sum: <literal>&zstd-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&zstd-md5;</literal>
pt_br: Soma de verificação MD5: <literal>&zstd-md5;</literal>

source: Total size of these packages: about <returnvalue/>
fr: Taille totale de ces paquets&nbsp;: environ <returnvalue/>
pt_br: Tamanho total desses pacotes: cerca de <returnvalue/>
