Repository: espindula/br-lfs
Catalog: lfs/*/chapter03/patches.po
Languages: fr, zh_cn

source: Needed Patches
fr: Correctifs requis
zh_cn: 必要的补丁

source: In addition to the packages, several patches are also required. These patches correct any mistakes in the packages that should be fixed by the maintainer. The patches also make small modifications to make the packages easier to work with. The following patches will be needed to build an LFS system:
fr: En plus des paquets, quelques correctifs sont aussi requis. Ces correctifs corrigent certaines erreurs contenues dans les paquets, ces erreurs devraient être corrigées par le mainteneur. Les correctifs font aussi quelques modifications pour faciliter l'utilisation des paquets. Les correctifs suivants seront nécessaires pour construire un système LFS&nbsp;:
zh_cn: 除了软件包外，我们还需要一些补丁。有些补丁解决了本应由维护者修复的问题，有些则对软件包进行微小的修改，使得它们更容易使用。构建 LFS 系统需要下列补丁：

source: Bzip2 Documentation Patch - <token>&bzip2-docs-patch-size;</token>:
fr: Bzip2 Correctif documentation — <token>&bzip2-docs-patch-size;</token>&nbsp;:
zh_cn: Bzip2 文档补丁 - <token>&bzip2-docs-patch-size;</token>:

source: Download: <ulink url="&patches-root;&bzip2-docs-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&bzip2-docs-patch;"/>
zh_cn: 下载地址：<ulink url="&patches-root;&bzip2-docs-patch;"/>

source: MD5 sum: <literal>&bzip2-docs-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&bzip2-docs-patch-md5;</literal>
zh_cn: MD5 校验和：<literal>&bzip2-docs-patch-md5;</literal>

source: Coreutils Internationalization Fixes Patch - <token>&coreutils-i18n-patch-size;</token>:
fr: Coreutils Correctif pour l'internationalisation — <token>&coreutils-i18n-patch-size;</token>:
zh_cn: Coreutils 国际化修复补丁 - <token>&coreutils-i18n-patch-size;</token>:

source: Download: <ulink url="&patches-root;&coreutils-i18n-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&coreutils-i18n-patch;"/>
zh_cn: 下载地址：<ulink url="&patches-root;&coreutils-i18n-patch;"/>

source: MD5 sum: <literal>&coreutils-i18n-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&coreutils-i18n-patch-md5;</literal>
zh_cn: MD5 校验和：<literal>&coreutils-i18n-patch-md5;</literal>

source: Glibc FHS Patch - <token>&glibc-fhs-patch-size;</token>:
fr: Glibc correctif FHS — <token>&glibc-fhs-patch-size;</token>&nbsp;:
zh_cn: Glibc FHS 补丁 - <token>&glibc-fhs-patch-size;</token>:

source: Download: <ulink url="&patches-root;&glibc-fhs-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&glibc-fhs-patch;"/>
zh_cn: 下载地址：<ulink url="&patches-root;&glibc-fhs-patch;"/>

source: MD5 sum: <literal>&glibc-fhs-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&glibc-fhs-patch-md5;</literal>
zh_cn: MD5 校验和：<literal>&glibc-fhs-patch-md5;</literal>

source: Kbd Backspace/Delete Fix Patch - <token>&kbd-backspace-patch-size;</token>:
fr: Correctif réparant Kdb Backspace/Delete — <token>&kbd-backspace-patch-size;</token>&nbsp;:
zh_cn: Kbd 退格/删除修复补丁 - <token>&kbd-backspace-patch-size;</token>:

source: Download: <ulink url="&patches-root;&kbd-backspace-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&kbd-backspace-patch;"/>
zh_cn: 下载地址：<ulink url="&patches-root;&kbd-backspace-patch;"/>

source: MD5 sum: <literal>&kbd-backspace-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&kbd-backspace-patch-md5;</literal>
zh_cn: MD5 校验和：<literal>&kbd-backspace-patch-md5;</literal>

source: Download: <ulink url="&patches-root;&readline-fixes-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&readline-fixes-patch;"/>

source: MD5 sum: <literal>&readline-fixes-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&readline-fixes-patch-md5;</literal>

source: Sysvinit Consolidated Patch - <token>&sysvinit-consolidated-patch-size;</token>:
fr: Sysvinit Correctif consolidé — <token>&sysvinit-consolidated-patch-size;</token>:
zh_cn: Sysvinit 累积更新补丁 - <token>&sysvinit-consolidated-patch-size;</token>:

source: Download: <ulink url="&patches-root;&sysvinit-consolidated-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&sysvinit-consolidated-patch;"/>
zh_cn: 下载地址：<ulink url="&patches-root;&sysvinit-consolidated-patch;"/>

source: MD5 sum: <literal>&sysvinit-consolidated-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&sysvinit-consolidated-patch-md5;</literal>
zh_cn: MD5 校验和：<literal>&sysvinit-consolidated-patch-md5;</literal>

source: Zstd Upstream Fixes Patch - <token>&zstd-upstream-fixes-patch-size;</token>:
fr: Corrections en amont de Zstd — <token>&zstd-upstream-fixes-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&zstd-upstream-fixes-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&zstd-upstream-fixes-patch;"/>

source: MD5 sum: <literal>&zstd-upstream-fixes-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&zstd-upstream-fixes-patch-md5;</literal>

source: Total size of these patches: about <returnvalue/>
fr: Taille totale de ces correctifs&nbsp;: environ <returnvalue/>
zh_cn: 以上补丁的总大小：约 <returnvalue/>

source: In addition to the above required patches, there exist a number of optional patches created by the LFS community. These optional patches solve minor problems or enable functionality that is not enabled by default. Feel free to peruse the patches database located at <ulink url="&lfs-root;patches/downloads/"/> and acquire any additional patches to suit your system needs.
fr: En plus des correctifs requis ci-dessus, il existe un certain nombre de correctifs optionnels créés par la communauté LFS. Ces correctifs résolvent des problèmes mineurs ou activent des fonctionnalités qui ne sont pas disponibles par défaut. Vous pouvez consulter la base de données des correctifs à loisir sur <ulink url="&lfs-root;patches/downloads/"/> et vous pouvez récupérer tout correctif supplémentaire correspondant aux besoins de votre système.
zh_cn: 除了上述必要的补丁外，LFS 社区还创建了一些可选补丁。它们有的解决了一些微小的问题，有的启用了一些默认没有启用的功能。您可以浏览 <ulink url="&lfs-root;patches/downloads/"/> 查询 LFS 补丁库，并获取各种适合您需求的补丁。
