Repository: espindula/br-lfs
Catalog: lfs/*/chapter01/askforhelp.po
Languages: fr, pt_br

source: Help
fr: Aide
pt_br: Ajuda

source: If an issue or a question is encountered while working through this book, please check the FAQ page at <ulink url="&faq-root;#generalfaq"/>. Questions are often already answered there. If your question is not answered on this page, try to find the source of the problem. The following hint will give you some guidance for troubleshooting: <ulink url="&hints-root;errors.txt"/>.
fr: Si vous rencontrez une erreur ou si vous vous posez une question en travaillant avec ce livre, merci de vérifier la FAQ sur <ulink url="&faq-root;#generalfaq"/>. Les questions y ont souvent des réponses. Si votre question n'a pas sa réponse sur cette page, essayez de trouver la source du problème. L'astuce suivante vous donnera quelques conseils pour cela&nbsp;: <ulink url="http://www.fr.linuxfromscratch.org/view/astuces/errors.txt"/>.

source: If you cannot find your problem listed in the FAQ, search the mailing lists at <ulink url="&lfs-root;search.html"/>.
fr: Si votre problème n'est pas listé dans la FAQ, recherchez dans les listes de discussion sur <ulink url="&lfs-root;search.html"/>.
pt_br: Se você não conseguir achar seu problema listado nas Perguntas Frequentes, [então] procure nas listas de discussão em <ulink url="&lfs-root;search.html"/>.

source: We also have a wonderful LFS community that is willing to offer assistance through the mailing lists and IRC (see the <xref linkend="ch-intro-resources"/> section of this book). However, we get several support questions every day and many of them can be easily answered by going to the FAQ and by searching the mailing lists first. So, for us to offer the best assistance possible, you need to do some research on your own first. That allows us to focus on the more unusual support needs. If your searches do not produce a solution, please include all relevant information (mentioned below) in your request for help.
fr: Nous avons aussi une formidable communauté LFS, volontaire pour offrir une assistance via les listes de discussion et IRC (voir la section <xref linkend="ch-intro-resources"/> de ce livre). Néanmoins, nous recevons plusieurs questions de support chaque jour et un grand nombre d'entre elles ont une réponse dans la FAQ et dans les listes de discussions. Pour que nous puissions vous offrir la meilleure assistance possible, vous devez faire quelques recherches de votre côté. Ceci nous permet de nous concentrer sur les besoins inhabituels. Si vos recherches ne vous apportent aucune solution, merci d'inclure toutes les informations adéquates (mentionnées ci-dessous) dans votre demande d'assistance.

source: Things to Mention
fr: Éléments à mentionner
pt_br: Coisas a Mencionar

source: Apart from a brief explanation of the problem being experienced, the essential things to include in any request for help are:
fr: À part une brève explication du problème, voici les éléments essentiels à inclure dans votre demande d'aide&nbsp;:

source: The version of the book being used (in this case <phrase revision="sysv">&version;</phrase> <phrase revision="systemd">&versiond;</phrase>)
fr: La version du livre utilisée (ici <phrase revision="sysv">&version;</phrase> <phrase revision="systemd">&versiond;</phrase>)

source: The host distribution and version being used to create LFS
fr: La distribution hôte (et sa version) que vous utilisez pour créer LFS
pt_br: A distribuição anfitriã e versão sendo usada para criar o LFS

source: The output from the <xref linkend='version-check'/> script
fr: La sortie du script <xref linkend='version-check'/>
pt_br: A saída gerada originária do script <xref linkend='version-check'/>

source: The package or section the problem was encountered in
fr: Le paquet ou la section où le problème a été rencontré
pt_br: O pacote ou seção onde o problema foi encontrado

source: The exact error message or symptom being received
fr: Le message d'erreur exact ou le symptôme reçu

source: Note whether you have deviated from the book at all
fr: Notez si vous avez dévié du livre
pt_br: Observação se você tiver se desviado do livro afinal

source: Deviating from this book does <emphasis>not</emphasis> mean that we will not help you. After all, LFS is about personal preference. Being upfront about any changes to the established procedure helps us evaluate and determine possible causes of your problem.
fr: Dévier du livre ne signifie <emphasis>pas</emphasis> que nous n'allons pas vous aider. Après tout, LFS est basé sur les préférences de l'utilisateur. Nous préciser les modifications effectuées sur la procédure établie nous aide à évaluer et à déterminer les causes probables de votre problème.

source: Configure Script Problems
fr: Problèmes avec le script configure
pt_br: Problemas do Script de Configuração

source: If something goes wrong while running the <command>configure</command> script, review the <filename>config.log</filename> file. This file may contain errors encountered during <command>configure</command> which were not printed to the screen. Include the <emphasis>relevant</emphasis> lines if you need to ask for help.
fr: Si quelque chose se passe mal lors de l'exécution du script <command>configure</command>, regardez le fichier <filename>config.log</filename> Ce fichier pourrait contenir les erreurs rencontrées lors de l'exécution de <command>configure</command> qui n'ont pas été affichées à l'écran. Incluez les lignes <emphasis>intéressantes</emphasis> si vous avez besoin d'aide.
pt_br: Se algo der errado quando executar o script <command>configure</command>, [então] revise o arquivo <filename>config.log</filename>. Esse arquivo possivelmente contenha erros encontrados durante o <command>configure</command> os quais não foram exibidos na tela. Inclua as linhas <emphasis>relevantes</emphasis> se você precisar pedir ajuda.

source: Compilation Problems
fr: Problèmes de compilation
pt_br: Problemas de Compilação

source: Both the screen output and the contents of various files are useful in determining the cause of compilation problems. The screen output from the <command>configure</command> script and the <command>make</command> run can be helpful. It is not necessary to include the entire output, but do include enough of the relevant information. Below is an example of the type of information to include from the screen output from <command>make</command>:
fr: L'affichage écran et le contenu de différents fichiers sont utiles pour déterminer la cause des problèmes de compilation. L'affichage de l'écran du script <command>configure</command> et du <command>make</command> peuvent être utiles. Il n'est pas nécessaire d'inclure la sortie complète mais incluez suffisamment d'informations intéressantes. Ci-dessous se trouve un exemple de type d'informations à inclure à partir de l'affichage écran de <command>make</command>&nbsp;:

source: In this case, many people would just include the bottom section:
fr: Dans ce cas, beaucoup de personnes n'inclueraient que la section du bas
pt_br: Nesse caso, muitas pessoas incluiriam apenas a seção final:

source: This is not enough information to properly diagnose the problem because it only notes that something went wrong, not <emphasis>what</emphasis> went wrong. The entire section, as in the example above, is what should be saved because it includes the command that was executed and the associated error message(s).
fr: Cette information n'est pas suffisante pour diagnostiquer correctement le problème car il note seulement que quelque chose s'est mal passé, pas <emphasis>ce</emphasis> qui s'est mal passé. La section entière, comme dans l'exemple ci-dessus, est ce qui devrait être sauvée car la commande exécutée et le(s) message(s) d'erreur associé(s) sont inclus.

source: An excellent article about asking for help on the Internet is available online at <ulink url="http://catb.org/~esr/faqs/smart-questions.html"/>. Read and follow the hints in this document to increase the likelihood of getting the help you need.
fr: Un excellent article sur les demandes d'aide sur Internet est disponible en ligne sur <ulink url="http://www.gnurou.org/writing/smartquestionsfr"/>. Lisez et suivez les astuces de ce document pour accroître vos chances d'obtenir l'aide dont vous avez besoin.

source: If an issue or a question is encountered while working through this book, please check the FAQ page at <ulink url="&faq-root;#generalfaq"/>. Questions are often already answered there. If your question is not answered on that page, try to find the source of the problem. The following hint will give you some guidance for troubleshooting: <ulink url="&hints-root;errors.txt"/>.
pt_br: Se um problema ou uma pergunta for encontrado durante o trabalho ao longo deste livro, [então], por favor, verifique a página de Perguntas Frequentes em <ulink url="&faq-root;#generalfaq"/>. Perguntas frequentemente já estão respondidas lá. Se sua pergunta não estiver respondida nessa página, [então], por favor, tente encontrar a origem do problema. A dica seguinte te dará alguma orientação com relação à resolução de problemas: <ulink url="&hints-root;errors.txt"/>.

source: We also have a wonderful LFS community that is willing to offer assistance through the mailing lists and IRC (see the <xref linkend="ch-intro-resources"/> section of this book). However, we get several support questions every day, and many of them could have been easily answered by going to the FAQ or by searching the mailing lists first. So, for us to offer the best assistance possible, you should first do some research on your own. That allows us to focus on the more unusual support needs. If your searches do not produce a solution, please include all the relevant information (mentioned below) in your request for help.
pt_br: Nós também temos uma comunidade LFS maravilhosa que está disposta a oferecer assistência por meio das listas de discussão e IRC (veja a seção <xref linkend="ch-intro-resources"/> deste livro). Entretanto, nós temos várias perguntas de suporte todos os dias e muitas delas poderiam ter sido facilmente respondidas indo para as Perguntas Frequentes ou procurando nas listas de discussão primeiro. Então, para que nós possamos oferecer a melhor assistência possível, você deveria primeiro fazer alguma pesquisa por conta própria. Isso nos permite focar nas necessidades menos usuais de suporte. Se suas buscas não produzirem uma solução, [então], por favor, inclua todas as informações relevantes (mencionadas abaixo) no seu pedido por ajuda.

source: Apart from a brief explanation of the problem being experienced, any request for help should include these essential things:
pt_br: Além de uma breve explicação do problema sendo vivenciado, qualquer solicitação por ajuda deveria incluir estas coisas essenciais:

source: The version of the book being used (in this case &version;)
pt_br: A versão do livro sendo usada (neste caso &version;)

source: The exact error message, or a clear description of the problem
pt_br: A mensagem exata do erro ou uma descrição clara do problema

source: Deviating from this book does <emphasis>not</emphasis> mean that we will not help you. After all, LFS is about personal preference. Being up-front about any changes to the established procedure helps us evaluate and determine possible causes of your problem.
pt_br: Desviar-se deste livro <emphasis>não</emphasis> significa que nós não vamos te ajudar. Afinal de contas, o LFS é acerca de preferência pessoal. Ser sincero a respeito de quaisquer mudanças no procedimento estabelecido nos ajuda a avaliar e determinar possíveis causas do seu problema.

source: Both the screen output and the contents of various files are useful in determining the cause of compilation problems. The screen output from the <command>configure</command> script and the <command>make</command> run can be helpful. It is not necessary to include the entire output, but do include all of the relevant information. Here is an example of the type of information to include from the <command>make</command> screen output.
pt_br: Tanto a saída gerada da tela quanto o conteúdo de vários arquivos são úteis para determinar a causa de problemas de compilação. A saída gerada da tela originária do script <command>configure</command> e a execução do <command>make</command> podem ser úteis. Não é necessário incluir a saída gerada inteira, mas inclua toda a informação relevante. Aqui está um exemplo do tipo de informação a incluir a partir da saída gerada de tela do <command>make</command>.

source: This is not enough information to diagnose the problem, because it only notes that something went wrong, not <emphasis>what</emphasis> went wrong. The entire section, as in the example above, is what should be saved because it includes the command that was executed and all the associated error messages.
pt_br: Essa não é informação suficiente para diagnosticar o problema, pois essa linha apenas mostra que algo deu errado, não <emphasis>o que</emphasis> deu errado. A seção inteira, como no exemplo acima, é o que deveria ser salva, porque ela inclui o comando que foi executado e todas as mensagens de erro associadas.

source: An excellent article about asking for help on the Internet is available online at <ulink url="http://catb.org/~esr/faqs/smart-questions.html"/>. Read this document, and follow the hints. Doing so will increase the likelihood of getting the help you need.
pt_br: Um artigo excelente sobre como pedir ajuda na Internet está disponível online em <ulink url="http://catb.org/~esr/faqs/smart-questions.html"/>. Leia esse documento e siga as dicas. Fazer isso aumentará a possibilidade de obter a ajuda que você precisa.
