Repository: espindula/br-lfs
Catalog: lfs/*/chapter01/changelog.po
Languages: fr, pt_br, zh_cn

source: [bdubbs] - Update to grep-3.11. Fixes <ulink url='&lfs-ticket-root;5256'>#5256</ulink>.
fr: [bdubbs] — Mise à jour vers grep-3.11. Corrige <ulink url='&lfs-ticket-root;5256'>#5256</ulink>.
pt_br: [bdubbs] - Atualizado para grep-3.11. Corrige <ulink url='&lfs-ticket-root;5256'>#5256</ulink>.
zh_cn: [bdubbs] — 更新到 grep-3.11。修复 <ulink url='&lfs-ticket-root;5256'>#5256</ulink>。

source: [bdubbs] - Update to flit_core-3.9.0. Fixes <ulink url='&lfs-ticket-root;5257'>#5257</ulink>.
fr: [bdubbs] — Mise à jour vers flit_core-3.9.0. Corrige <ulink url='&lfs-ticket-root;5257'>#5257</ulink>.
pt_br: [bdubbs] - Atualizado para flit_core-3.9.0. Corrige <ulink url='&lfs-ticket-root;5257'>#5257</ulink>.
zh_cn: [bdubbs] — 更新到 flit_core-3.9.0。修复 <ulink url='&lfs-ticket-root;5257'>#5257</ulink>。

source: [bdubbs] - Update to eudev-3.2.12. Fixes <ulink url='&lfs-ticket-root;5260'>#5260</ulink>.
fr: [bdubbs] — Mise à jour vers eudev-3.2.12. Corrige <ulink url='&lfs-ticket-root;5260'>#5260</ulink>.
pt_br: [bdubbs] - Atualizado para eudev-3.2.12. Corrige <ulink url='&lfs-ticket-root;5260'>#5260</ulink>.
zh_cn: [bdubbs] — 更新到 eudev-3.2.12。修复 <ulink url='&lfs-ticket-root;5260'>#5260</ulink>。

source: [xry111] - Update to less-633. Fixes <ulink url='&lfs-ticket-root;5251'>#5251</ulink>.
fr: [xry111] — Mise à jour vers less-633.. Corrige <ulink url='&lfs-ticket-root;5251'>#5251</ulink>.
pt_br: [xry111] - Atualizado para less-633.. Corrige <ulink url='&lfs-ticket-root;5251'>#5251</ulink>.
zh_cn: [xry111] — 更新到 less-633.。修复 <ulink url='&lfs-ticket-root;5251'>#5251</ulink>。

source: [xry111] - Update to linux-6.3.2. Fixes <ulink url='&lfs-ticket-root;5255'>#5255</ulink>.
fr: [xry111] — Mise à jour vers linux-6.3.2.. Corrige <ulink url='&lfs-ticket-root;5255'>#5255</ulink>.
pt_br: [xry111] - Atualizado para linux-6.3.2.. Corrige <ulink url='&lfs-ticket-root;5255'>#5255</ulink>.
zh_cn: [xry111] — 更新到 linux-6.3.2.。修复 <ulink url='&lfs-ticket-root;5255'>#5255</ulink>。

source: [xry111] - Update to xz-5.4.3. Fixes <ulink url='&lfs-ticket-root;5252'>#5252</ulink>.
fr: [xry111] — Mise à jour vers xz-5.4.3.. Corrige <ulink url='&lfs-ticket-root;5252'>#5252</ulink>.
pt_br: [xry111] - Atualizado para xz-5.4.3.. Corrige <ulink url='&lfs-ticket-root;5252'>#5252</ulink>.
zh_cn: [xry111] — 更新到 xz-5.4.3.。修复 <ulink url='&lfs-ticket-root;5252'>#5252</ulink>。

source: [xry111] - Update to gawk-5.2.2. Fixes <ulink url='&lfs-ticket-root;5253'>#5253</ulink>.
fr: [xry111] — Mise à jour vers gawk-5.2.2.. Corrige <ulink url='&lfs-ticket-root;5253'>#5253</ulink>.
pt_br: [xry111] - Atualizado para gawk-5.2.2.. Corrige <ulink url='&lfs-ticket-root;5253'>#5253</ulink>.
zh_cn: [xry111] — 更新到 gawk-5.2.2.。修复 <ulink url='&lfs-ticket-root;5253'>#5253</ulink>。

source: [xry111] - Fix systemd runtime issue exploited by GCC 13. Fixes <ulink url='&lfs-ticket-root;5254'>#5254</ulink>.
fr: [xry111] — Correction d'un problème à l'exécution de systemd provoqué par GCC 13. Corrige <ulink url='&lfs-ticket-root;5254'>#5254</ulink>.
pt_br: [xry111] - Corrige problema do systemd em tempo de execução explorado pelo GCC 13. Corrige <ulink url='&lfs-ticket-root;5254'>#5254</ulink>.

source: [bdubbs] - Update to vim-9.0.1503. Addresses <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
fr: [bdubbs] — Mise à jour vers vim-9.0.1503. Corrige <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
pt_br: [bdubbs] - Atualização para vim-9.0.1503. Endereça <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.

source: [bdubbs] - Update to iana-etc-20230418. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
fr: [bdubbs] — Mise à jour vers iana-etc-20230418. Corrige <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
pt_br: [bdubbs] - Atualização para iana-etc-20230418. Endereça <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to sysvinit-3.07. Fixes <ulink url='&lfs-ticket-root;5250'>#5250</ulink>.
fr: [bdubbs] — Mise à jour vers sysvinit-3.07.. Corrige <ulink url='&lfs-ticket-root;5250'>#5250</ulink>.
pt_br: [bdubbs] - Atualizado para sysvinit-3.07.. Corrige <ulink url='&lfs-ticket-root;5250'>#5250</ulink>.
zh_cn: [bdubbs] — 更新到 sysvinit-3.07.。修复 <ulink url='&lfs-ticket-root;5250'>#5250</ulink>。

source: [bdubbs] - Update to iproute2-6.3.0. Fixes <ulink url='&lfs-ticket-root;5248'>#5248</ulink>.
fr: [bdubbs] — Mise à jour vers iproute2-6.3.0. Corrige <ulink url='&lfs-ticket-root;5248'>#5248</ulink>.
pt_br: [bdubbs] - Atualizado para iproute2-6.3.0. Corrige <ulink url='&lfs-ticket-root;5248'>#5248</ulink>.
zh_cn: [bdubbs] — 更新到 iproute2-6.3.0。修复 <ulink url='&lfs-ticket-root;5248'>#5248</ulink>。

source: [bdubbs] - Update to gcc-13.1.0. Fixes <ulink url='&lfs-ticket-root;5247'>#5247</ulink>.
fr: [bdubbs] — Mise à jour vers gcc-13.1.0. Corrige <ulink url='&lfs-ticket-root;5247'>#5247</ulink>.
pt_br: [bdubbs] - Atualizado para gcc-13.1.0. Corrige <ulink url='&lfs-ticket-root;5247'>#5247</ulink>.
zh_cn: [bdubbs] — 更新到 gcc-13.1.0。修复 <ulink url='&lfs-ticket-root;5247'>#5247</ulink>。

source: [bdubbs] - Update to perl-5.36.1. Fixes <ulink url='&lfs-ticket-root;5246'>#5246</ulink>.
fr: [bdubbs] — Mise à jour vers perl-5.36.1. Corrige <ulink url='&lfs-ticket-root;5246'>#5246</ulink>.
pt_br: [bdubbs] - Atualizado para perl-5.36.1. Corrige <ulink url='&lfs-ticket-root;5246'>#5246</ulink>.
zh_cn: [bdubbs] — 更新到 perl-5.36.1。修复 <ulink url='&lfs-ticket-root;5246'>#5246</ulink>。

source: [bdubbs] - Update to linux-6.3.1. Fixes <ulink url='&lfs-ticket-root;5245'>#5245</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.3.1. Corrige <ulink url='&lfs-ticket-root;5245'>#5245</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.3.1. Corrige <ulink url='&lfs-ticket-root;5245'>#5245</ulink>.
zh_cn: [bdubbs] — 更新到 linux-6.3.1。修复 <ulink url='&lfs-ticket-root;5245'>#5245</ulink>。

source: [bdubbs] - Update to coreutils-9.3. Fixes <ulink url='&lfs-ticket-root;5244'>#5244</ulink>.
fr: [bdubbs] — Mise à jour vers coreutils-9.3. Corrige <ulink url='&lfs-ticket-root;5244'>#5244</ulink>.
pt_br: [bdubbs] - Atualizado para coreutils-9.3. Corrige <ulink url='&lfs-ticket-root;5244'>#5244</ulink>.
zh_cn: [bdubbs] — 更新到 coreutils-9.3。修复 <ulink url='&lfs-ticket-root;5244'>#5244</ulink>。

source: [bdubbs] - Update to vim-9.0.1452. Addresses <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
fr: [bdubbs] — Mise à jour vers vim-9.0.1452. Corrige <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
pt_br: [bdubbs] - Atualização para vim-9.0.1452. Endereça <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.

source: [bdubbs] - Update to iana-etc-20230405. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
fr: [bdubbs] — Mise à jour vers iana-etc-20230405. Corrige <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
pt_br: [bdubbs] - Atualização para iana-etc-20230405. Endereça <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to zstd-1.5.5. Fixes <ulink url='&lfs-ticket-root;5239'>#5239</ulink>.
fr: [bdubbs] — Mise à jour vers zstd-1.5.5. Corrige <ulink url='&lfs-ticket-root;5239'>#5239</ulink>.
pt_br: [bdubbs] - Atualizado para zstd-1.5.5. Corrige <ulink url='&lfs-ticket-root;5239'>#5239</ulink>.
zh_cn: [bdubbs] — 更新到 zstd-1.5.5。修复 <ulink url='&lfs-ticket-root;5239'>#5239</ulink>。

source: [bdubbs] - Update to Python-3.11.3. Fixes <ulink url='&lfs-ticket-root;5240'>#5240</ulink>.
fr: [bdubbs] — Mise à jour vers Python-3.11.3. Corrige <ulink url='&lfs-ticket-root;5240'>#5240</ulink>.
pt_br: [bdubbs] - Atualizado para Python-3.11.3. Corrige <ulink url='&lfs-ticket-root;5240'>#5240</ulink>.
zh_cn: [bdubbs] — 更新到 Python-3.11.3。修复 <ulink url='&lfs-ticket-root;5240'>#5240</ulink>。

source: [bdubbs] - Update to meson-1.1.0. Fixes <ulink url='&lfs-ticket-root;5242'>#5242</ulink>.
fr: [bdubbs] — Mise à jour vers meson-1.1.0. Corrige <ulink url='&lfs-ticket-root;5242'>#5242</ulink>.
pt_br: [bdubbs] - Atualizado para meson-1.1.0. Corrige <ulink url='&lfs-ticket-root;5242'>#5242</ulink>.
zh_cn: [bdubbs] — 更新到 meson-1.1.0。修复 <ulink url='&lfs-ticket-root;5242'>#5242</ulink>。

source: [bdubbs] - Update to man-pages-6.04. Fixes <ulink url='&lfs-ticket-root;5238'>#5238</ulink>.
fr: [bdubbs] — Mise à jour vers man-pages-6.04. Corrige <ulink url='&lfs-ticket-root;5238'>#5238</ulink>.
pt_br: [bdubbs] - Atualizado para man-pages-6.04. Corrige <ulink url='&lfs-ticket-root;5238'>#5238</ulink>.
zh_cn: [bdubbs] — 更新到 man-pages-6.04。修复 <ulink url='&lfs-ticket-root;5238'>#5238</ulink>。

source: [bdubbs] - Update to linux-6.2.11. Fixes <ulink url='&lfs-ticket-root;5241'>#5241</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.2.11. Corrige <ulink url='&lfs-ticket-root;5241'>#5241</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.2.11. Corrige <ulink url='&lfs-ticket-root;5241'>#5241</ulink>.
zh_cn: [bdubbs] — 更新到 linux-6.2.11。修复 <ulink url='&lfs-ticket-root;5241'>#5241</ulink>。

source: [xry111] - Update to linux-6.2.9 (security fix). Fixes <ulink url='&lfs-ticket-root;5230'>#5230</ulink>.
fr: [xry111] — Mise à jour vers linux-6.2.9 (correctif de sécurité). Corrige <ulink url="&lfs-ticket-root;5230">#5230</ulink>.
pt_br: [xry111] - Atualizar para linux-6.2.9 (correção de segurança). Corrige <ulink url='&lfs-ticket-root;5230'>#5230</ulink>.

source: [xry111] - Update to grep-3.10. Fixes <ulink url='&lfs-ticket-root;5234'>#5234</ulink>.
fr: [xry111] — Mise à jour vers grep-3.10.. Corrige <ulink url='&lfs-ticket-root;5234'>#5234</ulink>.
pt_br: [xry111] - Atualizado para grep-3.10.. Corrige <ulink url='&lfs-ticket-root;5234'>#5234</ulink>.
zh_cn: [xry111] — 更新到 grep-3.10.。修复 <ulink url='&lfs-ticket-root;5234'>#5234</ulink>。

source: [xry111] - Update to wheel-0.40.0. Fixes <ulink url='&lfs-ticket-root;5229'>#5229</ulink>.
fr: [xry111] — Mise à jour vers wheel-0.40.0.. Corrige <ulink url='&lfs-ticket-root;5229'>#5229</ulink>.
pt_br: [xry111] - Atualizado para wheel-0.40.0.. Corrige <ulink url='&lfs-ticket-root;5229'>#5229</ulink>.
zh_cn: [xry111] — 更新到 wheel-0.40.0.。修复 <ulink url='&lfs-ticket-root;5229'>#5229</ulink>。

source: [xry111] - Update to bc-6.5.0. Fixes <ulink url='&lfs-ticket-root;5228'>#5228</ulink>.
fr: [xry111] — Mise à jour vers bc-6.5.0.. Corrige <ulink url='&lfs-ticket-root;5228'>#5228</ulink>.
pt_br: [xry111] - Atualizado para bc-6.5.0.. Corrige <ulink url='&lfs-ticket-root;5228'>#5228</ulink>.
zh_cn: [xry111] — 更新到 bc-6.5.0.。修复 <ulink url='&lfs-ticket-root;5228'>#5228</ulink>。

source: [xry111] - Update to texinfo-7.0.3. Fixes <ulink url='&lfs-ticket-root;5235'>#5235</ulink>.
fr: [xry111] — Mise à jour vers texinfo-7.0.3.. Corrige <ulink url='&lfs-ticket-root;5235'>#5235</ulink>.
pt_br: [xry111] - Atualizado para texinfo-7.0.3.. Corrige <ulink url='&lfs-ticket-root;5235'>#5235</ulink>.
zh_cn: [xry111] — 更新到 texinfo-7.0.3.。修复 <ulink url='&lfs-ticket-root;5235'>#5235</ulink>。

source: [xry111] - Update to coreutils-9.2. Fixes <ulink url='&lfs-ticket-root;5232'>#5232</ulink>.
fr: [xry111] — Mise à jour vers coreutils-9.2.. Corrige <ulink url='&lfs-ticket-root;5232'>#5232</ulink>.
pt_br: [xry111] - Atualizado para coreutils-9.2.. Corrige <ulink url='&lfs-ticket-root;5232'>#5232</ulink>.
zh_cn: [xry111] — 更新到 coreutils-9.2.。修复 <ulink url='&lfs-ticket-root;5232'>#5232</ulink>。

source: [xry111] - Update to libcap-2.68. Fixes <ulink url='&lfs-ticket-root;5236'>#5236</ulink>.
fr: [xry111] — Mise à jour vers libcap-2.68.. Corrige <ulink url='&lfs-ticket-root;5236'>#5236</ulink>.
pt_br: [xry111] - Atualizado para libcap-2.68.. Corrige <ulink url='&lfs-ticket-root;5236'>#5236</ulink>.
zh_cn: [xry111] — 更新到 libcap-2.68.。修复 <ulink url='&lfs-ticket-root;5236'>#5236</ulink>。

source: [xry111] - Update to tzdata-2023c. Fixes <ulink url='&lfs-ticket-root;5237'>#5237</ulink>.
fr: [xry111] — Mise à jour vers tzdata-2023c.. Corrige <ulink url='&lfs-ticket-root;5237'>#5237</ulink>.
pt_br: [xry111] - Atualizado para tzdata-2023c.. Corrige <ulink url='&lfs-ticket-root;5237'>#5237</ulink>.
zh_cn: [xry111] — 更新到 tzdata-2023c.。修复 <ulink url='&lfs-ticket-root;5237'>#5237</ulink>。

source: [xry111] - Update to xz-5.4.2. Fixes <ulink url='&lfs-ticket-root;5233'>#5233</ulink>.
fr: [xry111] — Mise à jour vers xz-5.4.2.. Corrige <ulink url='&lfs-ticket-root;5233'>#5233</ulink>.
pt_br: [xry111] - Atualizado para xz-5.4.2.. Corrige <ulink url='&lfs-ticket-root;5233'>#5233</ulink>.
zh_cn: [xry111] — 更新到 xz-5.4.2.。修复 <ulink url='&lfs-ticket-root;5233'>#5233</ulink>。

source: [xry111] - Update to openssl-3.1.0. Fixes <ulink url='&lfs-ticket-root;5227'>#5227</ulink>.
fr: [xry111] — Mise à jour vers openssl-3.1.0.. Corrige <ulink url='&lfs-ticket-root;5227'>#5227</ulink>.
pt_br: [xry111] - Atualizado para openssl-3.1.0.. Corrige <ulink url='&lfs-ticket-root;5227'>#5227</ulink>.
zh_cn: [xry111] — 更新到 openssl-3.1.0.。修复 <ulink url='&lfs-ticket-root;5227'>#5227</ulink>。

source: [xry111] - Add flit-core-3.8.0.
fr: [xry111] — Ajout de flit-core-3.8.0.
pt_br: [xry111] - Arescentar flit-core-3.8.0.

source: [bdubbs] - Update to bc-6.4.0. Fixes <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.
fr: [bdubbs] — Mise à jour vers bc-6.4.0.. Corrige <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.
pt_br: [bdubbs] - Atualizado para bc-6.4.0.. Corrige <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.
zh_cn: [bdubbs] — 更新到 bc-6.4.0.。修复 <ulink url='&lfs-ticket-root;5217'>#5217</ulink>。

source: [bdubbs] - Update to grep-3.9. Fixes <ulink url='&lfs-ticket-root;5225'>#5225</ulink>.
fr: [bdubbs] — Mise à jour vers grep-3.9.. Corrige <ulink url='&lfs-ticket-root;5225'>#5225</ulink>.
pt_br: [bdubbs] - Atualizado para grep-3.9.. Corrige <ulink url='&lfs-ticket-root;5225'>#5225</ulink>.
zh_cn: [bdubbs] — 更新到 grep-3.9.。修复 <ulink url='&lfs-ticket-root;5225'>#5225</ulink>。

source: [bdubbs] - Update to linux-6.2.6. Fixes <ulink url='&lfs-ticket-root;5226'>#5226</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.2.6.. Corrige <ulink url='&lfs-ticket-root;5226'>#5226</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.2.6.. Corrige <ulink url='&lfs-ticket-root;5226'>#5226</ulink>.
zh_cn: [bdubbs] — 更新到 linux-6.2.6.。修复 <ulink url='&lfs-ticket-root;5226'>#5226</ulink>。

source: [bdubbs] - Update to iana-etc-20230306. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
fr: [bdubbs] — Mise à jour vers iana-etc-20230306. Corrige <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
pt_br: [bdubbs] - Atualizar para iana-etc-20230306. Endereça <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [xry111] - Update to systemd-253. Fixes <ulink url='&lfs-ticket-root;5206'>#5206</ulink>.
fr: [xry111] — Mise à jour vers systemd-253.. Corrige <ulink url='&lfs-ticket-root;5206'>#5206</ulink>.
pt_br: [xry111] - Atualizado para systemd-253.. Corrige <ulink url='&lfs-ticket-root;5206'>#5206</ulink>.
zh_cn: [xry111] — 更新到 systemd-253.。修复 <ulink url='&lfs-ticket-root;5206'>#5206</ulink>。

source: [xry111] - Update to bc-6.3.1. Fixes <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.
fr: [xry111] — Mise à jour vers bc-6.3.1.. Corrige <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.
pt_br: [xry111] - Atualizado para bc-6.3.1.. Corrige <ulink url='&lfs-ticket-root;5217'>#5217</ulink>.
zh_cn: [xry111] — 更新到 bc-6.3.1.。修复 <ulink url='&lfs-ticket-root;5217'>#5217</ulink>。

source: [xry111] - Update to linux-6.2.2 (security fixes). Fixes <ulink url='&lfs-ticket-root;5218'>#5218</ulink>.
fr: [xry111] — Mise à jour vers linux-6.2.2 (correctifs de sécurité). Corrige <ulink url="&lfs-ticket-root;5218">#5218</ulink>.
pt_br: [xry111] - Atualizar para linux-6.2.2 (correções de segurança). Corrige <ulink url='&lfs-ticket-root;5218'>#5218</ulink>.

source: [xry111] - Update to procps-ng-4.0.3. Fixes <ulink url='&lfs-ticket-root;5220'>#5220</ulink>.
fr: [xry111] — Mise à jour vers procps-ng-4.0.3.. Corrige <ulink url='&lfs-ticket-root;5220'>#5220</ulink>.
pt_br: [xry111] - Atualizado para procps-ng-4.0.3.. Corrige <ulink url='&lfs-ticket-root;5220'>#5220</ulink>.
zh_cn: [xry111] — 更新到 procps-ng-4.0.3.。修复 <ulink url='&lfs-ticket-root;5220'>#5220</ulink>。

source: [xry111] - Update to iproute2-6.2.0. Fixes <ulink url='&lfs-ticket-root;5221'>#5221</ulink>.
fr: [xry111] — Mise à jour vers iproute2-6.2.0.. Corrige <ulink url='&lfs-ticket-root;5221'>#5221</ulink>.
pt_br: [xry111] - Atualizado para iproute2-6.2.0.. Corrige <ulink url='&lfs-ticket-root;5221'>#5221</ulink>.
zh_cn: [xry111] — 更新到 iproute2-6.2.0.。修复 <ulink url='&lfs-ticket-root;5221'>#5221</ulink>。

source: [xry111] - Update to meson-1.0.1. Fixes <ulink url='&lfs-ticket-root;5222'>#5222</ulink>.
fr: [xry111] — Mise à jour vers meson-1.0.1.. Corrige <ulink url='&lfs-ticket-root;5222'>#5222</ulink>.
pt_br: [xry111] - Atualizado para meson-1.0.1.. Corrige <ulink url='&lfs-ticket-root;5222'>#5222</ulink>.
zh_cn: [xry111] — 更新到 meson-1.0.1.。修复 <ulink url='&lfs-ticket-root;5222'>#5222</ulink>。

source: [xry111] - Update to make-4.4.1. Fixes <ulink url='&lfs-ticket-root;5223'>#5223</ulink>.
fr: [xry111] — Mise à jour vers make-4.4.1.. Corrige <ulink url='&lfs-ticket-root;5223'>#5223</ulink>.
pt_br: [xry111] - Atualizado para make-4.4.1.. Corrige <ulink url='&lfs-ticket-root;5223'>#5223</ulink>.
zh_cn: [xry111] — 更新到 make-4.4.1.。修复 <ulink url='&lfs-ticket-root;5223'>#5223</ulink>。

source: [xry111] - Update to libelf-0.189. Fixes <ulink url='&lfs-ticket-root;5224'>#5224</ulink>.
fr: [xry111] — Mise à jour vers libelf-0.189.. Corrige <ulink url='&lfs-ticket-root;5224'>#5224</ulink>.
pt_br: [xry111] - Atualizado para libelf-0.189.. Corrige <ulink url='&lfs-ticket-root;5224'>#5224</ulink>.
zh_cn: [xry111] — 更新到 libelf-0.189.。修复 <ulink url='&lfs-ticket-root;5224'>#5224</ulink>。

source: [bdubbs] - Change to a better host requirements script in Chapter 2.
fr: [bdubbs] — Changement pour un meilleur script de prérequis de l'hôte au chapitre 2.
pt_br: [bdubbs] - Mudar para um script melhor das exigências do anfitrião no Capítulo 2.

source: [bdubbs] - LFS-11.3 released.
fr: [bdubbs] — Publication de LFS-11.3.
pt_br: [bdubbs] - LFS-11.3 lançado.
