Repository: espindula/br-lfs
Catalog: lfs/*/chapter01/changelog.po
Languages: fr, pt_br, zh_cn

source: Changelog
fr: Historique des modifications
pt_br: Registro das Mudanças
zh_cn: 更新日志

source: This is version &version; of the Linux From Scratch book, dated &releasedate;. If this book is more than six months old, a newer and better version is probably already available. To find out, please check one of the mirrors via <ulink url="&lfs-root;mirrors.html"/>.
fr: Il s'agit de la version &version; du livre Linux From Scratch, datant du &releasedate;. Si ce livre est daté de plus de six mois, une version plus récente et améliorée est probablement déjà disponible. Pour en avoir le c&oelig;ur net, vérifiez la présence d'une nouvelle version sur l'un des miroirs via <ulink url="&lfs-root;mirrors.html"/>.
pt_br: Esta é a versão &version; do livro Linux From Scratch, datada de &releasedate;. Se este livro for mais antigo que seis meses, [então] uma versão mais nova e melhor provavelmente já está disponível. Para descobrir, por favor verifique um dos espelhos via <ulink url="&lfs-root;mirrors.html"/>.

source: Below is a list of changes made since the previous release of the book.
fr: Ci-dessous se trouve une liste des modifications apportées depuis la version précédente du livre.
pt_br: Abaixo está uma lista das mudanças feitas desde o lançamento anterior do livro.
zh_cn: 下面是本书自上一版本发布以来的更新日志。

source: Changelog Entries:
fr: Entrées dans l'historique des modifications&nbsp;:
pt_br: Entradas do Registro das Mudanças:
zh_cn: 更新日志记录：

source: [bdubbs] - LFS-12.0 released.
fr: [bdubbs] — Publication de LFS-12.0.
pt_br: [bdubbs] - LFS-12.0 lançado.

source: [bdubbs] - Update to linux-6.4.12. Fixes <ulink url='&lfs-ticket-root;5320'>#5320</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.4.12.. Corrige <ulink url='&lfs-ticket-root;5320'>#5320</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.4.12.. Corrige <ulink url='&lfs-ticket-root;5320'>#5320</ulink>.

source: [bdubbs] - Update to udev-lfs-20230818.
fr: [bdubbs] — Mise à jour vers udev-lfs-20230818.
pt_br: [bdubbs] - Atualização para udev-lfs-20230818.

source: [bdubbs] - Add a patch to fix a performance regression in glibc's posix_memalign() function. Fixes <ulink url='&lfs-ticket-root;5315'>#5315</ulink>.
fr: [bdubbs] — Ajout d'un correctif pour corriger une régression de performances dans la fonction posix_memalign(). Corrige <ulink url="&lfs-ticket-root;5315">#5315</ulink>.
pt_br: [bdubbs] - Adicionar um remendo para corrigir uma regressão de desempenho na função "posix_memalign()" da "glibc". Corrige <ulink url='&lfs-ticket-root;5315'>#5315</ulink>.

source: [bdubbs] - Update to less-643. Fixes <ulink url='&lfs-ticket-root;5317'>#5317</ulink>.
fr: [bdubbs] — Mise à jour vers less-643. Corrige <ulink url='&lfs-ticket-root;5317'>#5317</ulink>.
pt_br: [bdubbs] - Atualizado para less-643. Corrige <ulink url='&lfs-ticket-root;5317'>#5317</ulink>.

source: [bdubbs] - Update to meson-1.2.1. Fixes <ulink url='&lfs-ticket-root;5314'>#5314</ulink>.
fr: [bdubbs] — Mise à jour vers meson-1.2.1. Corrige <ulink url='&lfs-ticket-root;5314'>#5314</ulink>.
pt_br: [bdubbs] - Atualizado para meson-1.2.1. Corrige <ulink url='&lfs-ticket-root;5314'>#5314</ulink>.

source: [bdubbs] - Update to linux-6.4.10. Fixes <ulink url='&lfs-ticket-root;5313'>#5313</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.4.10. Corrige <ulink url='&lfs-ticket-root;5313'>#5313</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.4.10. Corrige <ulink url='&lfs-ticket-root;5313'>#5313</ulink>.

source: [bdubbs] - Update to iana-etc-20230810. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
fr: [bdubbs] — Mise à jour vers iana-etc-20230810. Corrige <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
pt_br: [bdubbs] - Atualização para iana-etc-20230810. Endereça <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [rahul] - Update to pkgconf-2.0.1. Fixes <ulink url='&lfs-ticket-root;5316'>#5316</ulink>.
fr: [rahul] — Mise à jour vers pkgconf-2.0.1. Corrige <ulink url='&lfs-ticket-root;5316'>#5316</ulink>.
pt_br: [rahul] - Atualizado para pkgconf-2.0.1. Corrige <ulink url='&lfs-ticket-root;5316'>#5316</ulink>.

source: [bdubbs] - Update to xz-5.4.4. Fixes <ulink url='&lfs-ticket-root;5307'>#5307</ulink>.
fr: [bdubbs] — Mise à jour vers xz-5.4.4. Corrige <ulink url='&lfs-ticket-root;5307'>#5307</ulink>.
pt_br: [bdubbs] - Atualizado para xz-5.4.4. Corrige <ulink url='&lfs-ticket-root;5307'>#5307</ulink>.

source: [bdubbs] - Update to wheel-0.41.1 (Python Module). Fixes <ulink url='&lfs-ticket-root;5311'>#5311</ulink>.
fr: [bdubbs] — Mise à jour vers wheel-0.41.1 (module Python). Corrige <ulink url='&lfs-ticket-root;5311'>#5311</ulink>.
pt_br: [bdubbs] - Atualização para wheel-0.41.1 (Módulo Python). Corrige <ulink url='&lfs-ticket-root;5311'>#5311</ulink>.

source: [bdubbs] - Update to man-pages-6.05.01. Fixes <ulink url='&lfs-ticket-root;5306'>#5306</ulink>.
fr: [bdubbs] — Mise à jour vers man-pages-6.05.01. Corrige <ulink url='&lfs-ticket-root;5306'>#5306</ulink>.
pt_br: [bdubbs] - Atualizado para man-pages-6.05.01. Corrige <ulink url='&lfs-ticket-root;5306'>#5306</ulink>.

source: [bdubbs] - Update to linux-6.4.8. Fixes <ulink url='&lfs-ticket-root;5309'>#5309</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.4.8. Corrige <ulink url='&lfs-ticket-root;5309'>#5309</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.4.8. Corrige <ulink url='&lfs-ticket-root;5309'>#5309</ulink>.

source: [bdubbs] - Update to iana-etc-20230804. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
fr: [bdubbs] — Mise à jour vers iana-etc-20230804. Corrige <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
pt_br: [bdubbs] - Atualização para iana-etc-20230804. Endereça <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [rahul] - Update to pkgconf-2.0.0. Fixes <ulink url='&lfs-ticket-root;5310'>#5310</ulink>.
fr: [rahul] — Mise à jour vers pkgconf-2.0.0. Corrige <ulink url='&lfs-ticket-root;5310'>#5310</ulink>.
pt_br: [rahul] - Atualizado para pkgconf-2.0.0. Corrige <ulink url='&lfs-ticket-root;5310'>#5310</ulink>.

source: [bdubbs] - Update to vim-9.0.1677. Addresses <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
fr: [bdubbs] — Mise à jour vers vim-9.0.1677. Corrige <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
pt_br: [bdubbs] - Atualização para vim-9.0.1677. Endereça <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.

source: [bdubbs] - Update to openssl-3.1.2. Fixes <ulink url='&lfs-ticket-root;5305'>#5305</ulink>.
fr: [bdubbs] — Mise à jour vers openssl-3.1.2. Corrige <ulink url='&lfs-ticket-root;5305'>#5305</ulink>.
pt_br: [bdubbs] - Atualizado para openssl-3.1.2. Corrige <ulink url='&lfs-ticket-root;5305'>#5305</ulink>.

source: [bdubbs] - Update to man-pages-6.05. Fixes <ulink url='&lfs-ticket-root;5303'>#5303</ulink>.
fr: [bdubbs] — Mise à jour vers man-pages-6.05. Corrige <ulink url='&lfs-ticket-root;5303'>#5303</ulink>.
pt_br: [bdubbs] - Atualizado para man-pages-6.05. Corrige <ulink url='&lfs-ticket-root;5303'>#5303</ulink>.

source: [bdubbs] - Update to binutils-2.41. Fixes <ulink url='&lfs-ticket-root;5300'>#5300</ulink>.
fr: [bdubbs] — Mise à jour vers binutils-2.41. Corrige <ulink url='&lfs-ticket-root;5300'>#5300</ulink>.
pt_br: [bdubbs] - Atualizado para binutils-2.41. Corrige <ulink url='&lfs-ticket-root;5300'>#5300</ulink>.

source: [bdubbs] - Update to gmp-6.3.0. Fixes <ulink url='&lfs-ticket-root;5301'>#5301</ulink>.
fr: [bdubbs] — Mise à jour vers gmp-6.3.0. Corrige <ulink url='&lfs-ticket-root;5301'>#5301</ulink>.
pt_br: [bdubbs] - Atualizado para gmp-6.3.0. Corrige <ulink url='&lfs-ticket-root;5301'>#5301</ulink>.

source: [bdubbs] - Update to glibc-2.38. Fixes <ulink url='&lfs-ticket-root;5302'>#5302</ulink>.
fr: [bdubbs] — Mise à jour vers glibc-2.38. Corrige <ulink url='&lfs-ticket-root;5302'>#5302</ulink>.
pt_br: [bdubbs] - Atualizado para glibc-2.38. Corrige <ulink url='&lfs-ticket-root;5302'>#5302</ulink>.

source: [bdubbs] - Update udev-lfs tarball to remove obsolete cdrom rules and references to ISDN devices. Fixes <ulink url='&lfs-ticket-root;5291'>#5291</ulink>.
fr: [bdubbs] — Mise à jour de l'archive udev-lfs pour supprimer les anciennes règles cdrom obsolètes et les références aux périphériques ISDN. Corrige <ulink url="&lfs-ticket-root;5291">#5291</ulink>.
pt_br: [bdubbs] - Atualiza o tarball do "udev-lfs" para remover regras obsoletas de CDROM e referências a dispositivos ISDN. Corrige <ulink url='&lfs-ticket-root;5291'>#5291</ulink>.

source: [bdubbs] - Update to wheel-0.41.0 (Python Module). Fixes <ulink url='&lfs-ticket-root;5290'>#5290</ulink>.
fr: [bdubbs] — Mise à jour vers wheel-0.41.0 (module Python). Corrige <ulink url='&lfs-ticket-root;5290'>#5290</ulink>.
pt_br: [bdubbs] - Atualização para "wheel-0.41.0" (Módulo Python). Corrige <ulink url='&lfs-ticket-root;5290'>#5290</ulink>.

source: [bdubbs] - Update to tar-1.35. Fixes <ulink url='&lfs-ticket-root;5287'>#5287</ulink>.
fr: [bdubbs] — Mise à jour vers tar-1.35. Corrige <ulink url='&lfs-ticket-root;5287'>#5287</ulink>.
pt_br: [bdubbs] - Atualizado para tar-1.35. Corrige <ulink url='&lfs-ticket-root;5287'>#5287</ulink>.

source: [bdubbs] - Update to<phrase revision='sysv'> udev from</phrase> systemd-254. Fixes <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.
fr: [bdubbs] — Mise à jour vers <phrase revision='sysv'> udev de</phrase> systemd-254 Corrige <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.
pt_br: [bdubbs] - Atualização para<phrase revision='sysv'> "udev" originário de</phrase> systemd-254. Corrige <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.

source: [bdubbs] - Update to meson-1.2.0. Fixes <ulink url='&lfs-ticket-root;5286'>#5286</ulink>.
fr: [bdubbs] — Mise à jour vers meson-1.2.0. Corrige <ulink url='&lfs-ticket-root;5286'>#5286</ulink>.
pt_br: [bdubbs] - Atualizado para meson-1.2.0. Corrige <ulink url='&lfs-ticket-root;5286'>#5286</ulink>.

source: [bdubbs] - Update to linux-6.4.7. Fixes <ulink url='&lfs-ticket-root;5288'>#5288</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.4.7. Corrige <ulink url='&lfs-ticket-root;5288'>#5288</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.4.7. Corrige <ulink url='&lfs-ticket-root;5288'>#5288</ulink>.

source: [bdubbs] - Update to gcc-13.2.0. Fixes <ulink url='&lfs-ticket-root;5292'>#5292</ulink>.
fr: [bdubbs] — Mise à jour vers gcc-13.2.0. Corrige <ulink url='&lfs-ticket-root;5292'>#5292</ulink>.
pt_br: [bdubbs] - Atualizado para gcc-13.2.0. Corrige <ulink url='&lfs-ticket-root;5292'>#5292</ulink>.

source: [bdubbs] - Update to file-5.45. Fixes <ulink url='&lfs-ticket-root;5294'>#5294</ulink>.
fr: [bdubbs] — Mise à jour vers file-5.45. Corrige <ulink url='&lfs-ticket-root;5294'>#5294</ulink>.
pt_br: [bdubbs] - Atualizado para file-5.45. Corrige <ulink url='&lfs-ticket-root;5294'>#5294</ulink>.

source: [xry111] - Enable cgroup-based memory pressure information in kernel, and add the cgroup file system into /etc/fstab and the mountvirtfs bootscript. This is a preparation for udev from systemd-254. Addresses <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.
fr: [xry111] — Activation des informations de pression mémoire basées sur les cgroups dans le noyau et ajout du système de fichiers cgroup à /etc/fstab et du script de démarrage mountvirtfs. Ce changement est fait en préparation à udev de systemd-254. Traite <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.
pt_br: [xry111] - Habilita informação de pressão de memória baseada em "cgroup" no núcleo e adiciona o sistema de arquivos "cgroup" no /etc/fstab e o script de inicialização "mountvirtfs". Isso é uma preparaçao para "udev" originário de systemd-254. Endereça <ulink url='&lfs-ticket-root;5293'>#5293</ulink>.

source: [xry111] - Make the mountvirtfs bootscript create essential symlinks in /dev. Fixes <ulink url='&lfs-ticket-root;5289'>#5289</ulink>.
fr: [xry111] — Création de liens symboliques essentiels dans /dev par le script de démarrage mountvirtfs. Corrige <ulink url='&lfs-ticket-root;5289'>#5289</ulink>.
pt_br: [xry111] - Fazer com que o script de inicialização "mountvirtfs" crie links simbólicos essenciais em /dev. Corrige <ulink url='&lfs-ticket-root;5289'>#5289</ulink>.

source: [xry111] - Replace eudev-3.2.12 with udev from systemd-253. Fixes <ulink url='&lfs-ticket-root;5285'>#5085</ulink>.
fr: [xry111] — Remplacement de eudev-3.2.12 par udev de systemd-253.. Corrige <ulink url='&lfs-ticket-root;5085'>#5085</ulink>.
pt_br: [xry111] - Substituir eudev-3.2.12 por udev originário do systemd-253. Corrige <ulink url='&lfs-ticket-root;5285'>#5085</ulink>.

source: [bdubbs] - Update to iana-etc-20230629. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
fr: [bdubbs] — Mise à jour vers iana-etc-20230629. Corrige <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
pt_br: [bdubbs] - Atualização para iana-etc-20230629. Endereça <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to linux-6.4.3. Fixes <ulink url='&lfs-ticket-root;5284'>#5284</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.4.3.. Corrige <ulink url='&lfs-ticket-root;5284'>#5284</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.4.3.. Corrige <ulink url='&lfs-ticket-root;5284'>#5284</ulink>.

source: [bdubbs] - Update to libxcrypt-4.4.36. Fixes <ulink url='&lfs-ticket-root;5283'>#5283</ulink>.
fr: [bdubbs] — Mise à jour vers libxcrypt-4.4.36.. Corrige <ulink url='&lfs-ticket-root;5283'>#5283</ulink>.
pt_br: [bdubbs] - Atualizado para libxcrypt-4.4.36.. Corrige <ulink url='&lfs-ticket-root;5283'>#5283</ulink>.

source: [bdubbs] - Update to groff-1.23.0. Fixes <ulink url='&lfs-ticket-root;5282'>#5282</ulink>.
fr: [bdubbs] — Mise à jour vers groff-1.23.0.. Corrige <ulink url='&lfs-ticket-root;5282'>#5282</ulink>.
pt_br: [bdubbs] - Atualizado para groff-1.23.0.. Corrige <ulink url='&lfs-ticket-root;5282'>#5282</ulink>.

source: [bdubbs] - Update to perl-5.38.0. Fixes <ulink url='&lfs-ticket-root;5281'>#5281</ulink>.
fr: [bdubbs] — Mise à jour vers perl-5.38.0.. Corrige <ulink url='&lfs-ticket-root;5281'>#5281</ulink>.
pt_br: [bdubbs] - Atualizado para perl-5.38.0.. Corrige <ulink url='&lfs-ticket-root;5281'>#5281</ulink>.

source: [xry111] - Add libxcrypt-4.4.35. Fixes <ulink url='&lfs-ticket-root;5280'>#5280</ulink>.
fr: [xry111] — Ajout de libxcrypt-4.4.35. Corrige <ulink url='&lfs-ticket-root;5280'>#5280</ulink>.
pt_br: [xry111] - Adicionar libxcrypt-4.4.35. Corrige <ulink url='&lfs-ticket-root;5280'>#5280</ulink>.

source: [xry111] - Update to iproute2-6.4.0. Fixes <ulink url='&lfs-ticket-root;5277'>#5277</ulink>.
fr: [xry111] — Mise à jour vers iproute2-6.4.0.. Corrige <ulink url='&lfs-ticket-root;5277'>#5277</ulink>.
pt_br: [xry111] - Atualizado para iproute2-6.4.0.. Corrige <ulink url='&lfs-ticket-root;5277'>#5277</ulink>.

source: [xry111] - Update to linux-6.4.1. Fixes <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.
fr: [xry111] — Mise à jour vers linux-6.4.1.. Corrige <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.
pt_br: [xry111] - Atualizado para linux-6.4.1.. Corrige <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.

source: [bdubbs] - Update to iana-etc-20230615. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
fr: [bdubbs] — Mise à jour vers iana-etc-20230615. Corrige <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
pt_br: [bdubbs] - Atualizar para iana-etc-20230615. Endereça <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to vim-9.0.1671. Addresses <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
fr: [bdubbs] — Mise à jour vers vim-9.0.1671. Corrige <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.
pt_br: [bdubbs] - Atualizar para vim-9.0.1671. Endereça <ulink url='&lfs-ticket-root;4500'>#4500</ulink>.

source: [bdubbs] - Update to util-linux-2.39.1. Addresses <ulink url='&lfs-ticket-root;5278'>#5278</ulink>.
fr: [bdubbs] — Mise à jour vers util-linux-2.39.1. Corrige <ulink url='&lfs-ticket-root;5278'>#5278</ulink>.
pt_br: [bdubbs] - Atualizar para util-linux-2.39.1. Endereça <ulink url='&lfs-ticket-root;5278'>#5278</ulink>.

source: [bdubbs] - Update to linux-6.3.10. Addresses <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.3.10. Corrige <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.
pt_br: [bdubbs] - Atualizar para linux-6.3.10. Endereça <ulink url='&lfs-ticket-root;5276'>#5276</ulink>.

source: [rahul] - Update to kbd-2.6.1. Fixes <ulink url='&lfs-ticket-root;5279'>#5279</ulink>.
fr: [rahul] — Mise à jour vers kbd-2.6.1.. Corrige <ulink url='&lfs-ticket-root;5279'>#5279</ulink>.
pt_br: [rahul] - Atualizado para kbd-2.6.1.. Corrige <ulink url='&lfs-ticket-root;5279'>#5279</ulink>.
zh_cn: [rahul] — 更新到 kbd-2.6.1.。修复 <ulink url='&lfs-ticket-root;5279'>#5279</ulink>。

source: [bdubbs] - Update to gettext-0.22. Fixes <ulink url='&lfs-ticket-root;5275'>#5275</ulink>.
fr: [bdubbs] — Mise à jour vers gettext-0.22.. Corrige <ulink url='&lfs-ticket-root;5275'>#5275</ulink>.
pt_br: [bdubbs] - Atualizado para gettext-0.22.. Corrige <ulink url='&lfs-ticket-root;5275'>#5275</ulink>.
zh_cn: [bdubbs] — 更新到 gettext-0.22.。修复 <ulink url='&lfs-ticket-root;5275'>#5275</ulink>。

source: [xry111] - Update to linux-6.3.8. Fixes <ulink url='&lfs-ticket-root;5272'>#5272</ulink>.
fr: [xry111] — Mise à jour vers linux-6.3.8.. Corrige <ulink url='&lfs-ticket-root;5272'>#5272</ulink>.
pt_br: [xry111] - Atualizado para linux-6.3.8.. Corrige <ulink url='&lfs-ticket-root;5272'>#5272</ulink>.
zh_cn: [xry111] — 更新到 linux-6.3.8.。修复 <ulink url='&lfs-ticket-root;5272'>#5272</ulink>。

source: [xry111] - Update to kbd-2.6.0. Fixes <ulink url='&lfs-ticket-root;5273'>#5273</ulink>.
fr: [xry111] — Mise à jour vers kbd-2.6.0.. Corrige <ulink url='&lfs-ticket-root;5273'>#5273</ulink>.
pt_br: [xry111] - Atualizado para kbd-2.6.0.. Corrige <ulink url='&lfs-ticket-root;5273'>#5273</ulink>.
zh_cn: [xry111] — 更新到 kbd-2.6.0.。修复 <ulink url='&lfs-ticket-root;5273'>#5273</ulink>。

source: [rahul] - Changed from pkg-config to pkgconf-1.9.5. Fixes <ulink url='&lfs-ticket-root;5274'>#5274</ulink>.
fr: [rahul] — Passage de pkg-config à pkgconf-1.9.5. Corrige <ulink url='&lfs-ticket-root;5274'>#5274</ulink>.
pt_br: [rahul] - Mudado de pkg-config para pkgconf-1.9.5. Corrige <ulink url='&lfs-ticket-root;5274'>#5274</ulink>.

source: [bdubbs] - Update to dbus-1.14.8. Fixes <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.
fr: [bdubbs] — Mise à jour vers dbus-1.14.8. Corrige <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.
pt_br: [bdubbs] - Atualizado para dbus-1.14.8. Corrige <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.
zh_cn: [bdubbs] — 更新到 dbus-1.14.8。修复 <ulink url='&lfs-ticket-root;5271'>#5271</ulink>。

source: [bdubbs] - Update to linux-6.3.6. Fixes <ulink url='&lfs-ticket-root;5269'>#5269</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.3.6. Corrige <ulink url='&lfs-ticket-root;5269'>#5269</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.3.6. Corrige <ulink url='&lfs-ticket-root;5269'>#5269</ulink>.
zh_cn: [bdubbs] — 更新到 linux-6.3.6。修复 <ulink url='&lfs-ticket-root;5269'>#5269</ulink>。

source: [bdubbs] - Update to Python-3.11.4. Fixes <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.
fr: [bdubbs] — Mise à jour vers Python-3.11.4. Corrige <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.
pt_br: [bdubbs] - Atualizado para Python-3.11.4. Corrige <ulink url='&lfs-ticket-root;5271'>#5271</ulink>.
zh_cn: [bdubbs] — 更新到 Python-3.11.4。修复 <ulink url='&lfs-ticket-root;5271'>#5271</ulink>。

source: [bdubbs] - Update to iana-etc-20230524. Addresses <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
fr: [bdubbs] — Mise à jour vers iana-etc-20230524. Corrige <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.
pt_br: [bdubbs] - Atualização para iana-etc-20230524. Endereça <ulink url='&lfs-ticket-root;5006'>#5006</ulink>.

source: [bdubbs] - Update to MarkupSafe-2.1.3 (Python Module). Fixes <ulink url='&lfs-ticket-root;5268'>#5268</ulink>.
fr: [bdubbs] — Mise à jour vers MarkupSafe-2.1.3 (module python). Corrige <ulink url='&lfs-ticket-root;5268'>#5268</ulink>.
pt_br: [bdubbs] - Atualização para MarkupSafe-2.1.3 (Módulo Python). Corrige <ulink url='&lfs-ticket-root;5268'>#5268</ulink>.

source: [bdubbs] - Update to linux-6.3.5. Fixes <ulink url='&lfs-ticket-root;5264'>#5264</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.3.5. Corrige <ulink url='&lfs-ticket-root;5264'>#5264</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.3.5. Corrige <ulink url='&lfs-ticket-root;5264'>#5264</ulink>.
zh_cn: [bdubbs] — 更新到 linux-6.3.5。修复 <ulink url='&lfs-ticket-root;5264'>#5264</ulink>。

source: [bdubbs] - Update to openssl-3.1.1. Fixes <ulink url='&lfs-ticket-root;5267'>#5267</ulink>.
fr: [bdubbs] — Mise à jour vers openssl-3.1.1. Corrige <ulink url='&lfs-ticket-root;5267'>#5267</ulink>.
pt_br: [bdubbs] - Atualizado para openssl-3.1.1. Corrige <ulink url='&lfs-ticket-root;5267'>#5267</ulink>.
zh_cn: [bdubbs] — 更新到 openssl-3.1.1。修复 <ulink url='&lfs-ticket-root;5267'>#5267</ulink>。

source: [bdubbs] - Update to meson-1.1.1. Fixes <ulink url='&lfs-ticket-root;5266'>#5266</ulink>.
fr: [bdubbs] — Mise à jour vers meson-1.1.1. Corrige <ulink url='&lfs-ticket-root;5266'>#5266</ulink>.
pt_br: [bdubbs] - Atualizado para meson-1.1.1. Corrige <ulink url='&lfs-ticket-root;5266'>#5266</ulink>.
zh_cn: [bdubbs] — 更新到 meson-1.1.1。修复 <ulink url='&lfs-ticket-root;5266'>#5266</ulink>。

source: [bdubbs] - Update to diffutils-3.10. Fixes <ulink url='&lfs-ticket-root;5262'>#5262</ulink>.
fr: [bdubbs] — Mise à jour vers diffutils-3.10. Corrige <ulink url='&lfs-ticket-root;5262'>#5262</ulink>.
pt_br: [bdubbs] - Atualizado para diffutils-3.10. Corrige <ulink url='&lfs-ticket-root;5262'>#5262</ulink>.
zh_cn: [bdubbs] — 更新到 diffutils-3.10。修复 <ulink url='&lfs-ticket-root;5262'>#5262</ulink>。

source: [bdubbs] - Update to bc-6.6.0. Fixes <ulink url='&lfs-ticket-root;5263'>#5263</ulink>.
fr: [bdubbs] — Mise à jour vers bc-6.6.0. Corrige <ulink url='&lfs-ticket-root;5263'>#5263</ulink>.
pt_br: [bdubbs] - Atualizado para bc-6.6.0. Corrige <ulink url='&lfs-ticket-root;5263'>#5263</ulink>.
zh_cn: [bdubbs] — 更新到 bc-6.6.0。修复 <ulink url='&lfs-ticket-root;5263'>#5263</ulink>。

source: [ken] - Remove unneeded group sgx from eudev rules. Fixes <ulink url='&lfs-ticket-root;5265'>#5265</ulink>.
fr: [ken] — Suppression du groupe sgx non requis dans les règles eudev. Corrige <ulink url='&lfs-ticket-root;5265'>#5265</ulink>.
pt_br: [ken] - Remover grupo desnecessário sgx das regras eudev. Corrige <ulink url='&lfs-ticket-root;5265'>#5265</ulink>.

source: [bdubbs] - Update to util-linux-2.39. Fixes <ulink url='&lfs-ticket-root;5259'>#5259</ulink>.
fr: [bdubbs] — Mise à jour vers util-linux-2.39.. Corrige <ulink url='&lfs-ticket-root;5259'>#5259</ulink>.
pt_br: [bdubbs] - Atualizado para util-linux-2.39.. Corrige <ulink url='&lfs-ticket-root;5259'>#5259</ulink>.
zh_cn: [bdubbs] — 更新到 util-linux-2.39.。修复 <ulink url='&lfs-ticket-root;5259'>#5259</ulink>。

source: [bdubbs] - Update to linux-6.3.3. Fixes <ulink url='&lfs-ticket-root;5261'>#5261</ulink>.
fr: [bdubbs] — Mise à jour vers linux-6.3.3. Corrige <ulink url='&lfs-ticket-root;5261'>#5261</ulink>.
pt_br: [bdubbs] - Atualizado para linux-6.3.3. Corrige <ulink url='&lfs-ticket-root;5261'>#5261</ulink>.
zh_cn: [bdubbs] — 更新到 linux-6.3.3。修复 <ulink url='&lfs-ticket-root;5261'>#5261</ulink>。

source: [bdubbs] - Update to libcap-2.69. Fixes <ulink url='&lfs-ticket-root;5258'>#5258</ulink>.
fr: [bdubbs] — Mise à jour vers libcap-2.69. Corrige <ulink url='&lfs-ticket-root;5258'>#5258</ulink>.
pt_br: [bdubbs] - Atualizado para libcap-2.69. Corrige <ulink url='&lfs-ticket-root;5258'>#5258</ulink>.
zh_cn: [bdubbs] — 更新到 libcap-2.69。修复 <ulink url='&lfs-ticket-root;5258'>#5258</ulink>。
