Repository: espindula/br-lfs
Catalog: lfs/*/chapter01/how.po
Languages: fr

source: How to Build an LFS System
fr: Comment construire un système LFS

source: The LFS system will be built by using an already installed Linux distribution (such as Debian, OpenMandriva, Fedora, or openSUSE). This existing Linux system (the host) will be used as a starting point to provide necessary programs, including a compiler, linker, and shell, to build the new system. Select the <quote>development</quote> option during the distribution installation to be able to access these tools.
fr: Le système LFS sera construit en utilisant une distribution Linux déjà installée (telle que Debian, OpenMandriva, Red Hat ou openSUSE). Ce système Linux existant (l'hôte) sera utilisé comme point de départ pour fournir certains programmes nécessaires, ceci incluant un compilateur, un éditeur de liens et un shell, pour construire le nouveau système. Sélectionnez l'option <quote>développement</quote> (<foreignphrase>development</foreignphrase>) lors de l'installation de la distribution pour disposer de ces outils.

source: As an alternative to installing a separate distribution onto your machine, you may wish to use a LiveCD from a commercial distribution.
fr: Alternativement à l'installation d'une distribution séparée complète sur votre machine, vous pouvez utiliser le LiveCD d'une distribution commerciale.

source: <xref linkend="chapter-partitioning"/> of this book describes how to create a new Linux native partition and file system. This is the place where the new LFS system will be compiled and installed. <xref linkend="chapter-getting-materials"/> explains which packages and patches need to be downloaded to build an LFS system and how to store them on the new file system. <xref linkend="chapter-final-preps"/> discusses the setup of an appropriate working environment. Please read <xref linkend="chapter-final-preps"/> carefully as it explains several important issues you need be aware of before beginning to work your way through <xref linkend="chapter-temporary-tools"/> and beyond.
fr: Le <xref linkend="chapter-partitioning"/> de ce livre décrit comment créer une nouvelle partition native Linux et un système de fichiers. C'est l'endroit où le nouveau système LFS sera compilé et installé. Le <xref linkend="chapter-getting-materials"/> explique quels paquets et correctifs ont besoin d'être téléchargés pour construire un système LFS et comment les stocker sur le nouveau système de fichiers. Le <xref linkend="chapter-final-preps"/> traite de la configuration pour un environnement de travail approprié. Merci de lire le <xref linkend="chapter-final-preps"/> avec attention car il explique plusieurs problèmes importants dont vous devez être au courant avant de commencer à travailler sur le <xref linkend="chapter-temporary-tools"/> et les chapitres suivants.

source: <xref linkend="chapter-temporary-tools"/> explains the installation of a number of packages that will form the basic development suite (or toolchain) which is used to build the actual system in <xref linkend="chapter-building-system"/>. Some of these packages are needed to resolve circular dependencies&mdash;for example, to compile a compiler, you need a compiler.
fr: Le <xref linkend="chapter-temporary-tools"/> explique l'installation d'un ensemble de paquets qui formera la suite de développement de base (ou ensemble d'outils) utilisé pour construire le système réel dans le <xref linkend="chapter-building-system"/>. Certains de ces paquets sont nécessaires pour résoudre des dépendances circulaires&nbsp;&mdash; par exemple, pour compiler un compilateur, vous avez besoin d'un compilateur.

source: <xref linkend="chapter-temporary-tools"/> also shows you how to build a first pass of the toolchain, including Binutils and GCC (first pass basically means these two core packages will be reinstalled). The next step is to build Glibc, the C library. Glibc will be compiled by the toolchain programs built in the first pass. Then, a second pass of the toolchain will be built. This time, the toolchain will be dynamically linked against the newly built Glibc. The remaining <xref linkend="chapter-temporary-tools"/> packages are built using this second pass toolchain. When this is done, the LFS installation process will no longer depend on the host distribution, with the exception of the running kernel.
fr: Le <xref linkend="chapter-temporary-tools"/> vous montre aussi comment construire dans une première passe l'ensemble des outils, incluant Binutils et GCC (première passe signifiant basiquement que ces deux paquets principaux seront installés une deuxième fois). La prochaine étape consiste à construire Glibc, la bibliothèque C. Glibc sera compilé par les programmes de l'ensemble d'outils, construits lors de la première passe. Ensuite, une seconde passe de la chaîne d'outils sera lancée. Cette fois, l'ensemble d'outils sera lié dynamiquement avec la Glibc nouvellement construite. Les paquets restants du <xref linkend="chapter-temporary-tools"/> seront construits en utilisant la chaîne d'outils de cette deuxième passe. Lorsque ceci sera fait, le processus d'installation de LFS ne dépendra plus de la distribution hôte, à l'exception du noyau en cours d'exécution.

source: This effort to isolate the new system from the host distribution may seem excessive. A full technical explanation as to why this is done is provided in <xref linkend="ch-tools-toolchaintechnotes"/>.
fr: Cet effort consistant à isoler le nouveau système de la distribution hôte peut sembler excessif. Une explication technique complète est fournie dans <xref linkend="ch-tools-toolchaintechnotes"/>.

source: In <xref linkend="chapter-building-system"/>, the full LFS system is built. The <command>chroot</command> (change root) program is used to enter a virtual environment and start a new shell whose root directory will be set to the LFS partition. This is very similar to rebooting and instructing the kernel to mount the LFS partition as the root partition. The system does not actually reboot, but instead uses <command>chroot</command> because creating a bootable system requires additional work which is not necessary just yet. The major advantage is that <quote>chrooting</quote> allows you to continue using the host system while LFS is being built. While waiting for package compilations to complete, you can continue using your computer as normal.
fr: Dans le <xref linkend="chapter-building-system"/>, le système LFS complet est construit. Le programme <command>chroot</command> (changement de racine) est utilisé pour entrer dans un environnement virtuel et pour lancer un nouveau shell dont le répertoire racine sera initialisé à la partition LFS. Ceci ressemble à redémarrer et donner l'instruction au noyau de monter la partition LFS comme partition racine. Le système ne redémarre pas réellement mais utilise <command>chroot</command> parce que la création d'un système démarrable (amorçable) réclame un travail supplémentaire qui n'est pas encore nécessaire. L'avantage principal est que se <quote>chrooter</quote>vous permet de continuer à utiliser l'hôte pendant la construction de LFS. En attendant que les compilations d'un paquet se termine, un utilisateur peut passer sur une console virtuelle (VC) différente ou un bureau X et continuer à utiliser son ordinateur comme d'habitude.

source: To finish the installation, the basic system configuration is set up in <xref linkend="chapter-bootscripts"/>, and the kernel and boot loader are set up in <xref linkend="chapter-bootable"/>. <xref linkend="chapter-finalizing"/> contains information on continuing the LFS experience beyond this book. After the steps in this book have been implemented, the computer will be ready to reboot into the new LFS system.
fr: Pour terminer l'installation, les scripts de démarrage sont configurés dans le <xref linkend="chapter-bootscripts"/>, le noyau et le chargeur de démarrage sont configurés dans le <xref linkend="chapter-bootable"/>. Le <xref linkend="chapter-finalizing"/> contient des informations sur la suite de l'expérience LFS après ce livre. Après avoir suivi les étapes de ce livre, l'ordinateur sera prêt à redémarrer dans le nouveau système LFS.

source: This is the process in a nutshell. Detailed information on each step is discussed in the following chapters and package descriptions. Items that may seem complicated will be clarified, and everything will fall into place as you embark on the LFS adventure.
fr: Ceci expose rapidement le processus. Des informations détaillées sur chaque étape sont traitées dans les chapitres suivants avec les descriptions des paquets. Les éléments qui peuvent sembler compliqués seront clarifiés et tout ira à sa place, alors que vous vous embarquerez pour l'aventure LFS.
