Repository: espindula/br-lfs
Catalog: lfs/*/chapter01/livecd.po
Languages: fr

source: About the Included CD
fr: À propos du CD inclus

source: For your convenience, we have included a CD with this book that contains the source packages needed for creating a Linux From Scratch system. The CD is bootable and provides a stable working environment for building LFS. This book refers to this system as the <quote>host system.</quote> The CD images are actively maintained and updated versions can be found at <ulink url="ftp://ftp.lfs-matrix.net/pub/lfs-livecd/"/>
fr: Pour votre confort, nous avons inclus un CD avec ce livre contenant les paquets de sources nécessaires pour créer un système Linux From Scratch. Le CD est amorçable et fournit un environnement de travail stable pour construire LFS. Ce livre se réfère à ce système comme le <quote>système hôte</quote>. Les images CD sont maintenues activement et des versions mises à jour sont disponibles sur <ulink url="ftp://ftp.lfs-matrix.net/pub/lfs-livecd/"/>

source: In addition to the tools required to build LFS, the host system on the CD has a number of other helpful tools installed:
fr: En plus des outils requis pour construire LFS, le système hôte sur le CD a un certain nombre d'autres outils utiles installés&nbsp;:

source: An HTML version of this book
fr: Une version HTML de ce livre

source: The X Window System Environment
fr: L'environnement X Window System

source: Web Tools
fr: Outils Web

source: Wget (command line file retriever)
fr: Wget (récupération de fichiers en ligne de commande)

source: Lynx (text web browser)
fr: Lynx (navigateur web texte)

source: Irssi (console IRC client)
fr: Irssi (client IRC en console)

source: Firefox (graphical web browser)
fr: Firefox (navigateur web graphique)

source: Xchat (X-based IRC client)
fr: Xchat (client IRC basé sur X)

source: Text Editors
fr: Éditeurs de texte

source: Network Tools
fr: Outils réseau

source: SSH Server and Client
fr: Serveur et client SSH

source: NFS Server and Client
fr: Serveur et client NFS

source: Smbmount (mount.cifs) for Windows shares
fr: Smbmount (mount.cifs) pour les partages Windows

source: Dhcpcd (DHCP client)
fr: Dhcpcd (client DHCP)

source: Filesystem Programs
fr: Programmes de systèmes de fichiers

source: nALFS - A tool for automating LFS builds
fr: nALFS - Un outil pour automatiser les constructions LFS
