Repository: espindula/br-lfs
Catalog: lfs/*/chapter01/resources.po
Languages: fr

source: Resources
fr: Ressources

source: If during the building of the LFS system you encounter any errors, have any questions, or think there is a typo in the book, please start by consulting the list of Frequently Asked Questions (FAQ), located at <ulink url="&faq-root;"/>.
fr: Si vous rencontrez des erreurs lors de la construction du système LFS, si vous avez des questions ou si vous pensez qu'il y a une coquille dans ce livre, merci de commencer par consulter la <acronym>FAQ</acronym> (Foire aux Questions) sur <ulink url="&faq-root;"/>.

source: Chapter&nbsp;1 - Mailing Lists
fr: Chapitre&nbsp;1 — Listes de diffusion

source: Mailing Lists
fr: Listes de diffusion

source: The <systemitem class='domainname'>linuxfromscratch.org</systemitem> server hosts a number of mailing lists used for the development of the LFS project. These lists include the main development and support lists, among others. If you cannot find an answer to your problem on the FAQ page, the next step would be to search the mailing lists at <ulink url="&lfs-root;search.html"/>.
fr: Le serveur <systemitem class='domainname'>linuxfromscratch.org</systemitem> gère quelques listes de diffusion utilisées pour le développement du projet LFS. Ces listes incluent, entre autres, les listes de développement et d'aide. Si la FAQ ne résout pas votre problème, la prochaine étape serait de chercher dans les listes de diffusion sur <ulink url="&lfs-root;search.html"/>.

source: For information on the different lists, how to subscribe, archive locations, and additional information, visit <ulink url="&lfs-root;mail.html"/>.
fr: Pour connaître les listes disponibles, les conditions d'abonnement, l'emplacement des archives et quelques autres informations, allez sur <ulink url="http://fr.linuxfromscratch.org/aide"/>.

source: Several members of the LFS community offer assistance via Internet Relay Chat (IRC). Before using this support, please make sure your question is not already answered in the LFS FAQ or the mailing list archives. You can find the IRC network at <systemitem class='domainname'>irc.libera.chat</systemitem>. The support channel is named #lfs-support.
fr: Plusieurs membres de la communauté LFS offrent leur aide sur IRC. Avant d'utiliser ce mode de communication, assurez-vous que la réponse à votre question ne se trouve pas déjà dans la FAQ LFS ou dans les archives des listes de diffusion. Vous trouverez le réseau IRC à l'adresse <systemitem class='domainname'>irc.libera.chat</systemitem>. Le canal d'entre-aide en français se nomme #lfs-fr.

source: Chapter&nbsp;1 - Mirror sites
fr: Chapitre&nbsp;1 — sites mirroirs

source: Mirror Sites
fr: Sites miroirs

source: The LFS project has a number of world-wide mirrors to make accessing the website and downloading the required packages more convenient. Please visit the LFS website at <ulink url="&lfs-root;mirrors.html"/> for a list of current mirrors.
fr: Le projet LFS a un bon nombre de miroirs configurés tout autour du monde pour faciliter l'accès au site web ainsi que le téléchargement des paquets requis. Merci de visiter le site web de LFS sur <ulink url="&lfs-root;mirrors.html"/> pour obtenir une liste des miroirs à jour.

source: Contact Information
fr: Contacts

source: Please direct all your questions and comments to one of the LFS mailing lists (see above).
fr: Merci d'envoyer toutes vos questions et commentaires sur les listes de diffusion LFS (voir ci-dessus).
