Repository: espindula/br-lfs
Catalog: clfs/*/final-system/multilib/libtool.po
Languages: fr

source: Libtool-&libtool-version; 32 Bit Libraries
fr: Bibliothèques 32 Bit Libtool-&libtool-version;

source: 32 Bit
fr: 32 bits

source: Installation of Libtool
fr: Installation de Libtool

source: The following <filename>config.cache</filename> entry overrides the default search path, which does not take multilib into account:
fr: Le fichier <filename>config.cache</filename> suivant permet de forcer le chemin de recherche par défaut pour prendre en compte l'environnement multilib&nbsp;:

source: To test the results, first identify whether you are on a big- or little-endian machine. SGI machines are usually big-endian, Cobalt are usually little-endian. If in doubt you can <command>echo ${MACHTYPE} | grep 'el-' </command>- this will match a little-endian machine.
fr: Pour tester les résultats, vous devez d'abord savoir si votre machine a une architecture big-endian ou little-endian. Les machines SGI sont généralement de type big-endian et les Cobalt sont de type little-endian. Si vous avez un doute, <command>echo ${MACHTYPE} | grep 'el-' </command> trouvera une occurrence sur une machine de type little-endian.

source: To test on a little-endian machine issue: <userinput>make LDEMULATION=elf32ltsmip check</userinput>.
fr: Pour tester les résultats sur une machine little-endian, lancez&nbsp;: <userinput>make LDEMULATION=elf32ltsmip check</userinput>.

source: To test on a big-endian machine issue: <userinput>make LDEMULATION=elf32btsmip check</userinput>.
fr: Pour tester les résultats sur une machine big-endian, lancez&nbsp;: <userinput>make LDEMULATION=elf32btsmip check</userinput>.

source: The meaning of the override on make check:
fr: Voici la signification du paramètre de make check&nbsp;:

source: Libtool tends to do the wrong thing when building for multilib, at least on the non-default size(s) of architecture. The causes of these errors are not well understood and they can appear, or disappear, as a result of apparently innocuous other changes in the build. In this version of the book, one of the tests (pdemo-make) fails to link because it tries to link the 32-bit objects against 64-bit system libraries. This option enables the test to succeed without impacting the other tests (compare the common alternative fixes of <literal>LD="gcc ${BUILD32}"</literal> which causes far fewer tests to be executed, and configuring with <literal>LDFLAGS='-L/lib -L/usr/lib'</literal> which in this case causes other tests to fail.)
fr: Libtool a tendance à se comporter de façon inattendue en environnement multilib, du moins sur des architectures autres que celle par défaut. On ne saisit pas tout à fait les causes de ces erreurs car elles peuvent apparaître ou disparaître bon gré mal gré, même lors de changements normalement inoffensifs au bon déroulement de la compilation. Dans cette version du livre, l'un des tests, pdemo-make, ne se lie pas correctement car il cherche à lier les objets 32 bits aux bibliothèques 64 bits du système. Cette option permet à ce test de réussir sans impacter les autres tests (par rapport aux méthodes de correction plus traditionnelles comme spécifier <literal>LD="gcc ${BUILD32}"</literal>, ce qui empêche l'exécution de nombreux test ou bien configurer avec <literal>LDFLAGS='-L/lib -L/usr/lib'</literal>, ce qui dans ce cas fait échouer d'autres tests).

source: Prepare <filename>libtool</filename> to be wrapped by the multiarch wrapper. Libtool by itself is not multilib aware:
fr: Préparez <filename>libtool</filename> à être pris en charge par le programme enveloppe multi-architectures («&nbsp;multiarch-wrapper&nbsp;»). Libtool seul ne supporte pas l'environnement multilib&nbsp;:

source: Details on this package are located in <xref linkend="contents-libtool" role="."/>
fr: Des détails sur ce paquet se trouvent sur <xref linkend="contents-libtool" role="."/>
