Repository: espindula/br-lfs
Catalog: clfs/*/final-system/multilib/multiarch_wrapper.po
Languages: fr

source: Creating a Multiarch Wrapper
fr: Création d'un programme enveloppe multi-architecture («&nbsp;Multiarch Wrapper&nbsp;»)

source: The Multiarch Wrapper is used to wrap certain binaries that have hardcoded paths to libraries or are architecture specific.
fr: Le programme envoloppe multi-architecture, ou «&nbsp;Multiarch Wrapper&nbsp;», sert à envelopper certains binaires contenant en dur les chemins vers leurs bibliothèques ou bien qui sont spécifiques à certaines architectures..

source: Installation of The Multiarch Wrapper
fr: Installation du programme enveloppe multi-architecture

source: Create the source file:
fr: Créez le fichier source&nbsp;:

source: Compile and Install the Multiarch Wrapper:
fr: Compilez et installez le «&nbsp;Multiarch Wrapper&nbsp;»&nbsp;:

source: This multiarch wrapper is going to be used later on in the book with Perl. It will also be very useful outside of the base CLFS system.
fr: Ce programme sera utilisé plus tard dans le livre avec Perl. Il sera également très utile hors du système CLFS de base.

source: Create a testcase:
fr: Faisons un test&nbsp;:

source: Test the wrapper:
fr: Testons le programme enveloppe&nbsp;:

source: The output of the above command should be:
fr: Le résultat de ces commandes devrait être alors&nbsp;:

source: Remove the testcase source, binaries, and link:
fr: Supprimez les sources, les binaires et le lien du test&nbsp;:

source: Contents of The Multiarch Wrapper
fr: Contenu de The Multiarch Wrapper

source: Installed programs
fr: Programmes installés

source: Short Descriptions
fr: Descriptions courtes

source: Will execute a different program based on the <envar>USE_ARCH</envar> variable. The <envar>USE_ARCH</envar> variable will be the suffix of the executed program.
fr: Exécute un programme différent en se basant sur la variable <envar>USE_ARCH</envar>. Cette variable <envar>USE_ARCH</envar> sera alors le suffixe du programme exécuté.
