Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/scanning/sane.xml.1.chaine.po
Languages: fr

source: 5.7 MB
fr: 5.7 Mo

source: 129 MB (additional 34 MB for tests)
fr: 129 Mo (additional 34 Mo for tests)

source: 231 KB
fr: 231 Ko

source: 3.0 MB
fr: 3.0 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to SANE
fr: Introduction à SANE

source: Scanner access; however, is far from easy, since every vendor has their own protocols.
fr: Cependant, l'accès au scanner est loin d'être facile, vu que chaque fabricant a ses propres protocoles.

source: The only known protocol that should bring some unity into this chaos is the TWAIN interface, but this is too imprecise to allow a stable scanning framework.
fr: Le seul protocole connu qui devrait apporter un peu d'unité dans ce chaos est l'interface TWAIN, mais c'est trop imprécis pour permettre un environnement de numérisation stable.

source: Therefore, _A917_ comes with its own protocol, and the vendor drivers can't be used.
fr: _A917_ est donc fourni avec son propre protocole et on ne peut pas utiliser les pilotes du fabricant.

source: The back ends are drivers for the supported scanners and cameras.
fr: Les fondations sont des pilotes des scanners et des appareils photo.

source: The front ends are user interfaces to access the backends.
fr: Les interfaces sont des interfaces utilisateur pour accéder aux fondations.

source: Back Ends Package Information
fr: Information sur le paquet des fondations

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Front Ends Package Information
fr: Informations sur le paquet d'interfaces

source: SANE Dependencies
fr: Dépendances de SANE

source: Optional (Back Ends)
fr: Optionnelles (Back Ends)

source: Optional (Front Ends)
fr: Optionnelles (Front Ends)

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration, Drivers and Additional Packages
fr: Configuration du noyau, des pilotes et des paquets supplémentaires

source: To access your scanner, you will probably need the related kernel drivers and/or additional support packages.
fr: Pour accéder à votre scanner, vous aurez probablement besoin les pilotes associés du noyau et/ou les paquets de support supplémentaires.

source: A SCSI scanner will need SCSI drivers, a parallel port scanner needs parallel port support (you should use enhanced EPP modes) and perhaps _L1947_ , and a USB scanner will need the _X53_ package.
fr: Un scanner SCSI aura besoin des pilotes SCSI, un scanner en port parallèle a besoin du support du port parallèle (vous devriez utiliser les modes EPP amélioré) et peut-être _L1947_ et un scanner USB aura besoin du paquet _X53_.

source: For HP devices, you may need _L1950_ .
fr: Pour les périphériques HP, vous aurez besoin de _L1950_.

source: Ensure you have the necessary drivers properly configured to access the devices.
fr: Assurez-vous d'avoir correctement configuré les pilotes nécessaires pour accéder aux périphériques.

source: Installation of SANE
fr: Installation de SANE

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Installation of SANE Front Ends
fr: Installation des interfaces de SANE

source: The _A917_ -frontends package includes the graphical frontends _C1776_ and _C1777_ , and a command-line frontend _C1778_ .
fr: Le paquet _A917_ -frontends inclus les interfaces graphiques _C1776_ et _C1777_ ainsi qu'une interface en ligne de commande _C1778_.

source: You don't need this package if you intend to use one of the more advanced graphical frontends like _X499_ .
fr: Vous n'avez pas besoin de ce paquet si vous souhaitez utiliser une des interfaces graphiques plus avancées comme _X499_.

source: For a list of frontend packages, see _L1951_ .
fr: Pour une liste des paquets d'interface, voir _L1951_.

source: To install _A917_ -frontends, use the following commands:
fr: Pour installer _A917_ -frontends, utilisez les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: If _A24_ was linked into the build and you wish _A24_ to use _C1776_ as a scanning plugin, issue the following command as the _U2_ user:
fr: Si vous avez lié _A24_ à la construction et si vous souhaitez que _A24_ utilise _C1776_ comme plugin de numérisation, exécutez les commandes suivantes en tant qu'utilisateur _U2_ :

source: If the plugin _C1776_ is disabled in _A24_ 's menu, in order to enable it, "create" a blank image using the menu or Ctrl-N.
fr: Si le plugin _C1776_ est désactivé du menu de _A24_ , pour l'activer , "créez" une image blanche en utilisant le menu ou Ctrl-N.

source: After that, it is enabled.
fr: Après cela, il sera activé.

source: Command Explanations
fr: Explications des commandes

source: This switch installs the configuration files in _F517_ instead of _F518_ .
fr: Ce paramètre installe les fichiers de configuration dans _F517_ et non dans _F518_.

source: This parameter causes the directory created for the locking files to be group owned by the _U17_ group instead of the default _U18_ group.
fr: Ce paramètre fait que le répertoire créé pour les fichiers de verrou doit appartenir au groupe _U17_ au lieu du groupe par défaut _U18_.

source: This command is used to exit the shell created by the _C1780_ command.
fr: Cette commande est utilisée pour sortir du shell créé par la commande _C1780_.

source: Configuring SANE
fr: Configuration de SANE

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Backend Configuration
fr: Configuration des fondations

source: The backend configuration files are located in _F517_ .
fr: Les fichiers de configuration des fondations se trouvent dans _F517_.

source: Information for configuring the various backends can be found by using the man (5) page for the desired backend.
fr: Vous pouvez des informations sur la configuration des diverses fondations en utilisant la page de man (5) de la fondation désirée.

source: Run _C1781_ , substituting the desired backend.
fr: Lancez _C1790_ , en remplaçant par la fondation désirée.

source: Add any desired users to the _U17_ group.
fr: Ajoutez les utilisateurs désirés au groupe _U17_ group.

source: If you want to access a network scanner, include two lines in _F1334_ , as _U2_ user (make sure to replace &lt;server_ip&gt; by the actual value, below):
fr: Si vous voulez accéder à un scanner réseau, ajoutez deux lignes dans _F1334_ , en tant qu'utilisateur _U2_ (soyez certain de remplacer &lt;server_ip&gt; par la bonne valeur) :

source: On the server side, include the client ip in the access list of _F1335_ , restart the _C1782_ daemon, and make sure the firewall, if any, is open to the client.
fr: Coté du serveur, ajoutez l'ip du client dans la liste d'accès de _F1335_ , redémarrez le démon _C1782_ , et soyez certain que le pare-feu, s'il y en a un, est ouvert pour le client.

source: Frontend Configuration
fr: Configuration de l'interface

source: If you use a desktop environment like _A381_ or _A225_ you may wish to create a _F1336_ file so that _A918_ appears in the panel's menus.
fr: Si vous utilisez un environnement de bureau comme _A381_ ou _A225_ vous devrez créer un fichier _F1336_ pour que _A918_ apparaisse dans le menu.

source: As the _U2_ user:
fr: En tant qu'utilisateur _U2_ :

source: General Information
fr: Informations générales

source: For general information about configuring and using _A917_ , see _C1783_ .
fr: Pour des informations générales sur la configuration et l'utilisation de _A917_ , voir _C1783_.

source: Linux-2.6.x brings some special issues into the picture.
fr: Linux-2.6.x apporte des problèmes spéciaux en matière d'image.

source: See _L1952_ for information about using _A917_ with the Linux-2.6.x kernel.
fr: Voir _L1952_ pour des informations sur l'utilisation de _A917_ avec le noyau Linux-2.6.x.

source: For information about USB scanning devices, run _C1784_ .
fr: Pour des informations sur les périphériques scanner USB, lancez _C1784_.

source: For information about SCSI devices, run _C1785_ .
fr: Pour des informations sur les périphériques SCSI, lancez _C1785_.

source: Configuration and setup of the 'saned' daemon
fr: Configuration et paramétrage du démon 'saned'

source: The _C1782_ daemon is not meant to be used for untrusted clients.
fr: Le démon _C1782_ n'est pas conçu pour être utilisé pour des clients non fiables.

source: You should provide _X195_ protection to ensure only trusted clients access the daemon.
fr: Vous devriez fournir une protection _X195_ pour vous assurer que seuls des clients de confiance accèdent au démon.

source: Due to the complex security requirements to ensure only trusted clients access the daemon, BLFS does not provide instructions to configure the _C1782_ daemon.
fr: Vu la complexité des exigences de sécurité pour être sûr que seuls les clients de confiance accèdent au démon, BLFS ne fournit pas d'instructions pour configurer le démon _C1782_.

source: If you desire to make the daemon available, ensure you provide adequate security, configure your _F1337_ file and send a
fr: Si vous désirez rendre le démon disponible, assurez-vous de fournir la sécurité adaptée, de configurer votre fichier _F1339_ et d'envoyer un

source: to the[x]inetd daemon.
fr: au démon[x]inetd.

source: Some good information for setting up and securing the _C1782_ daemon can be found at _L1953_ .
fr: Vous pouvez trouver de bonnes informations sur le paramétrage et la sécurisation du démon _C1782_ sur _L1953_.

source: Contents
fr: Contenu

source: Back Ends:
fr: Fondements :

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: gamma4scanimage, sane-config, saned, sane-find-scanner, and scanimage
fr: gamma4scanimage, sane-config, saned, sane-find-scanner, et scanimage

source: libsane.so and numerous scanner backend modules
fr: libsane.so et numerous scanner backend modules

source: /etc/sane.d, /usr/{include, lib, share}/sane, and /usr/share/doc/sane-&sane-version;
fr: /etc/sane.d, /usr/{include, lib, share}/sane, et /usr/share/doc/sane-&sane-version;

source: Front Ends:
fr: Interfaces :

source: Installed Library
fr: Bibliothèque installée

source: scanadf, xcam, and xscanimage
fr: scanadf, xcam, et xscanimage

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: creates a gamma table in the format expected by _C1787_ .
fr: crée une table gamma au format attendu par _C1787_.

source: is a tool used to determine the compiler and linker flags that should be used to compile and link _A917_ .
fr: est un outil utilisé pour déterminer les drapeaux du compilateur et de l'éditeur de liens qui devraient être utilisés pour compiler et lier _A917_.

source: is the _A917_ daemon that allows remote clients to access image acquisition devices available on the local host.
fr: est le démon _A917_ qui permet à un client distant d'accéder aux périphériques d'acquisition d'images disponibles sur l'hôte local.

source: is a command-line tool to find SCSI and USB scanners and determine their device files.
fr: est un outil en ligne de commande pour chercher des scanners SCSI et USB et pour déterminer leurs fichiers de périphérique.

source: Its primary purpose is to make sure that scanners can be detected by _A917_ backends.
fr: Son premier objectif est d'assurer que les scanners puissent être détectés par les fondations _A917_.

source: is a command-line interface to control image acquisition devices which are equipped with an automatic document feeder (ADF).
fr: est une interface en ligne de commande pour contrôler des des périphériques d'acquisition d'image équipés d'un alimenteur automatique de document (_fpo_automatic document feeder_fpf_).

source: is a command line interface for scanning from image acquisition devices such as flatbed scanners or cameras.
fr: est une interface en ligne de commande pour numériser à partir de périphériques d'acquisition d'image tels que des scanners à plat ou des appareils photos.

source: It is also used to list the available backend devices.
fr: On l'utilise aussi pour lister les périphériques fondations disponibles.

source: is a graphical camera front end for _A917_ .
fr: est une interface d'appareil photo graphique pour _A917_.

source: is a graphical user interface for scanning.
fr: est une interface graphique pour la manipulation d'images.

source: is the application programming interface that is used to communicate between frontends and backends.
fr: est l'interface de programmation de l'application utilisée pour communiquer entre des interfaces et des fondations.

source: modules are backend scanning library plugins used to interface with scanning devices.
fr: ces modules sont des plugins de bibliothèque de numérisation des fondations utilisées comme interface avec les périphériques de numérisation.
