Repository: espindula/br-lfs
Catalog: clfs/*/introduction/x86/livecd.po
Languages: fr

source: About the Included CD
fr: À propos du CD inclus

source: For your convenience, we have included a CD with this book that contains the source packages needed for creating a Linux From Scratch system. The CD is bootable and provides a stable working environment for building CLFS. This book refers to this system as the <quote>host system.</quote> The CD images are actively maintained and updated versions can be found at <ulink url="ftp://ftp.lfs-matrix.de/pub/lfs-livecd/"/>
fr: Pour votre confort, nous avons inclus un CD avec ce livre qui contient les paquets source requis pour créer un système Linux From Scratch. Le CD est amorçable et fournit un environnement de travail stable pour construire CLFS. Ce livre se réfère à ce système en tant que <quote>système hôte</quote>. Les images des CD sont activement maintenues et des versions mises à jour sont disponibles sur <ulink url="ftp://ftp.lfs-matrix.de/pub/lfs-livecd/"/>.

source: In addition to the tools required to build LFS, the host system on the CD has a number of other helpful tools installed:
fr: En plus des outils requis pour construire LFS, le système hôte sur le CD a un certain nombre d'outils utiles installé&nbsp;:

source: The X Window System Environment
fr: L'environnement de fenêtrage X

source: Web Tools
fr: Des outils Web

source: Wget (command line file retriever)
fr: Wget (pour télécharger des fichiers en ligne de commande)

source: Lynx (text web browser)
fr: Lynx (un navigateur web en mode texte)

source: Irssi (console IRC client)
fr: Irssi (un client IRC en console)

source: Firefox (graphical web browser)
fr: Firefox (un navigateur web graphique)

source: Xchat (X-based IRC client)
fr: Xchat (un client IRC basé sur X)

source: Text Editors
fr: Éditeurs de Texte

source: Network Tools
fr: Outils Réseaux

source: SSH Server and Client
fr: Serveur et Client SSH

source: NFS Server and Client
fr: Serveur et Client NFS

source: Smbmount (mount.cifs) for Windows shares
fr: Smbmount (mount.cifs) pour les partages Windows

source: Dhcpcd (DHCP client)
fr: Dhcpcd (un client DHCP)

source: Filesystem Programs
fr: Programmes de Systèmes de Fichiers
