Repository: espindula/br-lfs
Catalog: blfs/*/gnome/applications/gnome-tweaks.po
Languages: fr

source: 248 KB
fr: 248&nbsp;Ko

source: 5.3 MB
fr: 5.3&nbsp;Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to GNOME Tweaks
fr: Introduction à GNOME Tweaks

source: <application>GNOME Tweaks</application> is a simple program used to tweak advanced <application>GNOME</application> settings.
fr: <application>GNOME Tweaks</application> est un simple programme utilisé pour personnaliser les paramètres avancés de <application>GNOME</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-tweaks-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-tweaks-download-http;"/>

source: Download (FTP): <ulink url="&gnome-tweaks-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-tweaks-download-ftp;"/>

source: Download MD5 sum: &gnome-tweaks-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-tweaks-md5sum;

source: Download size: &gnome-tweaks-size;
fr: Taille du téléchargement&nbsp;: &gnome-tweaks-size;

source: Estimated disk space required: &gnome-tweaks-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-tweaks-buildsize;

source: Estimated build time: &gnome-tweaks-time;
fr: Estimation du temps de construction&nbsp;: &gnome-tweaks-time;

source: GNOME Tweaks Dependencies
fr: Dépendances de GNOME Tweaks

source: Required
fr: Requises

source: <xref linkend="gtk3"/>, <xref linkend="gsettings-desktop-schemas"/>, <xref linkend="libhandy1"/>, <xref linkend="pygobject3"/>, and <xref linkend="sound-theme-freedesktop"/>
fr: <xref linkend="gtk3"/>, <xref linkend="gsettings-desktop-schemas"/>, <xref linkend="libhandy1"/>, <xref linkend="pygobject3"/> et <xref linkend="sound-theme-freedesktop"/>

source: User Notes: <ulink url="&blfs-wiki;/gnome-tweaks"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-tweaks"/>

source: Installation of GNOME Tweaks
fr: Installation de GNOME Tweaks

source: First, if you are upgrading from gnome-tweaks-3.34.x, remove some incompatible files as the <systemitem class="username">root</systemitem> user:
fr: Tout d'abord, si vous mettez à jour à partir de gnome-tweaks-3.34.x, supprimez certains fichiers incompatibles en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Install <application>GNOME Tweaks</application> by running the following commands:
fr: Installez <application>GNOME Tweaks</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: /usr/lib/python&python3-majorver;/site-packages/gtweak and /usr/share/gnome-tweaks
fr: /usr/lib/python&python3-majorver;/site-packages/gtweak et /usr/share/gnome-tweaks

source: Short Descriptions
fr: Descriptions courtes

source: is used to tweak advanced <application>GNOME</application> settings
fr: est utilisé pour personnaliser les paramètres avancés de <application>GNOME</application>
