Repository: espindula/br-lfs
Catalog: blfs/*/kde/kf5-apps/libkdcraw.po
Languages: fr

source: 40 KB
fr: 40&nbsp;Ko

source: 1.4 MB
fr: 1.4&nbsp;Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to libkdcraw
fr: Introduction à libkdcraw

source: <application>Libkdcraw</application> is a KDE wrapper around the <xref linkend="libraw"/> library for manipulating image metadata.
fr: <application>Libkdcraw</application> est une enveloppe KDE autour de la bibliothèque <xref linkend="libraw"/> pour manipuler les métadonnées des images.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&libkdcraw-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&libkdcraw-download-http;"/>

source: Download (FTP): <ulink url="&libkdcraw-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&libkdcraw-download-ftp;"/>

source: Download MD5 sum: &libkdcraw-md5sum;
fr: Somme de contrôle MD5&nbsp;: &libkdcraw-md5sum;

source: Download size: &libkdcraw-size;
fr: Taille du téléchargement&nbsp;: &libkdcraw-size;

source: Estimated disk space required: &libkdcraw-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &libkdcraw-buildsize;

source: Estimated build time: &libkdcraw-time;
fr: Estimation du temps de construction&nbsp;: &libkdcraw-time;

source: libkdcraw Dependencies
fr: Dépendances de libkdcraw

source: Required
fr: Requises

source: <xref linkend="kf5-frameworks"/> and <xref linkend="libraw"/>
fr: <xref linkend="kf5-frameworks"/> et <xref linkend="libraw"/>

source: User Notes: <ulink url="&blfs-wiki;/libkdcraw"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/libkdcraw"/>

source: Installation of libkdcraw
fr: Installation de libkdcraw

source: Install <application>libkdcraw</application> by running the following commands:
fr: Installez <application>libkdcraw</application> en exécutant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: $KF5_PREFIX/include/KF5/KDCRAW and $KF5_PREFIX/lib/cmake/KF5KDcraw
fr: $KF5_PREFIX/include/KF5/KDCRAW et $KF5_PREFIX/lib/cmake/KF5KDcraw
