Repository: espindula/br-lfs
Catalog: clfs/*/materials/mips/packages.po
Languages: fr

source: Additional Packages for MIPS
fr: Paquets supplémentaires pour MIPS

source: ARCLoad (&arcload-version;) - <token>&arcload-size;</token>:
fr: ARCLoad (&arcload-version;) - <token>&arcload-size;</token>&nbsp;:

source: Home page: <ulink url="&arcload-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&arcload-home;"/>

source: Download: <ulink url="&arcload-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&arcload-url;"/>

source: MD5 sum: <literal>&arcload-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&arcload-md5;</literal>

source: Colo (&colo-version;) - <token>&colo-size;</token>:
fr: Colo (&colo-version;) - <token>&colo-size;</token>&nbsp;:

source: Home page: <ulink url="&colo-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&colo-home;"/>

source: Download: <ulink url="&colo-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&colo-url;"/>

source: MD5 sum: <literal>&colo-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&colo-md5;</literal>

source: DVHtool (&dvhtool-version;) - <token>&dvhtool-size;</token>:
fr: DVHtool (&dvhtool-version;) - <token>&dvhtool-size;</token>&nbsp;:

source: Home page: <ulink url="&dvhtool-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&dvhtool-home;"/>

source: Download: <ulink url="&dvhtool-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&dvhtool-url;"/>

source: MD5 sum: <literal>&dvhtool-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&dvhtool-md5;</literal>
