Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/major/apache.xml.1.chaine.po
Languages: fr

source: 4.9 MB
fr: 4.9 Mo

source: 109 MB
fr: 109 Mo

source: Introduction to Apache HTTPD
fr: Introduction à Apache HTTPD

source: The _A758_ package contains an open-source HTTP server.
fr: Le paquet _A758_ contient un serveur HTTP open-source.

source: It is useful for creating local intranet web sites or running huge web serving operations.
fr: C'est utile pour créer des sites Internet d'Intranet locaux ou lancer d'immenses opérations de service Internet.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: Apache HTTPD Dependencies
fr: Dépendances d'Apache HTTPD

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Apache HTTPD
fr: Installation d'Apache HTTPD

source: For security reasons, running the server as an unprivileged user and group is strongly encouraged.
fr: Pour des raisons de sécurité, l'exécution du serveur en tant qu'utilisateur et groupe non privilégiés est fortement conseillée.

source: Create the following group and user using the following commands as _U1_ :
fr: Créez le groupe et l'utilisateur suivant en utilisant les commandes suivantes :

source: Build and install _A758_ by running the following commands:
fr: Construisez et installez _A758_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user (notice that DESTDIR does not work properly as unpriviledged user):
fr: Maintenant, en tant qu'utilisateur _U1_ (notez que DESTDIR ne fonctionne pas correctement en tant qu'utilisateur sans privilège) :

source: Command Explanations
fr: Explications des commandes

source: Forces the _A759_ utility to use absolute pathnames for modules, when instructed to do so.
fr: Force l'utilitaire _A759_ à utiliser les chemins absolus pour les modules quand les instructions le font.

source: Build FastCGI authorizer-based authentication and authorization (mod_authnz_fcgi.so fast CGI module).
fr: construit les authentifications basées sur FastCGI authorizer et les autorisations (module fast CGI mod_authnz_fcgi.so).

source: The modules should be compiled and used as Dynamic Shared Objects (DSOs) so they can be included and excluded from the server using the run-time configuration directives.
fr: Les modules devraient être compilés et utilisés comme objets partageables dymamiquement (_fpo_Dynamic Shared Objects_fpf_, DSOs) pour pouvoir être inclus et exclus du serveur qui utilise les lignes de configuration au moment de l'exécution.

source: This switch ensures that all MPM (Multi Processing Modules) are built as Dynamic Shared Objects (DSOs), so the user can choose which one to use at runtime.
fr: CE paramètre assure que tous les MPM (Multi Processing Modules) sont constuit en tant que Dynamic Shared Objects (_fpo_Dynamic Shared Objects_fpf_, DSOs), pour que l'utilisateur puisse choisir lequel utiliser à l'éxécution.

source: This switch enables building of the _A322_ suEXEC module which can be used to allow users to run CGI and SSI scripts under user IDs different from the user ID of the calling web server.
fr: Ce paramètre active la construction du module suEXEC de _A322_ qui peut être utilisé pour autoriser les utilisateurs à lancer des scripts CGI et SSI avec un ID différent de l'ID de l'utilisateur du serveur web appelant.

source: These switches control suEXEC module behavior, such as default document root, minimal UID that can be used to run the script under the suEXEC.
fr: Ces paramètres contrôlent le comportement du module suEXEC, comme le document racine par défaut, l'UID minimal qui peut être utilisé pour lancer des scripts dans le suEXEC.

source: These commands put _C2019_ wrapper into proper location, since it is not meant to be run directly.
fr: Ces commandes mettent l'enveloppe _C2019_ au bon endroit, car il n'est pas destiné à être exécuté directement.

source: They also adjust proper permissions of the binary, making it setgid _U16_ .
fr: Ils ajustent aussi les permissions pour le binaire, mettant sont segid à _U16_.

source: By default, the installation process installs files (documentation, error messages, default icons, etc. ) with the ownership of the user that extracted the files from the tar file.
fr: Par défaut, le processus d'installation installe des fichiers (documentation, messages d'erreur, icônes par défaut, etc. ) avec comme propriétaire l'utilisateur qui a extrait les fichiers de l'archive tar.

source: If you want to change the ownership to another user, you should do so at this point.
fr: Si vous voulez modifier la propriété au profit d'un autre utilisateur, vous devriez le faire à ce moment.

source: The only requirement is that the document directories need to be accessible by the _C2021_ process with (r-x) permissions and files need to be readable (r--) by the _U16_ user.
fr: La seule exigence est que les répertoires des documents soient accessibles par le processus _C2021_ avec les droits (r-x) et il faut que les fichiers soient lisibles (r--) par l'utilisateur _U16_.

source: Configuring Apache
fr: Configuration d'Apache

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: See _L1353_ for detailed instructions on customising your _A322_ HTTP server configuration file.
fr: Voir _L1353_ pour des instructions détaillées sur la personnalisation de votre fichier configuration du servur HTTP _A322_.

source: Boot Script
fr: Script de démarrage

source: If you want the _A322_ server to start automatically when the system is booted, install the _F809_ init script included in the _X203_ package.
fr: Si vous voulez que le serveur _A322_ démarre automatiquement quand le système est démarré, installez le script d'initialisation _F809_ inclu dans le paquet _X203_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: ab, apachectl, apxs, checkgid, dbmmanage, fcgistarter, htcacheclean, htdbm, htdigest, htpasswd, httpd, httxt2dbm, logresolve, rotatelogs, and suexec
fr: ab, apachectl, apxs, checkgid, dbmmanage, fcgistarter, htcacheclean, htdbm, htdigest, htpasswd, httpd, httxt2dbm, logresolve, rotatelogs, et suexec

source: Several libraries under /usr/lib/httpd/modules/
fr: Plusieurs bibliothèques sous /usr/lib/httpd/modules/

source: Short Descriptions
fr: Descriptions courtes

source: is a tool for benchmarking your _A322_ HTTP server.
fr: est un outil d'évaluation de votre serveur HTTP _A322_.

source: is a front end to the _A322_ HTTP server which is designed to help the administrator control the functioning of the _A322_ httpd daemon.
fr: est une interface avec le serveur HTTP _A322_ conçue pour aider l'administrateur à contrôler le fonctionnement du démon httpd d'_A322_.

source: is a tool for building and installing extension modules for the _A322_ HTTP server.
fr: est un outil pour construire et installer les modules pour le serveur HTTP _A322_.

source: is a program that checks whether it can setgid to the group specified.
fr: est un programme qui vérifie s'il peut initialiser le gid du groupe spécifié.

source: This is to see if it is a valid group for Apache2 to use at runtime.
fr: C'est pour voir si un groupe valide existe pour Apache2 afin de l'utiliser à l'éxécution.

source: If the user (should be run as superuser) is in that group, or can setgid to it, it will return 0.
fr: Si l'utilisateur (doit être lancé en superutilisateur) est dans ce groupe, ou peut être initialisé dans ce groupe, le programme retournera 0.

source: is used to create and update the DBM format files used to store usernames and passwords for basic authentication of HTTP users.
fr: est utilisé pour créer et mettre à jour les fichiers au format DBM utilisés pour stocker les noms d'utilisateur et les mots de passe pour l'authentication de base des utilisateurs HTTP.

source: is a tool to start a FastCGI program.
fr: est un outil pour démarrer un programme FastCGI.

source: is used to clean up the disk cache.
fr: est utilisé pour nettoyer le cache disque.

source: is used to manipulate the DBM password databases.
fr: est utilisé pour manipuler la basse de données DBM des mots de passe.

source: is used to create and update the flat-files used to store usernames, realms and passwords for digest authentication of HTTP users.
fr: est utilisé pour créer et mettre à jour les fichiers plats utilisés pour stocker les noms d'utilisateur, les realms et les mots de passe pour une authentication digest des utilisateurs HTTP.

source: is used to create and update the flat-files used to store usernames and passwords for basic authentication of HTTP users.
fr: est utilisé pour créer et mettre à jour les fichiers plats utilisés pour stocker les noms d'utilisateur et les mots de passe pour une authentication des utilisateurs HTTP.

source: is the _A322_ HTTP server program.
fr: est le serveur HTTP _A322_.

source: is used to generate DBM files from text, for use in RewriteMap.
fr: est utilisé pour générer les fichiers DBM depuis des entrées textes, qui seront utilisés dans RewriteMap.

source: allows users to run CGI and SSI applications as a different user.
fr: permet aux utilisateurs de lancer des applications CGI et SSI avec un utilisateur différent.
