Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/major/bind.xml.1.chaine.po
Languages: fr

source: 8.2 MB
fr: 8.2 Mo

source: 137 MB (additional 93 MB for the test suite)
fr: 137 Mo (additional 93 Mo for the test suite)

source: Introduction to BIND
fr: Introduction à BIND

source: The _A555_ package provides a DNS server and client utilities.
fr: Le paquet _A555_ offre un serveur et un client DNS.

source: If you are only interested in the utilities, refer to the _X344_ .
fr: Si vous n'êtes intéressé que par les outils, reportez-vous au chapitre _X344_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Optional patch (if net-tools is not installed):
fr: Correctif facultatif (si net-tools n'est pas installé) :

source: BIND Dependencies
fr: Dépendances de BIND

source: Optional
fr: Optionnelles

source: Optional database backends
fr: Moteurs facultatifs de base de données

source: Optional (to run the test suite)
fr: Optionnelles (pour lancer la suite de tests)

source: Optional (to rebuild the documentation)
fr: Optionnelles (pour reconstruire la documentation)

source: User Notes:
fr: Notes utilisateur :

source: Install _A555_ by running the following commands:
fr: Installez _A555_ en lançant les commandes suivantes :

source: Command Explanations
fr: Explications des commandes

source: This parameter forces _A555_ to look for configuration files in _F175_ instead of _F239_ .
fr: Ce paramètre oblige _A555_ à chercher des fichiers de configuration dans _F175_ et non dans _F239_.

source: This parameter enables multi-threading capability.
fr: Ce paramètre active la fonctionnalité de multi-threading.

source: This parameter forces the building of dynamic libraries and links the installed binaries to these libraries.
fr: Ce paramètre oblige la construction de bibliothèques et de liens dynamiques vers les binaires installés vers ces bibliothèques.

source: This parameter specifes a non-blocking random device for use with digital signatures.
fr: Ce paramètre spécifie un périphérique aléatoire non bloquant pour utiliser avec des signatures numériques.

source: Use this option if you want to be able to limit the the rate of recursive client queries.
fr: Utilisez cette option si vous voulez pouvoir limiter le taux des demandes clients récursives.

source: This may be useful on servers which receive a large number of queries.
fr: Cela peut être utilse sur les serveurs recevant beaucoup de demandes.

source: Enable the execute bit to prevent a warning when using _C1088_ to check library dependencies.
fr: Active le bit d'exécution pour empêcher un avertissement lors de l'utilisation de _C1088_ pour vérifier les dépendances de bibliothèque.

source: These commands install additional package documentation.
fr: Ces commandes installent la documentation supplémentaire du paquet.

source: Omit any or all of these commands if desired.
fr: Ne mettez pas tout ou partie de ces commandes si vous le désirez.

source: Configuring BIND
fr: Configuration de BIND

source: Config files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: This configuration is more secure in that a DNS compromise can only affect a few files in the _U11_ user's _E29_ directory.
fr: Cette configuration est plus sécurisée dans la mesure où la compromission d'un DNS ne peut toucher que quelques fichiers du répertoire de la variable _E29_ de l'utilisateur _U11_.

source: Create the unprivileged user and group _U11_:
fr: Créez l'utilisateur et le groupe non privilégiés _U11_ :

source: Set up some files, directories and devices needed by _A555_ :
fr: Paramétrez des fichiers, des répertoires et des périphériques dont a besoin _A555_ :

source: The _F1128_ file contains information for controlling _C1090_ operations with the _C1091_ utility.
fr: Le fichier _F1128_ contient des informations pour contrôler les opérations de _C1090_ avec l'outil _C1091_.

source: Generate a key for use in the _F1125_ and _F1130_ with the _C1092_ command:
fr: Générez une clé à utiliser dans _F1125_ et _F1130_ avec la commande _C1092_ :

source: Complete the _F1125_ file from which _C1090_ will read the location of zone files, root name servers and secure DNS keys:
fr: Complétez le fichier _F1125_ à partir duquel _C1090_ lira l'emplacement des fichiers de zone, le serveur de DNS racine, et les clés DNS sécurisées :

source: Create a zone file with the following contents:
fr: Créez un fichier de zone ayant le contenu suivant :

source: Create the _F1126_ file with the following commands:
fr: Créez le fichier _F1126_ avec les commandes suivantes :

source: Caution must be used to ensure there are no leading spaces in this file.
fr: Faites bien attention à vous assurer qu'il n'y a pas de grands espaces dans ce fichier.

source: The _F1126_ file is a list of root name servers.
fr: Le fichier _F1126_ est une liste de serveurs de DNS racines.

source: This file must be updated periodically with the _C1093_ utility.
fr: Il faut mettre régulièrement à jour ce fichier avec l'outil _C1093_.

source: A current copy of root.hints can be obtained from _L547_ .
fr: Vous pouvez obtenir une copie actuelle de root.hints sur _L549_.

source: For details, consult the "BIND 9 Administrator Reference Manual", included in every source archive of BIND 9 distributed by ISC, in HTML and PDF formats, also available at _L548_ .
fr: Pour plus de détails, consultez le the "BIND 9 Administrator Reference Manual".

source: Create or modify _F1129_ to use the new name server with the following commands:
fr: Créez ou modifiez _F1129_ pour utiliser le nouveau serveur de DNS avec les commandes suivantes :

source: Replace
fr: Remplacez

source: with your own valid domain name.
fr: par votre propre nom de domaine valide.

source: Set permissions on the _C537_ jail with the following command:
fr: Réglez les droits de la cage _C537_ avec la commande suivante :

source: Boot Script
fr: Script de démarrage

source: To start the DNS server at boot, install the _F1131_ init script included in the _X194_ package.
fr: Pour lancer le serveur DNS au démarrage, installez le script de démarrage _F1131_ inclu dans le paquet _X194_.

source: Now start _A555_ with the new boot script:
fr: Maintenant démarrez _A555_ avec le nouveau script de démarrage :

source: Testing BIND
fr: Tester BIND

source: Test out the new _A555_ 9 installation.
fr: Testez la nouvelle installation de _A555_ 9.

source: First query the local host address with _C1093_ :
fr: Cherchez tout d'abord l'adresse de l'hôte local avec _C1093_ :

source: Now try an external name lookup, taking note of the speed difference in repeated lookups due to the caching.
fr: Maintenant essayez une recherche de nom externe, en observant la différence de vitesse dans des recherches répétées du fait de la mise en cache.

source: Run the _C1093_ command twice on the same address:
fr: Lancez la commande _C1093_ deux fois sur la même adresse :

source: You can see almost instantaneous results with the named caching lookups.
fr: Vous pouvez voir presque des résultats instantanés avec les recherches de mise en cache nommées.

source: Consult the _A555_ Administrator Reference Manual located at _F1132_ in the package source tree, for further configuration options.
fr: Consultez le _fpo_Administrator Reference Manual_fpf_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: arpaname, bind9-config hardlinked to isc-config.sh, ddns-confgen, delv, dig, dnssec-checkds, dnssec-coverage, dnssec-dsfromkey, dnssec-importkey, dnssec-keyfromlabel, dnssec-keygen, dnssec-revoke, dnssec-settime, dnssec-signzone, dnssec-verify, genrandom, host, isc-hmac-fixup, lwresd hardlinked to named, named-checkconf, named-checkzone, named-compilezone (symlink), named-journalprint, named-rrchecker, nsec3hash, nslookup, nsupdate, rndc, rndc-confgen, and tsig-keygen (symlink)
fr: arpaname, bind9-config hardlinked to isc-config.sh, ddns-confgen, delv, dig, dnssec-checkds, dnssec-coverage, dnssec-dsfromkey, dnssec-importkey, dnssec-keyfromlabel, dnssec-keygen, dnssec-revoke, dnssec-settime, dnssec-signzone, dnssec-verify, genrandom, host, isc-hmac-fixup, lwresd hardlinked to named, named-checkconf, named-checkzone, named-compilezone (lien symbolique), named-journalprint, named-rrchecker, nsec3hash, nslookup, nsupdate, rndc, rndc-confgen, et tsig-keygen (lien symbolique)

source: /usr/include/{bind9, dns, dst, irs, isc, isccc, isccfg, lwres, pk11, pkcs11}, /usr/share/doc/bind-&bind-version; and /srv/named
fr: /usr/include/{bind9, dns, dst, irs, isc, isccc, isccfg, lwres, pk11, pkcs11}, /usr/share/doc/bind-&bind-version; et /srv/named

source: Short Descriptions
fr: Descriptions courtes

source: translate IP addresses to the corresponding ARPA names.
fr: traduit les adresses IP vers les noms ARPA correspondants.

source: hardlinked to _C1096_ .
fr: lié en dur à _C1096_.

source: generates a key for use by nsupdate and named.
fr: génère une clé qui est utilisée par nsupdate et named.

source: is a new debugging tool that is a successor to _C1093_ .
fr: est un nouvel outil de déboguage qui est le successeur de _C1093_.

source: interrogates DNS servers.
fr: interroge les serveurs de DNS.

source: is a DNSSEC delegation consistency checking tool.
fr: est un outil de vérification de cohérence de délégation DNSSEC.

source: verifies that the DNSSEC keys for a given zone or a set of zones have timing metadata set properly to ensure no future lapses in DNSSEC coverage.
fr: verifie que les clés DNSSEC pour une zone donnée ou un ensemble de zones ont des métadonnées de temps initialisées correctement pour assurer qu'il n'y aura pas d'espaces futures dans la couverture DNSSEC.

source: outputs the Delegation Signer (DS) resource record (RR).
fr: affiche l'enregistrement de ressoures (resource record RR) d'un signataire (Delegation Signer DS).

source: reads a public DNSKEY record and generates a pair of .key/.private files.
fr: lit un enregistrement public de DNSKEY et génère une paire de fichiers .key/.private.

source: gets keys with the given label from a crypto hardware and builds key files for DNSSEC.
fr: prends les clés avec le label donné depuis un matériel de crypto et construit les fichiers de clé pour DNSSEC.

source: is a key generator for secure DNS.
fr: est un générateur de clés pour du DNS sécurisé.

source: Set the REVOKED bit on a DNSSEC key.
fr: initialise le bit de révocation sur une clé DNSSEC.

source: set the key timing metadata for a DNSSEC key.
fr: initialise la métadonnée de temps d'une clé pour une clé DNSSEC.

source: generates signed versions of zone files.
fr: génère des versions signées des fichiers de zone.

source: verifies that a zone is fully signed for each algorithm found in the DNSKEY RRset for the zone, and that the NSEC / NSEC3 chains are complete.
fr: vérifie qu'une zone est complètement signée pour chaque algorithme trouvé dans DNSKEY RRset pour la zone, et que les chaines NSEC / NSEC3 sont complètes.

source: generate a file containing random data.
fr: génère un fichier contenant des données aléatoires.

source: is a utility for DNS lookups.
fr: est un outil de recherche de DNS.

source: prints information related to the installed version of ISC BIND.
fr: affiche les informations relatives à une version installée de ISC BIND.

source: fixes HMAC keys generated by older versions of BIND.
fr: corrige les clés HMAC générées par les anciennes versions de BIND.

source: is a caching-only name server for local process use.
fr: est un serveur de DNS pour la mise en cache seulement pour l'utilisation d'un processus local.

source: is the name server daemon.
fr: est le démon du serveur de DNS.

source: checks the syntax of _F1125_ files.
fr: vérifie la syntaxe des fichiers _F1125_.

source: checks zone file validity.
fr: vérifie la validité d'un fichier de zone.

source: is similar to _C1114_ , but it always dumps the zone contents to a specified file in a specified format.
fr: est similaire à _C1114_ , mais il enregistre aussi les contenus de la zone dans un fichier spécifié dans un format donné.

source: print zone journal in human-readable form.
fr: affiche le journal de zone dans un format lisible.

source: read a individual DNS resource record from standard input and checks if it is syntactically correct.
fr: lit un enregistrement de ressouce DN individuel depuis l'entrée standard et vérifie si se syntaxe est correct.

source: generates an NSEC3 hash based on a set of NSEC3 parameters.
fr: génère un hash NSEC3 basé sur un ensemble de paramètres NSEC3.

source: is a program used to query Internet domain nameservers.
fr: est un programme utilisé pour interroger des serveurs de nom de domaine sur Internet.

source: is used to submit DNS update requests.
fr: est utilisé pour soumettre des demandes de mise à jour de DNS.

source: controls the operation of _A555_ .
fr: contrôle le fonctionnement de _A555_.

source: generates _F1128_ files.
fr: génère des fichiers _F1128_.

source: is a symlink to _C1097_ .
fr: est un lien symbolique vers _C1097_.
