Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/major/proftpd.xml.1.chaine.po
Languages: fr

source: 29 MB
fr: 29 Mo

source: 69 MB
fr: 69 Mo

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of ProFTPD
fr: Installation de ProFTPD

source: For security reasons, you should install _A755_ using an unprivileged user and group.
fr: Pour des raisons de sécurité, vous devriez installer _A755_ en utilisant un utilisateur et un groupe non privilégiés.

source: As the _U1_ user:
fr: En tant qu'utilisateur _U1_ :

source: Install _A755_ as an unprivileged user by running the following commands:
fr: Installez _A755_ en tant qu'utilisateur non privilégié en lançant les commandes suivantes :

source: The tests for this package require a very old (2001) version of the Perl Module Test::Unit.
fr: Les tests de ce paquet exigent une version très ancienne (2001) du module perl Test::Unit.

source: Even when using that version of Test::Unit, there are many failures (41/1397) although the program appears to run well.
fr: Même en utilisant cette version de Test::Unit, il y a de nombreux échecs (41/1397) bien que le programme semble correctement s'exécuter.

source: The tests take a long time (45 minutes, not CPU dependent) and are not recommended.
fr: Les tests mettent beaucoup de temps (45 minutes, indépendamment du processeur) et ils ne sont pas recommandées.

source: To test the results anyway, add the switch:
fr: Pour tester quand même les résultats, ajoutez le paramètre :

source: If the tests are run with root privileges, more tests are run, but there are more failures.
fr: Si les tests sont lancés avec les privilèges root, beaucoup de tests sont lancés, mais il y a beaucoup d'erreurs.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Create the home directory for _A755_ .
fr: Crée le répertoire home de _A755_.

source: Set the default shell as a link to an invalid shell.
fr: Règle le shell par défaut comme un lien vers un shell invalide.

source: Fake a valid shell for compatibility purposes.
fr: Fait croire à un shell valide pour des raisons de compatibilité.

source: The above two commands can be omitted if the following directive is placed in the configuration file:
fr: Vous pouvez vous passer des deux commandes ci-dessus si vous mettez la ligne suivante dans le fichier de configuration :

source: By default, proftpd will require that users logging in have valid shells.
fr: Par défaut, proftpd exigera que les utilisateurs qui se connectent aient des shells valides.

source: The RequireValidShell directive turns off this requirement.
fr: La ligne RequireValidShell désactive cette exigence.

source: This is only recommended if you are setting up your FTP server exclusively for anonymous downloads.
fr: Ce n'est recommandé que si vous paramétrez votre serveur FTP exclusivement pour des téléchargements anonymes.

source: Support for most of the dependency packages requires using options passed to the _C121_ script.
fr: Le support de la plupart des paquets dépendants demande l'utilisation d'options passées au script _C121_.

source: View the output from _C276_ for complete information about enabling dependency packages.
fr: Regardez la sortie de _C276_ pour une information complète à propos de l'activation des paquets dépendants.

source: Configuring ProFTPD
fr: Configuration de ProFTPD

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: This is a simple, download-only sample configuration.
fr: C'est une configuration simple, un modèle pour téléchargement uniquement.

source: See the _A755_ documentation in _F796_ and consult the website at _L214_ for example configurations.
fr: Voir la documentation de _A755_ dans _F796_ et consultez le site Internet sur _L214_ pour des configurations d'exemple.

source: Boot Script
fr: Script de démarrage

source: Install the _F797_ init script included in the _X203_ package.
fr: Installez le script de démarrage _F797_ fourni dans le script de démarrage _X203_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: ftpasswd, ftpcount, ftpdctl, ftpmail, ftpquota, ftpscrub, ftpshut, ftptop, ftpwho, in.proftpd (symlink to proftpd), proftpd, and prxs
fr: ftpasswd, ftpcount, ftpdctl, ftpmail, ftpquota, ftpscrub, ftpshut, ftptop, ftpwho, in.proftpd (lien symbolique vers proftpd), proftpd, et prxs

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is the FTP daemon.
fr: est le démon FTP.

source: shows the current number of connections.
fr: affiche le nombre actuel de connexions.

source: is used to control the proftpd daemon while it is running.
fr: est utilisé pour contrôler le démon proftpd pendant qu'il est lancé.

source: is a Perl script designed to create and manage AuthUserFiles and AuthGroupFiles of the correct format for proftpd.
fr: est un script perl conçu pour créer et gérer AuthUserFiles and AuthGroupFiles du bon format pour proftpd.

source: is a Perl script for sending email based on the proftpd TransferLog.
fr: est un script perl pour envoyer des messages électroniques basés sur le TransferLog de proftpd.

source: is a Perl script designed to create and manage limits and tally files for the mod_quotatab + mod_quotatab_file module combination for proftpd.
fr: est un script Perl conçu pour créer et gérer l'association des modules mod_quotatab + mod_quotatab_file de proftpd des fichiers limits et tally.

source: provides a way to scrub the scoreboard file on demand.
fr: fournit une manière de nettoyer le fichier tableau de bord.

source: shuts down all _A756_ servers at a given time.
fr: arrête tous les serveurs _A756_ à une heure donnée.

source: displays running status on connections.
fr: affiche le statut d'exécution des connexions.

source: shows current process information for each session.
fr: affiche des informations sur le processus actuel pour chaque session.

source: is a Perl script designed to compile and install third-party modules, from source code, as DSO modules for the installed proftpd.
fr: est un script Perl conçu pour compiler et installer les modules tiers, depuis le code source, comme modules DSO pour le proftpd installé.
