Repository: espindula/br-lfs
Catalog: blfs/*/server/databases/upgradedb.po
Languages: fr

source: Important notes about upgrading Database Server Software
fr: Notes importantes sur la mise à jour du serveur de bases de données

source: This section is about reinstalling database software when an existing database is in use. It is not applicable for initial installations or if there is no existing database for the package being updated, but users should read through it to become aware of issues that can arise in the future.
fr: Cette section parle de la réinstallation des logiciels de bases de données lorsqu'une base de données est utilisée. Elle n'est pas pertinente pour l'installation initiale ou si vous n'avez pas de bases de données pour le paquet mis à jour, mais vous devriez lire cette section pour prendre connaissance des problèmes qui peuvent survenir dans le futur.

source: Lets start this chapter with a dramatic screenshot of an issue that really happened. This issue will not occur if you are going to install the software the first time:
fr: Commençons ce chapitre avec une copie d'écran d'un problème qui a vraiment eu lieu. Ce problème n'aura pas lieu si vous installez le logiciel pour la première fois&nbsp;:

source: To avoid situations like the one above finding your database server software refusing to start, read the following thoughts about how to upgrade a DBMS (Database Management System) prior to actually doing the upgrade.
fr: Pour éviter ce genre de situation où votre serveur de bases de données refuse de démarrer, lisez les réflexions suivantes à propos de la mise à jour d'un DBMS (système de gestion de bases de données) avant d'effectuer la mise à jour.

source: The root cause of the issue shown above was an upgrade of the server software to a newer major version but leaving the data files untouched. The administrator was able to recover without any loss of data.
fr: La cause principale du problème ci-dessus était la mise à jour du serveur vers une nouvelle version majeur et les fichiers de données qui n'ont pas été mis à jour. L'administrateur a réussi à corriger le problème sans perdre de données.

source: Even if you are doing an install DBMS install, read through this section. Tt will provide you information about how to set up backup and restore procedures (at least the strategy for building them) which are sufficient for your needs and for the safety of your data.
fr: Même si vous effectuez une installation de DBMS initiale, lisez cette section. Elle vous donnera des informations sur la mise en place de sauvegardes et les procédures de restauration (au moins la stratégie pour les créer) suffisantes pour vos besoins et pour la sûreté de vos données.

source: Upgrade database server packages
fr: Mise à jour des paquets de serveurs de bases de données

source: Database systems work on files which hold the database metadata and the data itself. Those files are highly optimized in their internal structures for use by the server software. When upgrading such server software, newer server software may expect a different file format than was created by previous versions. In the best case, the new software can act on the old format as well&mdash;but not benefitting from newer formats which might result in better performance or of other improvements. It can also happen that the new server software will reformat the data files automatically when starting.
fr: Les systèmes de bases de données fonctionnent sur les fichiers qui contiennent les métadonnées de la base de données et ses données. Ces fichiers sont fortement optimisés dans leur structure interne pour être utilisés par le serveur. Lors de la mise à jour de ce serveur, le nouveau serveur peut s'attendre à un format de fichier différent que celui créé par la version précédente. Dans le meilleur des cas, le nouveau serveur peut utiliser l'ancien format&mdash;mais sans bénéficier du nouveau format qui peut permettre de meilleures performances ou d'autres améliorations. Il se peut aussi que le nouveau serveur reformate les fichiers de données automatiquement au démarrage.

source: Unfortunately, the most likly case is that the new server software complains about out of date file formats and exits. When this happens and you have overwritten the installed server software, you may not be able to read the data files and the new software is unwilling to do so.
fr: Malheureusement, le cas le plus probable est que le nouveau serveur se plaigne du format obsolète et quitte. Lorsque cela se produit et que vous avez écrasé le serveur installé, vous pourriez ne plus pouvoir lire les fichiers de données et le nouveau serveur ne le fera pas non plus.

source: Changes in data file formats usually happen at major version changes but potentially can come at other times. Before upgrading the server software, check the documentation if there are changes which will require reformatting the database.
fr: Les changements de format de fichiers arrivent en général au changement de versions majeures mais peuvent arriver à d'autres moments. Avant de mettre à jour le serveur, vérifiez dans la documentation s'il y a des changements qui nécessitent le reformatage de la base de données.

source: Of course, if you have databases with content which is not easy to rebuild, it is always a good idea to create backups of the database from time to time. When upgrading the server software, it is time to run another backup.
fr: Bien sur, si vous avez des bases de données dont le contenu n'est pas facile à reconstruire, c'est toujours une bonne idée de créer des sauvegardes de votre base de données de temps en temps. Lors de la mise à jour du serveur, il est temps de créer une nouvelle sauvegarde.

source: Upgrade by backup and restore
fr: Mise à jour par sauvegarde et restauration

source: A backup is meaningless if there is no verified process to restore the data from this backup. When running a database server, you should not only create backups but you should also verify that the process you designed to fulfill the restore task is working properly. When you encounter a problem with the restore when you urgently have to rely on the backup data, it is too late&mdash;your database is in danger.
fr: Une sauvegarde est inutile s'il n'y a pas de processus vérifié pour restaurer les données de la sauvegarde. Lorsque vous utilisez un serveur de bases de données vous devriez non seulement créer des sauvegardes, mais vous devriez vérifier aussi que le processus que vous avez conçu pour les restaurer fonctionne correctement. Lorsque vous rencontrez un problème avec la restauration alors que vous avez un besoin urgent de vos données de sauvegarde, c'est trop tard&mdash;votre base de données est en danger.

source: In general, most (all?) database server software provides some basic tools to create backups of your data. Usually the backups created with those tools can be read by newer versions of the software (via a restore tool). Using older restore tools with newer backup data is not defined and you should <emphasis>never</emphasis> blindly assume that it will work. It might, but usually it doesn't.
fr: En général, la plupart (tous?) des serveurs de bases de données fournissent des outils de base pour créer des sauvegardes de vos données. En général les sauvegardes créées avec ces outils peuvent être lues par les nouvelles versions du logiciel (avec un outil de restauration). Utiliser les anciens outils de restauration avec les nouvelles données de sauvegarde est incertain et vous ne devriez <emphasis>jamais</emphasis> supposer aveuglément que cela fonctionnera. C'est possible, mais en général ça ne marche pas.

source: The easiest way to upgrade your database files is to
fr: Le plus simple pour mettre à jour vos fichiers de bases de données est de

source: Create a full database backup using the old tools.
fr: Créer une sauvegarde complète de votre base de données avec les anciens outils.

source: This step creates an offline copy of the database files ready to be used for long term archiving, for disaster recovery, or just preparation for upgrade. This offline backup consists of the full one-to-one copy of the current database files or a backup of the files from a certain time in history plus all journal data (that is Oracle&reg; terminology, it is called "Continuous Archiving" or "write ahead log (WAL)" in Postgresql) containing information about changes made to the data content. The later take less time to create if the DB software provides this type of journaling as you only have to save the changes after creating the last backup. The amount of data to backup is much less than doing a full backup every time.
fr: Cette étape crée une copie hors-ligne des fichiers de bases de données pour les utiliser pour l'archivage à long terme, pour la restaurer après une catastrophe ou simplement pour préparer une mise à jour. Cette sauvegarde hors-ligne consiste en une copie complète des fichiers de bases de données ou d'une sauvegarde des fichiers à un certain moment de l'histoire plus toutes les données de journal (c'est la terminologie d'Oracle&reg;, ça s'appelle « Continuous Archiving » ou « write ahead log (WAL) » dans Postgresql) qui contiennent les informations sur les changements de données. Ce dernier prend moins de temps à créer si le logiciel de bases de données fournit ce type de journalisation car vous n'avez qu'à sauvegarder les dernier changements après la création de la dernière sauvegarde. La quantité de données à sauvegarder est bien plus faible que pour une sauvegarde complète à chaque fois.

source: In terms of upgrading database server software, a full backup (which can be used for subsequent incremental backups) should be made, but if the amount of data is too big, an incremental backup will be sufficient. Which strategy is appropriate for you depends on the amount of data stored in your database (is it a few hundred table rows or is it hundreds of terabytes?). A full backup of the later one isn't done quickly (and we assume that the underlying system of such a database is probably not on an LFS system). To close the last gap to fully protect your data, create a backup of the corresponding old binaries (and/or their sources) and store it along with the data files to make sure that there is a fallback solution if the newer software is not able to read the older data.
fr: En terme de mise à jour du serveur, une sauvegarde complète (qui peut être utilisée pour des sauvegardes incrémentales suivantes) est recommandée, mais si la quantité de données est trop élevée, une sauvegarde incrémentale devrait être suffisante. La stratégie appropriée dépend de la quantité de données dans votre base de données (une centaine de lignes ou plusieurs centaines de téraoctets ?). Une sauvegarde complète de cette dernière n'est pas rapide (et on suppose que le système sous-jacent d'une telle base de données n'est probablement pas un système LFS). Pour être sûr et complètement protéger vos données, créez une sauvegarde des anciens binaires correspondants (et/ou leurs sources) et stockez-les avec les fichiers de données pour vous assurer qu'il y a une solution de repli si le nouveau logiciel n'est pas capable de lire les anciennes données.

source: Upgrade the server software
fr: Mettez à jour le serveur

source: In this step, instructions to build the database server software are executed just as they are shown in subsequent sections talking about the DBMs like MariaDB or Postgresql. That is, build the software as usual using BLFS instructions.
fr: Pour cette étape, exécutez les instructions de construction du serveur de bases de données telles qu'elles sont montrées dans les sections suivantes parlant de DBMS comme MariaDB ou PostgreSQL. C'est-à-dire, construisez le logiciel comme d'habitude avec les instructions de BLFS.

source: Restore the database by using the new tools.
fr: Restaurez la base de données avec les nouveaux outils.

source: To restore the data, the tools of the newly installed server software should be used. During the restoration process, the new tools will create and/or upgrade the data files in the format the software requires. It is assumed that newer software is capable of reading old data.
fr: Pour restaurer les données, vous devriez utiliser les outils du serveur nouvellement installé. Pendant la restauration, les nouveaux outils créeront ou mettront à jour les fichiers de données vers le format requis par le logiciel. On suppose que le nouveau logiciel est capable de lire les anciennes données de sauvegarde.

source: Since you have already have a backup procedure in place (and you have tested your restore procedure, right?), this might be the easiest way to upgrade as you are going to use your well known processes to upgrade just as you allways do&mdash;at least in terms of the backup and restore.
fr: Comme vous avez déjà une procédure de sauvegarde (et que vous avez testé votre procédure de restauration, n'est-ce pas&nbsp;?), c'est la manière la plus simple de mettre à jour puisque vous utilisez des procédures connues pour mettre à jour comme vous le faites toujours&mdash;au moins pour la sauvegarde et la restauration.

source: Upgrade the database files by using system tools
fr: Mise à jour des fichiers de bases de données avec des outils systèmes

source: Some database systems (for instance Postgresql) provide a tool which can reformat (upgrade) the existing database files to the new format. Since the upgrading tool has to be used from the new server software (the old one cannot know anything about a new file format), the old software might be overwritten due to installation of the new software.
fr: Certains systèmes de bases de données (par exemple Postgresql) fournissent un outil qui peut reformater (mettre à jour) les fichiers de bases de données existants vers le nouveau format. Comme l'outil de mise à jour doit être utilisé avec le nouveau serveur (l'ancien ne peut pas connaitre le nouveau format), l'ancien logiciel peut être écrasé par l'installation du nouveau.

source: In case you have to restore a backup (for example, running the upgrade tool failed) you have to reinstall the old version to get back the access to your data.
fr: Si vous devez restaurer une sauvegarde (par exemple, l'outil de mise à jour a échoué) vous devrez réinstaller l'ancienne version pour récupérer l'accès à vos données.

source: Even though those tools might work with one of the actual database files, you should create a full backup before running them. A failure might result in a serious damage of the database files.
fr: Même si ces outils peuvent fonctionner avec l'un des fichiers de bases de données, vous devriez créer une sauvegarde complète avant de les lancer. Un échec peut occasionner de sérieux dommages à vos fichiers de bases de données.

source: Notes for specific DBMS
fr: Remarque pour des DBMS spécifiques

source: Upstream documentation for Backup/Restore: <ulink url="https://www.postgresql.org/docs/current/backup.html"/>
fr: Documentation en amont pour la sauvegarde et la restauration&nbsp;: <ulink url="https://www.postgresql.org/docs/current/backup.html"/>

source: Upstream documentation for Backup/Restore: <ulink url="https://mariadb.com/kb/en/backup-and-restore-overview/"/>
fr: Documentation en amont pour la sauvegarde et la restauration&nbsp;: <ulink url="https://mariadb.com/kb/en/backup-and-restore-overview/"/>

source: Do not underestimate <application>Sqlite</application>. It is a feature rich DBMS. The main difference from the two big players above is that Sqlite does not provide access via a network API. Sqlite databases are files always stored on the same machine as the running program which uses the database. The manipulation of data content is done via API calls to library functions directly within the program.
fr: Ne sous-estimez pas <application>Sqlite</application>. C'est un DBMS riche en fonctionnalités. La différence majeure par rapport aux deux grands concurrents plus haut est que Sqlite ne fournit pas d'accès par une API en réseau. Les bases de données Sqlite sont des fichiers stockés sur la même machine que le programme qui l'utilise. La manipulation de données se fait par des appels API vers des bibliothèques directement dans le programme.

source: In the upstream documentation you may find the following useful:
fr: Dans la documentation en amont, vous pourriez trouver que ceci est utile&nbsp;:

source: Documentation of the sqlite3 command line tool: <ulink url="https://www.sqlite.org/cli.html"/>
fr: La documentation de l'outil en ligne de commande sqlite3&nbsp;: <ulink url="https://www.sqlite.org/cli.html"/>

source: Documentation of backup API calls: <ulink url="https://www.sqlite.org/backup.html"/>
fr: La documentation des appels API de sauvegarde&nbsp;: <ulink url="https://www.sqlite.org/backup.html"/>

source: Unfortunately, there is no dedicated chapter in the upstream documentation talking about backup/restore but there are several articles about it on the Internet. One example is shown below.
fr: Malheureusement, il n'y a pas de chapitre dédié dans la documentation en amont sur la sauvegarde et la restauration, mais il y a plusieurs articles à ce sujet sur internet. Voici un exemple plus bas.

source: Documentation for Backup/Restore: <ulink url="https://database.guide/backup-sqlite-database/"/>
fr: Documentation pour la sauvegarde et la restauration&nbsp;: <ulink url="https://database.guide/backup-sqlite-database/"/>

source: Just like <application>Sqlite</application> this software acts on local database files meaning there is no network interface.
fr: Comme <application>Sqlite</application> ce logiciel agit sur des fichiers de bases de données locaux ce qui signifie qu'il n'y a pas d'interface en réseau.

source: The relevant resources for Backup/Restore a Berkeley database are the man pages for <filename>db_dump</filename> and its counterpart <filename>db_load</filename>.
fr: Les ressources intéressantes pour la sauvegarde et la restauration des bases de données Berkeley sont les pages de manuel de <filename>db_dump</filename> et de sa contre-partie <filename>db_load</filename>.
