Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xincludes/qt-alternatives.xml.1.chaine.po
Languages: fr

source: Qt Installation Alternatives
fr: Alternatives d'installation de Qt

source: The installation of _A105_ presents several challenges and choices.
fr: L'installation de _A105_ présente plusieurs challenges et choix.

source: Complicating the Qt installation is the fact that there are two versions, _A399_ and _A309_ , that have executable programs with identical names.
fr: La complication de l'installation de Qt est le fait qu'il y a deux versions, _A399_ et _A309_ , qui ont des programmes exécutables avec des noms identiques.

source: If both packages are installed on one system, the only methods to manage which set of programs is used is to either control the users' _E13_ or to rename files either directly or via symbolic links.
fr: Si les deux paquets sont installés sur un système, la seule méthode pour gérer quel ensemble de programmes est utilisé est soit de contrôler le _E13_ de l'utilisateur ou de renommer les fichiers soit directement ou via des liens symboliques.

source: Both packages cannot be installed in the same directory.
fr: Les deux paquets ne peuvent pas être installés dans le même répertoire.

source: If you are only going to install one of the Qt versions, the choice of installation methods is easier.
fr: Si vous installez seulement une des versions de Qt, le choix de l'installation est facile.

source: You can either install the components in the several directories of the _F153_ hierarchy or install the entire package in a separate directory of your choice.
fr: Vous pouvez soit installer le composant dans plusieurs répertoires de la hiérarchie _F153_ ou installer le paquet entièrement dans un répertoire séparé de votre choix.

source: If both versions of Qt are to be installed, one or both versions need to be installed in a separate directory.
fr: Si les deux versions de Qt doivent être installée, une ou les deux versions doivent être installées dans un répertoire séparé.

source: For the purposes here we use the _F343_ directory.
fr: Pour la discussion ici nous utiliserons le répertoire _F343_.

source: The selection of which version is being used by individual users on a system is controlled by the _E13_ variable.
fr: La sélection de quelle version doit être utilisée par des utilisateurs individuels sur un système est contrôlé par la variable _E13_.

source: Other systems can be designed, but the BLFS editors find the _E13_ method easiest.
fr: D'autres systèmes peuvent être imaginés, mais les éditeurs de BLFS trouvent la méthode du _E13_ plus simple.

source: The advantage of installing in _F153_ is that no updates to the _F1015_ or _F1171_ files are required.
fr: L'avantage d'installer dans _F153_ est qu'il n'y à pas de mise à jour des fichiers _F1015_ ou _F1171_.

source: The package files are distributed within several subdirectories of the _F153_ hierarchy.
fr: Les fichiers du paquet sont répartis dans plusieurs sous-répertoire de la hiérarchie _F153_.

source: This is the method that most commercial distributions use.
fr: C'est la méthode que le plus de distributions commerciales utilisent.

source: The disadvantage for BLFS users is that this Qt instance cannot be upgraded while it is in use.
fr: Le désavantage pour les utilisateurs de BLFS est que la version de Qt ne peut pas être mise à jour quand elle est utilisée.

source: For instance, it cannot be upgraded from a running KDE environment.
fr: Par exemple, elle ne peut pas être mise à jour dans un environnement KDE.

source: It also precludes having multiple versions of Qt on your system and does not allow reverting to an existing, known working instance of Qt.
fr: cela implique également de multiples versions de Qt sur votre système et ne permet pas de retourner à une version existante de Qt connue pour fonctionner.

source: The advantage of installing _A105_ in a custom directory such as _F557_ or _F558_ is that it keeps all the package files consolidated in a dedicated directory hierarchy.
fr: L'avantage d'installer _A105_ dans un répertoire personnalisé comme _F557_ ou _F558_ ou est que cela laisse tous les fichiers du paquet consolidés dans une hiérarchie de répertoires dédiées.

source: By using this method, an update can be made without overwriting a previous installation and users can easily revert to a previous version by changing one symbolic link or merely changing the PATH variable.
fr: En utilisant cette méthode, une mise à jour peut être faite sans écraser une installation précédente et les utilisateurs peuvent facilement retourner dans une version précédente en changeant un lien symbolique ou simplement en changeant la variable PATH.

source: It also allows a developer to maintain multiple versions of _A399_ or _A309_ for testing.
fr: Cela permet également à un développeur de maintenir des versions multiplus de _A399_ ou _A309_ pour tester.
