Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/cleanup.po
Languages: fr, pt_br

source: Cleaning up and Saving the Temporary System
fr: Nettoyage et Sauvegarde du système temporaire
pt_br: Limpando e Salvando o Sistema Temporário

source: Cleaning
fr: Nettoyage
pt_br: Limpando

source: First, remove the currently installed documentation to prevent them from ending up in the final system, and to save about 35 MB:
fr: Tout d'abord, supprimez la documentation actuellement installée pour éviter qu'elle ne se retrouve sur le système final, et pour récupérer environ 35&nbsp;Mo&nbsp;:

source: Second, on a modern Linux system, the libtool .la files are only useful for libltdl. No libraries in LFS are expected to be loaded by libltdl, and it's known that some .la files can cause BLFS packages fail to build. Remove those files now:
fr: Ensuite, sur un système Linux moderne, les fichiers .la de libtool sont aussi utiles pour libltdl. Aucune bibliothèque dans LFS ne sera normalement chargée par libltdl, et certains fichiers .la sont connus pour causer des échecs à la construction de certains paquets de BLFS. Supprimez maintenant ces fichiers&nbsp;:

source: The current system size is now about 3 GB, however the /tools directory is no longer needed. It uses about 1 GB of disk space. Delete it now:
fr: La taille du système est maintenant d'environ 3&nbsp;Go, mais le répertoire /tools n'est plus requis. Il utilise environ 1&nbsp;Go d'espace disque. Supprimez-le maintenant&nbsp;:
pt_br: O tamanho atual do sistema é agora de cerca de 3 GB, entretanto o diretório /tools não mais é necessário. Ele usa cerca de 1 GB de espaço de disco. Delete ele agora:

source: Backup
fr: Sauvegarde
pt_br: Cópia de segurança

source: At this point the essential programs and libraries have been created and your current LFS system is in a good state. Your system can now be backed up for later reuse. In case of fatal failures in the subsequent chapters, it often turns out that removing everything and starting over (more carefully) is the best option to recover. Unfortunately, all the temporary files will be removed, too. To avoid spending extra time to redo something which has been built successfully, creating a backup of the current LFS system may prove useful.
fr: Maintenant, les programmes et bibliothèques essentiels ont été créés et votre système LFS actuel est en bon état. Votre système peut maintenant être sauvegardé pour être réutilisé plus tard. Si vous rencontrez une erreur fatale dans les chapitres suivants, il arrive souvent que tout supprimer et recommencer (avec plus de prudence) soit la meilleure option. Malheureusement, tous les fichiers temporaires seront aussi supprimés. Pour éviter de passer du temps en plus pour refaire quelque chose que vous avez déjà réussi, préparez une sauvegarde.

source: All the remaining steps in this section are optional. Nevertheless, as soon as you begin installing packages in <xref linkend="chapter-building-system"/>, the temporary files will be overwritten. So it may be a good idea to do a backup of the current system as described below.
fr: Toutes les étapes restantes dans cette section sont facultatives. Cependant, dès que vous commencez à installer des paquets dans le <xref linkend="chapter-building-system"/>, les fichiers temporaires seront remplacés. Donc c'est peut-être une bonne idée d'effectuer une sauvegarde du système actuel, comme on le décrit plus bas.
pt_br: Todos os passos restantes nesta seção são opcionais. Apesar disso, tão logo você comece a instalar pacotes no <xref linkend="chapter-building-system"/>, os arquivos temporários serão sobrescritos. Assim, possivelmente seja uma boa ideia fazer uma cópia de segurança do sistema atual conforme descrito abaixo.

source: The following steps are performed from outside the chroot environment. That means, you have to leave the chroot environment first before continuing. The reason for that is to get access to file system locations outside of the chroot environment to store/read the backup archive which should not be placed within the <filename class="directory">$LFS</filename> hierarchy for safety reasons.
fr: Les étapes suivantes sont à effectuer en dehors de l'environnement chroot. Cela signifie que vous devez quitter l'environnement chroot avant de continuer. La raison est est qu'il faut pouvoir accéder à des emplacement du système de fichiers en dehors de l'environnement chroot pour stocker et lire l'archive de sauvegarde, qui ne devrait pas se trouver dans la hiérarchie <filename class="directory">$LFS</filename> pour plus de sûreté.

source: If you have decided to make a backup, leave the chroot environment:
fr: Si vous avez décidé d'effectuer une sauvegarde, quittez l'environnement chroot&nbsp;:
pt_br: Se você decidiu fazer uma cópia de segurança, [então] deixe o ambiente chroot:

source: All of the following instructions are executed by <systemitem class="username">root</systemitem> on your host system. Take extra care about the commands you're going to run as mistakes here can modify your host system. Be aware that the environment variable <envar>LFS</envar> is set for user <systemitem class="username">lfs</systemitem> by default but may <emphasis>not</emphasis> be set for <systemitem class="username">root</systemitem>.
fr: Toutes les instructions suivantes sont exécutées en <systemitem class="username">root</systemitem> sur votre système hôte. Faites particulièrement attention aux commandes que vous allez exécuter car toute erreur ici peut modifier votre environnement hôte. Soyez conscient que la variable d'environnement <envar>LFS</envar> a une valeur pour l'utilisateur <systemitem class="username">lfs</systemitem> par défaut, mais peut ne <emphasis>pas</emphasis> exister pour <systemitem class="username">root</systemitem>.

source: Whenever commands are to be executed by <systemitem class="username">root</systemitem>, make sure you have set <envar>LFS</envar>.
fr: Quand les commandes doivent être exécutées par <systemitem class="username">root</systemitem>, assurez-vous d'avoir la variable <envar>LFS</envar>.
pt_br: Sempre que comandos forem ser executados por <systemitem class="username">root</systemitem>, tenha certeza de que você configurou <envar>LFS</envar>.

source: This has been discussed in <xref linkend='ch-partitioning-aboutlfs'/>.
fr: On en a déjà parlé dans le <xref linkend='ch-partitioning-aboutlfs'/>.
pt_br: Isso foi discutido no <xref linkend='ch-partitioning-aboutlfs'/>.

source: Before making a backup, unmount the virtual file systems:
fr: Avant de faire la sauvegarde, démontez les systèmes de fichiers virtuels&nbsp;:
pt_br: Antes de fazer uma cópia de segurança, desmonte os sistemas de arquivos virtuais:

source: Make sure you have at least 1 GB free disk space (the source tarballs will be included in the backup archive) on the filesystem containing directory where you create the backup archive.
fr: Assurez-vous d'avoir au moins 1&nbsp;Go d'espace disque libre (les archives des sources seront incluses dans l'archive de sauvegarde) sur le système de fichier contenant le répertoire dans lequel vous créez la sauvegarde.

source: Note that the instructions below specify the home directory of the host system's <systemitem class="username">root</systemitem> user, which is typically found on the root filesystem.
fr: Remarquez que les instructions ci-dessous spécifient le répertoire personnel de l'utilisateur <systemitem class="username">root</systemitem> sur le système hôte, qui se trouve généralement sur le système de fichiers racine.

source: Replace <envar>$HOME</envar> by a directory of your choice if you do not want to have the backup stored in <systemitem class="username">root</systemitem>'s home directory.
fr: Remplacez <envar>$HOME</envar> par un répertoire de votre choix si vous ne voulez pas stoker la sauvegarde dans le répertoire personnel de <systemitem class="username">root</systemitem>.

source: Create the backup archive by running the following command:
fr: Créez l'archive de sauvegarde en lançant la commande suivante&nbsp;:
pt_br: Crie o arquivamento da cópia de segurança executando o seguinte comando:

source: Because the backup archive is compressed, it takes a relatively long time (over 10 minutes) even on a reasonably fast system.
fr: Comme l'archive de sauvegarde est compressée, elle prend un temps relativement long (plus de 10 minutes) même sur un système raisonnablement rapide.
pt_br: Por causa de que o arquivamento da cópia de segurança é comprimido, dura um tempo relativamente longo (mais que dez (10) minutos) mesmo em um sistema razoavelmente rápido.

source: If continuing to chapter 8, don't forget to reenter the chroot environment as explained in the <quote>Important</quote> box below.
fr: Si vous continuez au chapitre 8, n'oubliez pas d'entrer de nouveau dans l'environnement chroot comme expliqué dans l'encadré <quote>important</quote> plus bas.
pt_br: Se continuar para o capítulo 8, [então] não se esqueça de entrar novamente no ambiente chroot conforme explicado na caixa <quote>Importante</quote> abaixo.

source: Restore
fr: Restauration du système
pt_br: Restauro

source: In case some mistakes have been made and you need to start over, you can use this backup to restore the system and save some recovery time. Since the sources are located under <filename class="directory">$LFS</filename>, they are included in the backup archive as well, so they do not need to be downloaded again. After checking that <envar>$LFS</envar> is set properly, restore the backup by executing the following commands:
fr: Dans le cas où vous avez fait des erreurs et que vous devez recommencer du début, vous pouvez utiliser cette sauvegarde pour réinitialiser le système et gagner du temps. Comme les sources se trouvent dans <filename class="directory">$LFS</filename>, elles sont incluses dans l'archive de sauvegarde, donc vous n'aurez pas besoin de les télécharger de nouveau. Après avoir vérifié que <envar>$LFS</envar> est définie correctement, restaurez la sauvegarde en exécutant les commandes suivantes&nbsp;:

source: The following commands are extremely dangerous. If you run <command>rm -rf ./*</command> as the &root; user and you do not change to the $LFS directory or the <envar>LFS</envar> environment variable is not set for the &root; user, it will destroy your entire host system. YOU ARE WARNED.
fr: Les commandes suivantes sont extrêmement dangereuses. Si vous lancez <command>rm -rf ./*</command> en tant que &root; et que vous ne vous êtes pas déplacés dans le répertoire $LFS ou que la variable d'environnement <envar>LFS</envar> n'est pas définie pour l'utilisateur &root;, elle détruira votre système complet. ON VOUS AURA PRÉVENU.
pt_br: Os seguintes comandos são extremamente perigosos. Se você executar <command>rm -rf ./*</command> como a(o) usuária(o) &root; e você não mudar para o diretório $LFS ou a variável de ambiente <envar>LFS</envar> não estiver configurada para a(o) usuária(o) &root;, [então] isso destruirá seu sistema anfitrião inteiro. VOCÊ ESTÁ AVISADA(O).

source: Again, double check that the environment has been setup properly and continue building the rest of the system.
fr: De nouveau, vérifiez que l'environnement a été correctement paramétré et continuez à construire le reste du système.

source: If you left the chroot environment to create a backup or restart building using a restore, remember to check that the virtual filesystems are still mounted (<command>findmnt | grep $LFS</command>). If they are not mounted, remount them now as described in <xref linkend='ch-tools-kernfs'/> and re-enter the chroot environment (see <xref linkend='ch-tools-chroot'/>) before continuing.
fr: Si vous quittez l'environnement chroot pour créer une sauvegarde ou pour recommencer à construire à partir d'une sauvegarde, rappelez-vous de vérifier que les systèmes de fichiers virtuels sont toujours montés (<command>findmnt | grep $LFS</command>). S'ils ne sont pas montés, remontez-les maintenant comme décrit dans le <xref linkend='ch-tools-kernfs'/> et entrez de nouveau dans l'environnement chroot (voir le <xref linkend='ch-tools-chroot'/>) avant de continuer.

source: First, remove the currently installed documentation files to prevent them from ending up in the final system, and to save about 35 MB:
pt_br: Primeiro, remova a documentação atualmente instalada para evitar que ela termine no sistema final e para salvar cerca de 35 MB:

source: Second, on a modern Linux system, the libtool .la files are only useful for libltdl. No libraries in LFS are loaded by libltdl, and it's known that some .la files can cause BLFS package failures. Remove those files now:
pt_br: Segundo, em um sistema moderno Linux, os arquivos libtool.la somente são úteis para a libltdl. Nenhuma biblioteca no LFS é carregada pela libltdl e é sabido que alguns arquivos .la podem causar falhas de pacote do BLFS. Remova tais arquivos agora:

source: At this point the essential programs and libraries have been created and your current LFS system is in a good state. Your system can now be backed up for later reuse. In case of fatal failures in the subsequent chapters, it often turns out that removing everything and starting over (more carefully) is the best way to recover. Unfortunately, all the temporary files will be removed, too. To avoid spending extra time to redo something which has been done successfully, creating a backup of the current LFS system may prove useful.
pt_br: Neste ponto, os aplicativos e bibliotecas essenciais foram criados e o seu sistema LFS atual está em um bom estado. Seu sistema agora pode ser copiado para posterior reuso. Em caso de falhas fatais nos capítulos subsequentes, frequentemente acontece que remover tudo e começar de novo (mais cuidadosamente) é a melhor maneira para recuperar. Infelizmente, todos os arquivos temporários serão removidos, também. Para evitar desperdiçar tempo extra para refazer tudo o que tenha sido feito com sucesso, criar uma cópia de segurança do sistema LFS atual possivelmente se prove útil.

source: The following steps are performed from outside the chroot environment. That means you have to leave the chroot environment first before continuing. The reason for that is to get access to file system locations outside of the chroot environment to store/read the backup archive, which ought not be placed within the <filename class="directory">$LFS</filename> hierarchy.
pt_br: Os passos seguintes são realizados a partir do lado de fora do ambiente chroot. Isso significa que você tem de deixar o ambiente chroot primeiro antes de continuar. A razão para isso é a de conseguir acesso a locais do sistema de arquivos do lado de fora do ambiente chroot para armazenar/ler o arquivamento da cópia de segurança, o qual convém não ser colocado dentro da hierarquia do <filename class="directory">$LFS</filename>.

source: All of the following instructions are executed by <systemitem class="username">root</systemitem> on your host system. Take extra care about the commands you're going to run as mistakes made here can modify your host system. Be aware that the environment variable <envar>LFS</envar> is set for user <systemitem class="username">lfs</systemitem> by default but may <emphasis>not</emphasis> be set for <systemitem class="username">root</systemitem>.
pt_br: Todas as instruções seguintes são executadas pelo(a) <systemitem class="username">root</systemitem> no seu sistema anfitrião. Tome cuidado extra acerca dos comandos que você vai executar, uma vez que erros cometidos aqui podem modificar seu sistema anfitrião. Esteja ciente de que a variável de ambiente <envar>LFS</envar> está configurada para usuária(o) <systemitem class="username">lfs</systemitem> por padrão, porém possivelmente <emphasis>não</emphasis> esteja configurada para <systemitem class="username">root</systemitem>.

source: Make sure you have at least 1 GB free disk space (the source tarballs will be included in the backup archive) on the file system containing the directory where you create the backup archive.
pt_br: Tenha certeza de que tem pelo menos um (01) GB de espaço livre no disco (os tarballs do fonte serão incluídos no arquivamento da cópia de segurança) no sistema de arquivos contendo o diretório onde você criar o arquivamento da cópia de segurança.

source: Note that the instructions below specify the home directory of the host system's <systemitem class="username">root</systemitem> user, which is typically found on the root file system. Replace <envar>$HOME</envar> by a directory of your choice if you do not want to have the backup stored in <systemitem class="username">root</systemitem>'s home directory.
pt_br: Observe que as instruções abaixo especificam o diretório home da(o) usuária(o) <systemitem class="username">root</systemitem> do sistema anfitrião, o qual tipicamente é encontrado no sistema de arquivos raiz. Substitua <envar>$HOME</envar> por um diretório da sua escolha se não quiser ter a cópia de segurança armazenada no diretório home do(a)<systemitem class="username">root</systemitem>.

source: In case some mistakes have been made and you need to start over, you can use this backup to restore the system and save some recovery time. Since the sources are located under <filename class="directory">$LFS</filename>, they are included in the backup archive as well, so they do not need to be downloaded again. After checking that <envar>$LFS</envar> is set properly, you can restore the backup by executing the following commands:
pt_br: No caso de alguns erros tiverem sido cometidos e você precisar começar de novo, você pode usar essa cópia de segurança para restaurar o sistema e economizar algum tempo de recuperação. Desde que os fontes estão localizados sob <filename class="directory">$LFS</filename>, eles são incluídos no arquivamento da cópia de segurança também, de forma que não precisam ser transferidos novamente. Após verificar se <envar>$LFS</envar> está configurada adequadamente, você consegue restaurar a cópia de segurança executando os seguintes comandos:

source: Again, double check that the environment has been set up properly and continue building the rest of the system.
pt_br: Novamente, verifique duplamente se o ambiente foi configurado adequadamente e continue construindo o resto do sistema.

source: If you left the chroot environment to create a backup or restart building using a restore, remember to check that the virtual file systems are still mounted (<command>findmnt | grep $LFS</command>). If they are not mounted, remount them now as described in <xref linkend='ch-tools-kernfs'/> and re-enter the chroot environment (see <xref linkend='ch-tools-chroot'/>) before continuing.
pt_br: Se você deixou o ambiente chroot para criar uma cópia de segurança ou reiniciar a construção usando um restauro, [então] lembre-se de verificar se os sistemas de arquivos virtuais ainda estão montados (<command>findmnt | grep $LFS</command>). Se eles não estiverem montados, [então] remonte-os agora conforme descrito no <xref linkend='ch-tools-kernfs'/> e entre novamente no ambiente chroot (veja-se o <xref linkend='ch-tools-chroot'/>) antes de continuar.
