Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/clock.po
Languages: fr

source: Configuring the system clock
fr: Configuration de l'horloge système

source: configuring
fr: configuration

source: This section discusses how to configure the <command>systemd-timedated</command> system service, which configures system clock and timezone.
fr: Cette section parle de la manière de configurer le service système <command>systemd-timedated</command>, qui configure l'horloge et le fuseau horaire système.

source: If you cannot remember whether or not the hardware clock is set to UTC, find out by running the <userinput>hwclock --localtime --show</userinput> command. This will display what the current time is according to the hardware clock. If this time matches whatever your watch says, then the hardware clock is set to local time. If the output from <command>hwclock</command> is not local time, chances are it is set to UTC time. Verify this by adding or subtracting the proper amount of hours for the timezone to the time shown by <command>hwclock</command>. For example, if you are currently in the MST timezone, which is also known as GMT -0700, add seven hours to the local time.
fr: Si vous ne vous souvenez pas si l'horloge matérielle est configurée en UTC ou non, trouvez le en lançant la commande <userinput>hwclock --localtime --show</userinput>. Cela va afficher l'heure actuelle d'après l'horloge matérielle. Si l'heure correspond à celle de votre montre, alors votre horloge système est configurée à l'heure locale. Si la sortie de <command>hwclock</command> n'est pas l'heure locale, il y a des chances qu'elle soit configurée en UTC. Vérifiez cela en ajoutant ou retirant le bon nombre d'heures par rapport à l'heure affichée par <command>hwclock</command>. Par exemple si vous êtes dans le fuseau horaire MST, qui est aussi connu comme GMT -7, ajoutez 7 heures à l'heure locale.

source: <command>systemd-timedated</command> reads <filename>/etc/adjtime</filename>, and depending on the contents of the file, it sets the clock to either UTC or local time.
fr: <command>systemd-timedated</command> lit <filename>/etc/adjtime</filename>, et en fonction de ce qui est écrit dans le fichier, met l'horloge en UTC ou en heure locale.

source: Create the <filename>/etc/adjtime</filename> file with the following contents if your hardware clock is set to local time:
fr: Créez le fichier <filename>/etc/adjtime</filename> avec le contenu suivant si votre horloge matérielle est configurée en heure locale&nbsp;:

source: If <filename>/etc/adjtime</filename> isn't present at first boot, <command>systemd-timedated</command> will assume that hardware clock is set to UTC and adjust the file according to that.
fr: Si le fichier <filename>/etc/adjtime</filename> n'est pas présent au premier démarrage, <command>systemd-timedated</command> va considérer que l'horloge matérielle est configurée en UTC et ajuster le fichier en accord avec cela.

source: You can also use the <command>timedatectl</command> utility to tell <command>systemd-timedated</command> if your hardware clock is set to UTC or local time:
fr: Vous pouvez également utiliser l'utilitaire <command>timedatectl</command> pour signaler à <command>systemd-timedated</command> si votre horloge matérielle est initialisée en UTC ou en temps local&nbsp;:

source: <command>timedatectl</command> can also be used to change system time and time zone.
fr: <command>timedatectl</command> peut également être utilisé pour changer l'heure système et le fuseau horaire.

source: To change your current system time, issue:
fr: Pour changer l'heure actuelle du système, tapez&nbsp;:

source: Hardware clock will also be updated accordingly.
fr: L'horloge matérielle sera également mise à jour en conséquence.

source: To change your current time zone, issue:
fr: Pour changer de fuseau horaire, tapez:

source: You can get a list of available time zones by running:
fr: Vous pouvez avoir une liste des fuseaux horaires disponibles en tapant&nbsp;:

source: Please note that the <command>timedatectl</command> command can be used only on a system booted with systemd.
fr: Merci de noter que la commande <command>timedatectl</command> peut être utilisée seulement sur un système démarré avec systemd.

source: Network Time Synchronization
fr: Synchronisation réseau du temps

source: Starting with version 213, systemd ships a daemon called <command>systemd-timesyncd</command> which can be used to synchronize the system time with remote NTP servers.
fr: Depuis la version 213, systemd livre un démon appelé <command>systemd-timesyncd</command> qui peut être utilisé pour synchroniser l'heure système avec les serveurs NTP distants.

source: The daemon is not intended as a replacement for the well established NTP daemon, but as a client only implementation of the SNTP protocol which can be used for less advanced tasks and on resource limited systems.
fr: Le démon n'est pas prévu pour remplacer le démon bien établit NTP, mais comme client du protocole SNTP qui peut être utilisé pour les tâches moins avancées et sur les systèmes à ressources limitées.

source: Starting with systemd version 216, the <command>systemd-timesyncd</command> daemon is enabled by default. If you want to disable it, issue the following command:
fr: Depuis la version 216, le démon <command>systemd-timesyncd</command> est activé par défaut. Si vous voulez le désactiver, tapez la commande suivante&nbsp;:

source: The <filename>/etc/systemd/timesyncd.conf</filename> file can be used to change the NTP servers that <command>systemd-timesyncd</command> synchronizes with.
fr: Le fichier <filename>/etc/systemd/timesyncd.conf</filename> peut être utilisé pour changer les serveurs NTP avec lesquels <command>systemd-timesyncd</command> se synchronisent

source: Please note that when system clock is set to Local Time, <command>systemd-timesyncd</command> won't update hardware clock.
fr: Merci de noter que quand l'horloge système est initialisée en temps local, <command>systemd-timesyncd</command> ne mettra pas à jour l'horloge système.
