Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/consoled.po
Languages: fr

source: Configuring the Linux Console
fr: Configurer la Console Linux

source: configuring
fr: configuration

source: This section discusses how to configure the <command>systemd-vconsole-setup</command> system service, which configures the virtual console font and console keymap.
fr: Cette section traite de la manière de configurer le service système <command>systemd-vconsole-setup</command> qui configure la police de la console virtuelle et la disposition du clavier dans la console.

source: The <command>systemd-vconsole-setup</command> service reads the <filename>/etc/vconsole.conf</filename> file for configuration information. Decide which keymap and screen font will be used. Various language-specific HOWTOs can also help with this, see <ulink url="http://www.tldp.org/HOWTO/HOWTO-INDEX/other-lang.html"/>. Examine <command>localectl list-keymaps</command> output for a list of valid console keymaps. Look in <filename class="directory">/usr/share/consolefonts</filename> directory for valid screen fonts.
fr: Le service <command>systemd-vconsole-setup</command> lit les informations de configuration dans le fichier <filename>/etc/vconsole.conf</filename>. Décidez de la disposition du clavier et de la police à l'écran qui seront utilisées. Il existe divers guides pratiques spécifiques à chaque langue qui peuvent vous aider. Voir <ulink url="http://www.tldp.org/HOWTO/HOWTO-INDEX/other-lang.html"/>. Observez la sortie de <command>localectl list-keymaps</command> pour une liste des dispositions de clavier valides sur la console. Regardez le répertoire <filename class="directory">/usr/share/consolefonts</filename> pour une liste des polices d'écran valides.

source: The <filename>/etc/vconsole.conf</filename> file should contain lines of the form: VARIABLE="value". The following variables are recognized:
fr: Le fichier <filename>/etc/vconsole.conf</filename> devrait contenir des lignes de la forme&nbsp;: VARIABLE="valeur". Les variables suivantes sont reconnues&nbsp;:

source: This variable specifies the key mapping table for the keyboard. If unset, it defaults to <literal>us</literal>.
fr: Cette variable spécifie la table de disposition du clavier. Si vous ne la définissez pas, elle est par défaut <literal>us</literal>.

source: This variable can be used to configure a second toggle keymap and is unset by default.
fr: Vous pouvez utiliser cette variable pour configurer une disposition alternative par défaut où vous pouvez basculer.

source: This variable specifies the font used by the virtual console.
fr: Cette variable spécifie la police utilisée par la console virtuelle.

source: This variable specifies the console map to be used.
fr: Cette variable spécifie la présentation de la console.

source: This variable specifies the Unicode font map.
fr: Cette variable spécifie la police de l'Unicode.

source: An example for a German keyboard and console is given below:
fr: Voici un exemple pour un clavier allemand&nbsp;:

source: You can change KEYMAP value at runtime by using the <command>localectl</command> utility:
fr: Vous pouvez modifier la valeur de KEYMAP lors de l'exécution en utilisant l'outil <command>localectl</command>&nbsp;:

source: Please note that the <command>localectl</command> command can be used only on a system booted with systemd.
fr: Veuillez remarquer que la commande <command>localectl</command> n'est utilisable que sur un système démarré avec systemd.

source: You can also use <command>localectl</command> utility with the corresponding parameters to change X11 keyboard layout, model, variant and options:
fr: Vous pouvez aussi utiliser l'utilitaire <command>localectl</command> avec les paramètres correspondants pour changer la disposition, le modèle, la variante et d'autres options du clavier&nbsp;:

source: To list possible values for <command>localectl set-x11-keymap</command> parameters, run <command>localectl</command> with parameters listed below:
fr: Pour lister les différentes valeurs possibles pour les paramètres <command>localectl set-x11-keymap</command>, lancez <command>localectl</command> avec les paramètres ci-dessous&nbsp;

source: Show known X11 keyboard mapping models.
fr: Affiche les modèles connus de claviers X11.

source: Show known X11 keyboard mapping layouts.
fr: Affiche les dispositions connues de claviers X11.

source: Show known X11 keyboard mapping variants.
fr: Affiche les variantes connues de claviers X11.

source: Show known X11 keyboard mapping options.
fr: Affiche les options connues de claviers X11.

source: Using any of the parameters listed above requires the XKeyboard Config package from BLFS.
fr: L'utilisation des paramètres listés ci-dessus nécessite le paquet XKeyboard Config de BLFS.
