Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/creatingdirs.po
Languages: pt_br

source: Creating Directories
pt_br: Criando Diretórios

source: It is time to create the full directory structure in the LFS file system.
pt_br: É tempo de criar a estrutura completa de diretórios no sistema de arquivos do LFS.

source: Some of the directories mentioned in this section may have already been created earlier with explicit instructions, or when installing some packages. They are repeated below for completeness.
pt_br: Alguns dos diretórios mencionados nesta seção possivelmente já tenham sido criados anteriormente com instruções explícitas ou quando da instalação de alguns pacotes. Elas estão repetidas abaixo para completude.

source: Create some root-level directories that are not in the limited set required in the previous chapters by issuing the following command:
pt_br: Crie alguns diretórios de nível de raiz que não estão no conjunto limitado exigido nos capítulos anteriores emitindo o seguinte comando:

source: Create the required set of subdirectories below the root-level by issuing the following commands:
pt_br: Crie o conjunto exigido de subdiretórios abaixo do nível de raiz emitindo os seguintes comandos:

source: Directories are, by default, created with permission mode 755, but this is not desirable everywhere. In the commands above, two changes are made&mdash;one to the home directory of user <systemitem class="username">root</systemitem>, and another to the directories for temporary files.
pt_br: Diretórios são, por padrão, criados com modo de permissão 755, mas isso não é desejável em todos os lugares. Nos comandos acima, duas mudanças são feitas&mdash;uma para o diretório home do(a) usuário(a) <systemitem class="username">root</systemitem> e outra para os diretórios para arquivos temporários.

source: The first mode change ensures that not just anybody can enter the <filename class="directory">/root</filename> directory&mdash;just like a normal user would do with his or her own home directory. The second mode change makes sure that any user can write to the <filename class="directory">/tmp</filename> and <filename class="directory">/var/tmp</filename> directories, but cannot remove another user's files from them. The latter is prohibited by the so-called <quote>sticky bit,</quote> the highest bit (1) in the 1777 bit mask.
pt_br: A primeira mudança de modo assegura que nem toda pessoa possa entrar no diretório <filename class="directory">/root</filename>&mdash;o mesmo que uma(m) usuária(o) normal faria com o próprio diretório home dela ou dele. A segunda mudança de modo garante que qualquer usuária(o) possa escrever nos diretórios <filename class="directory">/tmp</filename> e <filename class="directory">/var/tmp</filename>, mas não possa remover deles os arquivos de outras(os) usuárias(os). Essa última é proibida pelo assim chamado <quote>sticky bit</quote>, o bit mais alto (1) na máscara de bits 1777.

source: FHS Compliance Note
pt_br: Observação de Conformidade com o FHS

source: This directory tree is based on the Filesystem Hierarchy Standard (FHS) (available at <ulink url="https://refspecs.linuxfoundation.org/fhs.shtml"/>). The FHS also specifies the optional existence of additional directories such as <filename class="directory">/usr/local/games</filename> and <filename class="directory">/usr/share/games</filename>. In LFS, we create only the directories that are really necessary. However, feel free to create more directories, if you wish.
pt_br: Essa árvore de diretórios é baseada no Padrão de Hierarquia de Sistema de Arquivos (Filesystem Hierarchy Standard - FHS) (disponível em <ulink url="https://refspecs.linuxfoundation.org/fhs.shtml"/>). O FHS também especifica a existência opcional de diretórios adicionais, tais como <filename class="directory">/usr/local/games</filename> e <filename class="directory">/usr/share/games</filename>. No LFS, nós criamos apenas os diretórios que são realmente necessários. Entretanto, sinta-se livre para criar mais diretórios, se você desejar.

source: The FHS does not mandate the existence of the directory <filename class="directory">/usr/lib64</filename>, and the LFS editors have decided not to use it. For the instructions in LFS and BLFS to work correctly, it is imperative that this directory be non-existent. From time to time you should verify that it does not exist, because it is easy to create it inadvertently, and this will probably break your system.
pt_br: O FHS não impõe a existência do diretório <filename class="directory">/usr/lib64</filename> e os(as) editores(as) do LFS decidiram não usá-lo. Para as instruções no LFS e no BLFS funcionarem corretamente, é imperativo que esse diretório seja não existente. De tempos em tempos você deveria verificar se ele não existe, pois é fácil criá-lo inadvertidamente e isso provavelmente quebrará o seu sistema.
