Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/introduction.po
Languages: fr

source: Booting a Linux system involves several tasks. The process must mount both virtual and real file systems, initialize devices, activate swap, check file systems for integrity, mount any swap partitions or files, set the system clock, bring up networking, start any daemons required by the system, and accomplish any other custom tasks needed by the user. This process must be organized to ensure the tasks are performed in the correct order but, at the same time, be executed as fast as possible.
fr: Le démarrage d'un système Linux englobe plusieurs tâches. Le processus implique de monter les systèmes de fichiers virtuels et réels, d'initialiser les périphériques, activer l'échange (swap), vérifier l'intégrité des systèmes de fichiers, monter les partitions ou les fichiers d'échange, régler l'horloge du système, activer le réseau, démarrer les démons nécessaires au système et accomplir d'autres tâches personnalisées dont a besoin l'utilisateur. Il faut organiser le processus pour s'assurer que les tâches s'effectuent dans l'ordre, mais en même temps, le plus vite possible.

source: System V is the classic boot process that has been used in Unix and Unix-like systems such as Linux since about 1983. It consists of a small program, <command>init</command>, that sets up basic programs such as <command>login</command> (via getty) and runs a script. This script, usually named <command>rc</command>, controls the execution of a set of additional scripts that perform the tasks required to initialize the system.
fr: System V est le système de démarrage classique qu'on utilise dans les systèmes Unix et Unix-like comme Linux depuis environ 1983. Il consiste en un petit programme, <command>init</command>, qui initialise les programmes de base tels que <command>login</command> (via getty) et lance un script. Ce script, appelé en général <command>rc</command>, contrôle l'exécution d'un ensemble d'autres scripts effectuant les tâches nécessaires pour initialiser le système.

source: The <command>init</command> program is controlled by the <filename>/etc/inittab</filename> file and is organized into run levels that can be run by the user:
fr: Le programme <command>init</command> est contrôlé par le fichier <filename>/etc/inittab</filename> et s'organise en niveaux d'exécution lançables par l'utilisateur&nbsp;:

source: 0 &mdash; halt 1 &mdash; Single user mode 2 &mdash; Multiuser, without networking 3 &mdash; Full multiuser mode 4 &mdash; User definable 5 &mdash; Full multiuser mode with display manager 6 &mdash; reboot
fr: 0 &mdash; arrêt 1 &mdash; Mode mono-utilisateur 2 &mdash; Multi-utilisateur, sans réseau 3 &mdash; Mode multi-utilisateur complet 4 &mdash; Définissable par l'utilisateur 5 &mdash; Mode multi-utilisateur complet avec gestionnaire d'affichage 6 &mdash; redémarrage

source: The usual default run level is 3 or 5.
fr: Le niveau d'exécution par défaut est en général 3 ou 5.

source: Advantages
fr: Avantages

source: Established, well understood system.
fr: Système stabilisé et maîtrisé.

source: Easy to customize.
fr: Facile à personnaliser.

source: Disadvantages
fr: Inconvénients

source: Slower to boot. A medium speed base LFS system takes 8-12 seconds where the boot time is measured from the first kernel message to the login prompt. Network connectivity is typically established about 2 seconds after the login prompt.
fr: Plus lent au démarrage. La vitesse moyenne d'un système LFS de base est de 8-12 secondes, le temps de démarrage étant mesuré à partir du premier message du noyau jusqu'à l'invite de connexion. La connectivité réseau arrive en général 2 secondes après l'invite de connexion.

source: Serial processing of boot tasks. This is related to the previous point. A delay in any process such as a file system check, will delay the entire boot process.
fr: Gestion en série des tâches de démarrage. Ceci est lié au point précédent. La durée d'un processus comme la vérification d'un système de fichiers retardera tout le processus de démarrage.

source: Does not directly support advanced features like control groups (cgroups), and per-user fair share scheduling.
fr: Ne supporte pas directement les fonctionnalités avancées comme les groupes de contrôle (cgroups) et l’ordonnancement à part équitable entre utilisateurs.

source: Adding scripts requires manual, static sequencing decisions.
fr: L'ajout de scripts nécessite de prendre des décisions sur la séquence statique d'exécution à la main.
