Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/locale.po
Languages: fr

source: Configuring the System Locale
fr: Configuration des paramètres régionaux du système

source: The <filename>/etc/locale.conf</filename> below sets some environment variables necessary for native language support. Setting them properly results in:
fr: Le <filename>/etc/locale.conf</filename> ci-dessous défini certaines variables nécessaires pour le support de la langue native. Les configurer à pour résultat&nbsp;:

source: The output of programs translated into the native language
fr: La sortie des programmes est traduite dans le langage natif

source: Correct classification of characters into letters, digits and other classes. This is necessary for <command>bash</command> to properly accept non-ASCII characters in command lines in non-English locales
fr: Le classement correct des caractères dans les lettres, chiffres et autres classes. Cela est nécessaire pour <command>bash</command> pour accepter correctement les caractères non-ASCII dans les locales non anglaises

source: The correct alphabetical sorting order for the country
fr: Le classement alphabétique correct pour les autres pays

source: Appropriate default paper size
fr: Taille de papier par défaut appropriée

source: Correct formatting of monetary, time, and date values
fr: Le formatage correct de la monnaie, du temps et de la date

source: Replace <replaceable>&lt;ll&gt;</replaceable> below with the two-letter code for the desired language (e.g., <quote>en</quote>) and <replaceable>&lt;CC&gt;</replaceable> with the two-letter code for the appropriate country (e.g., <quote>GB</quote>). <replaceable>&lt;charmap&gt;</replaceable> should be replaced with the canonical charmap for your chosen locale. Optional modifiers such as <quote>@euro</quote> may also be present.
fr: Remplacez <replaceable>&lt;ll&gt;</replaceable> ci-dessous par les deux lettres du langage désiré (par exemple <quote>fr</quote>) et remplacez <replaceable>&lt;CC&gt;</replaceable> par les deux lettres du pays approprié (par exemple <quote>FR</quote>). <replaceable>&lt;charmap&gt;</replaceable> doit être remplacé par la table de caractère classique pour votre locale choisie. Des modificateurs optionnels comme <quote>@euro</quote> peuvent aussi être présents.

source: The list of all locales supported by Glibc can be obtained by running the following command:
fr: La liste des locales supportée par Glibc peut être obtenue en lançant la commande suivante&nbsp;:

source: Charmaps can have a number of aliases, e.g., <quote>ISO-8859-1</quote> is also referred to as <quote>iso8859-1</quote> and <quote>iso88591</quote>. Some applications cannot handle the various synonyms correctly (e.g., require that <quote>UTF-8</quote> is written as <quote>UTF-8</quote>, not <quote>utf8</quote>), so it is safest in most cases to choose the canonical name for a particular locale. To determine the canonical name, run the following command, where <replaceable>&lt;locale name&gt;</replaceable> is the output given by <command>locale -a</command> for your preferred locale (<quote>en_GB.iso88591</quote> in our example).
fr: Les tables de caractères peuvent aussi avoir certains alias, par exemple <quote>ISO-8859-15</quote> est aussi référencé comme <quote>iso8859-15</quote> et <quote>iso885915</quote>. Certaines applications ne peuvent pas gérer les différents synonymes (il est par exemple requis que <quote>UTF-8</quote> soit écrit <quote>UTF-8</quote> et pas <quote>utf8</quote>), il est donc plus sur de choisir le nom classique pour une locale particulière. Pour déterminer le nom classique, lancez la commande suivante, où <replaceable>&lt;locale name&gt;</replaceable> est la sortie donnée par <command>locale -a</command> pour votre locale préférée (<quote>fr_FR.iso885915</quote> dans notre exemple).

source: For the <quote>en_GB.iso88591</quote> locale, the above command will print:
fr: Pour la région <quote>fr_FR.iso885915</quote>, la commande va renvoyer&nbsp;:

source: <computeroutput>ISO-8859-1</computeroutput>
fr: <computeroutput>ISO-8859-15</computeroutput>

source: This results in a final locale setting of <quote>en_GB.ISO-8859-1</quote>. It is important that the locale found using the heuristic above is tested prior to it being added to the Bash startup files:
fr: Cela résulte en un paramètre de régionalisation final de <quote>fr_FR.ISO-8859-15</quote>. Il est important que la locale trouvée en utilistant la syntaxe précédente soit testée avant d'être ajoutée aux fichiers de démarage de bash&nbsp;:

source: The above commands should print the language name, the character encoding used by the locale, the local currency, and the prefix to dial before the telephone number in order to get into the country. If any of the commands above fail with a message similar to the one shown below, this means that your locale was either not installed in Chapter&nbsp;6 or is not supported by the default installation of Glibc.
fr: Les commandes ci-dessus devraient imprimer les langages, l'encodage des caractères utilisé par la locale, la monnaie locale ainsi que le préfixe de téléphone à composer afin d'entrer dans le pays. Si une de ces commandes précédentes échoue, cela signifie que votre locale n'a pas étée installée dans le chapitre&nbsp;6 ou n'est pas supportée par l'installation par défaut de Glibc.

source: If this happens, you should either install the desired locale using the <command>localedef</command> command, or consider choosing a different locale. Further instructions assume that there are no such error messages from Glibc.
fr: Si cela arrive, vous devez soit installer la locale désirée en utilisant la commande <command>localedef</command>, ou en utilisant une autre locale. Les instructions suivantes supposent qu'il n'y a pas de tels message d'erreur de Glibc.

source: Some packages beyond LFS may also lack support for your chosen locale. One example is the X library (part of the X Window System), which outputs the following error message if the locale does not exactly match one of the character map names in its internal files:
fr: Certains paquets au-delà de LFS peuvent manquer de support pour la locale que vous avez choisie. Un exemple est la bibliothèque X (partie du système X Window), qui retourne les messages suivant si la locale ou que le nom de jeu de caractères ne correspond pas exactement à ses fichiers internes&nbsp;:

source: In several cases Xlib expects that the character map will be listed in uppercase notation with canonical dashes. For instance, "ISO-8859-1" rather than "iso88591". It is also possible to find an appropriate specification by removing the charmap part of the locale specification. This can be checked by running the <command>locale charmap</command> command in both locales. For example, one would have to change "de_DE.ISO-8859-15@euro" to "de_DE@euro" in order to get this locale recognized by Xlib.
fr: Dans plusieurs cas Xlib s'attend à ce que le jeu de caractère soit inscrit en notation majuscule avec les tirets classiques. Par exemple «&nbsp;ISO-8859-1&nbsp;» plutôt que «&nbsp;iso88591&nbsp;». Il est aussi possible de trouver la spécification appropriée en retirant la partie correspondant au jeu de caractères de la spécification de la locale. Cela peut être testé en lançant la commande <command>locale charmap</command> des deux locales. Par exemple, il faudra changer «&nbsp;de_DE.ISO-8859-15@euro&nbsp;» à «&nbsp;de_DE@euro&nbsp;» pour que cette locale soit reconnue pas Xlib.

source: Other packages can also function incorrectly (but may not necessarily display any error messages) if the locale name does not meet their expectations. In those cases, investigating how other Linux distributions support your locale might provide some useful information.
fr: D'autres programmes ne vont aussi pas fonctionner correctement (mais ne vont pas nécessairement afficher un message d'erreur) si le nom de la locale ne rencontre pas leurs attentes. Dans d'autres cas, rechercher comment d'autres distributions Linux supportent votre locale peut fournir des informations utiles.

source: Once the proper locale settings have been determined, create the <filename>/etc/locale.conf</filename> file:
fr: Une fois que les bonnes configurations de locales ont été effectuées, créez le fichier <filename>/etc/locale.conf</filename>&nbsp;:

source: Note that you can modify <filename>/etc/locale.conf</filename> with the systemd <command>localectl</command> utility. To use <command>localectl</command> for the example above, run:
fr: Notez que vous devez modifier <filename>/etc/locale.conf</filename> avec l'utilitaire systemd <command>localectl</command>. Pour utiliser <command>localectl</command> avec l'exemple précédent, lancez&nbsp;:

source: You can also specify other language specific environment variables such as <envar>LANG</envar>, <envar>LC_CTYPE</envar>, <envar>LC_NUMERIC</envar> or any other environment variable from <command>locale</command> output. Just separate them with a space. An example where <envar>LANG</envar> is set as en_US.UTF-8 but <envar>LC_CTYPE</envar> is set as just en_US is:
fr: Vous pouvez aussi spécifier d'autres variables d'environnement comme <envar>LANG</envar>, <envar>LC_CTYPE</envar>, <envar>LC_NUMERIC</envar> ou n'importe quel autre varable de la sortie de <command>locale</command>. Un exemple où <envar>LANG</envar> est définie à en_US.UTF-8 mais <envar>LC_CTYPE</envar> est défini juste à en_US est&nbsp;:

source: Please note that the <command>localectl</command> command can be used only on a system booted with systemd.
fr: Notez que la commande <command>localectl</command> ne peut-être lancée que sur un système lancé avec systemd.

source: The <quote>C</quote> (default) and <quote>en_US</quote> (the recommended one for United States English users) locales are different. <quote>C</quote> uses the US-ASCII 7-bit character set, and treats bytes with the high bit set as invalid characters. That's why, e.g., the <command>ls</command> command substitutes them with question marks in that locale. Also, an attempt to send mail with such characters from Mutt or Pine results in non-RFC-conforming messages being sent (the charset in the outgoing mail is indicated as <quote>unknown 8-bit</quote>). So you can use the <quote>C</quote> locale only if you are sure that you will never need 8-bit characters.
fr: Les locales <quote>C</quote> (défaut) et <quote>en_US</quote> (recommandée pour les utilisateurs anglophones des états-Unis) sont différentes. <quote>C</quote> utilise le jeu de caractères US-ASCII 7-bit et traite les octets avec le bit de point fort à 1 comme caractères invalides. C'est pourquoi, par exemple, la commande <command>ls</command> les remplace par des points d'interrogation dans cette locale. En outre, les messages contenant ces caractères envoyés avec Mutt ou Pine ne sont pas conformes aux RFC (le jeu de caractères dans le mail sortant est indiqué comme <quote>unknown 8-bit</quote>). Vous ne pouvez donc utiliser la locale <quote>C</quote> seulement si vous êtes sûr que vous n'aurez jamais besoins de caractère 8 bits.

source: UTF-8 based locales are not supported well by many programs. Work is in progress to document and, if possible, fix such problems, see <ulink url="&blfs-book;introduction/locale-issues.html"/>.
fr: Les locales basées sur UTF-8 ne sont pas bien supportées par beaucoup de programmes. Le travail progresse pour documenter et si possible résoudre de tels problèmes, allez voir <ulink url="&blfs-book;introduction/locale-issues.html"/>
