Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/network.po
Languages: fr

source: General Network Configuration
fr: Configuration générale du réseau

source: configuring
fr: configuration

source: Creating Network Interface Configuration Files
fr: Création des fichiers de configuration d'interface réseau

source: Which interfaces are brought up and down by the network script usually depends on the files in <filename class="directory">/etc/sysconfig/</filename>. This directory should contain a file for each interface to be configured, such as <filename>ifconfig.xyz</filename>, where <quote>xyz</quote> should describe the network card. The interface name (e.g. eth0) is usually appropriate. Inside this file are attributes to this interface, such as its IP address(es), subnet masks, and so forth. It is necessary that the stem of the filename be <emphasis>ifconfig</emphasis>.
fr: Les interfaces activées et désactivées par le script réseau dépendent en général des fichiers du répertoire <filename class="directory">/etc/sysconfig/</filename>. Ce répertoire devrait contenir un fichier par interface à configurer, tel que <filename>ifconfig.xyz</filename>, où <quote>xyz</quote> doit décrit la carte réseau. En général le nom d'interface (comme eth0) est suffisant. Dans ce fichier, se trouvent les attributs de cette interface, tels que son//ses adresse(s) IP, les masques de sous-réseau, etc. Il faut que le fichier ait pour nom <emphasis>ifconfig</emphasis>.

source: If the procedure in the previous section was not used, Udev will assign network card interface names based on system physical characteristics such as enp2s1. If you are not sure what your interface name is, you can always run <command>ip link</command> or <command>ls /sys/class/net</command> after you have booted your system.
fr: Si vous n'avez pas suivi la procédure de la section précédente, Udev affectera un nom à l'interface de carte réseau en se basant sur les caractéristiques physiques du système comme enp2s1. Si vous n'êtes pas sûr du nom de votre interface, vous pouvez toujours lancer <command>ip link</command> ou <command>ls /sys/class/net</command> après avoir démarré votre système.

source: The following command creates a sample file for the <emphasis>eth0</emphasis> device with a static IP address:
fr: La commande suivante crée un fichier modèle pour le périphérique <emphasis>eth0</emphasis> avec une adresse IP statique&nbsp;:

source: The values of these variables must be changed in every file to match the proper setup.
fr: Les valeurs de ces variables doivent être modifiées dans chaque fichier pour correspondre à la bonne configuration.

source: If the <envar>ONBOOT</envar> variable is set to <quote>yes</quote> the System V network script will bring up the Network Interface Card (NIC) during booting of the system. If set to anything but <quote>yes</quote> the NIC will be ignored by the network script and not be automatically brought up. The interface can be manually started or stopped with the <command>ifup</command> and <command>ifdown</command> commands.
fr: Si la variable <envar>ONBOOT</envar> est configurée à <quote>yes</quote>, le script réseau de System V configurera le NIC pendant le démarrage du système. S'il est configuré avec toute autre valeur que <quote>yes</quote>, le NIC sera ignoré par le script réseau et ne sera pas configurée automatiquement. On peut démarrer et arrêter l'interface à la main avec les commandes <command>ifup</command> et <command>ifdown</command>.

source: The <envar>IFACE</envar> variable defines the interface name, for example, eth0. It is required for all network device configuration files.
fr: La variable <envar>IFACE</envar> définit le nom de l'interface, par exemple, eth0. Elle est nécessaire dans tous les fichiers de configuration des périphériques réseaux.

source: The <envar>SERVICE</envar> variable defines the method used for obtaining the IP address. The LFS-Bootscripts package has a modular IP assignment format, and creating additional files in the <filename class="directory">/lib/services/</filename> directory allows other IP assignment methods. This is commonly used for Dynamic Host Configuration Protocol (DHCP), which is addressed in the BLFS book.
fr: La variable <envar>SERVICE</envar> définit la méthode utilisée pour obtenir l'adresse IP. Les scripts de démarrage LFS ont un format d'affectation d'IP modulaire. Créer les fichiers supplémentaires dans le répertoire <filename class="directory">/lib/services/</filename> autorise d'autres méthodes d'affectation d'IP. Ceci est habituellement utilisé pour le DHCP, qui est adressé dans le livre BLFS.

source: The <envar>GATEWAY</envar> variable should contain the default gateway IP address, if one is present. If not, then comment out the variable entirely.
fr: La variable <envar>GATEWAY</envar> devrait contenir l'adresse IP par défaut de la passerelle, si elle existe. Sinon, mettez entièrement en commentaire la variable.

source: The <envar>PREFIX</envar> variable contains the number of bits used in the subnet. Each octet in an IP address is 8 bits. If the subnet's netmask is 255.255.255.0, then it is using the first three octets (24 bits) to specify the network number. If the netmask is 255.255.255.240, it would be using the first 28 bits. Prefixes longer than 24 bits are commonly used by DSL and cable-based Internet Service Providers (ISPs). In this example (PREFIX=24), the netmask is 255.255.255.0. Adjust the <envar>PREFIX</envar> variable according to your specific subnet. If omitted, the PREFIX defaults to 24.
fr: La variable <envar>PREFIX</envar> contient le nombre de bits utilisés dans le sous-réseau. Chaque octet dans une adresse IP est exprimé sur huit bits. Si le masque du sous-réseau est 255.255.255.0, alors il est en train d'utiliser les trois premiers octets (24 bits) pour spécifier le numéro du réseau. Si le masque réseau est 255.255.255.240, il utiliserait les 28 premiers bits. Les préfixes plus longs que 24 bits sont habituellement utilisés par les fournisseurs d'accès Internet ADSL et câble. Dans cet exemple (PREFIX=24), le masque réseau est 255.255.255.0. Ajustez la variable <envar>PREFIX</envar> en concordance avec votre sous-réseau spécifique. Si vous ne le mettez pas, PREFIX vaut 24 par défaut.

source: For more information see the <command>ifup</command> man page.
fr: Pour plus d'informations, voir la page de manuel de <command>ifup</command>.

source: Creating the /etc/resolv.conf File
fr: Créer le fichier /etc/resolv.conf

source: The system will need some means of obtaining Domain Name Service (DNS) name resolution to resolve Internet domain names to IP addresses, and vice versa. This is best achieved by placing the IP address of the DNS server, available from the ISP or network administrator, into <filename>/etc/resolv.conf</filename>. Create the file by running the following:
fr: Le système aura besoin d'un moyen pour obtenir un résolveur DNS pour résoudre les noms de domaines Internet en adresse IP, et vice-versa. Ceci se fait en plaçant les adresses IP des serveurs DNS, disponibles auprès du FAI ou de l'administrateur système, dans <filename>/etc/resolv.conf</filename>. Créez ce fichier en lançant&nbsp;:

source: <userinput>cat &gt; /etc/resolv.conf &lt;&lt; "EOF" <literal># Begin /etc/resolv.conf domain <replaceable>&lt;Your Domain Name&gt;</replaceable> nameserver <replaceable>&lt;IP address of your primary nameserver&gt;</replaceable> nameserver <replaceable>&lt;IP address of your secondary nameserver&gt;</replaceable> # End /etc/resolv.conf</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/resolv.conf &lt;&lt; "EOF" <literal># Début de /etc/resolv.conf domain <replaceable>&lt;Votre nom de domaine&gt;</replaceable> nameserver <replaceable>&lt;Adresse IP du DNS primaire&gt;</replaceable> nameserver <replaceable>&lt;Adresse IP du DNS secondaire&gt;</replaceable> # Fin de /etc/resolv.conf</literal> EOF</userinput>

source: The <varname>domain</varname> statement can be omitted or replaced with a <varname>search</varname> statement. See the man page for resolv.conf for more details.
fr: Le paramètre <varname>domain</varname> peut être omis ou remplacé par un paramètre <varname>search</varname>. Voir la page de manuel de resolv.conf pour plus de détails.

source: Replace <replaceable>&lt;IP address of the nameserver&gt;</replaceable> with the IP address of the DNS most appropriate for the setup. There will often be more than one entry (requirements demand secondary servers for fallback capability). If you only need or want one DNS server, remove the second <emphasis>nameserver</emphasis> line from the file. The IP address may also be a router on the local network.
fr: Remplacez <replaceable>&lt;Adresse IP du DNS&gt;</replaceable> par l'adresse IP du DNS le plus approprié pour la configuration. Il y aura souvent plus d'une entrée (les serveurs secondaires sont utiles en cas d'indisponibilité du premier). Si vous avez seulement besoin ou si vous voulez seulement un serveur DNS, supprimez la seconde ligne <emphasis>nameserver</emphasis> du fichier. L'adresse IP pourrait aussi être un routeur sur le réseau local.

source: The Google Public IPv4 DNS addresses are 8.8.8.8 and 8.8.4.4.
fr: Les adresses des DNS publiques IPV4 de Google sont 8.8.8.8 et 8.8.4.4.

source: Configuring the system hostname
fr: Configurer le nom d'hôte du système

source: During the boot process, the file <filename>/etc/hostname</filename> is used for establishing the system's hostname.
fr: Pendant le processus de démarrage, le fichier <filename>/etc/hostname</filename> est utilisé pour donner un nom d'hôte au système.

source: Create the <filename>/etc/hostname</filename> file and enter a hostname by running:
fr: Créez le fichier <filename>/etc/network</filename> et saisissez le nom du système en lançant&nbsp;:

source: <replaceable>&lt;lfs&gt;</replaceable> needs to be replaced with the name given to the computer. Do not enter the Fully Qualified Domain Name (FQDN) here. That information is put in the <filename>/etc/hosts</filename> file.
fr: <replaceable>&lt;lfs&gt;</replaceable> doit être remplacé par le nom de l'ordinateur. Ne saisissez pas le FQDN ici. Cette information sera saisie dans le fichier <filename>/etc/hosts</filename>.

source: Customizing the /etc/hosts File
fr: Personnaliser le fichier /etc/hosts

source: Decide on the IP address, fully-qualified domain name (FQDN), and possible aliases for use in the <filename>/etc/hosts</filename> file. The syntax is:
fr: Choisissez l'adresse IP, son nom de domaine pleinement qualifié (<foreignphrase>fully-qualified domain name</foreignphrase>, ou FQDN) et les alias possibles à déclarer dans le fichier <filename>/etc/hosts</filename>. La syntaxe est&nbsp;:

source: Unless the computer is to be visible to the Internet (i.e., there is a registered domain and a valid block of assigned IP addresses&mdash;most users do not have this), make sure that the IP address is in the private network IP address range. Valid ranges are:
fr: Sauf si votre ordinateur doit être visible à partir d'Internet (c-à-d que c'est un domaine enregistré et un bloc d'adresses IP valide&mdash;la plupart des utilisateurs n'ont pas ceci), assurez-vous que l'adresse IP se trouve dans la plage d'adresses réservée aux réseaux privés. Les plages valides sont&nbsp;:

source: <literal>Private Network Address Range Normal Prefix 10.0.0.1 - 10.255.255.254 8 172.x.0.1 - 172.x.255.254 16 192.168.y.1 - 192.168.y.254 24</literal>
fr: <literal>Plage d'adresses réseau privés Préfixe normal 10.0.0.1 - 10.255.255.254 8 172.x.0.1 - 172.x.255.254 16 192.168.y.1 - 192.168.y.254 24</literal>

source: x can be any number in the range 16-31. y can be any number in the range 0-255.
fr: x peut être un nombre compris entre 16 et 31. y peut être un nombre compris entre 0 et 255.

source: A valid private IP address could be 192.168.1.1. A valid FQDN for this IP could be lfs.example.org.
fr: Une adresse IP privée valide pourrait être 192.168.1.1. Un FQDN valide pour cette IP pourrait être lfs.example.org.

source: Even if not using a network card, a valid FQDN is still required. This is necessary for certain programs to operate correctly.
fr: Même si vous ne possédez pas de carte réseau, un FQDN valide est toujours requis. Certains programmes en ont besoin pour fonctionner correctement.

source: Create the <filename>/etc/hosts</filename> file by running:
fr: Créez le fichier <filename>/etc/hosts</filename> en lançant&nbsp;:

source: The <replaceable>&lt;192.168.1.1&gt;</replaceable>, <replaceable>&lt;FQDN&gt;</replaceable>, and <replaceable>&lt;HOSTNAME&gt;</replaceable> values need to be changed for specific uses or requirements (if assigned an IP address by a network/system administrator and the machine will be connected to an existing network). The optional alias name(s) can be omitted.
fr: Les valeurs <replaceable>&lt;192.168.1.1&gt;</replaceable>, <replaceable>&lt;FQDN&gt;</replaceable> et <replaceable>&lt;HOSTNAME&gt;</replaceable> doivent être remplacées suivant les contraintes et les besoins spécifiques (si la machine se voit affecter une adresse IP par un administrateur réseau/système et que cette machine est connectée à un réseau existant). Vous pouvez omettre le ou les noms d'alias facultatifs.
