Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/networkd.po
Languages: fr

source: General Network Configuration
fr: Configuration générale du réseau

source: configuring
fr: configuration

source: This section only applies if a network card is to be configured.
fr: Cette section s'applique seulement si une carte réseau doit être configurée.

source: Network Interface Configuration Files
fr: Fichier de configuration d'interface réseau

source: Starting with version 209, systemd ships a network configuration daemon called <command>systemd-networkd</command> which can be used for basic network configuration. Additionally, since version 213, DNS name resolution can be handled by <command>systemd-resolved</command> in place of a static <filename>/etc/resolv.conf</filename> file. Both services are enabled by default.
fr: À partir de la version 209, systemd contient un démon de configuration réseau nommé <command>systemd-networkd</command> qui peut être utilisé pour la configuration basique du réseau. De plus, depuis la version 213, la résolution de nom DNS peut être prise en charge par <command>systemd-resolved</command> au lieu d'un fichier <filename>/etc/resolv.conf</filename> statique. Ces deux services sont activés par défaut.

source: Configuration files for <command>systemd-networkd</command> (and <command>systemd-resolved</command>) can be placed in <filename class="directory">/usr/lib/systemd/network</filename> or <filename class="directory">/etc/systemd/network</filename>. Files in <filename class="directory">/etc/systemd/network</filename> have a higher priority than the ones in <filename class="directory">/usr/lib/systemd/network</filename>. There are three types of configuration files: <filename class="extension">.link</filename>, <filename class="extension">.netdev</filename> and <filename class="extension">.network</filename> files. For detailed descriptions and example contents of these configuration files, consult the <filename>systemd-link(5)</filename>, <filename>systemd-netdev(5)</filename> and <filename>systemd-network(5)</filename> manual pages.
fr: Les fichiers de configuration pour <command>systemd-networkd</command> (et <command>systemd-resolved</command>) peuvent être placés dans <filename class="directory">/usr/lib/systemd/network</filename> ou <filename class="directory">/etc/systemd/network</filename>. Les fichiers dans <filename class="directory">/etc/systemd/network</filename> ont une priorité supérieure à ceux dans <filename class="directory">/usr/lib/systemd/network</filename>. Il existe trois types de fichiers de configuration&nbsp;: <filename class="extension">.link</filename>, <filename class="extension">.netdev</filename> et <filename class="extension">.network</filename>. Pour une description détaillée et des exemples de contenu de ces fichiers de configuration, consultez des pages de manuel <filename>systemd-link(5)</filename>, <filename>systemd-netdev(5)</filename> et <filename>systemd-network(5)</filename>.

source: Network Device Naming
fr: Nommage des périphériques réseau

source: Udev normally assigns network card interface names based on system physical characteristics such as enp2s1. If you are not sure what your interface name is, you can always run <command>ip link</command> after you have booted your system.
fr: Udev assigne normalement des noms d'interface basés sur les caractéristiques physiques comme enp2s1. Si vous n'êtes pas sûr de votre nom d'interface, vous pouvez toujours lancer <command>ip link</command> après avoir lancé votre système.

source: For most systems, there is only one network interface for each type of connection. For example, the classic interface name for a wired connection is eth0. A wireless connection will usually have the name wifi0 or wlan0.
fr: Pour la plupart des systèmes, il n'y a qu'une interface réseau pour chaque type de connexion. Par exemple, le nom classique pour une connexion filaire est eth0. Une connexion sans fil aura souvant pour nom wifi0 ou wlan0.

source: If you prefer to use the classic or customized network interface names, there are three alternative ways to do that:
fr: Si vous préférez utiliser les noms d'interfaces réseau classiques ou personnalisés, il y a trois manières de procéder&nbsp;:

source: Mask udev's .link file for the default policy: <placeholder type="screen" id="0"/>
fr: Masquez le fichier .link d'udev pour la politique par défaut&nbsp;: <placeholder type="screen" id="0"/>

source: Create a manual naming scheme, for example by naming the interfaces something like "internet0", "dmz0", or "lan0". For that, create .link files in /etc/systemd/network/, that choose an explicit name or a better naming scheme for one, some, or all of your interfaces. For example:
fr: Créez une convention de nommage manuelle, par exemple en nommant les interface comme «&nbsp;internet0&nbsp;», «&nbsp;dmz0&nbsp;» ou «&nbsp;lan0&nbsp;». Pour cela, créez des fichiers .link dans /etc/systemd/network/, qui choisissent un nom explicite ou une meilleure convention de nommage pour une, certaines ou toutes vos interfaces. Par exemple&nbsp;:

source: <userinput>cat &gt; /etc/systemd/network/10-ether0.link &lt;&lt; "EOF" <literal>[Match] # Change the MAC address as appropriate for your network device MACAddress=12:34:45:78:90:AB [Link] Name=ether0</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/systemd/network/10-ether0.link &lt;&lt; "EOF" <literal>[Match] # Changez l'adresse MAC comme il faut pour votre périphérique réseau MACAddress=12:34:45:78:90:AB [Link] Name=ether0</literal> EOF</userinput>

source: See the man page systemd.link(5) for more information.
fr: Voir la page de manuel de systemd.link(5) pour plus d'informations.

source: In /boot/grub/grub.cfg, pass the option net.ifnames=0 on the kernel command line.
fr: Dans /boot/grub/grub.cfg, passez l'option net.ifnames=0 sur la ligne de commande du noyau.

source: Static IP Configuration
fr: Configuration en IP statique

source: The command below creates a basic configuration file for a Static IP setup (using both systemd-networkd and systemd-resolved):
fr: La commande suivante crée un fichier de configuration basique pour la configuration d'une adresse ip statique (en utilisant systemd-networkd et systemd-resolved)&nbsp;:

source: Multiple DNS entries can be added if you have more than one DNS server. Do not include DNS or Domains entries if you intend to use a static <filename>/etc/resolv.conf</filename> file.
fr: Vous pouvez ajouter plusieurs entrées DNS si vous avez plus d’un serveur DNS. Ne rajoutez pas d’entrée DNS ou Domains si vous voulez utiliser un fichier <filename>/etc/resolv.conf</filename> statique.

source: DHCP Configuration
fr: Configuration du DHCP

source: The command below creates a basic configuration file for an IPv4 DHCP setup:
fr: La commande suivante crée un fichier de configuration basique pour la configuration de DHCP en IPv4&nbsp;:

source: Creating the /etc/resolv.conf File
fr: Créer le fichier /etc/resolv.conf

source: If the system is going to be connected to the Internet, it will need some means of Domain Name Service (DNS) name resolution to resolve Internet domain names to IP addresses, and vice versa. This is best achieved by placing the IP address of the DNS server, available from the ISP or network administrator, into <filename>/etc/resolv.conf</filename>.
fr: Si le système a besoin d'être connecté à Internet, il aura besoin d'un DNS pour résoudre les noms de domaines Internet en adresse IP, et vice-versa. Ceci se fait en plaçant les adresses IP des serveurs DNS, disponibles auprès du FAI ou de l'administrateur système, dans <filename>/etc/resolv.conf</filename>.

source: systemd-resolved Configuration
fr: Configuration de systemd-resolved

source: If using another means to configure your network interfaces (ex: ppp, network-manager, etc.), or if using any type of local resolver (ex: bind, dnsmasq, etc.), or any other software that generates an <filename>/etc/resolv.conf</filename> (ex: resolvconf), the <command>systemd-resolved</command> service should not be used.
fr: Si vous utilisez un autre moyen pour configurer votre interface réseau (par exemple ppp, network-manager, etc), ou si vous utilisez un résolveur local (par exemple bind, dnsmasq, etc), ou tout autre logiciel générant un fichier <filename>/etc/resolv.conf</filename> (par exemple resolvconf), le service <command>systemd-resolved</command> ne devrait pas être utilisé.

source: When using <command>systemd-resolved</command> for DNS configuration, it creates the file <filename>/run/systemd/resolve/resolv.conf</filename>. Create a symlink in <filename>/etc</filename> to use the generated file:
fr: Lorsque vous utilisez <command>systemd-resolved</command> pour configurer le DNS, il crée le fichier <filename>/run/systemd/resolve/resolv.conf</filename>. Créez un lien symbolique dans <filename>/etc</filename> pour utiliser le fichier généré&nbsp;:

source: Static resolv.conf Configuration
fr: Configuration de resolv.conf statique

source: If a static <filename>/etc/resolv.conf</filename> is desired, create it by running the following command:
fr: Si un fichier statique <filename>/etc/resolv.conf</filename> est désiré, créez-le en lançant la commande suivante&nbsp;:

source: <userinput>cat &gt; /etc/resolv.conf &lt;&lt; "EOF" <literal># Begin /etc/resolv.conf domain <replaceable>&lt;Your Domain Name&gt;</replaceable> nameserver <replaceable>&lt;IP address of your primary nameserver&gt;</replaceable> nameserver <replaceable>&lt;IP address of your secondary nameserver&gt;</replaceable> # End /etc/resolv.conf</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/resolv.conf &lt;&lt; "EOF" <literal># Début de /etc/resolv.conf domain <replaceable>&lt;Votre nom de domaine&gt;</replaceable> nameserver <replaceable>&lt;Adresse IP du DNS primaire&gt;</replaceable> nameserver <replaceable>&lt;Adresse IP du DNS secondaire&gt;</replaceable> # Fin de /etc/resolv.conf</literal> EOF</userinput>

source: The <varname>domain</varname> statement can be omitted or replaced with a <varname>search</varname> statement. See the man page for resolv.conf for more details.
fr: Le paramètre <varname>domain</varname> peut être omis ou remplacé par un paramètre <varname>search</varname>. Voir la page de manuel de resolv.conf pour plus de détails.

source: Replace <replaceable>&lt;IP address of the nameserver&gt;</replaceable> with the IP address of the DNS most appropriate for the setup. There will often be more than one entry (requirements demand secondary servers for fallback capability). If you only need or want one DNS server, remove the second <emphasis>nameserver</emphasis> line from the file. The IP address may also be a router on the local network.
fr: Remplacez <replaceable>&lt;Adresse IP du DNS&gt;</replaceable> par l'adresse IP du DNS le plus approprié pour la configuration. Il y aura souvent plus d'une entrée (les serveurs secondaires sont utiles en cas d'indisponibilité du premier). Si vous avez seulement besoin ou si vous voulez seulement un serveur DNS, supprimez la seconde ligne <emphasis>nameserver</emphasis> du fichier. L'adresse IP pourrait aussi être un routeur sur le réseau local.

source: The Google Public IPv4 DNS addresses are <parameter>8.8.8.8</parameter> and <parameter>8.8.4.4</parameter> for IPv4, and <parameter>2001:4860:4860::8888</parameter> and <parameter>2001:4860:4860::8844</parameter> for IPv6.
fr: Les adresses des DNS publiques de Google sont <parameter>8.8.8.8</parameter> et <parameter>8.8.4.4</parameter> en IPv4 et <parameter>2001:4860:4860::8888</parameter> et <parameter>2001:4860:4860::8844</parameter> en IPv6. Autrement, vous pouvez aussi utiliser les résolveurs de FDN: <parameter>80.67.169.12</parameter> et <parameter>80.67.169.40</parameter> en IPv4 et <parameter>2001:910:800::12</parameter> et <parameter>2001:910:800::40</parameter> en IPv6.

source: Configuring the system hostname
fr: Configurer le nom d'hôte du système

source: During the boot process, the file <filename>/etc/hostname</filename> is used for establishing the system's hostname.
fr: Pendant le processus de démarrage, le fichier <filename>/etc/hostname</filename> est utilisé pour donner un nom d'hôte au système.

source: Create the <filename>/etc/hostname</filename> file and enter a hostname by running:
fr: Créez le fichier <filename>/etc/network</filename> et saisissez le nom du système en lançant&nbsp;:

source: <replaceable>&lt;lfs&gt;</replaceable> needs to be replaced with the name given to the computer. Do not enter the Fully Qualified Domain Name (FQDN) here. That information is put in the <filename>/etc/hosts</filename> file.
fr: <replaceable>&lt;lfs&gt;</replaceable> doit être remplacé par le nom de l'ordinateur. Ne saisissez pas le FQDN ici. Cette information sera saisie dans le fichier <filename>/etc/hosts</filename>.

source: Customizing the /etc/hosts File
fr: Personnaliser le fichier /etc/hosts

source: Decide on a fully-qualified domain name (FQDN), and possible aliases for use in the <filename>/etc/hosts</filename> file. If using static addresses, you'll also need to decide on an IP address. The syntax for a hosts file entry is:
fr: Choisissez un nom de domaine pleinement qualifié (<foreignphrase>fully-qualified domain name</foreignphrase>, ou FQDN) et les alias possibles à déclarer dans le fichier <filename>/etc/hosts</filename>. Si vous utilisez des adresses statiques, vous devrez aussi choisir une adresse IP. La syntaxe d’une entrée du fichier hosts est&nbsp;:

source: Unless the computer is to be visible to the Internet (i.e., there is a registered domain and a valid block of assigned IP addresses&mdash;most users do not have this), make sure that the IP address is in the private network IP address range. Valid ranges are:
fr: Sauf si votre ordinateur doit être visible à partir d'Internet (c-à-d que c'est un domaine enregistré et un bloc d'adresses IP valide&mdash;la plupart des utilisateurs n'ont pas ceci), assurez-vous que l'adresse IP se trouve dans la plage d'adresses réservée aux réseaux privés. Les plages valides sont&nbsp;:

source: <literal>Private Network Address Range Normal Prefix 10.0.0.1 - 10.255.255.254 8 172.x.0.1 - 172.x.255.254 16 192.168.y.1 - 192.168.y.254 24</literal>
fr: <literal>Plage d'adresses réseau privés Préfixe normal 10.0.0.1 - 10.255.255.254 8 172.x.0.1 - 172.x.255.254 16 192.168.y.1 - 192.168.y.254 24</literal>

source: x can be any number in the range 16-31. y can be any number in the range 0-255.
fr: x peut être un nombre compris entre 16 et 31. y peut être un nombre compris entre 0 et 255.

source: A valid private IP address could be 192.168.1.1. A valid FQDN for this IP could be lfs.example.org.
fr: Une adresse IP privée valide pourrait être 192.168.1.1. Un FQDN valide pour cette IP pourrait être lfs.example.org.

source: Even if not using a network card, a valid FQDN is still required. This is necessary for certain programs to operate correctly.
fr: Même si vous ne possédez pas de carte réseau, un FQDN valide est toujours requis. Certains programmes en ont besoin pour fonctionner correctement.

source: If using DHCP, DHCPv6, IPv6 Autoconfiguration, or if a network card is not going to be configured, create the <filename>/etc/hosts</filename> file by running the following command:
fr: Si vous utilisez le DHCP, DHCPv6, l’auto-configuration IPv6 ou si vous n'avez pas de carte réseau à configurer, créez le fichier <filename>/etc/hosts</filename> en lançant la commande&nbsp;:

source: The ::1 entry is the IPv6 counterpart of 127.0.0.1 and represents the IPv6 loopback interface. 127.0.1.1 is a loopback entry reserved specifically for the FQDN.
fr: L'adresse ::1 est l'équivalent en IPv6 à 127.0.0.1 et représente l'interface de rebouclage IPv6. 127.0.1.1 est une entrée de rebouclage réservée spécifiquement pour le FQDN.

source: If using a static address, create the <filename>/etc/hosts</filename> file by running this command instead:
fr: Si vous utilisez une adresse statique, créez le fichier <filename>/etc/hosts</filename> en lançant plutôt cette commande&nbsp;:

source: The <replaceable>&lt;192.168.0.2&gt;</replaceable>, <replaceable>&lt;FQDN&gt;</replaceable>, and <replaceable>&lt;HOSTNAME&gt;</replaceable> values need to be changed for specific uses or requirements (if assigned an IP address by a network/system administrator and the machine will be connected to an existing network). The optional alias name(s) can be omitted.
fr: Les valeurs <replaceable>&lt;192.168.0.2&gt;</replaceable>, <replaceable>&lt;FQDN&gt;</replaceable> et <replaceable>&lt;HOSTNAME&gt;</replaceable> doivent être remplacées suivant les contraintes et les besoins spécifiques (si la machine se voit affecter une adresse IP par un administrateur réseau/système et que cette machine est connectée à un réseau existant). Vous pouvez omettre le ou les noms d'alias facultatifs.
