Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/profile.po
Languages: fr

source: The Bash Shell Startup Files
fr: Fichiers de démarrage du shell Bash

source: The shell program <command>/bin/bash</command> (hereafter referred to as <quote>the shell</quote>) uses a collection of startup files to help create an environment to run in. Each file has a specific use and may affect login and interactive environments differently. The files in the <filename class="directory">/etc</filename> directory provide global settings. If an equivalent file exists in the home directory, it may override the global settings.
fr: Le programme shell <command>/bin/bash</command> (dénommé ci-après <quote>le shell</quote>) utilise une collection de fichiers de démarrage pour aider à la création d'un environnement d'exécution. Chaque fichier a une utilisation spécifique et pourrait avoir des effets différents sur les environnements de connexion et interactif. Les fichiers du répertoire <filename class="directory">/etc</filename> fournissent un paramétrage global. Si un fichier équivalent existe dans le répertoire personnel, il pourrait surcharger les paramétrages globaux.

source: An interactive login shell is started after a successful login, using <command>/bin/login</command>, by reading the <filename>/etc/passwd</filename> file. An interactive non-login shell is started at the command-line (e.g., <prompt>[prompt]$</prompt><command>/bin/bash</command>). A non-interactive shell is usually present when a shell script is running. It is non-interactive because it is processing a script and not waiting for user input between commands.
fr: Un shell interactif de connexion est lancé après une connexion réussie, en utilisant <command>/bin/login</command>, par la lecture du fichier <filename>/etc/passwd</filename>. Un shell interactif sans connexion est lancé en ligne de commande (c'est-à-dire <prompt>[prompt]$</prompt><command>/bin/bash</command>). Un shell non interactif est habituellement présent quand un script shell est en cours d'exécution. Il est non interactif parce qu'il traite un script et n'attend pas une saisie de l'utilisateur entre les commandes.

source: For more information, see <command>info bash</command> under the <emphasis>Bash Startup Files and Interactive Shells</emphasis> section.
fr: Pour plus d'informations, voir <command>info bash</command> sous la section <emphasis>Bash Startup Files and Interactive Shells</emphasis> (Fichiers de démarrage de Bash et shells interactifs).

source: The files <filename>/etc/profile</filename> and <filename>~/.bash_profile</filename> are read when the shell is invoked as an interactive login shell.
fr: Les fichiers <filename>/etc/profile</filename> et <filename>~/.bash_profile</filename> sont lus quand le shell est appelé en tant que shell interactif de connexion.

source: The base <filename>/etc/profile</filename> below sets some environment variables necessary for native language support. Setting them properly results in:
fr: Le fichier <filename>/etc/profile</filename> de base ci-dessous configure quelques variables d'environnement nécessaires au support des langues maternelles. Les configurer convenablement permet ce qui suit&nbsp;:

source: The output of programs translated into the native language
fr: La sortie des programmes traduite dans la langue maternelle&nbsp;;

source: Correct classification of characters into letters, digits and other classes. This is necessary for <command>bash</command> to properly accept non-ASCII characters in command lines in non-English locales
fr: Un classement correct des caractères en lettres, chiffres et autres classes. Ceci est nécessaire pour que <command>bash</command> accepte correctement les caractères non-ASCII dans les lignes de commandes pour les locales autres que l'anglais&nbsp;;

source: The correct alphabetical sorting order for the country
fr: L'ordre de tri alphabétique correct pour le pays&nbsp;;

source: Appropriate default paper size
fr: Taille de papier par défaut appropriée

source: Correct formatting of monetary, time, and date values
fr: Le bon formatage des valeurs monétaires, d'heure et de dates.

source: Replace <replaceable>&lt;ll&gt;</replaceable> below with the two-letter code for the desired language (e.g., <quote>en</quote>) and <replaceable>&lt;CC&gt;</replaceable> with the two-letter code for the appropriate country (e.g., <quote>GB</quote>). <replaceable>&lt;charmap&gt;</replaceable> should be replaced with the canonical charmap for your chosen locale. Optional modifiers such as <quote>@euro</quote> may also be present.
fr: Remplacez <replaceable>&lt;ll&gt;</replaceable> ci-dessous par le code à deux lettres de la langue désirée (par exemple, <quote>fr</quote>) et <replaceable>&lt;CC&gt;</replaceable> avec le code à deux lettres du pays approprié (par exemple, <quote>FR</quote>). <replaceable>&lt;charmap&gt;</replaceable> devra être remplacé avec le jeu de caractères canonique de la locale choisie. Des modificateurs optionnels comme <quote>@euro</quote> peuvent aussi être présents.

source: The list of all locales supported by Glibc can be obtained by running the following command:
fr: La liste de toutes les locales supportées par Glibc peut être obtenue en exécutant la commande suivante&nbsp;:

source: Charmaps can have a number of aliases, e.g., <quote>ISO-8859-1</quote> is also referred to as <quote>iso8859-1</quote> and <quote>iso88591</quote>. Some applications cannot handle the various synonyms correctly (e.g., require that <quote>UTF-8</quote> is written as <quote>UTF-8</quote>, not <quote>utf8</quote>), so it is safest in most cases to choose the canonical name for a particular locale. To determine the canonical name, run the following command, where <replaceable>&lt;locale name&gt;</replaceable> is the output given by <command>locale -a</command> for your preferred locale (<quote>en_GB.iso88591</quote> in our example).
fr: Les locales peuvent avoir plusieurs synonymes. Par exemple, <quote>ISO-8859-1</quote> est aussi appelée <quote>iso8859-1</quote> et <quote>iso88591</quote>. Quelques applications ne peuvent pas gérer les différents synonymes correctement (elles nécessitent par exemple l'écriture de <quote>UTF-8</quote> sous la forme <quote>UTF-8</quote> et non <quote>utf8</quote>), donc il est plus sûr de choisir le nom canonique pour une locale particulière. Pour déterminer le nom canonique, lancez la commande suivante, où <replaceable>&lt;nom locale&gt;</replaceable> est l'affichage donné par <command>locale -a</command> pour votre locale préférée (<quote>fr_FR.iso88591</quote> dans notre exemple).

source: <userinput>LC_ALL=<replaceable>&lt;locale name&gt;</replaceable> locale charmap</userinput>
fr: <userinput>LC_ALL=<replaceable>&lt;nom_de_la_locale&gt;</replaceable> locale charmap</userinput>

source: For the <quote>en_GB.iso88591</quote> locale, the above command will print:
fr: Pour la locale <quote>fr_FR.iso88591</quote>, la commande ci-dessus affichera&nbsp;:

source: This results in a final locale setting of <quote>en_GB.ISO-8859-1</quote>. It is important that the locale found using the heuristic above is tested prior to it being added to the Bash startup files:
fr: Ceci résulte en un paramétrage final de locale avec <quote>fr_FR.ISO-8859-1</quote>. Il est important que la locale trouvée utilisant l'heuristique ci-dessus soit testée avant d'être ajoutée aux fichiers de démarrage de Bash&nbsp;:

source: <userinput>LC_ALL=&lt;locale name&gt; locale language LC_ALL=&lt;locale name&gt; locale charmap LC_ALL=&lt;locale name&gt; locale int_curr_symbol LC_ALL=&lt;locale name&gt; locale int_prefix</userinput>
fr: <userinput>LC_ALL=&lt;nom_de_la_locale&gt; locale language LC_ALL=&lt;nom_de_la_locale&gt; locale charmap LC_ALL=&lt;nom_de_la_locale&gt; locale int_curr_symbol LC_ALL=&lt;nom_de_la_locale&gt; locale int_prefix</userinput>

source: The above commands should print the language name, the character encoding used by the locale, the local currency, and the prefix to dial before the telephone number in order to get into the country. If any of the commands above fail with a message similar to the one shown below, this means that your locale was either not installed in Chapter&nbsp;6 or is not supported by the default installation of Glibc.
fr: Les commandes ci-dessus devraient afficher le nom de la langue, le codage des caractères utilisé par la locale, la monnaie et le préfixe du pays à composer avant de saisir le numéro de téléphone. Si une des commandes ci-dessus échoue avec un message similaire à un de ceux montrés ci-dessous, cela signifie que votre locale n'a pas été installée au chapitre&nbsp;6 ou qu'elle n'est pas prise en charge par l'installation par défaut de Glibc.

source: If this happens, you should either install the desired locale using the <command>localedef</command> command, or consider choosing a different locale. Further instructions assume that there are no such error messages from Glibc.
fr: Si cela arrive, vous pouvez soit installer la locale désirée en utilisant la commande <command>localedef</command> soit considérer l'utilisation d'une locale différente. Les instructions suivantes supposent qu'il n'y a pas eu de tels messages de Glibc.

source: Some packages beyond LFS may also lack support for your chosen locale. One example is the X library (part of the X Window System), which outputs the following error message if the locale does not exactly match one of the character map names in its internal files:
fr: Certains paquets en dehors de LFS pourraient aussi ne pas avoir de support pour la locale que vous avez choisi. Un exemple est la bibliothèque X (qui fait partie du système X Window), qui affiche le message d'erreur suivant si la locale n'est pas exactement identique à celle définie par ses fichiers&nbsp;:

source: In several cases Xlib expects that the character map will be listed in uppercase notation with canonical dashes. For instance, "ISO-8859-1" rather than "iso88591". It is also possible to find an appropriate specification by removing the charmap part of the locale specification. This can be checked by running the <command>locale charmap</command> command in both locales. For example, one would have to change "de_DE.ISO-8859-15@euro" to "de_DE@euro" in order to get this locale recognized by Xlib.
fr: Dans certains cas Xlib s'attend à ce que le plan de caractères soit listé en majuscule avec des tirets canoniques. Par exemple, «&nbsp;ISO-8859-1&nbsp;» plutôt que «&nbsp;iso88591&nbsp;». Il est aussi possible de trouver la spécification adéquate en supprimant la partie charmap de la spécification de la locale. Vous pouvez le vérifier en lançant la commande <command>locale charmap</command> dans les deux locales. Par exemple, vous pourriez vouloir remplacer «&nbsp;fr_FR.ISO-8859-15@euro&nbsp;» par «&nbsp;fr_FR@euro&nbsp;» afin que cette locale soit reconnue par Xlib.

source: Other packages can also function incorrectly (but may not necessarily display any error messages) if the locale name does not meet their expectations. In those cases, investigating how other Linux distributions support your locale might provide some useful information.
fr: D'autres paquets peuvent aussi mal fonctionner (mais pourraient ne pas nécessairement afficher de messages d'erreurs) si le nom de la locale ne correspond pas à leur attente. Dans de tels cas, vous pouvez obtenir des informations utiles en cherchant comment les autres distributions Linux supportent votre locale.

source: Once the proper locale settings have been determined, create the <filename>/etc/profile</filename> file:
fr: Une fois que les bons paramètres de locale ont été déterminés, créez le fichier <filename>/etc/profile</filename>&nbsp;:

source: <userinput>cat &gt; /etc/profile &lt;&lt; "EOF" <literal># Begin /etc/profile export LANG=<replaceable>&lt;ll&gt;_&lt;CC&gt;.&lt;charmap&gt;&lt;@modifiers&gt;</replaceable> # End /etc/profile</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/profile &lt;&lt; "EOF" <literal># Début de /etc/profile export LANG=<replaceable>&lt;ll&gt;_&lt;CC&gt;.&lt;charmap&gt;&lt;@modifiers&gt;</replaceable> # Fin de /etc/profile</literal> EOF</userinput>

source: The <quote>C</quote> (default) and <quote>en_US</quote> (the recommended one for United States English users) locales are different. <quote>C</quote> uses the US-ASCII 7-bit character set, and treats bytes with the high bit set as invalid characters. That's why, e.g., the <command>ls</command> command substitutes them with question marks in that locale. Also, an attempt to send mail with such characters from Mutt or Pine results in non-RFC-conforming messages being sent (the charset in the outgoing mail is indicated as <quote>unknown 8-bit</quote>). So you can use the <quote>C</quote> locale only if you are sure that you will never need 8-bit characters.
fr: Les locales <quote>C</quote> (par défaut) et <quote>en_US</quote> (celle recommandée pour les utilisateurs de langue anglaise vivant aux États-Unis) sont différentes. <quote>C</quote> utilise le codage US-ASCII 7-bit et traite les octets utilisant le bit de poids le plus fort comme des caractères invalides. C'est pourquoi, par exemple, la commande <command>ls</command> les remplace par des points d'interrogation dans cette locale. De même, essayer d'envoyer un mail avec de tels caractères depuis Mutt ou Pine donne l'envoi de messages en version non compatible avec RFC (le codage du mail sortant est indiqué comme <quote>8-bit inconnu</quote>). Donc, vous ne pouvez utiliser la locale <quote>C</quote> que si vous êtes sûr de ne jamais avoir besoin de caractères 8-bit.

source: UTF-8 based locales are not supported well by some programs. Work is in progress to document and, if possible, fix such problems, see <ulink url="&blfs-book;introduction/locale-issues.html"/>.
fr: Les locales basées sur UTF-8 ne sont pas bien supportées par certains programmes. Le travail progresse pour documenter et, si possible, réparer de tels problèmes, voir <ulink url="&blfs-book;introduction/locale-issues.html"/>.
