Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/symlinks.po
Languages: fr

source: Managing Devices
fr: Gérer les périphériques

source: Network Devices
fr: Périphériques réseaux

source: Udev, by default, names network devices according to Firmware/BIOS data or physical characteristics like the bus, slot, or MAC address. The purpose of this naming convention is to ensure that network devices are named consistently and not based on the time the network card was discovered. For example, on a computer having two network cards made by Intel and Realtek, the network card manufactured by Intel may become eth0 and the Realtek card becomes eth1. In some cases, after a reboot the cards get renumbered the other way around.
fr: Udev, par défaut, nomme les périphériques réseaux à partir des données du Firmware/BIOS ou de leurs caractéristiques physiques comme leur bus, leur slot ou leur adresse MAC. Le but de cette convention de nommage est de vous assurer que les périphériques réseaux aient un nommage cohérent qui ne s'appuie pas sur le moment où la carte réseau a été trouvée. Par exemple, sur un ordinateur ayant deux cartes réseaux Intel et Realtek, il se peut que la carte réseau Intel s'appelle eth0 et celle Realtek eth1. Dans certains cas, au redémarrage, les cartes sont numérotées en sens inverse.

source: In the new naming scheme, typical network device names would then be something like enp5s0 or wlp3s0. If this naming convention is not desired, the traditional naming scheme or a custom scheme can be implemented.
fr: Avec la nouvelle règle de nommage, les noms des cartes réseaux ressembleraient en général à quelque chose comme enp5s0 ou wlp3s0. Si cette convention de nommage ne vous plaît pas, vous pouvez implémenter celle traditionnelle ou une autre personnalisée.

source: Disabling Persistent Naming on the Kernel Command Line
fr: Désactiver la conservation des noms en ligne de commandes du noyau

source: The traditional naming scheme using eth0, eth1, etc can be restored by adding <userinput>net.ifnames=0</userinput> on the kernel command line. This is most appropriate for those systems that have only one ethernet device of the same type. Laptops often have multiple ethernet connections that are named eth0 and wlan0 and are also candidates for this method. The command line is passed in the GRUB configuration file. See <xref linkend="grub-cfg"/>.
fr: La règle de nommage traditionnel qui utilise eth0, eth1, etc peut être rétablie en ajoutant <userinput>net.ifnames=0</userinput> à la ligne de commandes du noyau. C'est surtout adapté aux systèmes n'ayant qu'un périphérique ethernet du même type. Les portables ont souvent plusieurs ports ethernet appelés eth0 et wlan0 et ils sont éligibles à cette méthode. La ligne de commandes se passe dans le fichier de configuration de GRUB. Voir <xref linkend="grub-cfg"/>.

source: Creating Custom Udev Rules
fr: Créer des règles Udev personnalisées

source: The naming scheme can be customized by creating custom Udev rules. A script has been included that generates the initial rules. Generate these rules by running:
fr: Vous pouvez personnaliser les règles de nommage en créant des règles Udev personnalisées. Un script est inclu pour générer les règles initiales. Générez ces règles en lançant&nbsp;:

source: Now, inspect the <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> file, to find out which name was assigned to which network device:
fr: Maintenant, lisez le fichier <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> pour trouver le nom affecté à une carte réseau&nbsp;:

source: In some cases such as when MAC addresess have been assigned to a network card manually or in a virtual environment such as Qemu or Xen, the network rules file may not have been generated because addresses are not consistently assigned. In these cases, this method cannot be used.
fr: Dans certains cas, comme quand une adresse MAC est affectée manuellement à une carte réseau, ou dans un environnement virtuel tel que Qemu ou Xen, il se peut que le fichier des règles du réseau n'ait pas été généré car les adresses ne sont pas affectées de façon cohérente. Dans ce cas, vous ne pouvez pas utiliser cette méthode.

source: The file begins with a comment block followed by two lines for each NIC. The first line for each NIC is a commented description showing its hardware IDs (e.g. its PCI vendor and device IDs, if it's a PCI card), along with its driver in parentheses, if the driver can be found. Neither the hardware ID nor the driver is used to determine which name to give an interface; this information is only for reference. The second line is the Udev rule that matches this NIC and actually assigns it a name.
fr: Le fichier commence par un bloc en commentaire suivi de deux lignes pour chaque NIC. La première ligne d'un NIC est une description commentée indiquant ses IDs matériels (comme ses IDs PCi de fabricant et de vendeur si la carte est PCI), avec le pilote entre parenthèses, si on peut trouver le pilote. Ni l'ID matériel ni le pilote ne sont utilisés pour déterminer le nom à donner à une interface&nbsp;; ces informations ne sont là que pour information. La deuxième ligne est la règle Udev correspondant à cette NIC et qui affecte un nom.

source: All Udev rules are made up of several keys, separated by commas and optional whitespace. This rule's keys and an explanation of each of them are as follows:
fr: Toutes les règles Udev se composent de clés séparées par des virgules et éventuellement des espaces. Les clés de cette règle et l'explication de chacune sont ainsi&nbsp;:

source: <literal>SUBSYSTEM=="net"</literal> - This tells Udev to ignore devices that are not network cards.
fr: <literal>SUBSYSTEM=="net"</literal> - Ceci dit à Udev d'ignorer les périphériques n'étant par des cartes réseaux.

source: <literal>ACTION=="add"</literal> - This tells Udev to ignore this rule for a uevent that isn't an add ("remove" and "change" uevents also happen, but don't need to rename network interfaces).
fr: <literal>ACTION=="add"</literal> - Ceci dit à Udev d'ignorer la règle pour un uevent autre que l'ajout (les ue1rdns "remove" et "change" se produisent aussi mais il n'est pas utile de renommer les interfaces réseaux).

source: <literal>DRIVERS=="?*"</literal> - This exists so that Udev will ignore VLAN or bridge sub-interfaces (because these sub-interfaces do not have drivers). These sub-interfaces are skipped because the name that would be assigned would collide with their parent devices.
fr: <literal>DRIVERS=="?*"</literal> - Ceci existe pour que Udev ignore les sous-interfaces VLAN ou les ponts (ces interfaces n'ayant pas de pilote). Ces sous-interfaces sont passées car le nom qui leur serait affecté entrerait en conflit avec leurs périphériques parents.

source: <literal>ATTR{address}</literal> - The value of this key is the NIC's MAC address.
fr: <literal>ATTR{address}</literal> - La valeur de cette clé est l'adresse MAC de la NIC.

source: <literal>ATTR{type}=="1"</literal> - This ensures the rule only matches the primary interface in the case of certain wireless drivers, which create multiple virtual interfaces. The secondary interfaces are skipped for the same reason that VLAN and bridge sub-interfaces are skipped: there would be a name collision otherwise.
fr: <literal>ATTR{type}=="1"</literal> - Ceci garantit que la règle ne corresponde qu'à l'interface primaire au cas où certains pilotes sans fil créent plusieurs interfaces virtuelles. Les interfaces secondaires sont passées pour la même raison qu'on évite les sous-interfaces VLAN et des ponts&nbsp;: il y aurait conflit de noms.

source: <literal>NAME</literal> - The value of this key is the name that Udev will assign to this interface.
fr: <literal>NAME</literal> - La valeur de cette clé est le nom donné par Udev à cette interface.

source: The value of <literal>NAME</literal> is the important part. Make sure you know which name has been assigned to each of your network cards before proceeding, and be sure to use that <literal>NAME</literal> value when creating your configuration files below.
fr: La valeur de <literal>NAME</literal> est ce qui compte. Assurez-vous de connaître le nom affecté à chacune de vos cartes réseaux avant de continuer et d'utiliser cette valeur <literal>NAME</literal> quand vous créez vos fichiers de configuration ci-dessous.

source: CD-ROM symlinks
fr: Liens symboliques pour le CD-ROM

source: Some software that you may want to install later (e.g., various media players) expect the <filename class="symlink">/dev/cdrom</filename> and <filename class="symlink">/dev/dvd</filename> symlinks to exist, and to point to a CD-ROM or DVD-ROM device. Also, it may be convenient to put references to those symlinks into <filename>/etc/fstab</filename>. Udev comes with a script that will generate rules files to create these symlinks for you, depending on the capabilities of each device, but you need to decide which of two modes of operation you wish to have the script use.
fr: Certains logiciels que vous pourriez vouloir installer plus tard (comme divers lecteurs multimédias) s'attendent à ce que les liens symboliques <filename class="symlink">/dev/cdrom</filename> et <filename class="symlink">/dev/dvd</filename> existent et pointent vers le lecteur CD-ROM ou DVD-ROM. De plus, il peut être pratique de mettre des références à ces liens symboliques dans <filename>/etc/fstab</filename>. Udev est fourni avec un script qui génèrera des fichiers de règles pour créer ces liens symboliques pour vous, selon les possibilités de chaque périphérique, mais vous devez décider lequel des deux modes opératoires vous souhaitez que le script utilise.

source: First, the script can operate in <quote>by-path</quote> mode (used by default for USB and FireWire devices), where the rules it creates depend on the physical path to the CD or DVD device. Second, it can operate in <quote>by-id</quote> mode (default for IDE and SCSI devices), where the rules it creates depend on identification strings stored in the CD or DVD device itself. The path is determined by Udev's <command>path_id</command> script, and the identification strings are read from the hardware by its <command>ata_id</command> or <command>scsi_id</command> programs, depending on which type of device you have.
fr: Tout d'abord, le script peut opérer en mode <quote>chemin</quote> (utilisé par défaut pour les périphériques USB et FireWire), où les règles qu'il crée dépendent du chemin physique vers le lecteur CD ou DVD. Ensuite, il peut opérer en mode <quote>id</quote> (par défaut pour les périphériques IDE et SCSI), où les règles qu'il crée dépendent des chaînes d'identification contenues dans le lecteur CD ou DVD lui-même. Le chemin est déterminé par le script <command>path_id</command> d'Udev, et les chaînes d'identification sont lues à partir du matériel par ses programmes <command>ata_id</command> ou <command>scsi_id</command>, selon le type de périphérique que vous avez.

source: There are advantages to each approach; the correct approach to use will depend on what kinds of device changes may happen. If you expect the physical path to the device (that is, the ports and/or slots that it plugs into) to change, for example because you plan on moving the drive to a different IDE port or a different USB connector, then you should use the <quote>by-id</quote> mode. On the other hand, if you expect the device's identification to change, for example because it may die, and you would replace it with a different device with the same capabilities and which is plugged into the same connectors, then you should use the <quote>by-path</quote> mode.
fr: Il y a des avantages dans chaque approche&nbsp;; la bonne approche à utiliser dépendra des types de changements de périphérique qui peuvent se produire. Si vous vous attendez à ce que le chemin physique vers le périphérique (c'est-à-dire, les ports ou les fentes par lesquels ils sont branchés) changent, par exemple parce que vous envisagez de déplacer le lecteur sur un port IDE différent ou un connecteur USB différent, alors vous devriez utiliser le mode <quote>id</quote>. D'un autre côté, si vous vous attendez à ce que l'identification du périphérique change, par exemple parce qu'il peut mourir et que vous le remplaceriez par un périphérique différent avec les mêmes possibilités et qui serait monté sur les mêmes connecteurs, vous devriez utiliser le mode <quote>chemin</quote>.

source: If either type of change is possible with your drive, then choose a mode based on the type of change you expect to happen more often.
fr: Si les deux types de changement sont possibles avec votre lecteur, choisissez un mode basé sur le type de changement que vous pensez rencontrer le plus fréquemment.

source: External devices (for example, a USB-connected CD drive) should not use by-path persistence, because each time the device is plugged into a new external port, its physical path will change. All externally-connected devices will have this problem if you write Udev rules to recognize them by their physical path; the problem is not limited to CD and DVD drives.
fr: Les périphériques externes (par exemple un lecteur CD connecté en USB) ne devraient pas utiliser la méthode des chemins, car chaque fois que le périphérique est monté sur un nouveau port, son chemin physique changera. Tous les périphériques connectés en externe auront ce problème si vous écrivez des règles Udev pour les reconnaître par leur chemin physique&nbsp;; le problème ne concerne pas que les lecteurs CD et DVD.

source: If you wish to see the values that the Udev scripts will use, then for the appropriate CD-ROM device, find the corresponding directory under <filename class="directory">/sys</filename> (e.g., this can be <filename class="directory">/sys/block/hdd</filename>) and run a command similar to the following:
fr: Si vous souhaitez voir les valeurs que les scripts Udev utiliseront, et celles appropriées au périphérique CD-ROM, trouvez le répertoire correspondant sous <filename class="directory">/sys</filename> (cela peut être par exemple <filename class="directory">/sys/block/hdd</filename>) et lancez une commande ressemblant à ce qui suit&nbsp;:

source: Look at the lines containing the output of various *_id programs. The <quote>by-id</quote> mode will use the ID_SERIAL value if it exists and is not empty, otherwise it will use a combination of ID_MODEL and ID_REVISION. The <quote>by-path</quote> mode will use the ID_PATH value.
fr: Regardez les lignes contenant la sortie des divers programmes *_id. Le mode <quote>id</quote> utilisera la valeur ID_SERIAL si elle existe et n'est pas vide, sinon il utilisera une combinaison d'ID_MODEL et d'ID_REVISION. Le mode <quote>chemin</quote> utilisera la valeur d'ID_PATH.

source: If the default mode is not suitable for your situation, then the following modification can be made to the <filename>/etc/udev/rules.d/83-cdrom-symlinks.rules</filename> file, as follows (where <replaceable>mode</replaceable> is one of <quote>by-id</quote> or <quote>by-path</quote>):
fr: Si le mode par défaut ne convient pas à votre situation, vous pouvez faire la modification suivante du fichier <filename>/etc/udev/rules.d/83-cdrom-symlinks.rules</filename>, comme suit, (où <replaceable>mode</replaceable> est soit <quote>by-id</quote> soit <quote>by-path</quote>)&nbsp;:

source: Note that it is not necessary to create the rules files or symlinks at this time, because you have bind-mounted the host's <filename class="directory">/dev</filename> directory into the LFS system, and we assume the symlinks exist on the host. The rules and symlinks will be created the first time you boot your LFS system.
fr: Remarquez qu'il n'est pas nécessaire de créer les fichiers de règle ou les liens symboliques à ce moment puisque vous avez monté en bind le répertoire <filename class="directory">/dev</filename> du système hôte dans le système LFS, et nous supposons que les liens symboliques existent sur l'hôte. Les règles et les liens symboliques seront créés la première fois que vous démarrerez votre système LFS.

source: However, if you have multiple CD-ROM devices, then the symlinks generated at that time may point to different devices than they point to on your host, because devices are not discovered in a predictable order. The assignments created when you first boot the LFS system will be stable, so this is only an issue if you need the symlinks on both systems to point to the same device. If you need that, then inspect (and possibly edit) the generated <filename>/etc/udev/rules.d/70-persistent-cd.rules</filename> file after booting, to make sure the assigned symlinks match what you need.
fr: Cependant, si vous avez plusieurs lecteurs CD-ROM, les liens symboliques générés à ce moment peuvent pointer vers des périphériques différents de ceux vers lesquels ils pointent sur votre hôte, car les périphériques ne sont pas découverts dans un ordre prévisible. Les affectations créées quand vous démarrerez pour la première fois le système LFS seront stables, donc cela n'est un problème que si vous avez besoin que les liens symboliques sur les deux systèmes pointent vers le même périphérique. Si tel est le cas, inspectez (et éditez peut-être) le fichier <filename>/etc/udev/rules.d/70-persistent-cd.rules</filename> généré après le démarrage pour vous assurer que les liens symboliques affectés correspondent à ce dont vous avez besoin.

source: Dealing with duplicate devices
fr: Gestion des périphériques dupliqués

source: As explained in <xref linkend="ch-scripts-udev"/>, the order in which devices with the same function appear in <filename class="directory">/dev</filename> is essentially random. E.g., if you have a USB web camera and a TV tuner, sometimes <filename>/dev/video0</filename> refers to the camera and <filename>/dev/video1</filename> refers to the tuner, and sometimes after a reboot the order changes to the opposite one. For all classes of hardware except sound cards and network cards, this is fixable by creating Udev rules for custom persistent symlinks. The case of network cards is covered separately in <xref linkend="ch-scripts-network"/>, and sound card configuration can be found in <ulink url="&blfs-book;postlfs/devices.html">BLFS</ulink>.
fr: Comme expliqué à la <xref linkend="ch-scripts-udev"/>, l'ordre dans lequel les périphériques ayant la même fonction apparaissent dans <filename class="directory">/dev</filename> est essentiellement aléatoire. Par exemple si vous avez une webcam USB et un tunner TV, parfois <filename>/dev/video0</filename> renvoie à la webcam, et <filename>/dev/video1</filename> renvoie au tuner, et parfois après un redémarrage l'ordre s'inverse. Pour toutes les classes de matériel sauf les cartes son et les cartes réseau, ceci peut se corriger en créant des règles Udev pour des liens symboliques constants personnalisés. Le cas des cartes réseau est couvert de façon séparée dans <xref linkend="ch-scripts-network"/>, et vous pouvez trouver la configuration des cartes son dans <ulink url="&blfs-book;postlfs/devices.html">BLFS</ulink>.

source: For each of your devices that is likely to have this problem (even if the problem doesn't exist in your current Linux distribution), find the corresponding directory under <filename class="directory">/sys/class</filename> or <filename class="directory">/sys/block</filename>. For video devices, this may be <filename class="directory">/sys/class/video4linux/video<replaceable>X</replaceable></filename>. Figure out the attributes that identify the device uniquely (usually, vendor and product IDs and/or serial numbers work):
fr: Pour chacun des périphériques susceptibles d'avoir ce problème (même si le problème n'apparaît pas dans votre distribution Linux actuelle), trouvez le répertoire correspondant sous <filename class="directory">/sys/class</filename> ou <filename class="directory">/sys/block</filename>. Pour les périphériques vidéo, cela peut être <filename class="directory">/sys/class/video4linux/video<replaceable>X</replaceable></filename>. Calculez les attributs qui identifient de façon unique un périphérique (normalement basé sur l'ID du fabricant et du produit ou les numéros de série)&nbsp;:

source: Then write rules that create the symlinks, e.g.:
fr: Puis, écrivez des règles qui créent les liens symboliques, comme&nbsp;:

source: <userinput>cat &gt; /etc/udev/rules.d/83-duplicate_devs.rules &lt;&lt; "EOF" <literal> # Persistent symlinks for webcam and tuner KERNEL=="video*", ATTRS{idProduct}=="1910", ATTRS{idVendor}=="0d81", \ SYMLINK+="webcam" KERNEL=="video*", ATTRS{device}=="0x036f", ATTRS{vendor}=="0x109e", \ SYMLINK+="tvtuner" </literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/udev/rules.d/83-duplicate_devs.rules &lt;&lt; "EOF" <literal> # Liens symboliques permanent vers la webcam et le tuner KERNEL=="video*", ATTRS{idProduct}=="1910", ATTRS{idVendor}=="0d81", \ SYMLINK+="webcam" KERNEL=="video*", ATTRS{device}=="0x036f", ATTRS{vendor}=="0x109e", \ SYMLINK+="tvtuner" </literal> EOF</userinput>

source: The result is that <filename>/dev/video0</filename> and <filename>/dev/video1</filename> devices still refer randomly to the tuner and the web camera (and thus should never be used directly), but there are symlinks <filename>/dev/tvtuner</filename> and <filename>/dev/webcam</filename> that always point to the correct device.
fr: Il en résulte que les périphériques <filename>/dev/video0</filename> et <filename>/dev/video1</filename> renvoient encore de manière aléatoire au tuner et à la webcam (et donc ne devrait jamais être utilisé directement), mais il y a des liens symboliques <filename>/dev/tvtuner</filename> et <filename>/dev/webcam</filename> qui pointent toujours vers le bon périphérique.
