Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/systemd-custom.po
Languages: fr

source: Systemd Usage and Configuration
fr: Utilisation et configuration de Systemd

source: Systemd Customization
fr: Personnalisation de Systemd

source: Basic Configuration
fr: Configuration basique

source: The <filename>/etc/systemd/system.conf</filename> file contains a set of options to control basic systemd operations. The default file has all entries commented out with the default settings indicated. This file is where the log level may be changed as well as some basic logging settings. See the <filename>systemd-system.conf(5)</filename> manual page for details on each configuration option.
fr: Le fichier <filename>/etc/systemd/system.conf</filename> contient un ensemble d'options pour contrôler les opérations de base de systemd. Le fichier par défaut a toutes ses entrées commentées indiquant les paramètres par défaut. Ce fichier est l'endroit où le niveau de journalisation (log) peut être modifié ainsi que les paramètres de base de journalisation. Voir la page de manuel de <filename>systemd-system.conf(5)</filename> pour plus de détails à propos de chaque option de configuration.

source: Disabling Screen Clearing at Boot Time
fr: Désactiver l'effacement de l'écran durant le démarrage

source: The normal behavior for systemd is to clear the screen at the end of the boot sequence. If desired, this behavior may be changed by running the following command:
fr: Le comportement normal de systemd est d'effacer l'écran à la fin de la séquence de démarrage. Si désiré, ce comportement peut être changé en exécutant la commande suivante&nbsp;:

source: The boot messages can always be reviewed by using the <userinput>journalctl -b</userinput> command as the root user.
fr: Les messages de démarrage peuvent toujours être examinés en utilisant la commande <userinput>journalctl -b</userinput> en tant qu'utilisateur root.

source: Disabling tmpfs for /tmp
fr: Désactiver tmpfs pour /tmp

source: By default, <filename class="directory">/tmp</filename> is created as a tmpfs. If this is not desired, it can be overridden by the following:
fr: Par défaut, <filename class="directory">/tmp</filename> est créé comme un tmpfs. Si cela n'est pas désiré, il est possible de l'en empêcher de la manière suivante&nbsp;:

source: Alternatively, if a a separate partition for <filename class="directory">/tmp</filename> is desired, specify that partition in an <filename>/etc/fstab</filename> entry.
fr: Autrement, si vous souhaitez avoir une partition séparée pour <filename class="directory">/tmp</filename>, spécifiez-la dans une entrée de <filename>/etc/fstab</filename>.

source: Do not create the symbolic link above if a separate partition is used for <filename class="directory">/tmp</filename>. This will prevent the root file system (/) from being remounted r/w and make the system unusable when booted.
fr: Ne créez pas le lien symbolique ci-dessus si vous utilisez une partition séparée pour <filename class="directory">/tmp</filename>. Cela empêche la partition racine (/) d'être remontée en lecture-écriture et rend le système inutilisable au démarrage.

source: Configuring Automatic File Creation and Deletion
fr: Configurer la création et la suppression automatique de fichiers

source: There are several services that create or delete files or directories:
fr: Il existe de nombreux services pour créer ou supprimer des fichiers ou des dossiers&nbsp;:

source: The system location for the configuration files is <filename>/usr/lib/tmpfiles.d/*.conf</filename>. The local configuration files are in <filename class="directory">/etc/tmpfiles.d</filename>. Files in <filename class="directory">/etc/tmpfiles.d</filename> override files with the same name in <filename class="directory">/usr/lib/tmpfiles.d</filename>. See <filename>tmpfiles.d(5)</filename> manual page for file format details.
fr: L'emplacement système des fichiers de configuration est <filename>/usr/lib/tmpfiles.d/*.conf</filename>. Les fichiers locaux de configuration sont dans <filename class="directory">/etc/tmpfiles.d</filename>. Les fichiers dans <filename class="directory">/etc/tmpfiles.d</filename> prévallent sur les fichiers du même nom dans <filename class="directory">/usr/lib/tmpfiles.d</filename>. Voir la page de manuel <filename>tmpfiles.d(5)</filename> pour plus de détails sur le format de fichier.

source: Note that the syntax for the <filename>/usr/lib/tmpfiles.d/*.conf</filename> files can be confusing. For example, the default deletion of files in the /tmp directory is located in <filename>/usr/lib/tmpfiles.d/tmp.conf</filename> with the line: <placeholder type="screen" id="0"/> The type field, q, discusses creating a subvolume with quotas which is really only applicable to btrfs filesystems. It references type v which in turn references type d (directory). This then creates the specified directory if is is not present and adjusts the permissions and ownership as specified. Contents of the directory will be subject to time based cleanup if the age argument is specified.
fr: Remarquez que la syntaxe pour les fichiers <filename>/usr/lib/tmpfiles.d/*.conf</filename> peut être déroutante. Par exemple, la suppression de fichiers par défaut dans le répertoire /tmp se trouve dans <filename>/usr/lib/tmpfiles.d/tmp.conf</filename> à cette ligne&nbsp;: <placeholder type="screen" id="0"/>. Le champ type, q, parle de créer un sous-volume avec des quotas, ce qui n'est vraiment possible que pour les système de fichiers btrfs. Il référence le type v qui lui-même référence le type d (répertoire). Cela crée ensuite le répertoire spécifié s'il n'est pas présent et ajuste ensuite les permissions et la propriété comme indiqué. Le contenu du répertoire sera sujet au nettoyage basé sur l'âge si l'argument d'âge est spécifié.

source: If the default parameters are not desired, then the file should be copied to <filename class="directory">/etc/tmpfiles.d</filename> and edited as desired. For example: <placeholder type="screen" id="0"/>
fr: Si les paramètres par défaut ne sont pas désirés, alors vous devrez copier le fichier vers <filename class="directory">/etc/tmpfiles.d</filename> et le modifier comme vous le voulez. Par exemple&nbsp;: <placeholder type="screen" id="0"/>

source: Overriding Default Services Behavior
fr: Redéfinition des comportements par défaut des services

source: The parameter of a unit can be overriden by creating a directory and a configuration file in <filename class="directory">/etc/systemd/system</filename>. For example:
fr: Les paramètres d’une unité peuvent être redéfinis en créant un dossier et un fichier de configuration dans <filename class="directory">/etc/systemd/system</filename>. Par exemple&nbsp;:

source: See <filename>systemd.unit(5)</filename> manual page for more information. After creating the configuration file, run <userinput>systemctl daemon-reload</userinput> and <userinput>systemctl restart foobar</userinput> to activate the changes to a service.
fr: Voir la page de manuel <filename>systemd.unit(5)</filename> pour plus d'informations. Après la création du fichier de configuration, exécutez <userinput>systemctl daemon-reload</userinput> et <userinput>systemctl restart foobar</userinput> pour activer les changements à un service.

source: Debugging the Boot Sequence
fr: Débogage de la séquence de démarrage

source: Rather than plain shell scripts used in SysVinit or BSD style init systems, systemd uses a unified format for different types of startup files (or units). The command <command>systemctl</command> is used to enable, disable, control state, and obtain status of unit files. Here are some examples of frequently used commands:
fr: Plutôt que des scripts shell utilisés par les systèmes d’init du style de SysVinit ou BSD, systemd utilise un format unifié pour différents types de fichiers de démarrage (ou unités). La commande <command>systemctl</command> est utilisée pour activer, désactiver, contrôler l’état et obtenir le statut d’un fichier d’unité. Voici quelques exemples de commandes fréquentes&nbsp;:

source: <command>systemctl list-units -t <replaceable>&lt;service&gt;</replaceable> [--all]</command>: lists loaded unit files of type service.
fr: <command>systemctl list-units -t <replaceable>&lt;service&gt;</replaceable> [--all]</command>: liste les fichiers d’unité chargés de type service.

source: <command>systemctl list-units -t <replaceable>&lt;target&gt;</replaceable> [--all]</command>: lists loaded unit files of type target.
fr: <command>systemctl list-units -t <replaceable>&lt;target&gt;</replaceable> [--all]</command>: liste les fichiers d’unité chargés de type target.

source: <command>systemctl show -p Wants <replaceable>&lt;multi-user.target&gt;</replaceable></command>: shows all units that depend on the multi-user target. Targets are special unit files that are anogalous to runlevels under SysVinit.
fr: <command>systemctl show -p Wants <replaceable>&lt;multi-user.target&gt;</replaceable></command>&nbsp;: montre toutes les unités qui dépendent de la cible multi-user. Les cibles sont des fichiers d’unité spéciaux qui sont analogues aux niveaux d’exécution de SysVinit.

source: <command>systemctl status <replaceable>&lt;servicename.service&gt;</replaceable></command>: shows the status of the servicename service. The .service extension can be omitted if there are no other unit files with the same name, such as .socket files (which create a listening socket that provides similar functionality to inetd/xinetd).
fr: <command>systemctl status <replaceable>&lt;servicename.service&gt;</replaceable></command>: montre le statut du service servicename. L’extension .service peut être omise s’il n’y a pas d’autres fichiers d’unité portant le même nom, comme des fichiers .socket (qui créent un socket en écoute qui fourni les même fonctionnalités qu'inetd/xinetd).

source: Working with the Systemd Journal
fr: Utiliser le journal Systemd

source: Logging on a system booted with systemd is handled with systemd-journald (by default), rather than a typical unix syslog daemon. You can also add a normal syslog daemon and have both work side by side if desired. The systemd-journald program stores journal entries in a binary format rather than a plain text log file. To assist with parsing the file, the command <command>journalctl</command> is provided. Here are some examples of frequently used commands:
fr: La journalisation d’un système démarré avec systemd est géré par systemd-journald (par défaut), plutôt qu’un démon syslog unix typique. Vous pouvez aussi ajouter un démon syslog normal et faire travailler les deux côte à côte si vous le souhaitez. Le programme systemd-journald stocke les entrées du journal dans un format binaire plutôt que dans un fichier en text brut. La commande <command>journalctl</command> est fournie pour aider à analyser le fichier. Voici quelques exemples de commandes usuelles&nbsp;:

source: <command>journalctl -r</command>: shows all contents of the journal in reverse chronological order.
fr: <command>journalctl -r</command>&nbsp;: montre tout le contenu du journal en sens chronologique inverse.

source: <command>journalctl -u <replaceable>UNIT</replaceable></command>: shows the journal entries associated with the specified UNIT file.
fr: <command>journalctl -u <replaceable>UNIT</replaceable></command>&nbsp;: montre les entrées du journal associées avec le fichier UNIT spécifié.

source: <command>journalctl -b[=ID] -r</command>: shows the journal entries since last successful boot (or for boot ID) in reverse chronological order.
fr: <command>journalctl -b[=ID] -r</command>&nbsp;: montre les entrées du journal depuis le dernier démarrage réussi (ou pour le démarrage d’identifiant ID) en sens chronologique inverse.

source: <command>journalctl -f</command>: povides functionality similar to tail -f (follow).
fr: <command>journalctl -f</command>&nbsp;: fournit une fonctionnalité similaire à tail -f (suivre).

source: Long Running Processes
fr: Processus lancés durablement

source: Beginning with systemd-230, all user processes are killed when a user session is ended, even if nohup is used, or the process uses the <function>daemon()</function> or <function>setsid()</function> functions. This is a deliberate change from a historically permissive environment to a more restrictive one. The new behavior may cause issues if you depend on long running programs (e.g., <command>screen</command> or <command>tmux</command>) to remain active after ending your user session. There are three ways to enable lingering processes to remain after a user session is ended.
fr: Depuis la version systemd-230, tous les processus utilisateurs sont tués lorsque la session utilisateur se termine, même en utilisant nohup, ou que le processus utilise les fonctions <function>daemon()</function> ou <function>setsid()</function>. Ceci est un changement délibéré par rapport à un environnement historiquement plus permissif vers un environnement plus restrictif. Le nouveau comportement peut causer des problèmes si vous dépendez de programmes lancés durablement (par exemple, <command>screen</command> ou <command>tmux</command>) qui restent actifs après la fin de votre session utilisateur. Il y a trois moyens de permettre la persistance des processus après la fin d'une session utilisateur.

source: <emphasis>Enable process lingering for only selected users</emphasis>: Normal users have permission to enable process lingering with the command <command>loginctl enable-linger</command> for their own user. System administrators can use the same command with a <parameter>user</parameter> argument to enable for a user. That user can then use the <command>systemd-run</command> command to start long running processes. For example: <command>systemd-run --scope --user /usr/bin/screen</command>. If you enable lingering for your user, the user@.service will remain even after all login sessions are closed, and will automatically start at system boot. This has the advantage of explicitly allowing and disallowing processes to run after the user session has ended, but breaks backwards compatibility with tools like <command>nohup</command> and utilities that use <function>deamon()</function>.
fr: <emphasis>N'activez les processus persistants que pour les utilisateurs qui en ont besoin</emphasis>&nbsp;: les utilisateurs ont la possibilité d'activer les processus persistants avec la commande <command>loginctl enable-linger</command> pour eux-mêmes. Les administrateurs systèmes peuvent utiliser la même commande avec un argument <parameter>utilisateur</parameter> pour les activer pour un utilisateur. Cet utilisateur peut alors utiliser la commande <command>systemd-run</command> pour débuter une tâche durable. Par exemple&nbsp;: <command>systemd-run --scope --user /usr/bin/screen</command>. Si vous souhaitez activer les tâches durables pour votre utilisateur, le service user@.service sera toujours présent même après la fermeture de toutes les sessions, et démarrera automatiquement au démarrage du système. Ceci a l'avantage d'autoriser et d'interdire explicitement aux programmes de s'exécuter après que la session utilisateur est fermée, mais cela casse la rétro-compatibilité avec des outils comme <command>nohup</command> et les utilitaires qui utilisent <function>daemon()</function>.

source: <emphasis>Enable system-wide process lingering</emphasis>: You can set <parameter>KillUserProcesses=no</parameter> in <filename>/etc/systemd/logind.conf</filename> to enable process lingering globally for all users. This has the benefit of leaving the old method available to all users at the expense of explicit control.
fr: <emphasis>Activer les processus persistant sur tout le système</emphasis>&nbsp;: vous pouvez définir <parameter>KillUserProcesses=no</parameter> dans <filename>/etc/systemd/logind.conf</filename> pour autoriser globalement la persistance pour tous les utilisateurs. Ceci a l'avantage de laisser disponibles les vieilles méthodes à tous les utilisateurs au prix de la perte de contrôle explicite.

source: <emphasis>Disable at build-time</emphasis>: You can enable lingering by default while building systemd by adding the switch <parameter>-Ddefault-kill-user-processes=false</parameter> to the <command>meson</command> command for systemd. This completely disables the ability of systemd to kill user processes at session end.
fr: <emphasis>Désactiver à la construction</emphasis>&nbsp;: vous pouvez autoriser les processus persistants par défaut pendant la construction de systemd en ajoutant le paramètre <parameter>-Ddefault-kill-user-processes=false</parameter> à la commande <command>meson</command> de systemd. Ceci désactive complètement la capacité que systemd a de tuer les processus utilisateurs à la fin de la session.
