Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/udev.po
Languages: fr

source: Overview of Device and Module Handling
fr: Manipulation des périphériques et modules

source: usage
fr: utilisation

source: In <xref linkend="chapter-building-system"/>, we installed the Udev package when <phrase revision="sysv">eudev</phrase> <phrase revision="systemd">systemd</phrase> was built. Before we go into the details regarding how this works, a brief history of previous methods of handling devices is in order.
fr: Au <xref linkend="chapter-building-system"/>, nous avons installé le paquet Udev à partir du paquet source de <phrase revision="sysv">eudev</phrase> <phrase revision="systemd">systemd</phrase>. Avant d'entrer dans les détails concernant son fonctionnement, un bref historique des méthodes précédentes de gestion des périphériques est nécessaire.

source: Linux systems in general traditionally used a static device creation method, whereby a great many device nodes were created under <filename class="directory">/dev</filename> (sometimes literally thousands of nodes), regardless of whether the corresponding hardware devices actually existed. This was typically done via a <command>MAKEDEV</command> script, which contains a number of calls to the <command>mknod</command> program with the relevant major and minor device numbers for every possible device that might exist in the world.
fr: Traditionnellement, les systèmes Linux utilisaient une méthode de création de périphériques statiques avec laquelle un grand nombre de nœuds de périphériques étaient créés sous <filename class="directory">/dev</filename> (quelques fois littéralement des milliers de nœuds), que le matériel correspondant existait ou non. Ceci était fait le plus souvent avec un script <command>MAKEDEV</command>, qui contient des appels au programme <command>mknod</command> avec les numéros de périphériques majeurs et mineurs pour chaque périphérique possible qui pourrait exister dans le monde.

source: Using the Udev method, only those devices which are detected by the kernel get device nodes created for them. Because these device nodes will be created each time the system boots, they will be stored on a <systemitem class="filesystem">devtmpfs</systemitem> file system (a virtual file system that resides entirely in system memory). Device nodes do not require much space, so the memory that is used is negligible.
fr: En utilisant la méthode udev, seuls les n&oelig;uds pour le périphérique détectés par le noyau sont créés. Comme ces n&oelig;uds de périphériques seront créés à chaque lancement du système, ils seront stockés dans un système de fichiers <systemitem class="filesystem">devtmpfs</systemitem> (un système de fichiers virtuel qui réside entièrement dans la mémoire du système). Les n&oelig;uds de périphériques ne requièrent pas beaucoup d'espace, donc la mémoire utilisée est négligeable.

source: History
fr: Historique

source: In February 2000, a new filesystem called <systemitem class="filesystem">devfs</systemitem> was merged into the 2.3.46 kernel and was made available during the 2.4 series of stable kernels. Although it was present in the kernel source itself, this method of creating devices dynamically never received overwhelming support from the core kernel developers.
fr: En février 2000, un nouveau système de fichiers appelé <systemitem class="filesystem">devfs</systemitem> a été intégré au noyau 2.3.46 et rendu disponible pour la série 2.4 des noyaux stables. Bien qu'il soit présent dans les sources du noyau, cette méthode de création dynamique des périphériques n'a jamais reçu un support inconditionnel des développeurs du noyau.

source: The main problem with the approach adopted by <systemitem class="filesystem">devfs</systemitem> was the way it handled device detection, creation, and naming. The latter issue, that of device node naming, was perhaps the most critical. It is generally accepted that if device names are allowed to be configurable, then the device naming policy should be up to a system administrator, not imposed on them by any particular developer(s). The <systemitem class="filesystem">devfs</systemitem> file system also suffered from race conditions that were inherent in its design and could not be fixed without a substantial revision to the kernel. It was marked as deprecated for a long period &ndash; due to a lack of maintenance &ndash; and was finally removed from the kernel in June, 2006.
fr: Le principal problème de l'approche adopté par <systemitem class="filesystem">devfs</systemitem> était la façon dont il gérait la détection, la création et le nommage des périphériques. Ce dernier problème, le nommage des périphériques, était peut-être le plus critique. Il est généralement accepté que s'il est possible de configurer les noms des périphériques, alors la politique de nommage des périphériques revient à l'administrateur du système, et non imposée par quelque développeur. Le système de fichiers <systemitem class="filesystem">devfs</systemitem> souffrait aussi de restrictions particulières inhérentes à sa conception et qui ne pouvaient être corrigées sans une revue importante du noyau. Il a aussi été marqué comme obsolète pendant une longue période &mdash;&nbsp;à cause d'un manque de maintenance&nbsp;&mdash; et a finalement été supprimé du noyau en juin 2006.

source: With the development of the unstable 2.5 kernel tree, later released as the 2.6 series of stable kernels, a new virtual filesystem called <systemitem class="filesystem">sysfs</systemitem> came to be. The job of <systemitem class="filesystem">sysfs</systemitem> is to export a view of the system's hardware configuration to userspace processes. With this userspace-visible representation, the possibility of developing a userspace replacement for <systemitem class="filesystem">devfs</systemitem> became much more realistic.
fr: Avec le développement de la branche instable 2.5 du noyau, sortie ensuite avec la série 2.6 des noyaux stables, un nouveau système de fichiers virtuel appelé <systemitem class="filesystem">sysfs</systemitem> est arrivé. Le rôle de <systemitem class="filesystem">sysfs</systemitem> est d'exporter une vue de la configuration matérielle du système pour les processus en espace utilisateur. Avec cette représentation visible en espace utilisateur, la possibilité de développer un remplacement en espace utilisateur de <systemitem class="filesystem">devfs</systemitem> est devenu beaucoup plus réaliste.

source: Udev Implementation
fr: Implémentation d'Udev

source: The <systemitem class="filesystem">sysfs</systemitem> filesystem was mentioned briefly above. One may wonder how <systemitem class="filesystem">sysfs</systemitem> knows about the devices present on a system and what device numbers should be used for them. Drivers that have been compiled into the kernel directly register their objects with a <systemitem class="filesystem">sysfs</systemitem> (devtmpfs internally) as they are detected by the kernel. For drivers compiled as modules, this registration will happen when the module is loaded. Once the <systemitem class="filesystem">sysfs</systemitem> filesystem is mounted (on /sys), data which the drivers register with <systemitem class="filesystem">sysfs</systemitem> are available to userspace processes and to udevd for processing (including modifications to device nodes).
fr: Le système de fichier <systemitem class="filesystem">sysfs</systemitem> a été brièvement mentionné ci-dessus. On pourrait se demander comment <systemitem class="filesystem">sysfs</systemitem> connaît les périphériques présents sur un système et quels numéros de périphériques devraient être utilisés. Les pilotes qui ont été compilés directement dans le noyau enregistrent leurs objets avec le <systemitem class="filesystem">sysfs</systemitem> (en interne, devtmpfs) quand ils sont détectés par le noyau. Pour les pilotes compilés en tant que modules, cet enregistrement surviendra quand le module sera chargé. Une fois que le système de fichier <systemitem class="filesystem">sysfs</systemitem> est monté (sur /sys), les données enregistrées par les pilotes avec <systemitem class="filesystem">sysfs</systemitem> sont disponibles pour les processus en espace utilisateur ainsi que pour udevd pour traitement (y compris des modifications aux n&oelig;uds de périphériques).

source: Device Node Creation
fr: Création de n&oelig;uds de périphérique

source: Device files are created by the kernel by the <systemitem class="filesystem">devtmpfs</systemitem> filesystem. Any driver that wishes to register a device node will go through the <systemitem class="filesystem">devtmpfs</systemitem> (via the driver core) to do it. When a <systemitem class="filesystem">devtmpfs</systemitem> instance is mounted on <filename class="directory">/dev</filename>, the device node will initially be created with a fixed name, permissions, and owner.
fr: Les fichiers de périphérique sont créés par le noyau avec le système de fichiers <systemitem class="filesystem">devtmpfs</systemitem>. Tout pilote souhaitant enregistrer un nœud de périphérique ira dans le <systemitem class="filesystem">devtmpfs</systemitem> (par le cœur du pilote) pour le faire. Quand une instance <systemitem class="filesystem">devtmpfs</systemitem> est montée sur <filename class="directory">/dev</filename>, le nœud de périphérique sera créé dès le départ avec un nom, des droits et un propriétaire figés.

source: A short time later, the kernel will send a uevent to <command> udevd</command>. Based on the rules specified in the files within the <filename class="directory">/etc/udev/rules.d</filename>, <filename class="directory">/lib/udev/rules.d</filename>, and <filename class="directory">/run/udev/rules.d</filename> directories, <command> udevd</command> will create additional symlinks to the device node, or change its permissions, owner, or group, or modify the internal <command>udevd</command> database entry (name) for that object.
fr: Peu de temps après, le noyau enverra un uevent à <command>udevd</command>. à partir des règles indiquées dans les fichiers contenus dans les répertoires <filename class="directory">/etc/udev/rules.d</filename>, <filename class="directory">/lib/udev/rules.d</filename> et <filename class="directory">/run/udev/rules.d</filename>, <command> udevd</command> créera les liens symboliques supplémentaires vers le n&oelig;ud de périphérique, ou bien il modifiera ses droits, son propriétaire ou son groupe, ou l'entrée dans la base de données interne d'<command>udevd</command> concernant cet objet.

source: The rules in these three directories are numbered and all three directories are merged together. If <command>udevd</command> can't find a rule for the device it is creating, it will leave the permissions and ownership at whatever <systemitem class="filesystem">devtmpfs</systemitem> used initially.
fr: Les règles de ces trois répertoires sont numérotées et les trois répertoires sont fusionnés. Si <command>udevd</command> ne peut pas trouver de règles pour le périphérique qu'il crée, il en donnera la propriété et les droits à n'importe quel <systemitem class="filesystem">devtmpfs</systemitem> utilisé au départ.

source: Module Loading
fr: Chargement d'un module

source: Device drivers compiled as modules may have aliases built into them. Aliases are visible in the output of the <command>modinfo</command> program and are usually related to the bus-specific identifiers of devices supported by a module. For example, the <emphasis>snd-fm801</emphasis> driver supports PCI devices with vendor ID 0x1319 and device ID 0x0801, and has an alias of <quote>pci:v00001319d00000801sv*sd*bc04sc01i*</quote>. For most devices, the bus driver exports the alias of the driver that would handle the device via <systemitem class="filesystem">sysfs</systemitem>. E.g., the <filename>/sys/bus/pci/devices/0000:00:0d.0/modalias</filename> file might contain the string <quote>pci:v00001319d00000801sv00001319sd00001319bc04sc01i00</quote>. The default rules provided with Udev will cause <command>udevd</command> to call out to <command>/sbin/modprobe</command> with the contents of the <envar>MODALIAS</envar> uevent environment variable (which should be the same as the contents of the <filename>modalias</filename> file in sysfs), thus loading all modules whose aliases match this string after wildcard expansion.
fr: Il se peut que les pilotes des périphériques compilés en module aient aussi des alias compilés. Les alias sont visibles dans la sortie du programme <command>modinfo</command> et sont souvent liés aux identifiants spécifiques du bus des périphériques supportés par un module. Par exemple, le pilote <emphasis>snd-fm801</emphasis> supporte les périphériques PCI ayant l'ID fabricant 0x1319 et l'ID de périphérique 0x0801 a aussi un alias <quote>pci:v00001319d00000801sv*sd*bc04sc01i*</quote>. Pour la plupart des périphériques, le pilote du bus définit l'alias du pilote qui gérerait le périphérique via <systemitem class="filesystem">sysfs</systemitem>. Par exemple, le fichier <filename>/sys/bus/pci/devices/0000:00:0d.0/modalias</filename> pourrait contenir la chaîne <quote>pci:v00001319d00000801sv00001319sd00001319bc04sc01i00</quote>. Les règles par défaut fournies par Udev feront que <command>udevd</command> appellera <command>/sbin/modprobe</command> avec le contenu de la variable d'environnement de l'uevent <envar>MODALIAS</envar> (qui devrait être la même que le contenu du fichier <filename>modalias</filename> dans sysfs), donc chargera tous les modules dont les alias correspondent à cette chaîne après les expansions génériques.

source: In this example, this means that, in addition to <emphasis>snd-fm801</emphasis>, the obsolete (and unwanted) <emphasis>forte</emphasis> driver will be loaded if it is available. See below for ways in which the loading of unwanted drivers can be prevented.
fr: Dans cet exemple, cela signifie que, outre <emphasis>snd-fm801</emphasis>, le pilote obsolète (et non désiré) <emphasis>forte</emphasis> sera chargé s'il est disponible. Voir ci-dessous les moyens d'empêcher le chargement des modules indésirables.

source: The kernel itself is also able to load modules for network protocols, filesystems and NLS support on demand.
fr: Le noyau lui-même est aussi capable de charger des modules de protocole réseau, de support pour des systèmes de fichiers et des NLS sur demande.

source: Handling Hotpluggable/Dynamic Devices
fr: Gestion des périphériques dynamiques ou montables à chaud

source: When you plug in a device, such as a Universal Serial Bus (USB) MP3 player, the kernel recognizes that the device is now connected and generates a uevent. This uevent is then handled by <command>udevd</command> as described above.
fr: Quand vous connectez un périphérique, comme un lecteur MP3 USB, le noyau reconnaît que le périphérique est maintenant connecté et génère un uevent. Cet uevent est alors géré par <command>udevd</command> comme décrit ci-dessus.

source: Problems with Loading Modules and Creating Devices
fr: Problèmes avec le chargement des modules et la création des périphériques

source: There are a few possible problems when it comes to automatically creating device nodes.
fr: Il existe quelques problèmes connus pour la création automatique des n&oelig;uds de périphériques&nbsp;:

source: A kernel module is not loaded automatically
fr: Un module noyau n'est pas chargé automatiquement

source: Udev will only load a module if it has a bus-specific alias and the bus driver properly exports the necessary aliases to <systemitem class="filesystem">sysfs</systemitem>. In other cases, one should arrange module loading by other means. With Linux-&linux-version;, Udev is known to load properly-written drivers for INPUT, IDE, PCI, USB, SCSI, SERIO, and FireWire devices.
fr: Udev ne chargera un module que s'il a un alias spécifique au bus et que le pilote du bus envoie correctement les alias nécessaires vers <systemitem class="filesystem">sysfs</systemitem>. Sinon, il faut organiser le chargement des modules par d'autres moyens. Avec Linux-&linux-version;, Udev est connu pour charger les pilotes correctement écrits pour les périphériques INPUT, IDE, PCI, USB, SCSI, SERIO et FireWire.

source: To determine if the device driver you require has the necessary support for Udev, run <command>modinfo</command> with the module name as the argument. Now try locating the device directory under <filename class="directory">/sys/bus</filename> and check whether there is a <filename>modalias</filename> file there.
fr: Pour déterminer si le pilote du périphérique dont vous avez besoin a le support nécessaire pour Udev, lancez <command>modinfo</command> avec le nom du module en argument. Puis, essayez de localiser le répertoire du périphérique sous <filename class="directory">/sys/bus</filename> et vérifiez s'il y a un fichier <filename>modalias</filename>.

source: If the <filename>modalias</filename> file exists in <systemitem class="filesystem">sysfs</systemitem>, the driver supports the device and can talk to it directly, but doesn't have the alias, it is a bug in the driver. Load the driver without the help from Udev and expect the issue to be fixed later.
fr: Si le fichier <filename>modalias</filename> existe dans <systemitem class="filesystem">sysfs</systemitem>, alors le pilote supporte le périphérique et peut lui parler directement, mais s'il n'a pas d'alias, c'est un bogue dans le pilote. Chargez le pilote sans l'aide d'Udev et attendez que le problème soit corrigé plus tard.

source: If there is no <filename>modalias</filename> file in the relevant directory under <filename class="directory">/sys/bus</filename>, this means that the kernel developers have not yet added modalias support to this bus type. With Linux-&linux-version;, this is the case with ISA busses. Expect this issue to be fixed in later kernel versions.
fr: S'il n'y a pas de fichier <filename>modalias</filename> dans le bon répertoire sous <filename class="directory">/sys/bus</filename>, cela signifie que les développeurs du noyau n'ont pas encore ajouté de support modalias à ce type de bus. Avec Linux-&linux-version;, c'est le cas pour les bus ISA. Attendez que ce problème soit réparé dans les versions ultérieures du noyau.

source: Udev is not intended to load <quote>wrapper</quote> drivers such as <emphasis>snd-pcm-oss</emphasis> and non-hardware drivers such as <emphasis>loop</emphasis> at all.
fr: Udev n'a pas du tout pour but de charger des pilotes <quote>wrapper</quote> (qui emballent un autre pilote) comme <emphasis>snd-pcm-oss</emphasis> et des pilotes non matériels comme <emphasis>loop</emphasis>.

source: A kernel module is not loaded automatically, and Udev is not intended to load it
fr: Un module du noyau n'est pas chargé automatiquement et Udev n'est pas prévu pour le charger

source: If the <quote>wrapper</quote> module only enhances the functionality provided by some other module (e.g., <emphasis>snd-pcm-oss</emphasis> enhances the functionality of <emphasis>snd-pcm</emphasis> by making the sound cards available to OSS applications), configure <command>modprobe</command> to load the wrapper after Udev loads the wrapped module. To do this, add a <quote>softdep</quote> line in any <filename>/etc/modprobe.d/<replaceable>&lt;filename&gt;</replaceable>.conf</filename> file. For example:
fr: Si le module <quote>wrapper</quote> n'améliore que la fonctionnalité fournie par un autre module (comme <emphasis>snd-pcm-oss</emphasis> améliore la fonctionnalité de <emphasis>snd-pcm</emphasis> en rendant les cartes son disponibles pour les applications OSS), configurez <command>modprobe</command> pour charger le wrapper après qu'Udev ait chargé le module emballé. Pour cela, ajoutez une ligne <quote>softdep</quote> dans tous les fichiers <filename>/etc/modprobe.d/<replaceable>&lt;filename&gt;</replaceable>.conf</filename>. Par exemple&nbsp;:

source: Note that the <quote>softdep</quote> command also allows <literal>pre:</literal> dependencies, or a mixture of both <literal>pre:</literal> and <literal>post:</literal>. See the <filename>modprobe.d(5)</filename> manual page for more information on <quote>softdep</quote> syntax and capabilities.
fr: Remarquez que la commande <quote>softdep</quote> autorise aussi les dépendances <literal>pre:</literal>, ou un mélange de <literal>pre:</literal> et de <literal>post:</literal>. Voir la page de manuel de <filename>modprobe.d(5)</filename> pour plus d'informations sur la syntaxe et les possibilités de <quote>softdep</quote>.

source: If the module in question is not a wrapper and is useful by itself, configure the <command>modules</command> bootscript to load this module on system boot. To do this, add the module name to the <filename>/etc/sysconfig/modules</filename> file on a separate line. This works for wrapper modules too, but is suboptimal in that case.
fr: Si le module en question n'est pas un emballage et s'avère utile en tant que tel, configurez le script de démarrage <command>modules</command> pour charger ce module sur le système de démarrage. Pour cela, ajoutez le nom du module au fichier <filename>/etc/sysconfig/modules</filename> sur une ligne séparée. Ceci fonctionne aussi pour les modules d'emballage, mais sans être optimal.

source: Udev loads some unwanted module
fr: Udev charge un module indésirable

source: Either don't build the module, or blacklist it in a <filename>/etc/modprobe.d/blacklist.conf</filename> file as done with the <emphasis>forte</emphasis> module in the example below:
fr: Ne compilez pas le module, ou mettez-le en liste noire dans un fichier <filename>/etc/modprobe.d/blacklist.conf</filename> comme nous l'avons fait avec le module <emphasis>forte</emphasis> dans l'exemple ci-dessous&nbsp;:

source: Blacklisted modules can still be loaded manually with the explicit <command>modprobe</command> command.
fr: Les modules en liste noire peuvent toujours être chargés manuellement avec la commande explicite <command>modprobe</command>.

source: Udev creates a device incorrectly, or makes a wrong symlink
fr: Udev crée mal un périphérique, ou crée un mauvais lien symbolique

source: This usually happens if a rule unexpectedly matches a device. For example, a poorly-written rule can match both a SCSI disk (as desired) and the corresponding SCSI generic device (incorrectly) by vendor. Find the offending rule and make it more specific, with the help of the <command>udevadm info</command> command.
fr: Cela se produit habituellement si une règle correspond à un périphérique de façon imprévue. Par exemple, une règle lacunaire peut correspondre à un disque SCSI (comme désiré) et au périphérique SCSI générique du même fabricant (de façon incorrecte). Trouvez la règle défectueuse et affinez-la, à l'aide de la commande <command>udevadm info</command>

source: Udev rule works unreliably
fr: Une règle Udev fonctionne de manière non fiable
