Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/udev.po
Languages: fr

source: This may be another manifestation of the previous problem. If not, and your rule uses <systemitem class="filesystem">sysfs</systemitem> attributes, it may be a kernel timing issue, to be fixed in later kernels. For now, you can work around it by creating a rule that waits for the used <systemitem class="filesystem">sysfs</systemitem> attribute and appending it to the <filename>/etc/udev/rules.d/10-wait_for_sysfs.rules</filename> file (create this file if it does not exist). Please notify the LFS Development list if you do so and it helps.
fr: Cela peut être une autre manifestation du problème précédent. Sinon, et si votre règle utilise les attributs de <systemitem class="filesystem">sysfs</systemitem>, il se peut que ce soit un problème de timing du noyau, sur le point d'être corrigé dans les noyaux ultérieurs. Pour le moment, vous pouvez contourner en créant une règle qui attend l'attribut <systemitem class="filesystem">sysfs</systemitem> utilisé et en le mettant dans le fichier <filename>/etc/udev/rules.d/10-wait_for_sysfs.rules</filename> (créez ce fichier s'il n'existe pas). Merci d'informer la liste de développement de LFS si vous faites ainsi et que cela vous aide.

source: Udev does not create a device
fr: Udev ne crée pas un périphérique

source: Further text assumes that the driver is built statically into the kernel or already loaded as a module, and that you have already checked that Udev doesn't create a misnamed device.
fr: Les textes suivants supposent que les pilotes sont compilés statiquement dans le kernel ou sont déjà chargés comme modules et que vous avez déjà vérifié que Udev ne crée pas un périphérique mal nommé.

source: Udev has no information needed to create a device node if a kernel driver does not export its data to <systemitem class="filesystem">sysfs</systemitem>. This is most common with third party drivers from outside the kernel tree. Create a static device node in <filename>/lib/udev/devices</filename> with the appropriate major/minor numbers (see the file <filename>devices.txt</filename> inside the kernel documentation or the documentation provided by the third party driver vendor). The static device node will be copied to <filename class="directory">/dev</filename> by <command>udev</command>.
fr: Udev n'a pas les informations pour créer un nœud si un pilote noyau n'exporte pas ses informations vers <systemitem class="filesystem">sysfs</systemitem>. C'est le plus souvent le cas des pilotes tiers ne provenant pas du noyau. Créez un nœud de périphérique statique dans <filename>/lib/udev/devices</filename> avec les numéros majeurs/mineurs appropriés (regardez le fichier <filename>devices.txt</filename> dans la documentation du noyau du vendeur du pilote tiers). Le nœud statique sera copié dans <filename class="directory">/dev</filename> par <command>udev</command>.

source: Device naming order changes randomly after rebooting
fr: L'ordre de nommage des périphériques change de manière aléatoire après le redémarrage

source: This is due to the fact that Udev, by design, handles uevents and loads modules in parallel, and thus in an unpredictable order. This will never be <quote>fixed</quote>. You should not rely upon the kernel device names being stable. Instead, create your own rules that make symlinks with stable names based on some stable attributes of the device, such as a serial number or the output of various *_id utilities installed by Udev. See <xref linkend="ch-scripts-symlinks"/> and <xref linkend="ch-scripts-network"/> for examples.
fr: Cela est dà» au fait qu'Udev, par nature, gère les uevents et charge les modules en parallèle, donc dans un ordre imprévisible. Cela ne sera jamais <quote>corrigé</quote>. Vous ne devriez pas supposer que les noms des périphériques du noyau sont stables. Créez plutôt vos propres règles qui rendent les liens symboliques stables basés sur des attributs stables du périphérique, comme une série de nombres ou la sortie de divers utilitaires *_id installés par Udev. Voir la <xref linkend="ch-scripts-symlinks"/> et la <xref linkend="ch-scripts-network"/> pour des exemples.

source: Useful Reading
fr: Lecture utile

source: Additional helpful documentation is available at the following sites:
fr: Des documentations supplémentaires sont disponibles sur les sites suivants&nbsp;:

source: A Userspace Implementation of <systemitem class="filesystem">devfs</systemitem> <ulink url="http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf"/>
fr: A Userspace Implementation of <systemitem class="filesystem">devfs</systemitem> <ulink url="http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf"/> (NdT&nbsp;: Une implémentation en espace utilisateur de devfs)

source: The <systemitem class="filesystem">sysfs</systemitem> Filesystem <ulink url="http://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf"/>
fr: The <systemitem class="filesystem">sysfs</systemitem> Filesystem <ulink url="http://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf"/> (NdT&nbsp;: Le système de fichiers <systemitem class="filesystem">sysfs</systemitem>)
