Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/usage.po
Languages: fr

source: System V Bootscript Usage and Configuration
fr: Utiliser et configurer les scripts de démarrage de System V

source: usage
fr: utilisation

source: How Do the System V Bootscripts Work?
fr: Comment fonctionnent les scripts de démarrage de System V&nbsp;?

source: Linux uses a special booting facility named SysVinit that is based on a concept of <emphasis>run-levels</emphasis>. It can be quite different from one system to another, so it cannot be assumed that because things worked in one particular Linux distribution, they should work the same in LFS too. LFS has its own way of doing things, but it respects generally accepted standards.
fr: Linux utilise un service de démarrage spécial nommé SysVinit qui est basé sur un concept de <emphasis>niveaux d'exécution</emphasis>. Il peut être très différent d'un système à un autre, du coup, il ne peut pas être supposé que parce que cela fonctionne sur une distribution Linux particulière, cela fonctionnera de la même façon dans LFS. LFS a sa propre façon de le faire mais il respecte généralement les standards établis.

source: SysVinit (which will be referred to as <quote>init</quote> from now on) works using a run-levels scheme. There are seven (numbered 0 to 6) run-levels (actually, there are more run-levels, but they are for special cases and are generally not used. See <filename>init(8)</filename> for more details), and each one of those corresponds to the actions the computer is supposed to perform when it starts up. The default run-level is 3. Here are the descriptions of the different run-levels as they are implemented:
fr: SysVinit (qui sera nommé par la suite <quote>init</quote>) fonctionne en utilisant un schéma de niveaux d'exécution. Ils sont au nombre de sept (numérotés de 0 à 6). En fait, il en existe plus mais ils sont réservés à des cas spéciaux et ne sont généralement pas utilisés. Voir <filename>init(8)</filename> pour plus de détails. Chacun d'entre eux correspond à des actions que l'ordinateur est supposé effectuer lorsqu'il démarre. Le niveau d'exécution par défaut est 3. Voici les descriptions sur l'implémentation des différents niveaux d'exécution&nbsp;:

source: 0: halt the computer 1: single-user mode 2: multi-user mode without networking 3: multi-user mode with networking 4: reserved for customization, otherwise does the same as 3 5: same as 4, it is usually used for GUI login (like X's <command>xdm</command> or KDE's <command>kdm</command>) 6: reboot the computer
fr: 0: arrête l'ordinateur 1: mode mono-utilisateur 2: mode multi-utilisateur sans réseau 3: mode multi-utilisateur avec réseau 4: réservé pour la personnalisation, sinon identique à 3 5: identique à 4, il est habituellement utilisé pour la connexion GUI (comme <command>xdm</command> de X ou <command>kdm</command> de KDE) 6: redémarre l'ordinateur

source: Configuring Sysvinit
fr: Configuration de Sysvinit

source: configuring
fr: configuration

source: During the kernel initialization, the first program that is run is either specified on the command line or, by default <command>init</command>. This program reads the initialization file <filename>/etc/inittab</filename>. Create this file with:
fr: Lors de l'initialisation du noyau, le premier programme qui se lance est soit spécifié sur la ligne de commande, soit, par défaut, <command>init</command>. Ce programme lit le fichier d'initialisation <filename>/etc/inittab</filename>. Créez ce fichier avec&nbsp;:

source: <userinput>cat &gt; /etc/inittab &lt;&lt; "EOF" <literal># Begin /etc/inittab id:3:initdefault: si::sysinit:/etc/rc.d/init.d/rc S l0:0:wait:/etc/rc.d/init.d/rc 0 l1:S1:wait:/etc/rc.d/init.d/rc 1 l2:2:wait:/etc/rc.d/init.d/rc 2 l3:3:wait:/etc/rc.d/init.d/rc 3 l4:4:wait:/etc/rc.d/init.d/rc 4 l5:5:wait:/etc/rc.d/init.d/rc 5 l6:6:wait:/etc/rc.d/init.d/rc 6 ca:12345:ctrlaltdel:/sbin/shutdown -t1 -a -r now su:S016:once:/sbin/sulogin 1:2345:respawn:/sbin/agetty --noclear tty1 9600 2:2345:respawn:/sbin/agetty tty2 9600 3:2345:respawn:/sbin/agetty tty3 9600 4:2345:respawn:/sbin/agetty tty4 9600 5:2345:respawn:/sbin/agetty tty5 9600 6:2345:respawn:/sbin/agetty tty6 9600 # End /etc/inittab</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/inittab &lt;&lt; "EOF" <literal># Début de /etc/inittab id:3:initdefault: si::sysinit:/etc/rc.d/init.d/rc S l0:0:wait:/etc/rc.d/init.d/rc 0 l1:S1:wait:/etc/rc.d/init.d/rc 1 l2:2:wait:/etc/rc.d/init.d/rc 2 l3:3:wait:/etc/rc.d/init.d/rc 3 l4:4:wait:/etc/rc.d/init.d/rc 4 l5:5:wait:/etc/rc.d/init.d/rc 5 l6:6:wait:/etc/rc.d/init.d/rc 6 ca:12345:ctrlaltdel:/sbin/shutdown -t1 -a -r now su:S016:once:/sbin/sulogin 1:2345:respawn:/sbin/agetty --noclear tty1 9600 2:2345:respawn:/sbin/agetty tty2 9600 3:2345:respawn:/sbin/agetty tty3 9600 4:2345:respawn:/sbin/agetty tty4 9600 5:2345:respawn:/sbin/agetty tty5 9600 6:2345:respawn:/sbin/agetty tty6 9600 # Fin de /etc/inittab</literal> EOF</userinput>

source: An explanation of this initialization file is in the man page for <emphasis>inittab</emphasis>. For LFS, the key command that is run is <command>rc</command>. The initialization file above will instruct <command>rc</command> to run all the scripts starting with an S in the <filename class="directory">/etc/rc.d/rcS.d</filename> directory followed by all the scripts starting with an S in the <filename class="directory">/etc/rc.d/rc?.d</filename> directory where the question mark is specified by the initdefault value.
fr: Vous trouverez une explication de ce fichier d'initialisation dans la page de manuel de <emphasis>inittab</emphasis>. Pour LFS, la commande clé qui se lance est <command>rc</command>. Le fichier d'initialisation ci-dessus demandera à <command>rc</command> de lancer tous les scripts commençant par un S qui sont dans le répertoire <filename class="directory">/etc/rc.d/rcS.d</filename>, puis tous les scripts commençant par un S du répertoire <filename class="directory">/etc/rc.d/rc?.d</filename> où le point d'interrogation est spécifié par la valeur initdefault.

source: As a convenience, the <command>rc</command> script reads a library of functions in <filename class="directory">/lib/lsb/init-functions</filename>. This library also reads an optional configuration file, <filename>/etc/sysconfig/rc.site</filename>. Any of the system configuration file parameters described in subsequent sections can be alternatively placed in this file allowing consolidation of all system parameters in this one file.
fr: Par commodité, le script <command>rc</command> lit une bibliothèque de fonctions dans <filename class="directory">/lib/lsb/init-functions</filename>. Cette bibliothèque lit aussi un fichier de configuration facultatif, <filename>/etc/sysconfig/rc.site</filename>. Tous les paramètres du fichier de configuration du système décrits dans les sections suivantes peuvent être mis dans ce fichier, ce qui permet de rassembler tous les paramètres systèmes dans un seul fichier.

source: As a debugging convenience, the functions script also logs all output to <filename>/run/var/bootlog</filename>. Since the <filename class="directory">/run</filename> directory is a tmpfs, this file is not persistent across boots, however it is appended to the more permanent file <filename>/var/log/boot.log</filename> at the end of the boot process.
fr: Pour faciliter le débogage, le script functions enregistre aussi toute la sortie dans <filename>/run/var/bootlog</filename>. Le répertoire <filename class="directory">/run</filename> étant un tmpfs, ce fichier n'est pas persistant entre les redémarrages, il est cependant envoyé dans le fichier plus permanent <filename>/var/log/boot.log</filename> à la fin du processus de démarrage.

source: Changing Run Levels
fr: Modifier les niveaux d'exécution

source: Changing run-levels is done with <command>init <replaceable>&lt;runlevel&gt;</replaceable></command>, where <replaceable>&lt;runlevel&gt;</replaceable> is the target run-level. For example, to reboot the computer, a user could issue the <command>init 6</command> command, which is an alias for the <command>reboot</command> command. Likewise, <command>init 0</command> is an alias for the <command>halt</command> command.
fr: La commande utilisée pour modifier le niveau d'exécution est <command>init <replaceable>&lt;[niveau_exécution]&gt;</replaceable></command>, où <replaceable>&lt;[niveau_exécution]&gt;</replaceable> est le niveau d'exécution cible. Par exemple, pour redémarrer l'ordinateur, un utilisateur pourrait lancer la commande <command>init 6</command> qui est un alias de la commande <command>reboot</command>. De même, <command>init 0</command> est un alias pour la commande <command>halt</command>.

source: There are a number of directories under <filename class="directory">/etc/rc.d</filename> that look like <filename class="directory">rc?.d</filename> (where ? is the number of the run-level) and <filename class="directory">rcsysinit.d</filename>, all containing a number of symbolic links. Some begin with a <emphasis>K</emphasis>, the others begin with an <emphasis>S</emphasis>, and all of them have two numbers following the initial letter. The K means to stop (kill) a service and the S means to start a service. The numbers determine the order in which the scripts are run, from 00 to 99&mdash;the lower the number the earlier it gets executed. When <command>init</command> switches to another run-level, the appropriate services are either started or stopped, depending on the runlevel chosen.
fr: Il existe un certain nombre de répertoires sous <filename class="directory">/etc/rc.d</filename> qui ressemble à <filename class="directory">rc?.d</filename> (où ? est le numéro du niveau d'exécution) et <filename class="directory">rcsysinit.d</filename>, tous contenant un certain nombre de liens symboliques. Certains commencent par un <emphasis>K</emphasis>, les autres par un <emphasis>S</emphasis>, et tous ont deux nombres après la lettre initiale. Le K signifie l'arrêt (kill) d'un service et le S son lancement (start). Les nombres déterminent l'ordre dans lequel les scripts sont exécutés, de 00 à 99 &mdash;&nbsp;plus ce nombre est petit, plus tôt le script correspondant sera exécuté. Quand <command>init</command> bascule sur un autre niveau d'exécution, les services appropriés sont soit lancés soit tués, suivant le niveau d'exécution choisi.

source: The real scripts are in <filename class="directory">/etc/rc.d/init.d</filename>. They do the actual work, and the symlinks all point to them. K links and S links point to the same script in <filename class="directory">/etc/rc.d/init.d</filename>. This is because the scripts can be called with different parameters like <parameter>start</parameter>, <parameter>stop</parameter>, <parameter>restart</parameter>, <parameter>reload</parameter>, and <parameter>status</parameter>. When a K link is encountered, the appropriate script is run with the <parameter>stop</parameter> argument. When an S link is encountered, the appropriate script is run with the <parameter>start</parameter> argument.
fr: Les vrais scripts sont dans <filename class="directory">/etc/rc.d/init.d</filename>. Ils font le vrai boulot et les liens symboliques pointent tous vers eux. Les liens K et les liens S pointent vers le même script dans <filename class="directory">/etc/rc.d/init.d</filename>. Ceci est dû au fait que les scripts peuvent être appelés avec différents paramètres comme <parameter>start</parameter>, <parameter>stop</parameter>, <parameter>restart</parameter>, <parameter>reload</parameter> et <parameter>status</parameter>. Quand un lien K est rencontré, le script approprié est lancé avec l'argument <parameter>stop</parameter>. Quand un lien S est rencontré, le script approprié est lancé avec l'argument <parameter>start</parameter>.

source: There is one exception to this explanation. Links that start with an <emphasis>S</emphasis> in the <filename class="directory">rc0.d</filename> and <filename class="directory">rc6.d</filename> directories will not cause anything to be started. They will be called with the parameter <parameter>stop</parameter> to stop something. The logic behind this is that when a user is going to reboot or halt the system, nothing needs to be started. The system only needs to be stopped.
fr: Il y a une exception à cette explication. Les liens qui commencent par un <emphasis>S</emphasis> dans les dossiers <filename class="directory">rc0.d</filename> et <filename class="directory">rc6.d</filename> ne vont rien faire pour être démarrés. Ils seront appelés avec le paramètre <parameter>stop</parameter> pour arrêter quelque chose. La logique sous-jacente est que quand un utilisateur est en train de redémarrer ou arrêter le système, rien ne nécessite d'être démarré. Le système a seulement besoin d'être arrêté.

source: These are descriptions of what the arguments make the scripts do:
fr: Voici les descriptions de ce que font les arguments des scripts&nbsp;:

source: The service is started.
fr: Le service est lancé.

source: The service is stopped.
fr: Le service est stoppé.

source: The service is stopped and then started again.
fr: Le service est stoppé puis relancé.

source: The configuration of the service is updated. This is used after the configuration file of a service was modified, when the service does not need to be restarted.
fr: La configuration du service est mise à jour. Ceci est utilisé après modification du fichier de configuration d'un service, quand le service n'a pas besoin d'être redémarré.

source: Tells if the service is running and with which PIDs.
fr: Indique si le service est en cours d'exécution ainsi que les PID associés.

source: Feel free to modify the way the boot process works (after all, it is your own LFS system). The files given here are an example of how it can be done.
fr: Vous êtes libre de modifier la façon dont le processus de démarrage fonctionne (après tout, c'est votre système LFS). Les fichiers donnés ici sont un exemple d'une façon de faire.

source: Udev Bootscripts
fr: Les scripts de démarrage Udev

source: The <filename>/etc/rc.d/init.d/udev</filename> initscript starts <command>udevd</command>, triggers any "coldplug" devices that have already been created by the kernel and waits for any rules to complete. The script also unsets the uevent handler from the default of <filename>/sbin/hotplug </filename>. This is done because the kernel no longer needs to call out to an external binary. Instead <command>udevd</command> will listen on a netlink socket for uevents that the kernel raises.
fr: Le script de démarrage <filename>/etc/rc.d/init.d/udev</filename> lance <command>udevd</command>, récupère les périphériques "branchés à froid" créés d'ores et déjà par le noyau et attend des règles pour se terminer. Le script supprime aussi du gestionnaire d'uevent le réglage par défaut <filename>/sbin/hotplug </filename>. On fait cela car le noyau n'a plus besoin de faire appel à un binaire externe. Par contre, <command>udevd</command> va écouter sur un socket netlink les uevents engendrés par le noyau.

source: The <command>/etc/rc.d/init.d/udev_retry</command> initscript takes care of re-triggering events for subsystems whose rules may rely on filesystems that are not mounted until the <command>mountfs</command> script is run (in particular, <filename class="directory">/usr</filename> and <filename class="directory">/var</filename> may cause this). This script runs after the <command>mountfs</command> script, so those rules (if re-triggered) should succeed the second time around. It is configured from the <filename>/etc/sysconfig/udev_retry</filename> file; any words in this file other than comments are considered subsystem names to trigger at retry time. To find the subsystem of a device, use <command>udevadm info --attribute-walk &lt;device&gt;</command> where &lt;device&gt; is an absolute path in /dev or /sys such as /dev/sr0 or /sys/class/rtc.
fr: Le script de démarrage <command>/etc/rc.d/init.d/udev_retry</command> se charge de récupérer les événements des sous-systèmes dont les règles s'appuient sur des systèmes de fichiers non montés jusqu'à ce que le script <command>mountfs</command>soit lancé (en particulier, <filename class="directory">/usr</filename> et <filename class="directory">/var</filename> peuvent avoir cet effet). Ce script s'exécute après le script <command>mountfs</command>, donc ces règles (si elles sont de nouveau récupérées) devraient s'appliquer la deuxième fois. Il se configure à partir du fichier <filename>/etc/sysconfig/udev_retry</filename>&nbsp;; donc tout mot autre que des commentaires dans ce fichier est vu comme un nom de sous-système à rattraper lorsqu'il lance le nouvel essai. Pour trouver le sous-système d'un périphérique, utilisez <command>udevadm info --attribute-walk &lt;périphérique&gt;</command> où &lt;périphérique&gt; est un chemin absolu dans /dev ou /sys comme /dev/sr0 ou /sys/class/rtc.

source: For information on kernel module loading and udev, see <xref linkend="module-loading"/>.
fr: Pour plus d'informations sur le chargement des modules du noyau et udev, consultez <xref linkend="module-loading"/>.

source: Configuring the System Clock
fr: Configurer l'horloge du système

source: The <command>setclock</command> script reads the time from the hardware clock, also known as the BIOS or the Complementary Metal Oxide Semiconductor (CMOS) clock. If the hardware clock is set to UTC, this script will convert the hardware clock's time to the local time using the <filename>/etc/localtime</filename> file (which tells the <command>hwclock</command> program which timezone the user is in). There is no way to detect whether or not the hardware clock is set to UTC, so this needs to be configured manually.
fr: Le script <command>setclock</command> lit l'heure à partir de l'horloge matérielle, appelée aussi horloge BIOS ou <foreignphrase>Complementary Metal Oxide Semiconductor</foreignphrase> (CMOS). Si l'horloge matérielle est réglée sur UTC, ce script convertira l'heure de l'horloge matérielle en heure locale en utilisant le fichier <filename>/etc/localtime</filename> (qui indique au programme <command>hwclock</command> le fuseau horaire de l'utilisateur). Il n'y a aucun moyen de détecter si l'horloge matérielle est réglée sur UTC, donc vous devez le configurer manuellement.

source: The <command>setclock</command> is run via <application>udev</application> when the kernel detects the hardware capability upon boot. It can also be run manually with the stop parameter to store the system time to the CMOS clock.
fr: Le script <command>setclock</command> se lance via <application>udev</application> quand le noyau détecte le matériel au démarrage. Vous pouvez aussi le lancer à la main avec le paramètre stop pour stocker l'heure du système dans l'horloge CMOS.

source: If you cannot remember whether or not the hardware clock is set to UTC, find out by running the <userinput>hwclock --localtime --show</userinput> command. This will display what the current time is according to the hardware clock. If this time matches whatever your watch says, then the hardware clock is set to local time. If the output from <command>hwclock</command> is not local time, chances are it is set to UTC time. Verify this by adding or subtracting the proper amount of hours for the timezone to the time shown by <command>hwclock</command>. For example, if you are currently in the MST timezone, which is also known as GMT -0700, add seven hours to the local time.
fr: Si vous ne vous rappelez pas si l'horloge matérielle est réglée sur UTC, assurez-vous-en en lançant la commande <userinput>hwclock --localtime --show</userinput>. Cela affichera l'heure actuelle selon l'horloge matérielle. Si elle correspond à ce qu'indique votre montre, l'horloge matérielle est en heure locale. Si la sortie de <command>hwclock</command> n'est pas l'heure locale, il y a des chances qu'il s'agisse de l'heure UTC. Vérifiez-le en ajoutant ou enlevant le bon nombre d'heures du fuseau horaire de l'heure affichée avec <command>hwclock</command>. Par exemple, si vous êtes dans le fuseau MST, connu aussi sous le nom GMT -0700, ajoutez sept heures à l'heure locale.

source: Change the value of the <envar>UTC</envar> variable below to a value of <parameter>0</parameter> (zero) if the hardware clock is <emphasis>not</emphasis> set to UTC time.
fr: Passez la valeur de la variable <envar>UTC</envar> ci-dessous à la valeur <parameter>0</parameter> (zéro) si vhorloge matérielle <emphasis>n'est pas</emphasis> réglée sur l'heure UTC.

source: Create a new file <filename>/etc/sysconfig/clock</filename> by running the following:
fr: Créez un nouveau fichier <filename>/etc/sysconfig/clock</filename> en lançant ce qui suit&nbsp;:

source: <userinput>cat &gt; /etc/sysconfig/clock &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/clock UTC=1 # Set this to any options you might need to give to hwclock, # such as machine hardware clock type for Alphas. CLOCKPARAMS= # End /etc/sysconfig/clock</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/sysconfig/clock &lt;&lt; "EOF" <literal># Début de /etc/sysconfig/clock UTC=1 # Mettez ici les options que vous pourriez devoir donner à hwclock, # comme le type de l'horloge matérielle de la machine pour les Alphas. CLOCKPARAMS= # Fin de /etc/sysconfig/clock</literal> EOF</userinput>

source: A good hint explaining how to deal with time on LFS is available at <ulink url="&hints-root;time.txt"/>. It explains issues such as time zones, UTC, and the <envar>TZ</envar> environment variable.
fr: Une bonne astuce expliquant la gestion de l'heure sur LFS est disponible sur <ulink url="http://www.fr.linuxfromscratch.org/view/astuces/heure.txt"/>. Elle traite de sujets tels que les fuseaux horaires, UTC et la variable d'environnement <envar>TZ</envar>.

source: The CLOCKPARAMS and UTC paramaters may be alternatively set in the <filename>/etc/sysconfig/rc.site</filename> file.
fr: Vous pouvez aussi régler les paramètres CLOCKPARAMS et UTC dans le fichier <filename>/etc/sysconfig/rc.site</filename>.

source: Configuring the Linux Console
fr: Configurer la Console Linux

source: This section discusses how to configure the <command>console</command> bootscript that sets up the keyboard map, console font and console kernel log level. If non-ASCII characters (e.g., the copyright sign, the British pound sign and Euro symbol) will not be used and the keyboard is a U.S. one, much of this section can be skipped. Without the configuration file, (or equivalent settings in <filename>rc.site</filename>), the <command>console</command> bootscript will do nothing.
fr: Cette section discute de la configuration du script de démarrage <command>console</command>, initialisant la disposition du clavier, la police de la console et le niveau de journalisation du noyau. Si des caractères non-ASCII (par exemple le symbole du copyright, de la livre sterling et de l'euro) ne seront pas utilisés et que le clavier est américain, la plupart de cette section peut être sautée. Sans ce fichier de configuration, (ou des options équivalentes dans <filename>rc.site</filename>), le script de démarrage <command>console</command> ne fera rien.
