Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/usage.po
Languages: fr

source: During shutdown, the <command>init</command> program sends a TERM signal to each program it has started (e.g. agetty), waits for a set time (default 3 seconds), and sends each process a KILL signal and waits again. This process is repeated in the <command>sendsignals</command> script for any processes that are not shut down by their own scripts. The delay for <command>init</command> can be set by passing a parameter. For example to remove the delay in <command>init</command>, pass the -t0 parameter when shutting down or rebooting (e.g. <command>/sbin/shutdown -t0 -r now</command>). The delay for the <command>sendsignals</command> script can be skipped by setting the parameter KILLDELAY=0.
fr: Lors de l'extinction, le programme <command>init</command> envoie un signal TERM à chaque programme qu'il a démarré (comme agetty), il attend un moment de définition (par défaut, 3 secondes), et il envoie à chaque processus un signal KILL puis attend de nouveau. Ce processus se répète dans le script <command>sendsignals</command> pour tous les processus non terminés par leurs propres scripts. Le délai de <command>init</command> peut être défini en passant un paramètre. Par exemple, pour supprimer le délai dans <command>init</command>, passez le paramètre -t0 lors de l'extinction ou du redémarrage (comme <command>/sbin/shutdown -t0 -r now</command>). Le délai du script <command>sendsignals</command> peut être sauté en définissant le paramètre KILLDELAY=0.
