Repository: espindula/br-lfs
Catalog: lfs/*/chapter07/usage.po
Languages: fr

source: The <command>console</command> script reads the <filename>/etc/sysconfig/console</filename> file for configuration information. Decide which keymap and screen font will be used. Various language-specific HOWTOs can also help with this, see <ulink url="http://www.tldp.org/HOWTO/HOWTO-INDEX/other-lang.html"/>. If still in doubt, look in the <filename class="directory">/usr/share/keymaps</filename> and <filename class="directory">/usr/share/consolefonts</filename> directories for valid keymaps and screen fonts. Read <filename>loadkeys(1)</filename> and <filename>setfont(8)</filename> manual pages to determine the correct arguments for these programs.
fr: Le script <command>console</command> lit les informations de configuration du fichier <filename>/etc/sysconfig/console</filename>. Il décide de la disposition de clavier et de la police de la console à utiliser. Différents guides pratiques spécifiques aux langues peuvent aussi être d'une grande aide (voir <ulink url="http://www.tldp.org/HOWTO/HOWTO-INDEX/other-lang.html"/>). Si vous avez toujours des doutes, jetez un œil dans les répertoires <filename class="directory">/usr/share/keymaps</filename> et <filename class="directory">/usr/share/consolefonts</filename> pour des dispositions de clavier valides et des polices d'écran. Lisez les pages de manuel <filename>loadkeys(1)</filename> et <filename>setfont(8)</filename> pour déterminer les bons arguments pour ces programmes.

source: The <filename>/etc/sysconfig/console</filename> file should contain lines of the form: VARIABLE="value". The following variables are recognized:
fr: Le fichier <filename>/etc/sysconfig/console</filename> devrait contenir des lignes de la forme&nbsp;: VARIABLE="valeur". Les variables suivantes sont reconnues&nbsp;:

source: This variable specifies the log level for kernel messages sent to the console as set by <command>dmesg</command>. Valid levels are from "1" (no messages) to "8". The default level is "7".
fr: Cette variable spécifie le niveau de traçage pour les messages du noyau envoyés à la console, selon le paramétrage de <command>dmesg</command>. Les niveaux valides vont de <quote>1</quote> (aucun message) à <quote>8</quote>. Le niveau par défaut est <quote>7</quote>.

source: This variable specifies the arguments for the <command>loadkeys</command> program, typically, the name of keymap to load, e.g., <quote>it</quote>. If this variable is not set, the bootscript will not run the <command>loadkeys</command> program, and the default kernel keymap will be used. Note that a few keymaps have multiple versions with the same name (cz and its variants in qwerty/ and qwertz/, es in olpc/ and qwerty/, and trf in fgGIod/ and qwerty/). In these cases the parent directory should also be specified (e.g. qwerty/es) to ensure the proper keymap is loaded.
fr: Cette variable spécifie les arguments du programme <command>loadkeys</command>, en général, le nom de l'arrangement du clavier à charger, comme <quote>it</quote>. Si cette variable n'est pas initialisée, le script de démarrage ne lancera pas le programme <command>loadkeys</command> et l'arrangement par défaut du noyau sera utilisé. Remarquez qu'un petit nombre d'arrangements ont plusieurs versions avec le même nom (cz avec ses variantes dans qwerty/ et qwertz/, es dans olpc/ et qwerty/, et trf dans fgGlod/ et qwerty/). Dans ce cas, le répertoire parent doit être spécifié (par exemple qwerty/es) pour s'assurer que l'arrangement adéquat est chargé.

source: This (rarely used) variable specifies the arguments for the second call to the <command>loadkeys</command> program. This is useful if the stock keymap is not completely satisfactory and a small adjustment has to be made. E.g., to include the Euro sign into a keymap that normally doesn't have it, set this variable to <quote>euro2</quote>.
fr: Cette variable (rarement utilisée) spécifie les arguments du second appel au programme <command>loadkeys</command>. C'est utile si la disposition du clavier stocké n'est pas totalement satisfaisant et que vous devez faire un petit ajustement. Par exemple, pour inclure le signe Euro dans une disposition de clavier qui ne l'a normalement pas, réglez cette variable à <quote>euro2</quote>.

source: This variable specifies the arguments for the <command>setfont</command> program. Typically, this includes the font name, <quote>-m</quote>, and the name of the application character map to load. E.g., in order to load the <quote>lat1-16</quote> font together with the <quote>8859-1</quote> application character map (as it is appropriate in the USA), set this variable to <quote>lat1-16 -m 8859-1</quote>. In UTF-8 mode, the kernel uses the application character map for conversion of composed 8-bit key codes in the keymap to UTF-8, and thus the argument of the "-m" parameter should be set to the encoding of the composed key codes in the keymap.
fr: Cette variable spécifie les arguments du programme <command>setfont</command>. En principe, ceci inclut le nom de la police, <quote>-m</quote> et le nom de la disposition de clavier de l'application à charger. Par exemple, pour charger la police <quote>lat1-16</quote> avec la disposition de clavier de l'application <quote>8859-1</quote>, (comme il convient aux États-Unis), réglez cette variable à <quote>lat1-16 -m 8859-1</quote>. En mode UTF-8, le noyau utilise la disposition de clavier de l'application pour la conversion de codes de touche 8-bits composés dans la disposition de clavier en UTF-8, et ainsi vous devriez initialiser l'argument du paramètre "-m" à l'encodage des codes de touche composés dans la disposition de clavier.

source: Set this variable to <quote>1</quote>, <quote>yes</quote> or <quote>true</quote> in order to put the console into UTF-8 mode. This is useful in UTF-8 based locales and harmful otherwise.
fr: Réglez cette variable à <quote>1</quote>, <quote>yes</quote> ou <quote>true</quote> afin de mettre la console en mode UTF-8. Ceci est utile pour les locales basées sur UTF-8 et nuisible sinon.

source: For many keyboard layouts, there is no stock Unicode keymap in the Kbd package. The <command>console</command> bootscript will convert an available keymap to UTF-8 on the fly if this variable is set to the encoding of the available non-UTF-8 keymap.
fr: Pour beaucoup de types de clavier, il n'y a pas de disposition de clavier pour le stock Unicode dans le paquet Kbd. Le script de démarrage <command>console</command> convertira une disposition de clavier disponible en UTF-8 au vol si cette variable est réglée à l'encodage de la disposition du clavier non UTF-8 disponible.

source: Some examples:
fr: Quelques exemples&nbsp;:

source: For a non-Unicode setup, only the KEYMAP and FONT variables are generally needed. E.g., for a Polish setup, one would use:
fr: Pour une initialisation non Unicode, en général seules les variables KEYMAP et FONT sont nécessaires. Par exemple, pour l'initialisation en polonais, on utiliserait&nbsp;:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console KEYMAP="pl2" FONT="lat2a-16 -m 8859-2" # End /etc/sysconfig/console</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Début de /etc/sysconfig/console KEYMAP="pl2" FONT="lat2a-16 -m 8859-2" # Fin de /etc/sysconfig/console</literal> EOF</userinput>

source: As mentioned above, it is sometimes necessary to adjust a stock keymap slightly. The following example adds the Euro symbol to the German keymap:
fr: Comme mentionné ci-dessus, il est parfois nécessaire d'ajuster légèrement une disposition de clavier stockée. L'exemple suivant ajoute le symbole Euro a la disposition allemande du clavier&nbsp;:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console KEYMAP="de-latin1" KEYMAP_CORRECTIONS="euro2" FONT="lat0-16 -m 8859-15" # End /etc/sysconfig/console</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Début de /etc/sysconfig/console KEYMAP="de-latin1" KEYMAP_CORRECTIONS="euro2" FONT="lat0-16 -m 8859-15" # Fin de /etc/sysconfig/console</literal> EOF</userinput>

source: The following is a Unicode-enabled example for Bulgarian, where a stock UTF-8 keymap exists:
fr: Ce qui suit est un exemple avec l'Unicode activé pour le bulgare, où une disposition du clavier UTF-8 stockée existe&nbsp;:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console UNICODE="1" KEYMAP="bg_bds-utf8" FONT="LatArCyrHeb-16" # End /etc/sysconfig/console</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Début de /etc/sysconfig/console UNICODE="1" KEYMAP="bg_bds-utf8" FONT="LatArCyrHeb-16" # Fin de /etc/sysconfig/console</literal> EOF</userinput>

source: Due to the use of a 512-glyph LatArCyrHeb-16 font in the previous example, bright colors are no longer available on the Linux console unless a framebuffer is used. If one wants to have bright colors without framebuffer and can live without characters not belonging to his language, it is still possible to use a language-specific 256-glyph font, as illustrated below:
fr: Du fait de l'utilisation d'une police 512-glyph LatArCyrHeb-16 dans l'exemple précédent, les couleurs brillantes ne sont plus disponibles sur la console Linux à moins qu'un framebuffer soit utilisé. Si vous voulez avoir les couleurs brillantes sans framebuffer et que vous pouvez vivre sans caractère n'appartenant pas à votre langue, il est encore possible d'utiliser une police 256-glyph spécifique à votre langue, comme illustré ci-dessous&nbsp;:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console UNICODE="1" KEYMAP="bg_bds-utf8" FONT="cyr-sun16" # End /etc/sysconfig/console</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Début de /etc/sysconfig/console UNICODE="1" KEYMAP="bg_bds-utf8" FONT="cyr-sun16" # Fin de /etc/sysconfig/console</literal> EOF</userinput>

source: The following example illustrates keymap autoconversion from ISO-8859-15 to UTF-8 and enabling dead keys in Unicode mode:
fr: L'exemple suivant illustre l'auto-conversion de la disposition de clavier d'ISO-8859-15 vers UTF-8 et l'activation des touches mortes en mode Unicode&nbsp;:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console UNICODE="1" KEYMAP="de-latin1" KEYMAP_CORRECTIONS="euro2" LEGACY_CHARSET="iso-8859-15" FONT="LatArCyrHeb-16 -m 8859-15" # End /etc/sysconfig/console</literal> EOF</userinput>
fr: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Début de /etc/sysconfig/console UNICODE="1" KEYMAP="de-latin1" KEYMAP_CORRECTIONS="euro2" LEGACY_CHARSET="iso-8859-15" FONT="LatArCyrHeb-16 -m 8859-15" # Fin de /etc/sysconfig/console</literal> EOF</userinput>

source: Some keymaps have dead keys (i.e., keys that don't produce a character by themselves, but put an accent on the character produced by the next key) or define composition rules (such as: <quote>press Ctrl+. A E to get &AElig;</quote> in the default keymap). Linux-&linux-version; interprets dead keys and composition rules in the keymap correctly only when the source characters to be composed together are not multibyte. This deficiency doesn't affect keymaps for European languages, because there accents are added to unaccented ASCII characters, or two ASCII characters are composed together. However, in UTF-8 mode it is a problem, e.g., for the Greek language, where one sometimes needs to put an accent on the letter <quote>alpha</quote>. The solution is either to avoid the use of UTF-8, or to install the X window system that doesn't have this limitation in its input handling.
fr: Certaines dispositions de codage ont des touches mortes (c-à-d que les touches qui ne produisent pas un caractère en elles-mêmes, mais mettent un accent sur le caractère produit par la touche suivante) ou définissent des règles de comportement (comme&nbsp;: <quote>Appuyez sur Ctrl+. A E pour obtenir &AElig;</quote> dans la disposition du clavier par défaut). Linux-&linux-version; n'interprète correctement les touches mortes et les règles de composition que quand les caractères source qui seront composés ensemble sont multi-octet. Ce défaut n'affecte pas les dispositions de clavier pour les langues européennes, car il y a des accents ajoutés à des caractères ASCII non accentués, ou deux caractères ASCII sont composés ensemble. Néanmoins en mode UTF-8, c'est un problème, comme pour la langue grecque, où on a parfois besoin de mettre un accent sur la lettre <quote>alpha</quote>. La solution consiste soit à éviter d'utiliser UTF-8, soit à installer le système de fenêtrage X qui n'a pas cette limitation dans sa gestion de l'entrée.

source: For Chinese, Japanese, Korean and some other languages, the Linux console cannot be configured to display the needed characters. Users who need such languages should install the X Window System, fonts that cover the necessary character ranges, and the proper input method (e.g., SCIM, it supports a wide variety of languages).
fr: Pour le chinois, le Japonais, le Coréen et certaines autres langues, la console Linux ne peut pas être configurée pour afficher les caractères nécessaires. Les utilisateurs qui ont besoin de telles langues devraient installer le système de fenêtrage X, dont les polices couvrent la plage de caractères nécessaire et qui a la bonne méthode d'entrée (par exemple SCIM prend en charge une large variété de langues).

source: The <filename>/etc/sysconfig/console</filename> file only controls the Linux text console localization. It has nothing to do with setting the proper keyboard layout and terminal fonts in the X Window System, with ssh sessions or with a serial console. In such situations, limitations mentioned in the last two list items above do not apply.
fr: Le fichier <filename>/etc/sysconfig/console</filename> ne contrôle que la localisation de la console texte de Linux. Cela n'a rien à voir avec le bon paramétrage du type de clavier et des polices du terminal dans le système de fenêtrage X, avec les sessions ssh ou une console série. Dans de telles situations, les limitations mentionnées dans les deux derniers points de la liste ci-dessus ne s'appliquent pas.

source: Creating Files at Boot
fr: Créer des fichiers au démarrage

source: At times, it is desired to create files at boot time. For instance, the <filename class="directory">/tmp/.ICE-unix</filename> directory may be desired. This can be done by creating an entry in the <filename>/etc/sysconfig/createfiles</filename> configuration script. The format of this file is embedded in the comments of the default configuration file.
fr: Parfois, on veut créer des fichiers lors du démarrage. Par exemple, vous pouvez souhaiter un répertoire <filename class="directory">/tmp/.ICE-unix</filename>. Vous pouvez le faire en modifiant une entrée du script de configuration <filename>/etc/sysconfig/createfiles</filename>. Le format de ce fichier est indiqué dans les commentaires du fichier de configuration par défaut.

source: Configuring the sysklogd Script
fr: Configurer le script sysklogd

source: The <filename>sysklogd</filename> script invokes the <command>syslogd</command> program as a part of System V initialization. The <parameter>-m 0</parameter> option turns off the periodic timestamp mark that <command>syslogd</command> writes to the log files every 20 minutes by default. If you want to turn on this periodic timestamp mark, edit <filename>/etc/sysconfig/rc.site</filename> and define the variable SYSKLOGD_PARMS to the desired value. For instance, to remove all parameters, set the variable to a null value:
fr: Le script <filename>sysklogd</filename> invoque le programme <command>syslogd</command> faisant partie de l'initialisation par System V. L'option <parameter>-m 0</parameter> désactive la marque périodique que <command>syslogd</command> écrit par défaut dans les fichiers journaux toutes les 20 minutes. Si vous voulez activer cet horodatage, éditez <filename>/etc/sysconfig/rc.site</filename> et définissez la variable SYSKLOGD_PARMS à la valeur désirée. Par exemple, pour supprimer tous les paramètres, réglez la variable à la valeur null&nbsp;:

source: See <userinput>man syslogd</userinput> for more options.
fr: Voir <userinput>man syslogd</userinput> pour plus d'options.

source: The rc.site File
fr: Le fichier rc.site

source: The optional <filename>/etc/sysconfig/rc.site</filename> file contains settings that are automatically set for each SystemV boot script. It can alternatively set the values specified in the <filename>hostname</filename>, <filename>console</filename>, and <filename>clock</filename> files in the <filename class='directory'>/etc/sysconfig/</filename> directory. If the associated variables are present in both these separate files and <filename>rc.site</filename>, the values in the script specific files have precedence.
fr: Le fichier facultatif <filename>/etc/sysconfig/rc.site</filename> contient les paramètres réglés automatiquement pour chaque script de démarrage de System V. Il peut aussi contrôler les valeurs des fichiers <filename>hostname</filename>, <filename>console</filename> et <filename>clock</filename> du répertoire <filename class='directory'>/etc/sysconfig/</filename>. Si les variables associées se trouvent à la fois dans ces fichiers distincts et dans <filename>rc.site</filename>, les valeurs des fichiers spécifiques ont la préséance.

source: <filename>rc.site</filename> also contains parameters that can customize other aspects of the boot process. Setting the IPROMPT variable will enable selective running of bootscripts. Other options are described in the file comments. The default version of the file is as follows:
fr: <filename>rc.site</filename> contient aussi des paramètres pour personnaliser d'autres aspects du processus de démarrage. Le réglage de la variable IPROMPT permettra un lancement sélectif des scripts de démarrage. D'autres options sont décrites dans les commentaires du fichier. La version par défaut du fichier est ci-dessous&nbsp;:

source: Customizing the Boot and Shutdown Scripts
fr: Personnaliser les scripts de démarrage et d'extinction

source: The LFS boot scripts boot and shut down a system in a fairly efficient manner, but there are a few tweaks that you can make in the rc.site file to improve speed even more and to adjust messages according to your preferences. To do this, adjust the settings in the <filename>/etc/sysconfig/rc.site</filename> file above.
fr: Les scripts de démarrage LFS démarrent et arrêtent un système d'une façon très efficace, mais vous pouvez faire quelques bidouillages dans le fichier rc.site pour améliorer encore davantage la vitesse et ajuster les messages selon vos préférences. Pour cela, ajustez les paramètres du fichier <filename>/etc/sysconfig/rc.site</filename> ci-dessus.

source: During the boot script <filename>udev</filename>, there is a call to <command>udev settle</command> that requires some time to complete. This time may or may not be required depending on devices present in the system. If you only have simple partitions and a single ethernet card, the boot process will probably not need to wait for this command. To skip it, set the variable OMIT_UDEV_SETTLE=y.
fr: Pendant le script de démarrage <filename>udev</filename>, un appel à <command>udev settle</command> demande du temps pour s'achever. Ce temps peut être ou pas nécessaire pour des périphériques présents dans votre système. Si vous n'avez que des partitions simples et une seule carte ethernet, le processus de démarrage n'aura probablement pas besoin d'attendre cette commande. Pour la sauter, définissez la variable OMIT_UDEV_SETTLE=y.

source: The boot script <filename>udev_retry</filename> also runs <command>udev settle</command> by default. This command is only needed by default if the <filename class='directory'>/var</filename> directory is separately mounted. This is because the clock needs the file <filename>/var/lib/hwclock/adjtime</filename>. Other customizations may also need to wait for udev to complete, but in many installations it is not needed. Skip the command by setting the variable OMIT_UDEV_RETRY_SETTLE=y.
fr: Le script de démarrage <filename>udev_retry</filename> lance aussi par défaut <command>udev settle</command>. Cette commande n'est nécessaire par défaut que si le répertoire <filename class='directory'>/var</filename> est monté séparément. Ceci car la vérification a besoin du fichier <filename>/var/lib/hwclock/adjtime</filename>. D'autres personnalisations peuvent nécessiter d'attendre qu'udev se termine mais dans beaucoup d'installations, ce n'est pas nécessaire. Sautez la commande en définissant la variable OMIT_UDEV_RETRY_SETTLE=y.

source: By default, the file system checks are silent. This can appear to be a delay during the bootup process. To turn on the <command>fsck</command> output, set the variable VERBOSE_FSCK=y.
fr: Par défaut, les vérifications des systèmes de fichiers sont sans message. Cela peut être vu comme un délai pendant le processus de démarrage. Pour activer la sortie de <command>fsck</command>, définissez la variable VERBOSE_FSCK=y.

source: When rebooting, you may want to skip the filesystem check, <command>fsck</command>, completely. To do this, either create the file <filename>/fastboot</filename> or reboot the system with the command <command>/sbin/shutdown -f -r now</command>. On the other hand, you can force all file systems to be checked by creating <filename>/forcefsck</filename> or running <command>shutdown</command> with the <parameter>-F</parameter> parameter instead of <parameter>-f</parameter>.
fr: Lors du redémarrage, il se peut que vous vouliez sauter la vérification du système de fichiers, <command>fsck</command>, complètement. Pour cela, soit créez le fichier <filename>/fastboot</filename>, soit redémarrez le système avec la commande <command>/sbin/shutdown -f -r now</command>. Inversement, vous pouvez forcer la vérification de tous les systèmes de fichiers en créant <filename>/forcefsck</filename> ou en lançant <command>shutdown</command> avec le paramètre <parameter>-F</parameter> plutôt que <parameter>-f</parameter>.

source: Setting the variable FASTBOOT=y will disable <command>fsck</command> during the boot process until it is removed. This is not recommended on a permanent basis.
fr: La définition de la variable FASTBOOT=y désactivera <command>fsck</command> lors du processus de démarrage jusqu'à ce qu'il soit supprimé. Ce n'est pas recommandé de façon permanente.

source: Normally, all files in the <filename class='directory'>/tmp</filename> directory are deleted at boot time. Depending on the number of files or directories present, this can cause a noticeable delay in the boot process. To skip removing these files set the variable SKIPTMPCLEAN=y.
fr: En principe, tous les fichiers du répertoire <filename class='directory'>/tmp</filename> sont effacés au moment du démarrage. Selon le nombre de fichiers ou de répertoires présents, cela peut provoquer un délai important dans le processus de démarrage. Pour sauter la suppression de ces fichiers, définissez la variable SKIPTMPCLEAN=y.
