Repository: espindula/br-lfs
Catalog: blfs/traduc/po/book/organization.xml.1.chaine.po
Languages: fr

source: Organization
fr: Organisation

source: This book is divided into the following parts.
fr: Ce livre est divisé en plusieurs parties.

source: Part I - Introduction
fr: Partie I - Introduction

source: This part contains information which is essential to the rest of the book.
fr: Cette partie contient des informations essentielles au reste du livre.

source: Part II - Post LFS Configuration and Extra Software
fr: Partie II - Configuration après LFS et logiciels supplémentaires

source: Here we introduce basic configuration and security issues.
fr: Nous présentons ici des questions de configuration et de sécurité de base.

source: We also discuss a range of editors, file systems, and shells which aren't covered in the main LFS book.
fr: Nous traitons aussi d'une série d'éditeurs, de systèmes de fichiers et de shells qui ne sont pas traités dans le LFS principal.

source: Part III - General Libraries and Utilities
fr: Partie III - Bibliothèques et outils généraux

source: In this section we cover libraries which are often needed by the rest of the book as well as system utilities.
fr: Dans cette section nous traitons des bibliothèques souvent nécessaires dans le reste du livre et des outils systèmes.

source: Information on Programming (including recompiling _A470_ to support its full range of languages) concludes this part.
fr: Des informations sur la programmation (comprenant la recompilation de _A470_ pour supporter tous ses langages) concluent cette partie.

source: Part IV - Basic Networking
fr: Partie IV - Le réseau de base

source: Here we cover how to connect to a network when you aren't using the simple static IP setup given in the main LFS book.
fr: Ici nous expliquons comment se connecter à un réseau lorsque vous n'utilisez pas un paramétrage IP statique simple fourni dans le livre LFS principal.

source: Networking libraries and command-line networking tools are also covered here.
fr: Les bibliothèques réseau et les outils réseau en ligne de commande représentent la majeure partie de cette partie.

source: Part V - Servers
fr: Partie V - Serveurs

source: Here we deal with setting up mail and other servers (such as _A121_ , _A506_ , etc. ).
fr: Nous traitons ici du paramétrage de serveurs de courrier ou autres (tels que _A121_ , _A506_ etc).

source: Part VI - X + Window Managers
fr: Partie VI - X + gestionnaires de fenêtres

source: This part explains how to set up a basic _A507_ installation along with some generic _A502_ libraries and Window managers.
fr: Cette partie explique comment paramétrer une installation _A507_ avec des bibliothèques _A502_ génériques et des gestionnaires de fenêtres.

source: Part VII - KDE
fr: Partie VII - KDE

source: For those who want to use the _A508_ or some parts of it, this part covers it.
fr: Pour ceux qui veulent utiliser le _A508_ ou certains de ses composants, cette partie en parle.

source: Part VIII - GNOME
fr: Partie VIII - GNOME

source: Part X - X Software
fr: Part X - Programmes X

source: Office programs and graphical web browsers are important to most people.
fr: Des programmes de bureautique et des navigateurs Internet graphiques sont importants pour la plupart des gens.

source: They, along with some generic _A502_ software can be found in this part of the book.
fr: Vous pouvez les trouver, ainsi que d'autres logiciels _A502_ dans cette partie du livre.

source: Part XI - Multimedia
fr: Partie XI - Multimédia

source: Here we cover setting multimedia libraries and drivers along with some audio, video and CD-writing programs.
fr: Nous traitons ici du paramétrage de bibliothèques et de pilotes multimédia ainsi que de certains programmes audio, vidéo et pour la gravure de CD.

source: Part XII - Printing, Scanning and Typesetting (PST)
fr: Partie XII - Imprimantes, scanners et polices (_fpo_Typesettting_fpf_)

source: The PST part of the book covers document handling with applications like _A219_ , _A444_ and _A509_ to installing _A419_ .
fr: La partie PST du livre traite la gestion de documents avec des applications comme _A219_ , _A444_ et _A509_ et par l'installation de _A419_.

source: Appendices
fr: Annexes

source: The Appendices cover information which doesn't belong in the main book; they are mainly there as a reference.
fr: Les Annexes traitent d'informations qui n'apparaissent pas dans le livre principal; elles sont principalement là en tant que référence.
