Repository: espindula/br-lfs
Catalog: blfs/traduc/po/book/preface.xml.1.chaine.po
Languages: fr

source: Preface
fr: Préface

source: Having helped out with Linux From Scratch for a short time, I noticed that we were getting many queries as to how to do things beyond the base LFS system.
fr: Ayant aidé sur Linux From Scratch pendant un bref moment, j'ai remarqué que nous avions beaucoup de demandes pour savoir comment faire des choses allant au-delà du système LFS de base.

source: At the time, the only assistance specifically offered relating to LFS were the LFS hints (_L581_ ).
fr: À cette époque, la seule aide qui était spécifiquement offerte à propos de LFS était les astuces LFS (. ).

source: BLFS aims to be more than the LFS-hints converted to XML although much of our work is based around the hints and indeed some authors write both hints and the relevant BLFS sections.
fr: BLFS a pour objectif d'être plus que les astuces LFS converties en XML, bien que la plupart de notre travail est basé sur les astuces et que, de fait, des auteurs écrivent à la fois des astuces et des sections BLFS adéquates.

source: We hope that we can provide you with enough information to not only manage to build your system up to what you want, whether it be a web server or a multimedia desktop system, but also that you will learn a lot about system configuration as you go.
fr: Nous espérons pouvoir vous fournir assez de renseignements pour, outre réussir à construire un système correspondant à ce que vous souhaitez, que ce soit un serveur Web ou un environnement de bureau multimédia, apprendre beaucoup sur la configuration d'un système comme vous l'entendez.

source: Thanks as ever go to everyone in the LFS/BLFS community; especially those who have contributed instructions, written text, answered questions and generally shouted when things were wrong!
fr: Merci infiniment à tous ceux de la communauté LFS/BLFS; surtout à ceux qui ont apporté des instructions, du texte écrit, qui ont répondu à des questions et, en général, qui se sont crashé quand les choses n'allaient pas!

source: Finally, we encourage you to become involved in the community; ask questions on the mailing list or news gateway and join in the fun on #lfs at irc.&lfs-domainname; .
fr: Enfin, nous vous encourageons à vous impliquer dans la communauté; poser des questions sur la liste de diffusion ou la passerelle de nouvelles, et nous rejoindre pour rire sur #lfs ou #lfs-fr sur irc.&lfs-domainname; .

source: You can find more details about all of these in the _X358_ section of the book.
fr: Vous pouvez trouver plus de détails sur tout cela dans la section _X358_ du livre.

source: Enjoy using BLFS.
fr: amusez-vous bien à utiliser BLFS.

source: Mark Hymers markh &lt;at&gt; &lfs-domainname; BLFS Editor (July 2001&ndash;March 2003)
fr: Mark Hymers markh &lt;at&gt; &lfs-domainname; Éditeur BLFS (juillet 2001&ndash;mars 2003)

source: I still remember how I found the BLFS project and started using the instructions that were completed at the time.
fr: Je me souviens encore de la façon dont j'ai découvert le projet BLFS et dont j'ai commencé à utiliser les instructions qui ont alors été complétées.

source: I could not believe how wonderful it was to get an application up and running very quickly, with explanations as to why things were done a certain way.
fr: Je n'arrivais pas à croire combien c'était agréable d'avoir une application à jour et qui s'exécute très rapidement, avec des explications sur pourquoi on fait les choses d'une certaine façon.

source: Unfortunately, for me, it wasn't long before I was opening applications that had nothing more than "To be done" on the page.
fr: Malheureusement pour moi, est arrivé rapidement le moment où j'ai ouvert des applications qui n'avaient rien de plus que "À faire" sur la page.

source: I did what most would do, I waited for someone else to do it.
fr: J'ai fait ce que beaucoup aurait fait, j'ai attendu que quelqu'un le fasse.

source: It wasn't too long before I am looking through _A570_ for something easy to do.
fr: Il n'a pas fallu longtemps avant que je cherche avec _A570_ quelque chose de facile à faire.

source: As with any learning experience, the definition of what was easy kept changing.
fr: Comme dans toute expérience d'apprentissage, la définition de ce qui était facile variait.

source: We still encourage you to become involved as BLFS is never really finished.
fr: Nous vous encourageons encore à vous investir car BLFS n'est jamais vraiment terminé.

source: Contributing or just using, we hope you enjoy your BLFS experience.
fr: En contribuant ou simplement en utilisant, nous espérons que vous vous amuserez bien dans votre expérience BLFS.

source: Larry Lawrence larry &lt;at&gt; &lfs-domainname; BLFS Editor (March 2003&ndash;June 2004)
fr: Larry Lawrence larry &lt;at&gt; &lfs-domainname; Editeur BLFS (mars 2003&ndash;juin 2004)

source: The BLFS project is a natural progression of LFS.
fr: Le projet BLFS est la progression naturelle de LFS.

source: Together, these projects provide a unique resource for the Open Source Community.
fr: Ces projets fournissent ensemble une ressource unique pour la communauté du logiciel libre.

source: They take the mystery out of the process of building a complete, functional software system from the source code contributed by many talented individuals throughout the world.
fr: Ils éclairent le mystère du processus de construction d'un système de logiciels complet et fonctionnel, à partir du code source, auquel beaucoup d'individus talentueux ont contribué à travers le monde.

source: They truly allow users to implement the slogan "Your distro, your rules."
fr: Ils permettent vraiment aux utilisateurs d'adopter le slogan "Votre distrib, vos règles"

source: Our goal is to continue to provide the best resource available that shows you how to integrate many significant Open Source applications.
fr: Notre but est de continuer à rendre disponible la meilleure ressource pour vous montrer comment intégrer beaucoup d'applications libres importantes.

source: Since these applications are constantly updated and new applications are developed, this book will never be complete.
fr: Comme ces applications sont mises à jour constamment et vu que de nouvelles applications sont développées, ce livre ne sera jamais fini.

source: Additionally, there is always room for improvement in explaining the nuances of how to install the different packages.
fr: En outre, il y a toujours de la place pour l'amélioration des explications des nuances sur la façon d'installer les différents paquets.

source: To make these improvements, we need your feedback.
fr: Pour faire ces améliorations, nous avons besoin de votre retour.

source: I encourage you to participate on the different mailing lists, news groups, and IRC channels to help meet these goals.
fr: Je vous encourage à participer aux différentes listes de diffusion, aux groupes de nouvelles et aux canaux IRC pour aider à atteindre ces buts.

source: Bruce Dubbs bdubbs &lt;at&gt; &lfs-domainname; BLFS Editor (June 2004&ndash;December 2006)
fr: Bruce Dubbs bdubbs &lt;at&gt; &lfs-domainname; Editeur BLFS (juin 2004&ndash;décembre 2006)

source: My introduction to the[B]LFS project was actually by accident.
fr: Ma découverte du projet[B]LFS s'est réellement faite par accident.

source: I was trying to build a _A58_ environment using some how-tos and other information I found on the web.
fr: J'essayais de construire un environnement _A58_ en utilisant des HowTos et d'autres informations que j'ai trouvé sur Internet.

source: A couple of times I ran into some build issues and Googling pulled up some old BLFS mailing list messages.
fr: J'ai rencontré deux fois des problèmes et une recherche sur Google m'a amené à de vieux messages de la liste de diffusion BLFS.

source: Out for curiosity, I visited the Linux From Scratch web site and shortly thereafter was hooked.
fr: Pris par la curiosité, j'ai visité le site Internet de Linux From Scratch et j'ai rapidement accroché.

source: I've not used any other Linux distribution for personal use since.
fr: Je n'ai depuis lors pas utilisé une autre distribution Linux pour mon usage personnel.

source: I can't promise anyone will feel the sense of satisfaction I felt after building my first few systems using[B]LFS instructions, but I sincerely hope that your BLFS experience is as rewarding for you as it has been for me.
fr: Je ne peux pas promettre que tout le monde ressentira le sentiment de satisfaction que j'ai ressenti après avoir construit mes premiers systèmes en utilisant les instructions de[B]LFS, mais j'espère sincèrement que votre expérience BLFS est autant glorifiante pour vous qu'elle l'a été pour moi.

source: The BLFS project has grown significantly the last couple of years.
fr: Le projet BLFS s'est agrandi de façon significative ces deux dernières années.

source: There are more package instructions and related dependencies than ever before.
fr: Il y a plus d'instructions de paquets et de dépendances liées qu'avant.

source: The project requires your input for continued success.
fr: Le projet a besoin de votre participation pour poursuivre son succès.

source: If you discover that you enjoy building BLFS, please consider helping out in any way you can.
fr: Si vous vous apercevez que vous vous amusez à construire BLFS, merci de penser à aider de la façon dont vous pouvez.

source: BLFS requires hundreds of hours of maintenance to keep it even semi-current.
fr: BLFS a besoin de centaines d'heures de maintenance pour rester au moins à moitié à jour.

source: If you feel confident enough in your editing skills, please consider joining the BLFS team.
fr: Si vous avez confiance en vos capacités de rédaction, merci d'envisager de rejoindre l'équipe BLFS.

source: Simply contributing to the mailing list discussions with sound advice and/or providing patches to the book's XML will probably result in you receiving an invitation to join the team.
fr: Une simple contribution aux discussions sur la liste de diffusion avec des conseils et/ou en fournissant des correctifs au XML du livre vous rapporteront probablement une invitation à rejoindre l'équipe.

source: Randy McMurchy randy &lt;at&gt; &lfs-domainname; BLFS Editor (December 2006&ndash;January 2011)
fr: Randy McMurchy randy &lt;at&gt; &lfs-domainname; Editeur BLFS (décembre 2006&ndash;janvier 2011)
