Repository: espindula/br-lfs
Catalog: clfs/*/bootable/ppc/yaboot.po
Languages: fr

source: Making the CLFS System Bootable
fr: Rendre le système CLFS démarrable

source: configuring
fr: configuration

source: Your shiny new CLFS system is almost complete. One of the last things to do is to ensure that the system can be properly booted. The instructions below apply only to NewWorld Macintoshes.
fr: Votre tout nouveau système CLFS est presque terminé. L'une des dernières étapes est de vous assurer que vous pouvez démarrer. Les instructions ci-dessous ne s'appliquent qu'aux Macintoshs NewWorld.

source: Boot loading can be a complex area, so a few cautionary words are in order. Be familiar with the current boot loader and any other operating systems present on the hard drive(s) that need to be bootable. Make sure that an emergency CD is ready to <quote>rescue</quote> the computer if it becomes un-bootable. It is also a good idea to enable booting from Open Firmware in case things go really wrong.
fr: Le démarrage est un domaine qui peut s'avérer complexe, donc quelques conseils de prudence s'imposent. Familiarisez-vous avec le chargeur d'amorçage actuel et tous les systèmes d'exploitation présents sur les disques qui devront être démarrables. Assurez-vous qu'un CD de secours est prêt à <quote>réparer</quote> l'ordinateur s'il devient impossible de le démarrer. C'est aussi une bonne idée d'activer le démarrage depuis Open Firmware s'il se passe quelque chose de vraiment mauvais.

source: Earlier, we compiled and installed the yaboot boot loader software in preparation for this step. The procedure involves writing the bootloader to a bootstrap partition and blessing it so that Open Firmware will boot from it. This is all handled by <command>ybin</command>, the yaboot installer.
fr: Plus tôt, nous avons compilé et installé le chargeur d'amorçage yaboot en prévision de cette étape. La procédure consiste à écrire le bootloader sur une partition bootstrap et la rendre démarrable pour qu'Open Firmware démarre dessus. Tout est géré par la commande <command>ybin</command>, l'installateur de yaboot.

source: Ybin writes an optional 'OS selector' menu into Open Firmware, then writes yaboot and <filename>yaboot.conf</filename> to the bootstrap partition, blesses this, and updates the boot device recorded in nvram. When booted, the OF provides the initial menu to choose between linux, boot from CD, and e.g. OSX (depending on what was in <filename>yaboot.conf</filename>). If you boot to 'linux', yaboot is executed and lets you select which kernel to use.
fr: Ybin écrit une menu de sélection de l'OS facultatif dans l'Open Firmware, puis écrit yaboot et son <filename>yaboot.conf</filename> dans la partition de bootstrap, l'active et met à jour le disque de démarrage dans la nvram. Au démarrage, l'OF fournit le menu initial pour choisir entre Linux, un CD et par exemple OSX (en fonction de ce qui se trouve dans <filename>yaboot.conf</filename>). Si vous démarrez «&nsbp;Linux&nbsp;», yaboot est exécuté et vous laissera choisir le noyau à utiliser.

source: Images (kernels) are specified, together with any necessary path, in <filename>yaboot.conf</filename> - the details are incorporated into the bootloader, but no attempt is made to access or validate the paths until they are selected. There are many possible options that can be specified in <filename>yaboot.conf</filename>, see the man page for the details. Most people will be able to specify device=hd: (for a single hard disk), but if you have multiple disks, or if you wish to be pedantic, you can specify the full OF path to the device, obtained by running <command>ofpath /dev/hdX</command> .
fr: Les images (noyaux) sont spécifiés, avec le chemin nécessaire, dans <filename>yaboot.conf</filename> — les détails sont inclus dans le chargeur d'amorçage, mais rien n'est fait pour accéder ou valider les chemin jusqu'à leur sélection. Il y a plusieurs options possibles qui peuvent être spécifiées dans <filename>yaboot.conf</filename>, regardez les pages de manuel pour plus de détails. La plupart des gens pourront spécifier device=hd: (pour un seul disque), mais si vous avez plus de disques, ou si vous êtes pointilleux, vous pouvez spécifier le chemin OF complet vers le disque, qu'on peut obtenir en lançant <command>ofpath /dev/hdX</command>.

source: Using the above information, determine the appropriate designators for the bootstrap partition and the root partition. For the following example, it is assumed that the bootstrap partition is <filename class="partition">hda2 </filename> and the root partition is <filename class="partition">hda7</filename>. We will also assume that you wish to be able to boot an OSX installation on <filename class="partition">hda4</filename>. Change these items as necessary for your machine.
fr: Avec les informations ci-dessus, déterminez les désignations appropriées pour la partition de bootstrap et la partition racine. Dans l'exemple suivant, nous supposerons que la partition de bootstrap est <filename class="partition">hda2</filename> et que la partition racine est <filename class="partition">hda7</filename>. Nous supposerons aussi que vous souhaitez démarrer un système OSX sur <filename class="partition">hda4</filename>. Changez ces valeurs comme nécessaire pour votre machine.

source: If your machine has a SATA disk, specify the partitions using <filename class="devicefile">/dev/sda7</filename> and so forth in the usual way. At least some of the distros specify a full OF path to the 'device' and to the image(s), such as <parameter>device=/ht@0,f2000000/pci@3/k2-sata-root@c/k2-sata@0/disk@0:</parameter> for the disk, and <parameter>image=/ht@0,f2000000/pci@3/k2-sata-root@c/k2-sata@0/disk@0:9,/boot/clfskernel-&linux-version2;</parameter> which definitely works.
fr: Si votre machine a un disque SATA, spécifiez les partition avec <filename class="devicefile">/dev/sda7</filename> etc, comme d'habitude. Certaines distributions spécifient le chemin OF complet vers le disque et les images, comme par exemple <parameter>device=/ht@0,f2000000/pci@3/k2-sata-root@c/k2-sata@0/disk@0:</parameter> pour le disque et <parameter>image=/ht@0,f2000000/pci@3/k2-sata-root@c/k2-sata@0/disk@0:9,/boot/clfskernel-&linux-version;</parameter> ce qui fonctionne toujours.

source: Create a <quote>yaboot.conf</quote> file defining yaboot's boot menu:
fr: Créez un fichier <quote>yaboot.conf</quote> pour définir le menu de démarrage de yaboot&nbsp;:

source: Add an entry for the host distribution, if you have one. It might look something like this if the kernel and initrd are in the host's '/' directory on <filename class="partition">hda6</filename>:
fr: Ajoutez une entrée pour la distribution hôte si vous en avez une. Cela peut ressembler à cela si le noyau et l'initrd sont dans le répertoire «&nsbp;/&nbsp;» sur <filename class="partition">hda6</filename>&nbsp;:

source: The following command will update the bootstrap partition and the boot variable in Open Firmware. Do not run the command if this is not desired.
fr: La commande suivante mettra à jour la partition bootstrap et la variable de démarrage dans l'Open Firmware. Ne lancez pas la commande si ce n'est pas souhaitable.

source: Alternatively, if the bootstrap partition has not already been initialized, perhaps because you are using a Live CD, you will need to use a different command to install the bootloader for the first time:
fr: Autrement, si la partition de bootstrap n'a pas déjà été initialisée, peut-être parce que vous utilisez un Live CD, vous devrez utiliser une autre commande pour installer le chargeur d'amorçage pour la première fois&nbsp;:
