Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/mailnews/mutt.xml.1.chaine.po
Languages: fr

source: 3.8 MB
fr: 3.8 Mo

source: 36 MB (plus a further 8MB for the PDF manual)
fr: 36 Mo (plus a further 8MB for the PDF manual)

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Mutt
fr: Installation de Mutt

source: This version of _A829_ is a development release.
fr: Cette version de _A829_ est une version de développement.

source: The BLFS editors have determined that it provides a stable program and fixes two issues in the current stable version of _A829_ :
fr: L'équipe BLFS a déterminé qu'elle fournit un programme stable et elle corrige deux problèmes dans la version stable actuelle de _A829_ :

source: a segmentation fault that occurs under certain conditions and a compilation problem when building with recent versions of _A267_ .
fr: une erreur de segmentation qui se produit dans certaines conditions et un problème de compilation lors d'une construction avec des versions récentes de _A267_.

source: You can add this group, if it does not exist, with this command:
fr: Vous pouvez ajouter ce groupe s'il n'existe pas avec cette command :

source: If you did not install an _X190_ , you need to modify the ownership of _F541_ with this command:
fr: Si vous n'avez pas installé un _X190_ , , vous devez modifier le propriétaire de _F541_ avec cette commande :

source: That will create an empty text file, so we will save the shipped file.
fr: Cela créera un fichier texte vide, alors nous enregistrerons le fichier fournit.

source: Install _A829_ by running the following commands:
fr: Installez _A829_ en lançant les commandes suivantes :

source: To generate the PDF manual with _X99_ , run the following command:
fr: Pour générer le manuel PDF avec _X99_ , lancez la commande suivante :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you generated the PDF manual, install it and the source TeX file by issuing the following command as the _U1_ user:
fr: Si vous avez généré le manuel PDF, installez-le avec le fichier source TeX en lançant les commandes suivantes en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch enables POP3 support.
fr: Ce paramètre active le support de POP3.

source: This switch enables IMAP support.
fr: Ce paramètre active le support d'IMAP.

source: This switch enables header caching.
fr: Ce paramètre active la mise en cache des en-têtes.

source: This switch disables _A830_ as the header cache backend.
fr: Ce paramètre désactive _A830_ en tant que support du cache d'en-tête.

source: This switch disables _A831_ as the header cache backend.
fr: Ce paramètre désactive _A831_ en tant que support du cache d'en-tête.

source: This switch enables _A336_ as the header cache backend.
fr: Ce paramètre active _A336_ en tant que support du cache d'en-tête.

source: This switch disables _A320_ as the header cache backend.
fr: Ce paramètre désactive _A320_ en tant que support du cache d'en-tête.

source: This switch enables SMTP relay support.
fr: Ce paramètre active le support du relai SMTP.

source: This parameter adds SSL/TLS support from _X91_ in POP3/IMAP/SMTP if they are enabled.
fr: Ce paramètre ajoute le support de SSL/TLS de _X91_ in POP3/IMAP/SMTP s'ils sont activés.

source: This parameter adds authentication support from _X92_ in POP3/IMAP/SMTP if they are enabled.
fr: Ce paramètre ajoute le support d'authentification de _X92_ en POP3/IMAP/SMTP s'ils sont activés.

source: Depending on the server configuration, this may not be needed for POP3 or IMAP.
fr: Selon la configuration du serveur, cela peut ne pas être nécessaire pour POP3 ou IMAP.

source: However, it is needed for SMTP authentication.
fr: Cependant, c'est nécessaire pour l'authentication SMTP.

source: Use _A328_ instead of _A166_ .
fr: Utilise _A328_ au lieu de _A166_.

source: if the text manual is now empty (_A81_ is installed, but without any of the specified text browsers), restore it from the copy.
fr: si le manuel test est maintenant vide (_A81_ est installé, mais aucun des navigateurs texte spécifié est installé), il est restauré depuis une copie.

source: Configuring Mutt
fr: Configurer Mutt

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: No changes in these files are necessary to begin using _A829_ .
fr: Aucun changement n'est nécessaire dans ces fichiers pour commencer à utiliser _A829_.

source: When you are ready to make changes, the man page for _F1031_ is a good starting place.
fr: Lorsque vous êtes prêt à faire des changements, la page de man pour _F1031_ sera un bon point de départ.

source: In order to utilize _A79_ , use the following command:
fr: Afin d'utiliser _A79_ , utilisez la commande suivante :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a bug submitter for _A829_ .
fr: est un soumetteur de bogues pour _A829_.

source: is a Mail User Agent (MUA) which enables you to read, write and delete your email.
fr: est un agent d'utilisateur courrier (_fpo_is a Mail User Agent_fpf_, MUA) qui vous permet de lire, écrire et et effacer votre courrier.

source: implements the mail spool file lock.
fr: implémente le verrouillage du fichier de spool de courrier.

source: is a script that executes _C2370_ .
fr: est un script qui exécute _C2370_.

source: prepares a command line for the _X47_ utilities.
fr: prépare une ligne de commande pour les outils _X47_.

source: is a key ring dumper for _L347_.
fr: est un générateur de trousseau de clés pour _L347_.

source: It is not needed for _X47_ .
fr: Il n'est pas nécessaire pour _X47_.

source: manages a keystore for S/MIME certificates.
fr: gère un ensemble de clé pour les certificats S/MIME.
