Repository: espindula/br-lfs
Catalog: blfs/traduc/po/gnome/platform/gvfs.xml.1.chaine.po
Languages: fr

source: 1.7 MB
fr: 1.7 Mo

source: 72 MB
fr: 72 Mo

source: Introduction to Gvfs
fr: Introduction à Gvfs

source: The _A1012_ package is a userspace virtual filesystem designed to work with the I/O abstractions of GLib's GIO library.
fr: Le paquet _A1012_ est un système de fichiers en espace utilisateur virtuel conçu pour fonctionner avec les abstractions I/O de la bibliothèque GIO de Glib.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Gvfs Dependencies
fr: Dépendances de Gvfs

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: Optional (Runtime)
fr: Optionnelles (Runtime)

source: User Notes:
fr: Notes utilisateur :

source: Install _A1012_ by running the following commands:
fr: Installez _A1012_ en lançant les commandes suivantes :

source: This package does not come with a working test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This switch is required if _A1013_ is not installed.
fr: Ce paramètre est requis si _A1013_ n'est pas installé.

source: Remove it if you installed _A1013_ and wish to use it with _A1012_ .
fr: Effacez le si vous avez installez _A1013_ et souhaitez l'utiliser avec _A1012_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: gvfs-cat, gvfs-copy, gvfs-info, gvfs-less, gvfs-ls, gvfs-mime, gvfs-mkdir, gvfs-monitor-dir, gvfs-monitor-file, gvfs-mount, gvfs-move, gvfs-open, gvfs-rename, gvfs-rm, gvfs-save, gvfs-set-attribute, gvfs-trash, and gvfs-tree
fr: gvfs-cat, gvfs-copy, gvfs-info, gvfs-less, gvfs-ls, gvfs-mime, gvfs-mkdir, gvfs-monitor-dir, gvfs-monitor-file, gvfs-mount, gvfs-move, gvfs-open, gvfs-rename, gvfs-rm, gvfs-save, gvfs-set-attribute, gvfs-trash, et gvfs-tree

source: libgvfscommon.so, libgvfsdaemon.so and some under /usr/lib/gio/modules/
fr: libgvfscommon.so, libgvfsdaemon.so et certaines sous /usr/lib/gio/modules/

source: /usr/include/gvfs-client and /usr/{lib, share}/gvfs
fr: /usr/include/gvfs-client et /usr/{lib, share}/gvfs

source: Short Descriptions
fr: Descriptions courtes

source: concatenates the given files and prints them to the standard output.
fr: concatène les fichiers données et les affiche sur la sortie standard.

source: copies a file from one URI location to another.
fr: copie un fichier depuis une adresse URI vers une autre.

source: shows information about the given locations.
fr: affiche des informations sur des endroits donnés.

source: executes _C1984_ using the VFS as input preprocesor, so less can access any resource accessible by any of the _A1012_ backends.
fr: exécute _C1984_ en utilisant VFS comme préprocesseur d'entrée, cependant less peut accéder à toutes les ressources accessibles par tous serveurs _A1012_.

source: lists information about the given locations.
fr: liste des informations sur des endroits donnés.

source: is used to query information about applications that are registered to handle a mime-type, or set the default handler for a mime-type.
fr: est utilisés pour obtenir des informations sur des applications qui sont enregistrés pour gérer un type mime, ou initialise les gestionnaires par défaut pour un type mime.

source: creates a directory specified by an URI.
fr: crée un répertoire spécifié par une URI.

source: prints information about file creation, deletion, file content and attribute changes and mount and unmount operations inside the specified directories.
fr: affiche des informations sur la création de fichier, l'effacement, le contenu de fichier et les changements d'attributs et les opérations de montage et démontage dans les répertoires spécifiés.

source: prints information about creation, deletion, content and attribute changes and mount and unmount operations affecting the monitored files.
fr: affiche des informations sur la création de fichier, l'effacement, le contenu de fichier et les changements d'attributs et les opérations de montage et démontage dans le système de fichiers surveillé.

source: provides commandline access to various aspects of GIOs mounting functionality.
fr: fournit un accès en ligne de commande aux différents aspects des fonctionnalités de montage de GIO.

source: moves a file from one URI location to another.
fr: déplace un fichier d'une URI sur une autre.

source: opens files with the default application that is registered to handle files of that type.
fr: ouvre des fichiers avec l'application par défaut qui est enregistrée pour gérer les fichiers de ce type.

source: changes the name of a file or directory.
fr: change le nom d'un fichier ou d'un répertoire.

source: removes a file.
fr: efface un fichier.

source: reads from the standard input and saves the data to the given location.
fr: lit depuis l'entrée standard et enregistre les données dans un endroit donné.

source: allows to set a file attribute on a file.
fr: autorise l'initialisation des attributs de fichier sur un fichier.

source: sends files or directories to the "Trashcan".
fr: envoit des fichiers ou des répertoires dans la poubelle.

source: lists the contents of the given directories recursively, in a tree-like format.
fr: liste le contenu de répertoires donnés récursivement dans un format en forme d'arbre.

source: contains the common API functions used in _A1012_ programs.
fr: contient les fonctions API usuels utilisées dans les programmes _A1012_.
