Repository: espindula/br-lfs
Catalog: blfs/*/multimedia/libdriv/libdvdcss.po
Languages: fr

source: 360 KB
fr: 360 Ko

source: 3.2 MB
fr: 3.2 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to libdvdcss
fr: Introduction à libdvdcss

source: <application>libdvdcss</application> is a simple library designed for accessing DVDs as a block device without having to bother about the decryption.
fr: <application>libdvdcss</application> est une bibliothèque simple conçue pour accéder aux DVD en tant que périphériques blocs sans se soucier du déchiffrement.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&libdvdcss-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&libdvdcss-download-http;"/>

source: Download (FTP): <ulink url="&libdvdcss-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&libdvdcss-download-ftp;"/>

source: Download MD5 sum: &libdvdcss-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &libdvdcss-md5sum;

source: Download size: &libdvdcss-size;
fr: Taille du téléchargement&nbsp;: &libdvdcss-size;

source: Estimated disk space required: &libdvdcss-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &libdvdcss-buildsize;

source: Estimated build time: &libdvdcss-time;
fr: Estimation du temps de construction&nbsp;: &libdvdcss-time;

source: libdvdcss Dependencies
fr: Dépendances de libdvdcss

source: Optional (to Create Documentation)
fr: Facultatives (pour créer la documentation)

source: User Notes: <ulink url="&blfs-wiki;/libdvdcss"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/libdvdcss"/>

source: Installation of libdvdcss
fr: Installation de libdvdcss

source: Install <application>libdvdcss</application> by running the following commands:
fr: Installez <application>libdvdcss</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: /usr/include/dvdcss and /usr/share/doc/libdvdcss-&libdvdcss-version;
fr: /usr/include/dvdcss et /usr/share/doc/libdvdcss-&libdvdcss-version;

source: Short Descriptions
fr: Descriptions courtes

source: provides the functionality that is required for transparent DVD access with CSS decryption.
fr: fournit les fonctionnalités requises pour l'accès transparent aux DVD avec le déchiffrement CSS.
