Repository: espindula/br-lfs
Catalog: blfs/*/general/genlib/qjson.po
Languages: fr

source: 64 KB
fr: 64 Ko

source: 1.4 MB
fr: 1.4 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to QJson
fr: Introduction à QJson

source: <application>QJson</application> is a Qt-based library that maps JSON data to QVariant objects and vice versa.
fr: <application>QJson</application> est une bibliothèque basée sur Qt qui associe les données JSON à des objets QVariant et vice versa.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&qjson-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&qjson-download-http;"/>

source: Download (FTP): <ulink url="&qjson-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&qjson-download-ftp;"/>

source: Download MD5 sum: &qjson-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &qjson-md5sum;

source: Download size: &qjson-size;
fr: Taille du téléchargement&nbsp;: &qjson-size;

source: Estimated disk space required: &qjson-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &qjson-buildsize;

source: Estimated build time: &qjson-time;
fr: Estimation du temps de construction&nbsp;: &qjson-time;

source: QJson Dependencies
fr: Dépendances de QJson

source: Required
fr: Requises

source: <xref linkend="qt4"/> and <xref linkend="cmake"/>
fr: <xref linkend="qt4"/> et <xref linkend="cmake"/>

source: User Notes: <ulink url="&blfs-wiki;/qjson"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/qjson"/>

source: Installation of QJson
fr: Installation de QJson

source: Install <application>QJson</application> by running the following commands:
fr: Installez <application>QJson</application> en lançant les commandes suivantes&nbsp;:

source: This package does not contain a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <option>-DCMAKE_BUILD_TYPE=Release</option>: This switch is used to build without debugging symbols and apply a higher level of compiler optimizations.
fr: <option>-DCMAKE_BUILD_TYPE=Release</option>&nbsp;: Ce paramètre est utilisé pour construire sans les symboles de débogage et applique un haut niveau d'optimisation à la compilation.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directory
fr: Répertoire installé

source: &qt4-dir;/include/json and &qt4-dir;/lib/cmake/qjson
fr: &qt4-dir;/include/json et &qt4-dir;/lib/cmake/qjson

source: Short Descriptions
fr: Descriptions courtes

source: contains <application>QJson</application> API functions.
fr: contient les fonctions API de <application>QJson</application>.
