Repository: espindula/br-lfs
Catalog: lfs/*/chapter06/introduction.po
Languages: fr

source: In this chapter, we enter the building site and start constructing the LFS system in earnest. That is, we chroot into the temporary mini Linux system, make a few final preparations, and then begin installing the packages.
fr: Dans ce chapitre, nous entrons dans le site de construction et lançons la construction du système LFS. Autrement dit, nous entrons avec chroot dans le mini système Linux temporaire, faisons quelques préparations finales et lançons l'installation de tous les paquets un par un.

source: The installation of this software is straightforward. Although in many cases the installation instructions could be made shorter and more generic, we have opted to provide the full instructions for every package to minimize the possibilities for mistakes. The key to learning what makes a Linux system work is to know what each package is used for and why you (or the system) may need it.
fr: Nous arrivons à la dernière étape de l'installation de ce logiciel. Bien que, dans beaucoup de cas, les instructions d'installation pourraient être plus courtes et plus génériques, nous avons opté pour fournir les instructions complètes pour chaque paquet et minimiser ainsi les possibilités d'erreurs. La clé pour apprendre ce qui fait fonctionner un système Linux est de savoir à quoi sert chaque paquet et pourquoi vous (ou le système) en avez besoin.

source: We do not recommend using optimizations. They can make a program run slightly faster, but they may also cause compilation difficulties and problems when running the program. If a package refuses to compile when using optimization, try to compile it without optimization and see if that fixes the problem. Even if the package does compile when using optimization, there is the risk it may have been compiled incorrectly because of the complex interactions between the code and build tools. Also note that the <option>-march</option> and <option>-mtune</option> options using values not specified in the book have not been tested. This may cause problems with the toolchain packages (Binutils, GCC and Glibc). The small potential gains achieved in using compiler optimizations are often outweighed by the risks. First-time builders of LFS are encouraged to build without custom optimizations. The subsequent system will still run very fast and be stable at the same time.
fr: Nous ne vous recommandons pas d'utiliser les optimisations. Elles peuvent faire qu'un programme s'exécute un peu plus rapidement mais elles peuvent aussi causer des problèmes de compilation et des difficultés à l'exécution de ce programme. Si un paquet refuse de compiler lors de l'utilisation d'optimisation, essayez de le compiler sans optimisation pour voir si cela corrige le problème. Même si le paquet compile avec les optimisations, il y a un risque qu'il ait été mal compilé à cause des interactions complexes entre le code et les outils de construction. Remarquez aussi que l'utilisation des options <option>-march</option> et <option>-mtune</option> peut causer des problèmes avec les paquets de la chaîne d'outils (Binutils, GCC et Glibc). Le petit potentiel de gains obtenu en utilisant les optimisations de compilation est souvent minime comparé aux risques. Les utilisateurs construisant une LFS pour la première fois sont encouragés à construire sans optimisations personnalisées. Le système sera toujours très rapide et restera stable en même temps.

source: The order that packages are installed in this chapter needs to be strictly followed to ensure that no program accidentally acquires a path referring to <filename class="directory">/tools</filename> hard-wired into it. For the same reason, do not compile separate packages in parallel. Compiling in parallel may save time (especially on dual-CPU machines), but it could result in a program containing a hard-wired path to <filename class="directory">/tools</filename>, which will cause the program to stop working when that directory is removed.
fr: L'ordre dans lequel les paquets sont installés dans ce chapitre a besoin d'être strictement suivi pour s'assurer qu'aucun programme n'acquiert accidentellement un chemin ayant comme référence <filename class="directory">/tools</filename> en dur. Pour la même raison, ne compilez pas des paquets en parallèle. La compilation en parallèle peut permettre de gagner du temps (tout particulièrement sur les machines à deux CPU), mais cela pourrait résulter en un programme contenant un chemin codé en dur vers <filename class="directory">/tools</filename>, ce qui fera arrêter le programme de fonctionner si ce répertoire est supprimé.

source: Before the installation instructions, each installation page provides information about the package, including a concise description of what it contains, approximately how long it will take to build, and how much disk space is required during this building process. Following the installation instructions, there is a list of programs and libraries (along with brief descriptions of these) that the package installs.
fr: Avant les instructions d'installation, chaque page d'installation fournit des informations sur le paquet, incluant une description concise de ce qu'il contient, approximativement combien de temps prendra la construction et les autres paquets nécessaires lors de cette étape de construction. Suivant les instructions d'installation, il existe une liste de programmes et de bibliothèques (avec quelques brèves descriptions de ceux-ci) que le paquet installe.

source: The SBU values and required disk space includes test suite data for all applicable packages in Chapter&nbsp;6.
fr: Les valeurs SBU et l'espace disque requis incluent les données de suites de tests pour tous les paquets du chapitre&nbsp;6 auxquels elles sont applicables.

source: About libraries
fr: À propos des bibliothèques

source: In general, the LFS editors discourage building and installing static libraries. The original purpose for most static libraries has been made obsolete in a modern Linux system. In addition linking a static library into a program can be detrimental. If an update to the library is needed to remove a security problem, all programs that use the static library will need to be relinked to the new library. Since the use of static libraries is not always obvious, the relevant programs (and the procedures needed to do the linking) may not even be known.
fr: En général, les éditeurs de LFS déconseillent la construction et l'installation de bibliothèques statiques. L'objectif original de la plupart des bibliothèques statique a été rendu obsolète dans un système Linux moderne. Par ailleurs la liaison statique de bibliothèques dans un programme peut être nuisible. Si une mise à jour des bibliothèques est nécessaire pour retirer un problème de sécurité, tous les programmes qui utilisent cette bibliothèque vont devoir être liés à nouveau vers la nouvelle bibliothèque. Depuis que l'utilisation de bibliothèques statiques n'est plus évident, les programmes relatifs (et les procédures de liage) ne doivent plus systématiquement être connues.

source: In the procedures in Chapter&nbsp;6, we remove or disable installation of most static libraries. Usually this is done by passing a <option>--disable-static</option> option to <command>configure</command>. In other cases, alternate means are needed. In a few cases, especially glibc and gcc, the use of static libraries remains essential to the general package building process.
fr: Dans les procédures du chapitre&nbsp;6, nous retirons ou désactivons l'installation de la plupart des bibliothèques statiques. Dans certains cas, en particulier pour glibc et gcc, l'utilisation de bibliothèques statique est indispensable au processus de construction du paquet en général. Généralement cela ce fait en activant le drapeau <option>--disable-static</option> lors de l'exécution de <command>configure</command>. Dans d'autres cas, des autres moyens sont nécessaires.

source: For a more complete discussion of libraries, see the discussion <ulink url="&blfs-root;/view/&short-version;/introduction/libraries.html"> Libraries: Static or shared?</ulink> in the BLFS book.
fr: Pour une discussion plus complète à propos des bibliothèques, regardez la discussion <ulink url="&blfs-book;/introduction/libraries.html">Bibliothèques&nbsp;: statiques ou partagées&nbsp;?</ulink> dans le livre BLFS.
