Repository: espindula/br-lfs
Catalog: lfs/*/chapter06/kernfs.po
Languages: fr, zh_cn

source: Preparing Virtual Kernel File Systems
fr: Préparer les systèmes de fichiers virtuels du noyau
zh_cn: 准备虚拟内核文件系统

source: Various file systems exported by the kernel are used to communicate to and from the kernel itself. These file systems are virtual in that no disk space is used for them. The content of the file systems resides in memory.
fr: Différents systèmes de fichiers exportés par le noyau sont utilisés pour communiquer avec le noyau lui-même. Ces systèmes de fichiers sont virtuels du fait qu'aucun espace disque n'est utilisé pour eux. Le contenu de ces systèmes de fichiers réside en mémoire.
zh_cn: 内核对外提供了一些文件系统，以便自己和用户空间进行通信。 它们是虚拟文件系统，并不占用磁盘空间，其内容保留在内存中。

source: Begin by creating directories onto which the file systems will be mounted:
fr: Commencez en créant les répertoires dans lesquels les systèmes de fichiers seront montés&nbsp;:
zh_cn: 首先创建这些文件系统的挂载点：

source: Creating Initial Device Nodes
fr: Création des nœuds initiaux vers les périphériques
zh_cn: 创建初始设备节点

source: When the kernel boots the system, it requires the presence of a few device nodes, in particular the <filename class="devicefile">console</filename> and <filename class="devicefile">null</filename> devices. The device nodes must be created on the hard disk so that they are available before <command>udevd</command> has been started, and additionally when Linux is started with <parameter>init=/bin/bash</parameter>. Create the devices by running the following commands:
fr: Quand le noyau démarre le système, il a besoin de la présence de quelques fichiers de périphériques, en particulier les périphériques <filename class="devicefile">console</filename> et <filename class="devicefile">null</filename>. Les n&oelig;uds de périphérique doivent être créés sur le disque dur afin d'être disponible avant que <command>udevd</command> n'ait été démarré et aussi quand Linux est démarré avec <parameter>init=/bin/bash</parameter>. Créez les périphériques en exécutant les commandes suivantes&nbsp;:
zh_cn: 在内核引导系统时，它需要一些设备节点，特别是 <filename class="devicefile">console</filename> 和 <filename class="devicefile">null</filename> 两个设备。它们需要创建在硬盘上，这样在 <command>udevd</command> 启动前即可使用，特别是在 Linux 使用 <parameter>init=/bin/bash</parameter> 内核选项启动的时候。运行以下命令创建它们：

source: Mounting and Populating /dev
fr: Monter et peupler /dev
zh_cn: 挂载和填充 /dev

source: The recommended method of populating the <filename class="directory">/dev</filename> directory with devices is to mount a virtual filesystem (such as <systemitem class="filesystem">tmpfs</systemitem>) on the <filename class="directory">/dev</filename> directory, and allow the devices to be created dynamically on that virtual filesystem as they are detected or accessed. Device creation is generally done during the boot process by Udev. Since this new system does not yet have Udev and has not yet been booted, it is necessary to mount and populate <filename class="directory">/dev</filename> manually. This is accomplished by bind mounting the host system's <filename class="directory">/dev</filename> directory. A bind mount is a special type of mount that allows you to create a mirror of a directory or mount point to some other location. Use the following command to achieve this:
fr: La méthode recommandée pour peupler le répertoire <filename class="directory">/dev</filename> de périphériques est de monter un système de fichiers virtuel (comme <systemitem class="filesystem">tmpfs</systemitem>) sur le répertoire <filename class="directory">/dev</filename>, et d'autoriser la création dynamique des périphériques sur le système de fichiers virtuel une fois qu'ils sont détectés ou que quelque chose tente d'y accéder. La création de périphériques est généralement faite par Udev lors du démarrage. Comme ce nouveau système ne contient pas encore Udev et n'a pas encore été démarré, il est nécessaire de monter et de peupler <filename class="directory">/dev</filename> manuellement. Cela se fait en montant en double le répertoire <filename class="directory">/dev</filename> du système hôte. Le montage en double est un type spécial de montage qui vous permet de créer le miroir d'un répertoire ou d'un point de montage à un autre endroit. Utilisez la commande suivante pour réaliser cela&nbsp;:
zh_cn: 用设备文件填充 <filename class="directory">/dev</filename> 目录的推荐方法是挂载一个虚拟文件系统 (例如 <systemitem class="filesystem">tmpfs</systemitem>) 到 <filename class="directory">/dev</filename>， 然后在设备被发现或访问时动态地创建设备文件。这个工作通常由 Udev 在系统引导时完成。然而，我们的新系统还没有 Udev，也没有被引导过，因此必须手工挂载和填充 <filename class="directory">/dev</filename>。这可以通过绑定挂载宿主系统的 <filename class="directory">/dev</filename> 目录就实现。绑定挂载是一种特殊挂载类型， 它允许在另外的位置创建某个目录或挂载点的映像。运行以下命令进行绑定挂载：

source: Mounting Virtual Kernel File Systems
fr: Monter les systèmes de fichiers virtuels du noyau
zh_cn: 挂载虚拟内核文件系统

source: Now mount the remaining virtual kernel filesystems:
fr: Maintenant montez les systèmes de fichiers virtuels du noyau qui en résultent&nbsp;:
zh_cn: 现在挂载其余的虚拟内核文件系统：

source: The meaning of the mount options for devpts:
fr: Voici la signification des options de montage de devpts&nbsp;:
zh_cn: devpts 挂载选项的含义：

source: This ensures that all devpts-created device nodes are owned by group ID 5. This is the ID we will use later on for the <systemitem class="groupname">tty</systemitem> group. We use the group ID instead of a name, since the host system might use a different ID for its <systemitem class="groupname">tty</systemitem> group.
fr: Cela garantit que tous les n&oelig;uds de périphérique créés par devpts appartiennent au groupe dont l'ID est 5. C'est l'ID que nous utiliserons plus tard pour le groupe <systemitem class="groupname">tty</systemitem>. Nous utilisons l'ID de groupe au lieu du nom, car il se pourrait que le système hôte utilise un ID différent pour son groupe <systemitem class="groupname">tty</systemitem>.
zh_cn: 这保证 devpts 创建的所有设备节点都属于 ID 为 5 的组。 我们之后会把这个 ID 分配给 <systemitem class="groupname"> tty</systemitem> 组。 这里使用组 ID 而不是名称，因为宿主系统的 <systemitem class="groupname">tty</systemitem> 组可能有不同的 ID。

source: This ensures that all devpts-created device nodes have mode 0620 (user readable and writable, group writable). Together with the option above, this ensures that devpts will create device nodes that meet the requirements of grantpt(), meaning the Glibc <command>pt_chown</command> helper binary (which is not installed by default) is not necessary.
fr: Cela garantit que tous les n&oelig;uds de périphérique créés par devpts ont le mode 0620 (lecture et écriture par l'utilisateur, écriture par le groupe). Combinée à l'option ci-dessus, cela garantit que devts créera des n&oelig;uds de périphérique correspondant aux exigences de grantpt(), c'est-à-dire que le binaire d'aide <command>pt_chown</command> de Glibc (qui n'est pas installé par défaut) n'est pas nécessaire.
zh_cn: 该选项确保 devpts 创建的所有设备节点具有权限码 0620 (所有者可读写，组成员可写)。 与上一个选项结合使用， 可以保证 devpts 创建符合 grantpt() 要求的设备节点，摆脱对 Glibc <command>pt_chown</command> 辅助程序 (默认不安装) 的依赖。

source: In some host systems, <filename>/dev/shm</filename> is a symbolic link to <filename class="directory">/run/shm</filename>. The /run tmpfs was mounted above so in this case only a directory needs to be created.
fr: Dans certains systèmes hôtes, <filename>/dev/shm</filename> est un lien symbolique vers <filename class="directory">/run/shm</filename>. Le tmpfs /run a été monté tout à l'heure, donc vous ne devez créer un répertoire que dans ce cas précis.
zh_cn: 在某些宿主系统上，<filename>/dev/shm</filename> 是一个指向 <filename class="directory">/run/shm</filename> 的符号链接。 我们已经在 /run 下挂载了 tmpfs 文件系统，因此在这里只需要创建一个目录。
