Repository: espindula/br-lfs
Catalog: lfs/*/chapter06/pkgmgt.po
Languages: fr

source: Package Management
fr: Gestion de paquets

source: Package Management is an often requested addition to the LFS Book. A Package Manager allows tracking the installation of files making it easy to remove and upgrade packages. As well as the binary and library files, a package manager will handle the installation of configuration files. Before you begin to wonder, NO&mdash;this section will not talk about nor recommend any particular package manager. What it provides is a roundup of the more popular techniques and how they work. The perfect package manager for you may be among these techniques or may be a combination of two or more of these techniques. This section briefly mentions issues that may arise when upgrading packages.
fr: La gestion de paquets est un ajout souvent demandé au livre LFS. Un gestionnaire de paquets permet de conserver une trace des fichiers installés, simplifiant ainsi leur suppression ou leur mise à jour. Un gestionnaire de paquets gérera tant les fichiers binaires et de bibliothèque que l'installation des fichiers de configuration. Avant tout, NON&mdash;cette section ne parle pas d'un gestionnaire de paquets particulier, elle n'en recommande pas non plus. Elle fait un tour des techniques les plus populaires pour indiquer comment elles fonctionnent. Le parfait gestionnaire de paquets pourrait faire partie de ces techniques ou pourrait être une combinaison d'une ou plusieurs techniques. Cette section mentionne brièvement les problèmes pouvant survenir lors de la mise à jour des paquets.

source: Some reasons why no package manager is mentioned in LFS or BLFS include:
fr: Parmi les raisons de l'absence d'un gestionnaire de paquets mentionné dans LFS ou BLFS&nbsp;:

source: Dealing with package management takes the focus away from the goals of these books&mdash;teaching how a Linux system is built.
fr: S'occuper de la gestion de paquets est en dehors des buts de ces livres&mdash; visant à apprendre comment un système Linux est construit.

source: There are multiple solutions for package management, each having its strengths and drawbacks. Including one that satisfies all audiences is difficult.
fr: Il existe de nombreuses solutions pour la gestion de paquets, chacune ayant ses forces et ses faiblesses. En inclure une qui satisfait tout le monde est difficile.

source: There are some hints written on the topic of package management. Visit the <ulink url="&hints-index;">Hints Project</ulink> and see if one of them fits your need.
fr: Des astuces ont été écrites sur le thème de la gestion de paquets. Visitez le <ulink url="&hints-index;">Projet des astuces</ulink> et voyez celui qui satisfait vos besoins.

source: Upgrade Issues
fr: Problèmes de mise à jour

source: A Package Manager makes it easy to upgrade to newer versions when they are released. Generally the instructions in the LFS and BLFS Book can be used to upgrade to the newer versions. Here are some points that you should be aware of when upgrading packages, especially on a running system.
fr: Un gestionnaire de paquets facilite la mise à jour des nouvelles versions au moment de leur sortie. Généralement, les instructions dans les livres LFS et BLFS peuvent être utilisées pour les nouvelles versions. Voici quelques points à connaître pour une mise à jour de paquets, spécifiquement sur un système en cours de fonctionnement

source: If Glibc needs to be upgraded to a newer version, (e.g. from glibc-2.19 to glibc-2.20, it is safer to rebuild LFS. Though you <emphasis>may</emphasis> be able to rebuild all the packages in their dependency order, we do not recommend it.
fr: Il est plus sûr, si Glibc doit être mis à jour vers une nouvelle version (par exemple, glibc-2.19 vers glibc-2.20), de reconstruire LFS. Bien que vous <emphasis>pourriez</emphasis> être capable de ne pas reconstruire tous les paquets dans leur ordre de dépendances, nous ne vous le recommandons pas.

source: If a package containing a shared library is updated, and if the name of the library changes, then all the packages dynamically linked to the library need to be recompiled to link against the newer library. (Note that there is no correlation between the package version and the name of the library.) For example, consider a package foo-1.2.3 that installs a shared library with name <filename class='libraryfile'>libfoo.so.1</filename>. Say you upgrade the package to a newer version foo-1.2.4 that installs a shared library with name <filename class='libraryfile'>libfoo.so.2</filename>. In this case, all packages that are dynamically linked to <filename class='libraryfile'>libfoo.so.1</filename> need to be recompiled to link against <filename class='libraryfile'>libfoo.so.2</filename>. Note that you should not remove the previous libraries until the dependent packages are recompiled.
fr: Si un paquet contenant une bibliothèque partagée est mise à jour et si le nom de cette dernière est modifié, alors les paquets liés dynamiquement à la bibliothèque devront être recompilés pour être liés à la nouvelle bibliothèque. (Remarquez qu'il n'y a aucune corrélation entre la version du paquet et le nom de la bibliothèque.) Par exemple, considérez un paquet foo-1.2.3 qui installe une bibliothèque partagée de nom <filename class='libraryfile'>libfoo.so.1</filename>. Disons que vous mettez à jour le paquet avec une nouvelle version foo-1.2.4 qui installe une bibliothèque partagée de nom <filename class='libraryfile'>libfoo.so.2</filename>. Dans ce cas, tous les paquets liés dynamiquement à <filename class='libraryfile'>libfoo.so.1</filename> doivent être recompilés pour être liés à <filename class='libraryfile'>libfoo.so.2</filename>. Remarquez que vous ne devez pas supprimer les anciennes bibliothèques jusqu'à ce que les paquets indépendants soient recompilés.

source: Package Management Techniques
fr: Techniques de gestion de paquets

source: The following are some common package management techniques. Before making a decision on a package manager, do some research on the various techniques, particularly the drawbacks of the particular scheme.
fr: Ce qui suit est une liste de techniques habituelles de gestion de paquets. Avant de prendre une décision sur un gestionnaire de paquets, faites une recherche sur les différentes techniques et notamment leurs faiblesses.

source: It is All in My Head!
fr: Tout est dans ma tête&nbsp;!

source: Yes, this is a package management technique. Some folks do not find the need for a package manager because they know the packages intimately and know what files are installed by each package. Some users also do not need any package management because they plan on rebuilding the entire system when a package is changed.
fr: Oui, c'est une technique de gestion de paquets. Certains n'éprouvent pas le besoin d'un gestionnaire de paquets parce qu'ils connaissent très bien les paquets et connaissent les fichiers installés par chaque paquet. Certains utilisateurs n'en ont pas besoin parce qu'ils planifient la reconstruction entière de LFS lorsqu'un paquet est modifié.

source: Install in Separate Directories
fr: Installer dans des répertoires séparés

source: This is a simplistic package management that does not need any extra package to manage the installations. Each package is installed in a separate directory. For example, package foo-1.1 is installed in <filename class='directory'>/usr/pkg/foo-1.1</filename> and a symlink is made from <filename>/usr/pkg/foo</filename> to <filename class='directory'>/usr/pkg/foo-1.1</filename>. When installing a new version foo-1.2, it is installed in <filename class='directory'>/usr/pkg/foo-1.2</filename> and the previous symlink is replaced by a symlink to the new version.
fr: C'est une gestion des paquets tellement simple qu'elle ne nécessite aucun paquet supplémentaire pour gérer les installations. Chaque paquet est installé dans un répertoire séparé. Par exemple, le paquet foo-1.1 est installé dans <filename class='directory'>/usr/pkg/foo-1.1</filename> et un lien symbolique est créé de <filename>/usr/pkg/foo</filename> vers <filename class='directory'>/usr/pkg/foo-1.1</filename>. Lors de l'installation de la nouvelle version foo-1.2, elle est installée dans <filename class='directory'>/usr/pkg/foo-1.2</filename> et l'ancien lien symbolique est remplacé par un lien symbolique vers la nouvelle version.

source: Environment variables such as <envar>PATH</envar>, <envar>LD_LIBRARY_PATH</envar>, <envar>MANPATH</envar>, <envar>INFOPATH</envar> and <envar>CPPFLAGS</envar> need to be expanded to include <filename>/usr/pkg/foo</filename>. For more than a few packages, this scheme becomes unmanageable.
fr: Les variables d'environnement telles que <envar>PATH</envar>, <envar>LD_LIBRARY_PATH</envar>, <envar>MANPATH</envar>, <envar>INFOPATH</envar> et <envar>CPPFLAGS</envar> ont besoin d'être étendues pour inclure <filename>/usr/pkg/foo</filename>. Pour plus que quelques paquets, ce schéma devient ingérable.

source: Symlink Style Package Management
fr: Gestion de paquet par lien symbolique

source: This is a variation of the previous package management technique. Each package is installed similar to the previous scheme. But instead of making the symlink, each file is symlinked into the <filename class='directory'>/usr</filename> hierarchy. This removes the need to expand the environment variables. Though the symlinks can be created by the user to automate the creation, many package managers have been written using this approach. A few of the popular ones include Stow, Epkg, Graft, and Depot.
fr: C'est une variante de la technique précédente. Chaque paquet est installé de façon similaire au schéma précédent. Mais au lieu de réaliser le lien symbolique, chaque fichier dispose d'un lien symbolique vers son équivalent dans la hiérarchie <filename class='directory'>/usr</filename>. Ceci supprime le besoin d'étendre les variables d'environnement. Bien que les liens symboliques peuvent être créés par l'utilisateur, pour automatiser la création, certains gestionnaires de paquets ont été écrits avec cette approche. Parmi les plus populaires se trouvent Stow, Epkg, Graft et Depot.

source: The installation needs to be faked, so that the package thinks that it is installed in <filename class="directory">/usr</filename> though in reality it is installed in the <filename class="directory">/usr/pkg</filename> hierarchy. Installing in this manner is not usually a trivial task. For example, consider that you are installing a package libfoo-1.1. The following instructions may not install the package properly:
fr: L'installation doit être faussée, de façon à ce que chaque paquet pense qu'il est installé dans <filename class="directory">/usr</filename> alors qu'en réalité il est installé dans la hiérarchie <filename class="directory">/usr/pkg</filename>. Installer de cette manière n'est généralement pas une tâche triviale. Par exemple, considérez que vous installez un paquet libfoo-1.1. Les instructions suivantes pourraient ne pas installer correctement le paquet&nbsp;:

source: The installation will work, but the dependent packages may not link to libfoo as you would expect. If you compile a package that links against libfoo, you may notice that it is linked to <filename class='libraryfile'>/usr/pkg/libfoo/1.1/lib/libfoo.so.1</filename> instead of <filename class='libraryfile'>/usr/lib/libfoo.so.1</filename> as you would expect. The correct approach is to use the <envar>DESTDIR</envar> strategy to fake installation of the package. This approach works as follows:
fr: L'installation fonctionnera mais les paquets dépendants pourraient ne pas lier libfoo comme vous vous y attendriez. Si vous compilez un paquet qui se lie à <filename class='libraryfile'>/usr/pkg/libfoo/1.1/lib/libfoo.so.1</filename> au lieu de <filename class='libraryfile'>/usr/lib/libfoo.so.1</filename> comme vous le prévoyez. La bonne approche est d'utiliser la stratégie <envar>DESTDIR</envar> pour fausser l'installation du paquet. Cette approche fonctionne ainsi&nbsp;:

source: Most packages support this approach, but there are some which do not. For the non-compliant packages, you may either need to manually install the package, or you may find that it is easier to install some problematic packages into <filename class='directory'>/opt</filename>.
fr: La plupart des paquets supportent cette approche mais elle pose problème à certains. Pour les paquets non compatibles, vous pouvez soit les installer manuellement soit trouver plus simple d'installer les paquets problématiques dans <filename class='directory'>/opt</filename>.

source: Timestamp Based
fr: Basé sur le temps

source: In this technique, a file is timestamped before the installation of the package. After the installation, a simple use of the <command>find</command> command with the appropriate options can generate a log of all the files installed after the timestamp file was created. A package manager written with this approach is install-log.
fr: Avec cette technique, un fichier est balisé avec l'heure avant l'installation du paquet. Après l'installation, une simple utilisation de la commande <command>find</command> avec les options appropriées peut générer une trace de tous les fichiers installés après que le fichier temps ne soit créé. install-log est un gestionnaire de paquets écrit avec cette approche.

source: Though this scheme has the advantage of being simple, it has two drawbacks. If, during installation, the files are installed with any timestamp other than the current time, those files will not be tracked by the package manager. Also, this scheme can only be used when one package is installed at a time. The logs are not reliable if two packages are being installed on two different consoles.
fr: Bien que ce schéma a l'avantage d'être simple, il a deux inconvénients. Si à l'installation, les fichiers sont installés sans balise de temps autre que l'heure actuelle, ces fichiers ne seront pas suivis par le gestionnaire de paquets. De plus, ce schéma peut seulement être utilisé lorsqu'un seul paquet est installé à la fois. Les traces ne sont pas fiables si deux paquets sont installés dans deux consoles différentes.

source: Tracing Installation Scripts
fr: Tracer les scripts d'installation

source: In this approach, the commands that the installation scripts perform are recorded. There are two techniques that one can use:
fr: Avec cette approche, les commandes que les scripts d'installation accomplissent sont enregistrées. Il y a deux techniques que vous pouvez utiliser&nbsp;:

source: The <envar>LD_PRELOAD</envar> environment variable can be set to point to a library to be preloaded before installation. During installation, this library tracks the packages that are being installed by attaching itself to various executables such as <command>cp</command>, <command>install</command>, <command>mv</command> and tracking the system calls that modify the filesystem. For this approach to work, all the executables need to be dynamically linked without the suid or sgid bit. Preloading the library may cause some unwanted side-effects during installation. Therefore, it is advised that one performs some tests to ensure that the package manager does not break anything and logs all the appropriate files.
fr: Vous pouvez initialiser la variable d'environnement <envar>LD_PRELOAD</envar> pour qu'elle pointe vers une bibliothèque à précharger avant l'installation. Lors de l'utilisation de cette dernière, cette bibliothèque trace les paquets en cours d'installation en s'attachant eux-mêmes aux différents exécutables comme <command>cp</command>, <command>install</command>, <command>mv</command> et trace les appels système qui modifient le système de fichiers. Pour que cette approche fonctionne, tous les exécutables ont besoin d'être liés dynamiquement sans bit suid ou sgid. Le préchargement de la bibliothèque pourrait causer quelques effets de bord involontaires lors de l'installation&nbsp;; donc, réalisez quelques tests pour vous assurer que le gestionnaire de paquets ne casse rien et trace bien tous les fichiers appropriés.

source: The second technique is to use <command>strace</command>, which logs all system calls made during the execution of the installation scripts.
fr: La seconde technique est d'utiliier <command>strace</command>, qui trace tous les appels du système faits pendant l'exécution des scripts d'installation.

source: Creating Package Archives
fr: Créer des archives de paquets

source: In this scheme, the package installation is faked into a separate tree as described in the Symlink style package management. After the installation, a package archive is created using the installed files. This archive is then used to install the package either on the local machine or can even be used to install the package on other machines.
fr: Dans ce schéma, l'installation d'un paquet est faussée dans un répertoire séparé comme décrit plus haut. Après l'installation, une archive du paquet est créée en utilisant les fichiers installés. L'archive est ensuite utilisée pour installer le paquet soit sur la machine locale soit même sûr d'autres machines.

source: This approach is used by most of the package managers found in the commercial distributions. Examples of package managers that follow this approach are RPM (which, incidentally, is required by the <ulink url="http://refspecs.linuxfoundation.org/lsb.shtml">Linux Standard Base Specification</ulink>), pkg-utils, Debian's apt, and Gentoo's Portage system. A hint describing how to adopt this style of package management for LFS systems is located at <ulink url="&hints-root;fakeroot.txt"/>.
fr: Cette approche est utilisée par la plupart des gestionnaires de paquets trouvés dans les distributions commerciales. Les exemples de gestionnaires qui suivent cette approche sont RPM (qui est parfois requis par la <ulink url="http://refspecs.linuxfoundation.org/lsb.shtml">Spécification de base de Linux Standard</ulink>), pkg-utils, apt de Debian, et le système de portage de Gentoo. Une astuce décrivant comment adopter ce style de gestion de paquets pour les systèmes LFS se trouve à <ulink url="http://www.fr.linuxfromscratch.org/view/astuces/fakeroot-fr.txt"/>.

source: Creation of package files that include dependency information is complex and is beyond the scope of LFS.
fr: La création de fichiers de paquet qui incluent des informations de dépendance est complexe et va au-delà de l'objectif de LFS.

source: Slackware uses a <command>tar</command> based system for package archives. This system purposely does not handle package dependencies as more complex package managers do. For details of Slackware package management, see <ulink url="http://www.slackbook.org/html/package-management.html"/>.
fr: Slackware utilise un système basé sur <command>tar</command> pour les archives de paquets. Ce système ne gère volontairement pas les dépendances de paquets car d'autres gestionnaires de paquets plus complexes le font. Pour des détails sur la gestion de paquets, voir <ulink url="http://www.slackbook.org/html/package-management.html"/>.

source: User Based Management
fr: Gestion basée sur les utilisateurs

source: This scheme, unique to LFS, was devised by Matthias Benkmann, and is available from the <ulink url="&hints-index;">Hints Project</ulink>. In this scheme, each package is installed as a separate user into the standard locations. Files belonging to a package are easily identified by checking the user ID. The features and shortcomings of this approach are too complex to describe in this section. For the details please see the hint at <ulink url="&hints-root;more_control_and_pkg_man.txt"/>.
fr: Ce schéma, unique à LFS, a été décrit par Matthias Benkmann et est disponible sur le <ulink url="&hints-index;">Projet des astuces</ulink>. Dans ce schéma, chaque paquet est installé en tant qu'utilisateur séparé dans les emplacements standards. Les fichiers appartenant à un paquet sont facilement identifiés grâce à l'identifiant de l'utilisateur. Les fonctionnalités et avantages de cette approche sont trop complexes pour les décrire dans cette section. Pour plus de détails, voir l'astuce sur <ulink url="http://www.fr.linuxfromscratch.org/view/astuces/gestionnaire-paquets-utilisateur.txt"/>.

source: Deploying LFS on Multiple Systems
fr: Déployer LFS sur plusieurs systèmes

source: One of the advantages of an LFS system is that there are no files that depend on the position of files on a disk system. Cloning an LFS build to another computer with the same architecture as the base system is as simple as using <command>tar</command> on the LFS partition that contains the root directory (about 250MB uncompressed for a base LFS build), copying that file via network transfer or CD-ROM to the new system and expanding it. From that point, a few configuration files will have to be changed. Configuration files that may need to be updated include: <filename>/etc/hosts</filename>, <filename>/etc/fstab</filename>, <filename>/etc/passwd</filename>, <filename>/etc/group</filename>, <phrase revision="systemd"> <filename>/etc/shadow</filename>, and <filename>/etc/ld.so.conf</filename>. </phrase> <phrase revision="sysv"> <filename>/etc/shadow</filename>, <filename>/etc/ld.so.conf</filename>, <filename>/etc/sysconfig/rc.site</filename>, <filename>/etc/sysconfig/network</filename>, and <filename>/etc/sysconfig/ifconfig.eth0</filename>. </phrase>
fr: Un des avantages du système LFS est qu'il n'y a pas de fichiers dépendant de la position des fichiers sur un système de disque. Cloner la construction d'un système LFS sur un autre ordinateur avec une architecture similaire au système de base est aussi facile que l'utilisation de <command>tar</command> sur la partition LFS qui contient le répertoire racine (environ 250Mo décompressés pour une construction LFS de base), en copiant ce fichier via un transfert par réseau ou par CD-ROM vers le nouveau système et en le décompressant. À partir de là, vous devrez modifier quelques fichiers de configuration. Les fichiers de configuration que vous pouvez devoir mettre à jour comprennent&nbsp;: <filename>/etc/hosts</filename>, <filename>/etc/fstab</filename>, <filename>/etc/passwd</filename>, <filename>/etc/group</filename>, <phrase revision="systemd"> <filename>/etc/shadow</filename> et <filename>/etc/ld.so.conf</filename>. </phrase> <phrase revision="sysv"> <filename>/etc/shadow</filename>, <filename>/etc/ld.so.conf</filename>, <filename>/etc/sysconfig/rc.site</filename>, <filename>/etc/sysconfig/network</filename> et <filename>/etc/sysconfig/ifconfig.eth0</filename>. </phrase>

source: A custom kernel may need to be built for the new system depending on differences in system hardware and the original kernel configuration.
fr: Vous pouvez construire un noyau personnalisé pour le nouveau système, selon les différences du matériel du système avec la configuration du noyau initial.

source: There have been some reports of issues when copying between similar but not identical architectures. For instance, the instruction set for an Intel system is not identical with an AMD processor and later versions of some processors may have instructions that are unavailable in earlier versions.
fr: Il y a eu quelques rapports de problèmes lors de la copie entre architectures similaires mais non identiques. Par exemple, l'ensemble d'instructions pour l'architecture Intel n'est pas identique avec celle pour un processeur AMD et les versions plus récentes de certains processeurs peuvent avoir des instructions qui ne sont pas disponibles pour des versions antérieures

source: Finally the new system has to be made bootable via <xref linkend="ch-bootable-grub"/>.
fr: Enfin, vous devez rendre le nouveau système amorçable via <xref linkend="ch-bootable-grub"/>.
