<sect2><title>Contenu</title>

<sect3><title>Programmes</title>
<para>captoinfo (lien vers tic), clear, infocmp, infotocap (lien vers tic),
reset (lien vers tset), tack, tic, toe, tput et tset.</para></sect3>

<sect3><title>Descriptions</title>

<sect4><title>captoinfo</title>
<para>captoinfo convertit une description termcap en une description
au format terminfo.</para></sect4>

<sect4><title>clear</title>
<para>Le programme clear efface l'&eacute;cran si cela est possible. Il utilise les
variables d'environnement pour d&eacute;terminer le type de terminal puis se renseigne
dans la base de donn&eacute;es terminfo pour trouver les commandes d'effacement de 
l'&eacute;cran.</para></sect4>

<sect4><title>infocmp</title>
<para>Le programme infocmp peut &ecirc;tre utilis&eacute; pour comparer deux entr&eacute;es binaires
de terminfo, r&eacute;-&eacute;crire une description de terminfo avec l'avantage du champ terminfo
use=, ou afficher une description terminfo depuis le fichier binaire (term) 
dans une vari&eacute;t&eacute; de formats (fonctionnement inverse de tic).</para></sect4>

<sect4><title>infotocap</title>
<para>infotocap convertit convertit une description terminfo en une description
au format termcap.</para></sect4>

<sect4><title>reset</title>
<para>reset met en place les modes cooked et echo, désactive les modes cbreak et raw,
active la prise en compte des retours chariot et réinitialise tous les caractères spéciaux
non mis en place à leur valeurs par défaut avant d'initialiser le terminal de la même
façon que tset.</para></sect4>

<sect4><title>tack</title>
<para>tack vérifie les actions de terminfo.</para></sect4>

<sect4><title>tic</title>
<para>Tic est le compilateur des entr&eacute;es de description de terminfo. Le programme
traduit un fichier terminfo d'un format source en format binaire pour &ecirc;tre utilis&eacute;
par les routines de la biblioth&egrave;que ncurses. Les fichiers Terminfo contiennent la
description des possibilit&eacute;s d'un terminal.</para></sect4>

<sect4><title>toe</title>
<para>Le programme toe liste tous les types de terminaux disponibles selon leur
nom primaire avec pour chacun leur description.</para></sect4>

<sect4><title>tput</title>
<para>Le programme tput utilise la base de donn&eacute;es terminfo pour cr&eacute;er les
valeurs associ&eacute;es aux capacit&eacute;s d'un terminal et les informations disponibles 
pour le shell, pour initialiser un terminal, ou retourner le nom complet
d'un type du terminal requis.</para></sect4>

<sect4><title>tset</title>
<para>Le programme Tset initialise les terminaux de fa&ccedil;on &agrave; ce qu'ils puissent
&ecirc;tre utilis&eacute;s, mais cette fonctionnalit&eacute; n'est plus tellement utilis&eacute;e. Elle 
est fourni pour une compatibilit&eacute; avec BSD4.4.</para></sect4>

</sect3>

<sect3><title>Bibliothèques</title>
<para>libcurses.[a,so] (lien vers libncurses.[a,so]), libform.[a,so],
libform_g.a, libmenu.[a,so], libmenu_g.a, libncurses++.a,
libncurses.[a,so], libncurses_g.a, libpanel.[a,so] et
libpanel_g.a</para>

<sect4><title>libcurses, libncurses++, libncurses, libncurses_g</title>
<para>Ces bibliothèques qui forment la bibliothèque Ncurses sont utilisées pour
afficher de texte à l'écran. Un exemple où ncurses est utilisé est dans le
programme <quote>make menuconfig</quote>. Les bibliothèques libncurses sont
la base du système.</para></sect4>

<sect4><title>libform, libform_g</title>
<para>libform est utilisé pour implémenter des formes dans ncurses.</para></sect4>

<sect4><title>libmenu, libmenu_g</title>
<para>libmenu est utilisé pour implémenter les menus dans ncurses.</para></sect4>

<sect4><title>libpanel, libpanel_g</title>
<para>libpanel est utilisé pour implémenter des panneaux dans ncurses.</para></sect4>

</sect3>

</sect2>
