Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/libdriv/alsa-utils.xml.1.chaine.po
Languages: fr

source: 1.1 MB
fr: 1.1 Mo

source: 9.3 MB
fr: 9.3 Mo

source: alsa-utils-&alsa-utils-version;
fr: ALSA-Utilities-&alsa-utils-version;

source: Introduction to ALSA Utilities
fr: Introduction à ALSA Utilities

source: The _A1214_ package contains various utilities which are useful for controlling your sound card.
fr: Le paquet _A1214_ contient divers outils qui sont utiles pour contrôler votre carte son.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: ALSA Utilities Dependencies
fr: Dépendances d'ALSA Utilities

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of ALSA Utilities
fr: Installation de ALSA Utilities

source: Install _A1214_ by running the following commands:
fr: Installez _A1214_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This switch disables building the _C2875_ configuration tool which is incompatible with _A1178_ .
fr: Ce paramètre désactive la construction des outils de configuration de _C2875_ qui est incompatible avec _A1178_.

source: Omit this switch if you have installed _X68_ and want to regenerate the man pages.
fr: Effacez ce paramètre si vous avez installé _X68_ et ne voulez pas régénérer les pages de manuel.

source: Omit this switch if you have installed _L1449_ and wish to install the Basic Audio Tester (BAT).
fr: Effacez ce paramètre si vous avez installé _L1449_ et souhaitez installer le testeur basic d'audio (Basic Audio Tester).

source: This switch forces the use of wide-character ncurses libraries.
fr: Ce paramètre force l'utilisation des bibliothèques ncurses de wide-character.

source: Configuring ALSA Utilities
fr: Configuration de ALSA Utilities

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Note that all channels of your sound card are muted by default.
fr: Remarquez que tous les canaux de votre carte son sont muets par défaut.

source: You can use the _C2876_ program to change this.
fr: Vous pouvez utiliser le programme _C2876_ pour changer cela.

source: Use _C2877_ to check that your settings have been applied correctly.
fr: Utilisez _C2877_ pour vérifier que vos paramètres ont été correctement appliqués.

source: You should hear
fr: Vous devez entendre

source: pink noise
fr: un bruit rose

source: on your speakers.
fr: dans vos haut-parleurs.

source: The _F1600_ program is normally run from a standard _A99_ rule.
fr: Le programme _F1600_ se lance normalement avec une règle _A99_ standard.

source: The first time it is run, it will complain that there is no state in _F1599_ .
fr: La première fois qu'on l'exécute, il se plaindra qu'il n'y a aucun état dans _F1599_.

source: You can prevent this by running the following commands as the _U2_ user:
fr: Vous pouvez empêcher cela en lançant les commandes suivantes en tant qu'utilisateur _U2_ :

source: The volume settings should be restored from the saved state by _A1178_ when the device is detected (during boot or when plugged in for USB devices).
fr: Les paramètres de volume peuvent être restaurés à partir de l'état sauvegardé par _A1178_ quand le périphérique sera détecté (pendant le démarrage ou lors du branchement de périphériques USB).

source: All sound devices are not accessible for any user except _U2_ and members of the _U24_ group.
fr: Tous les périphériques de son ne sont pas accessibles aux utilisateurs, sauf _U2_ et les membres du groupe _U24_.

source: Add any users that might use the sound devices to that group:
fr: Ajoutez à ce groupe les utilisateurs qui pourraient utiliser les périphériques de son :

source: You may need to log out and back in again to refresh your group memberships.
fr: Il se peut que vous deviez vous déconnecter et y revenir pour rafraîchir vos appartenances au groupe.

source: '_C1525_ ' should work as well.
fr: '_C2889_ ' devrait aussi fonctionner.

source: Boot Script
fr: Script de démarrage

source: To automatically store and restore volume settings (if udev rule doesn't work for you) when the system is rebooted, install the _F1601_ boot script from the _X194_ package.
fr: Pour enregistrer et restaurer automatiquement les valeurs du volume (si la rêgle udev no fonctionne pas pour vous) Quand le système est redémarré, installez le script de démarrage _F1601_ depuis le paquet _X194_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a utility for connecting and disconnecting two existing ports in the ALSA sequencer system.
fr: est un outil pouconnecter et déconnecter deux ports existant du système de séquenceur ALSA.

source: allows creation of a PCM loopback between a PCM capture device and a PCM playback device.
fr: permet la création d'une boucle PCM entre un périphérique de capture PCM et un périphérique de lecture PCM.

source: is an Ncurses based mixer program for use with the ALSA sound card drivers.
fr: est un mixeur basé sur ncurses à utiliser avec les pilotes de carte son ALSA.

source: allows applications to access the hardware in an abstracted manner
fr: permet aux applications d'accéder au matériel de façon abstraite

source: is used to read from and write to ALSA RawMIDI ports.
fr: est utilisé pour lire et écrire sur des ports RawMIDI d'ALSA.

source: allows command-line control of the mixers for the ALSA sound card drivers.
fr: permet un contrôle des mixeurs en ligne de commande pour les pilotes de carte son ALSA.

source: is a command-line soundfile player for the ALSA sound card drivers.
fr: est un lecteur de fichiers son en ligne de commande pour les pilotes de carte son ALSA.

source: is a command-line utility that plays the specified MIDI file (s) to one or more ALSA sequencer ports.
fr: est un outil en ligne de commande pour lire un/des fichier (x) MIDI spécifié.

source: is a command-line soundfile recorder for the ALSA sound card drivers.
fr: est un magnétophone en ligne de commande pour les pilotes de carte son ALSA.

source: is a command-line utility that records a standard MIDI file from one or more ALSA sequencer ports.
fr: est un outil en ligne de commande qui enregistre un fichier MIDI standard à partir d'un ou plusieurs ports de séquenceur ALSA.

source: is a command-line utility that prints the sequencer events it receives as text.
fr: est un outil en ligne de commande qui affiche les événements du séquenceur qu'il reçoit sous forme de texte.

source: is an ALSA sequencer client which sends and receives event packets over a network.
fr: est un client de séquenceur ALSA qui envoie et reçoit des paquets d'événements sur un réseau.

source: is a small utility to set or dump the IEC958 (or so-called
fr: est un petit outil pour paramétrer ou peaufiner l'état des bits IEC958 (ou de ce qu'on appelle

source: ) status bits of the specified sound card via the ALSA control API.
fr: ) d'une carte son spécifié par l'API du contrôle ALSA.

source: is a command-line speaker test tone generator for ALSA.
fr: est un générateur en ligne de commande de bruit de test du speaker pour ALSA.
