Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/libdriv/alsa-lib.xml.1.chaine.po
Languages: fr

source: 912 KB
fr: 912 Ko

source: 32 MB (additional 36 MB for tests)
fr: 32 Mo (additional 36 Mo for tests)

source: 0.3 SBU (less than 0.1 SBU for tests)
fr: 0.3 SBU (moins de 0.1 SBU for tests)

source: alsa-lib-&alsa-lib-version;
fr: ALSA-Library-&alsa-lib-version;

source: Introduction to ALSA Library
fr: Introduction à ALSA Library

source: The _A1213_ package contains the ALSA library used by programs (including _A1214_ ) requiring access to the ALSA sound interface.
fr: Le paquet _A1213_ contient la bibliothèque ALSA utilisée par des programmes (y compris _A1214_) exigeant l'accès à l'interface de son ALSA.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: ALSA Library Dependencies
fr: Dépendances d'ALSA Library

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: If needed, enable the following options in the kernel configuration and recompile the kernel:
fr: Si besoin, activé les options usivantes dans la configuration du noyau et recompilez le noyau :

source: In the Device Drivers &rArr; Sound card support &rArr; Advanced Linux Sound Architecture section of the kernel configuration, select the settings and drivers appropriate for your hardware.
fr: Dans la section Device Drivers &rArr; Sound card support &rArr; Advanced Linux Sound Architecture de la configuration du noyau, sélectionnez les paramètres et les pilotes adaptés à votre matériel.

source: Ensure that the deprecated Device Drivers &rArr; Sound card support &rArr; Open Sound System is
fr: Assurez-vous que Device Drivers &rArr; Sound card support &rArr; Open Sound System, obsolète, n'est

source: not
fr: non

source: selected.
fr: sélectionnée.

source: If necessary, recompile and install your new kernel.
fr: Si nécessaire, recompilez et installez votre nouveau noyau.

source: Installation of ALSA Library
fr: Installation de ALSA Library

source: Install _A1213_ by running the following commands:
fr: Installez _A1213_ en lançant les commandes suivantes :

source: If you have _A52_ installed and you wish to build the library API documentation, run the following commands from the top-level directory of the source tree:
fr: Si vous avez installé _A52_ et que vous souhaitez construire la documentation de l'API, lancez les commandes suivantes depuis le répertoire supérieur de l'arborescence des sources :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: To install the API documentation, run the following command as the _U2_ user:
fr: Maintenant, pour installer la documentation de l'API, en tant qu'utilisateur _U2_ :

source: Configuring ALSA Library
fr: Configuration d'ALSA Library

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: The default _F1559_ is adequate for most installations.
fr: Le _F1559_ par défaut convient à la plupart des installations.

source: For extra functionality and/or advanced control of your sound device, you may need to create additional configuration files.
fr: Pour des fonctionnalités supplémentaires et/ou un contrôle avancé de votre périphérique son, vous pouvez avoir besoin de créer des fichiers de configuration supplémentaires.

source: For information on the available configuration parameters, visit _L3018_ .
fr: Pour des informations sur les paramètres de configuration disponibles, visitez _L3018_.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: libasound.so and four others under /usr/lib/alsa-lib/smixer
fr: libasound.so et quatre autres dans /usr/lib/alsa-lib/smixer

source: /usr/include/alsa, /usr/lib/alsa-lib, /usr/share/alsa and /usr/share/doc/alsa-lib-&alsa-lib-version;
fr: /usr/include/alsa, /usr/lib/alsa-lib, /usr/share/alsa et /usr/share/doc/alsa-lib-&alsa-lib-version;

source: Short Descriptions
fr: Descriptions courtes

source: is the ALSA server.
fr: est le serveur ALSA.

source: contains the ALSA API functions.
fr: contient les fonctions API de ALSA.
