Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/libdriv/faac.xml.1.chaine.po
Languages: fr

source: 519 KB
fr: 519 Ko

source: 20 MB
fr: 20 Mo

source: Introduction to FAAC
fr: Introduction à FAAC

source: This encoder is useful for producing files that can be played back on iPod.
fr: Cet encodeur est utile pour produire des fichiers qu'on peut lire sur un iPod.

source: Moreover, iPod does not understand other sound compression schemes in video files.
fr: En outre, iPod ne comprend pas d'autres formats de compression du son dans des fichiers vidéo.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: FAAC Dependencies
fr: Dépendances de FAAC

source: Optional
fr: Optionnelles

source: libmp4v2 from _L1817_ (untested, as of 2007-09-28, development of the project is stopped; an internal version of the library is used if the external one is not found).
fr: libmp4v2 from _L1817_ (non testé, depuis le 28-09-2007, le développement du projet est arrêté; une version interne de la bibliothèque est utilisée si celle externe n'est pas trouvée).

source: User Notes:
fr: Notes utilisateur :

source: Installation of FAAC
fr: Installation de FAAC

source: Install _A880_ by running the following commands:
fr: Installez _A880_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: However, basic functionality can be tested by encoding a sample WAV file (the sample file is installed by the _X493_ package:
fr: Vous pouvez cependant dester les fonctionnalités de base en encodant un fichier échantillon WAV (le fichier d'échantillon est installé par le paquet _X493_ :

source: Then, decode the result using the _C1677_ program from the _X454_ package and play back the decoded file (requires the _C1678_ program from the _X493_ package:
fr: Puis, décodez le résultat en utilisant le programme _C1677_ du paquet _X454_ et lisez le fichier décodé (exige le programme _C1678_ du paquet _X493_ :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This command removes documentation for the _O240_ parameter from the _C1679_ command output.
fr: Cette commande supprime la documentation du paramètre _O240_ de la sortie de la commande _C1679_.

source: This parameter is already disabled in FAAC-&faac-version; due to sound quality issues with object types other than
fr: Ce paramètre est déjà désactivé dans FAAC-&faac-version; à cause de problèmes de qualité du son avec les types objets différents de

source: This option is supposed to enable support for encoding files for _L1819_ , but actually breaks the base functionality of the package (e.g., the resulting _C1680_ program produces files that cannot be decoded by _X454_ , even if compiled with DRM support).
fr: Cette option est censée activer le support des fichiers d'eodage pour _L1819_ , mais elle casse en fait les fonctionnalités de base du paquet (par exemple le programme _C1680_ qui en résulte produit des fichiers qui ne peuvent pas âtre décodés par _X454_ , Fµme s'il a été compilé avec le support DRM).

source: Don't use it.
fr: Ne l'utilisez pas.

source: Other AAC encoders
fr: Autres encodeurs AAC

source: The quality of _A880_ is not up to par with the best AAC encoders currently available.
fr: La qualité de _A880_ est loin d'atteindre celle des meilleurs encodeurs AAC actuellement disponibles.

source: Also, it only supports AAC and not High Efficiency AAC (also known as aacPlus), which provides better quality at low bitrates by means of using the
fr: Il supporte en outre l'AAC et pas l'AAC High Efficiency (connu aussi en tant qu'aacPlus), qui offre une meilleure qualité avec un taux faible grâce à l'utilisation de la technologie

source: There are the following alternative programs for producing AAC and HE-AAC streams:
fr: Il existe les programmes alternatifs suivants pour produire des flux AAC et HE-AAC :

source: available only in the binary form, the command-line AAC and HE-AAC encoders for Linux are in the same archive as the Windows application.
fr: disponible seulement sous forme binaire, les encodeurs en ligne de commande pour Linux AAC et HE-AAC sont dans la même archive que l'application Windows.

source: available in the source form, can encode only HE-AAC up to 48 kbps out of the box, but the maximum bitrate can be changed by editing the tuning table in the _F1304_ file.
fr: disponible sous forme de sources, ne peut encoder HE-AAC que jusqu'à 48 kbps au-delà de la table, mais le débit maximum peut être modifié en éditant la table de peaufinement dans le fichier _F1304_.

source: Note, however, that iPod supports only Low Complexity AAC profile, which is the default in FAAC, but may not be the default in Nero AAC Encoder and is completely unavailable in the 3GPP encoder.
fr: Remarquez en même temps qu'iPod ne supporte que le profil Complexity AAC qui est celui par défaut dans FAAC mais pas forcément dans l'encodeur Nero AAC et il est complètement indisponible dans l'encodeur 3GPP.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libfaac.so and libmp4v2.so
fr: libfaac.so et libmp4v2.so

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a command-line AAC encoder.
fr: est un encodeur AAC en ligne de commande.

source: contains functions for encoding AAC streams.
fr: contient les fonctions pour encoder des flux AAC.

source: contains functions for creating and manipulating MP4 files.
fr: contient les fonctions pour créer et manipuler des fichiers MP4.
