Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/libdriv/libcdio.xml.1.chaine.po
Languages: fr

source: 1.9 MB
fr: 1.9 Mo

source: 35 MB (both packages)
fr: 35 Mo (both packages)

source: Introduction to libcdio
fr: Introduction à libcdio

source: The _A1117_ is a library for CD-ROM and CD image access.
fr: _A1117_ est une bibliothèque pour l'accès aux CD-ROM et image CD.

source: The assiciated _A1118_ library reads audio from the CD-ROM directly as data, with no analog step between, and writes the data to a file or pipe as .wav, .aifc or as raw 16 bit linear PCM.
fr: La bibliothèque associée _A1118_ lit l'audio directement depuis le CD-ROm en tant que données, avec aucune étape analogiqu, et écrit les données dans un fichier ou un tunnel en tant que .wav, .aifc ou en tant que données 16 bits linéiares PCM.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Download
fr: Additional Téléchargement

source: Required file:
fr: Fichier requis :

source: libcdio Dependencies
fr: Dépendances de libcdio

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of libcdio
fr: Installation de libcdio

source: Install _A1117_ by running the following commands:
fr: Installez _A1117_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Now install libcdio-paranoia:
fr: Maintenant installez libcdio-paranoia :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: cd-drive, cd-info, cd-paranoia, cd-read, cdda-player, iso-info, iso-read, and mmc-tool
fr: cd-drive, cd-info, cd-paranoia, cd-read, cdda-player, iso-info, iso-read, et mmc-tool

source: libcdio++.so, libcdio.so, libcdio_cdda, libcdio_paranoia, libiso9660++, libiso9660, and libudf
fr: libcdio++.so, libcdio.so, libcdio_cdda, libcdio_paranoia, libiso9660++, libiso9660, et libudf

source: /usr/include/cdio and /usr/include/cdio++
fr: /usr/include/cdio et /usr/include/cdio++

source: Short Descriptions
fr: Descriptions courtes

source: shows CD-ROM drive characteristics
fr: affiche les caractéristiques des lecteurs CD-ROM

source: shows information about a CD or CD-image
fr: affiche des informations sur les CD ou les images de CD

source: is an audio CD reading utility which includes extra data verification features
fr: est un utilitaire de lecture de CD audio qui inclu des possibilités de vérifications de données supplémentaires

source: reads Information from a CD or CD-image
fr: lit des informations depuis un CD ou une image de CD

source: is a simple curses CD player
fr: est un lecteur de CD simple en curses

source: shows Information about an ISO 9660 image
fr: affiche les informations sur une image ISO 9660

source: reads portions of an ISO 9660 image
fr: lit une partie d'une image ISO 9660

source: issues libcdio multimedia commands
fr: tape des commandes multimédia de libcdio

source: contains the primary cdio API functions
fr: contient les fonctions principales de l'API cdio
