Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/libdriv/libquicktime.xml.1.chaine.po
Languages: fr

source: 1.0 MB
fr: 1.0 Mo

source: 20 MB
fr: 20 Mo

source: 0.7 SBU (includes building all codec modules)
fr: 0.7 SBU (en incluant la construction de tous les modules de codec)

source: Introduction to libquicktime
fr: Introduction à libquicktime

source: The _A1581_ package contains the _F830_ library, various plugins and codecs, along with graphical and command line utilities used for encoding and decoding QuickTime files.
fr: Le paquet _A1581_ contient la bibliothèque _F830_ , divers plugins et codecs, ainsi que des outils graphiques et en ligne de commande utilisés pour encoder et décoder des fichiers Quicktime.

source: This is useful for reading and writing files in the QuickTime format.
fr: C'est utile pour lire et écrire des fichiers au format Quicktime.

source: The goal of the project is to enhance, while providing compatibility with the _A1582_ library.
fr: Le but du projet est d'améliorer, tout en restant compatible, la bibliothèque _A1582_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: libquicktime Dependencies
fr: Dépendances de libquicktime

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of libquicktime
fr: Installation de libquicktime

source: Install _A1581_ by running the following commands:
fr: Installez _A1581_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: Changes the licence to GPL.
fr: Modification de la licence en GPL.

source: This enables some extra plugins, such as FAAC, FAAD2, and x264.
fr: Cela active quelques greffons supplémentaires comme FAAC, FAAD2, et x264.

source: This is necessary if you do not have _A52_ , omit this if it is installed and you wish the API documentation installed.
fr: C'est nécessaire si vous n'avez pas _A52_ , ne pas l'utiliser s'il est installé et que vous souhaitez l'utiliser.

source: Build with libdv support.
fr: Construire avec le support libdv.

source: Not enabled by default.
fr: Désactivé par défaut.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libquicktime.so and several plugin codec libraries
fr: libquicktime.so et several plugin codec libraries

source: Short Descriptions
fr: Descriptions courtes

source: is a graphical front end to examine and configure the available _A1581_ audio and video codecs.
fr: est une interface graphique pour examiner et configurer les codecs audio et vidéo _A1581_ disponibles.

source: is a simple QuickTime movie player for X Window System.
fr: est un simple lecteur vidéo Quicktime pour X Window System.

source: is a command-line program used to encode video and/or audio files from one format to another.
fr: est un programme en ligne de commande utilisé pour encoder des fichiers vidéo et/ou audio d'un format à l'autre.

source: is used to dump all text strings from a quicktime file.
fr: est utilisez pour enregistrer toutes les chaînes de texte d'un fichier quicktime.

source: can take movies containing rgb frames and write them out as ppm images.
fr: peut prendre des animations contenant des cadres rgb et les écrire sous la forme d'images ppm.

source: displays the parsed contents of the provided file.
fr: affiche le contenu analysé d'un fichier fourni.

source: prints various pieces of metadata parsed by the libquicktime library for the provided file
fr: affiche les différentes pièces de métadonnées analysées par la bibliothèque libquicktime pour le fichier fourni

source: concatenates input frames into a QuickTime movie.
fr: concatène des cadres en entrée dans des animations Quicktime.

source: is used to make a file streamable by placing the moov header at the beginning of the file.
fr: est utilisé pour rendre un fichier streamable en plçant l'entête moov au début du fichier.

source: is used to write a YUV4 encoded movie as a planar YUV 4:2:0 file.
fr: est utilisé pour écrire une animation encodée en YUV4 sous forme de fichier planar YUV 4:2:0.

source: is a library for reading and writing QuickTime files.
fr: est une bibliothèque pour lire et écrire des fichiers Quicktime.

source: It provides convenient access to QuickTime files with a variety of supported codecs.
fr: Elle offre un accès pratique aux fichiers Quicktime avec une grande variété de codecs supportés.

source: The library contains new functions integrated with all the original QuickTime 4 Linux library functions used to encode and decode QuickTime files.
fr: La bibliothèque contient de nouvelles fonctions intégrées à toutes les fonctions de la bibliothèque Linux Quicktime 4 d'origine utilisées pour encoder et décoder des fichiers Quicktime.
