Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/libdriv/pulseaudio.xml.1.chaine.po
Languages: fr

source: 1.5 MB
fr: 1.5 Mo

source: 110 MB (with tests)
fr: 110 Mo (avec les tests)

source: 2.2 SBU (with tests)
fr: 2.2 SBU (avec les tests)

source: Introduction to PulseAudio
fr: Introduction à PulseAudio

source: It allows you to do advanced operations on your sound data as it passes between your application and your hardware.
fr: Il vous permet de faire des tâches avancées sur vos données sonores en s'infiltrant entre votre application et votre matériel.

source: Things like transferring the audio to a different machine, changing the sample format or channel count and mixing several sounds into one are easily achieved using a sound server.
fr: Transférer le son sur une autre machine, modifier le format d'échantillonnage ou le nombre de canaux et mixer plusieurs sons en un sont des tâches faciles avec un serveur de son.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: PulseAudio Dependencies
fr: Dépendances de PulseAudio

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of PulseAudio
fr: Installation de PulseAudio

source: The build procedure emits a lot of invalid warnings.
fr: LA procédure de construction émet beaucoup d'avertissements invalides.

source: If desired, remove them with:
fr: Si vous le désirez, supprimez les avec :

source: Install _A790_ by running the following commands:
fr: Installez _A790_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: While still as the _U2_ user, remove the _A16_ configuration file for the system wide daemon to avoid creating unnecessary system users and groups:
fr: En restant avec l'utilisateur _U2_, effacez le fichier de configuration de _A16_ afin d'éviter la création d'utilisateurs et de groups inutiles :

source: Command Explanations
fr: Explications des commandes

source: This switch disables support for _A1210_ version 4 in favour of _A1210_ version 5 since the latter also installs compatibility library for the earlier version.
fr: Ce paramètre désactive le support pour _A1210_ en faveur de _A1210_ version 5 depuis que la dernière version installe également la bibliothèque de compatibilité pour les versions précédentes.

source: This switch prevents linker from adding a hardcoded runtime path to the installed programs and libraries.
fr: Ce paramètre empêche l'éditeur de lien d'ajouter des chemins d'exécution codé en dur dans les programmes et bibliothèques installés.

source: Configuring PulseAudio
fr: Configuration de PulseAudio

source: Config Files
fr: Fichiers de configuration

source: There are system wide configuration files:
fr: Il y a les fichiers système principaux pour la configuration :

source: User configuration files take precedence over system wide ones.
fr: Les fichiers de configuration prennent l'avantage sur ceux du système.

source: Configuration Information
fr: Informations de configuration

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libpulse-mainloop-glib.so, libpulse-simple.so and libpulse.so
fr: libpulse-mainloop-glib.so, libpulse-simple.so et libpulse.so

source: /etc/pulse, /usr/include/pulse, /usr/lib/cmake/PulseAudio, /usr/lib/{pulseaudio, pulse-&pulseaudio-major-version;}, /usr/libexec/pulse, and /usr/share/pulseaudio
fr: /etc/pulse, /usr/include/pulse, /usr/lib/cmake/PulseAudio, /usr/lib/{pulseaudio, pulse-&pulseaudio-major-version;}, /usr/libexec/pulse, et /usr/share/pulseaudio

source: Short Descriptions
fr: Descriptions courtes

source: is the _A790_ ESD wrapper script.
fr: est un script enveloppe ESD _A790_.

source: plays back or records raw or encoded audio streams on a _A790_ sound server.
fr: Lit ou enregistre des flux audio purs ou encodés sur un serveur de son _A790_.

source: is a tool used to reconfigure a _A790_ sound server during runtime.
fr: est un outil pour reconfigurer un serveur de son _A790_ en cours d'exécution.

source: is used to control a running _A790_ sound server.
fr: contrôleun serveur de son _A790_ en fonction.

source: is the _A790_ OSS Wrapper.
fr: est une enveloppe OSS _A790_.

source: is a symbolic link to _C2515_ .
fr: est un lien symbolique vers _C2515_.

source: is used to play audio files on a _A790_ sound server.
fr: lit des fichiers sons sur le serveur de son _A790_.

source: is a tool that can be used to tell a local _A790_ sound server to temporarily suspend access to the audio devices, to allow other applications to access them directly.
fr: est un outil utilisé pour dire à un serveur de son _A790_ local de suspendre temporairement l'accès aux périphériques sons, afin que d'autres applications puissent y accéder directement.

source: is the _A790_ X11 Credential Utility.
fr: est un outil d'autorisations de _A790_ pour X11.

source: is a networked low-latency sound server for Linux.
fr: est un serveur pour du son en réseau à faible latence sous Linux.

source: starts _A790_ and registers it to the X11 session manager.
fr: Démarre _A790_ et l'enregistre dans le gestionnaire de session X11.
