Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/libdriv/xine-lib.xml.1.chaine.po
Languages: fr

source: 4.8 MB
fr: 4.8 Mo

source: 121 MB (additional 123 MB to install API documentation)
fr: 121 Mo (additional 123 Mo to install API documentation)

source: xine-lib-&xine-lib-version;
fr: xine-Libraries-&xine-lib-version;

source: Introduction to Xine Libraries
fr: Introduction à Xine Libraries

source: The _A1601_ package contains xine libraries.
fr: Le paquet _A483_ contient les bibliothèques xine.

source: These are useful for interfacing with external plug-ins that allow the flow of information from the source to the audio and video hardware.
fr: Elles sont utiles pour être des interfaces avec des plugins externes qui gèrent un flux d'informations depuis la source vers le matériel audio et vidéo.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Xine Libraries Dependencies
fr: Dépendances de Xine Libraries

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Xine Libraries
fr: Installation de Xine Libraries

source: Install _A1601_ by running the following commands:
fr: Installez _A1601_ en lançant les commandes suivantes :

source: To create the API documentation, _A52_ must be installed and issue the following command:
fr: Pour la création de la documentation de l'API, _A52_ doit être installé et tapez la commande suivante :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: When installing, the Makefile does some additional linking.
fr: Pendant l'installation, le Makefile fait des liens supplémentaires.

source: If you do not have Xorg in /usr, the LIBRARY_PATH variable needs to be defined for the root user.
fr: Si vous n'avez pas Xorg dans /usr, la variable LIBRARY_PATH doit être définie pour l'utilisateur root.

source: If using sudo to assume root, use the -E option to pass your current environment variables for the install process.
fr: Si vous utilisez sudo pour être root, utilisez l'option -E pour passer vos variables d'environnement actuelles aux processus d'installation.

source: If you built the API documentation, issue the following commands as the _U2_ user to install it:
fr: Si vous construisez la documentation de l'API, tapez la commande suivante en tant qu'utilisateur _U2_ pour l'installer :

source: Command Explanations
fr: Explications des commandes

source: This switch is required to compile _A1602_ without _L1976_ installed.
fr: Cette option est requise pour compiler _A1602_ sans avoir installé _L1976_.

source: Remove this option if you have installed VCDImager.
fr: Supprimez cette option si vous avez installé VCDImager.

source: This switch is required, because internal libraries cannot decrypt DVD.
fr: Ce paramètre est requis car les bibliothèques internes ne peuvent pas décoder les DVD.

source: This switch causes the documentation to be installed into a versioned directory instead of the default _F848_ .
fr: Ce paramètre provoque l'installation de la documentation dans un répertoire versioné plutôt que dans le _F848_ par défaut.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: xine-config and xine-list-1.2
fr: xine-config et xine-list-1.2

source: libxine.so and numerous plugin modules and video extensions under /usr/lib/xine/plugins/2.5
fr: libxine.so et de nombreux modules d'ajout et des extensions de video sous /usr/lib/xine/plugins/2.5

source: Output display engine fonts located in /usr/share/xine-lib/fonts
fr: Polices du moteur d'affichage en sortie situées dans /usr/share/xine-lib/fonts

source: Short Descriptions
fr: Descriptions courtes

source: provides information to programs trying to link with the _A1603_ libraries.
fr: offre des informations à des to programmes essayant de se lier aux bibliothèques _A1603_.

source: is used to get supported filetype information from _A317_ .
fr: est utilisé pour prendre les informations sur les types de fichier supportés dans _A317_.

source: provides the API for processing audio/video files.
fr: fournit l'API pour traiter des fichiers audio/vidéo.
