Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/cantarell-fonts.po
Languages: fr

source: 308 KB
fr: 308 Kio

source: 1.4 MB
fr: 1.4 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Cantarell Fonts
fr: Introduction à Cantarell Fonts

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&cantarell-fonts-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&cantarell-fonts-download-http;"/>

source: Download (FTP): <ulink url="&cantarell-fonts-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&cantarell-fonts-download-ftp;"/>

source: Download MD5 sum: &cantarell-fonts-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &cantarell-fonts-md5sum;

source: Download size: &cantarell-fonts-size;
fr: Taille du téléchargement&nbsp;: &cantarell-fonts-size;

source: Estimated disk space required: &cantarell-fonts-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &cantarell-fonts-buildsize;

source: Estimated build time: &cantarell-fonts-time;
fr: Estimation du temps de construction&nbsp;: &cantarell-fonts-time;

source: Cantarell Fonts Dependencies
fr: Dépendances de Cantarell Fonts

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/cantarell-fonts"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/cantarell-fonts"/>

source: Installation of Cantarell Fonts
fr: Installation de Cantarell Fonts

source: Install <application>Cantarell Fonts</application> by running the following commands:
fr: Installez <application>Cantarell Fonts</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Directory
fr: Répertoire installé
