Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gnome-search-tool.po
Languages: fr

source: 672 KB
fr: 672 Kio

source: 17 MB
fr: 17 Mio

source: Introduction to GNOME Search Tool
fr: Introduction à GNOME Search Tool

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-search-tool-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-search-tool-download-http;"/>

source: Download (FTP): <ulink url="&gnome-search-tool-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-search-tool-download-ftp;"/>

source: Download MD5 sum: &gnome-search-tool-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-search-tool-md5sum;

source: Download size: &gnome-search-tool-size;
fr: Taille du téléchargement&nbsp;: &gnome-search-tool-size;

source: Estimated disk space required: &gnome-search-tool-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-search-tool-buildsize;

source: Estimated build time: &gnome-search-tool-time;
fr: Estimation du temps de construction&nbsp;: &gnome-search-tool-time;

source: GNOME Search Tool Dependencies
fr: Dépendances de GNOME Search Tool

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/gnome-search-tool"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-search-tool"/>

source: Installation of GNOME Search Tool
fr: Installation de GNOME Search Tool

source: Install <application>GNOME Search Tool</application> by running the following commands:
fr: Installez <application>GNOME Search Tool</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
