Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gnome-js-common.po
Languages: fr

source: 277 KB
fr: 277 Kio

source: 2.2 MB
fr: 2.2 Mio

source: Introduction to GNOME JS Common
fr: Introduction à GNOME JS Common

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-js-common-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-js-common-download-http;"/>

source: Download (FTP): <ulink url="&gnome-js-common-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-js-common-download-ftp;"/>

source: Download MD5 sum: &gnome-js-common-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-js-common-md5sum;

source: Download size: &gnome-js-common-size;
fr: Taille du téléchargement&nbsp;: &gnome-js-common-size;

source: Estimated disk space required: &gnome-js-common-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-js-common-buildsize;

source: Estimated build time: &gnome-js-common-time;
fr: Estimation du temps de construction&nbsp;: &gnome-js-common-time;

source: GNOME JS Common Dependencies
fr: Dépendances de GNOME JS Common

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/gnome-js-common"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-js-common"/>

source: Installation of GNOME JS Common
fr: Installation de GNOME JS Common

source: Install <application>GNOME JS Common</application> by running the following commands:
fr: Installez <application>GNOME JS Common</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue: <command>make check</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make check</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
