Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gnome-font-viewer.po
Languages: fr

source: 284 KB
fr: 284 Kio

source: 4.6 MB
fr: 4.6 Mio

source: Introduction to GNOME Font Viewer
fr: Introduction à GNOME Font Viewer

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-font-viewer-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-font-viewer-download-http;"/>

source: Download (FTP): <ulink url="&gnome-font-viewer-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-font-viewer-download-ftp;"/>

source: Download MD5 sum: &gnome-font-viewer-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-font-viewer-md5sum;

source: Download size: &gnome-font-viewer-size;
fr: Taille du téléchargement&nbsp;: &gnome-font-viewer-size;

source: Estimated disk space required: &gnome-font-viewer-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-font-viewer-buildsize;

source: Estimated build time: &gnome-font-viewer-time;
fr: Estimation du temps de construction&nbsp;: &gnome-font-viewer-time;

source: GNOME Font Viewer Dependencies
fr: Dépendances de GNOME Font Viewer

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/gnome-font-viewer"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-font-viewer"/>

source: Installation of GNOME Font Viewer
fr: Installation de GNOME Font Viewer

source: Install <application>GNOME Font Viewer</application> by running the following commands:
fr: Installez <application>GNOME Font Viewer</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Short Descriptions
fr: Descriptions courtes
