Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gnome-dictionary.po
Languages: fr

source: 2.1 MB
fr: 2.1 Mio

source: 23 MB
fr: 23 Mio

source: Introduction to GNOME Dictionary
fr: Introduction à GNOME Dictionary

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-dictionary-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-dictionary-download-http;"/>

source: Download (FTP): <ulink url="&gnome-dictionary-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-dictionary-download-ftp;"/>

source: Download MD5 sum: &gnome-dictionary-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-dictionary-md5sum;

source: Download size: &gnome-dictionary-size;
fr: Taille du téléchargement&nbsp;: &gnome-dictionary-size;

source: Estimated disk space required: &gnome-dictionary-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-dictionary-buildsize;

source: Estimated build time: &gnome-dictionary-time;
fr: Estimation du temps de construction&nbsp;: &gnome-dictionary-time;

source: GNOME Dictionary Dependencies
fr: Dépendances de GNOME Dictionary

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/gnome-dictionary"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-dictionary"/>

source: Installation of GNOME Dictionary
fr: Installation de GNOME Dictionary

source: Install <application>GNOME Dictionary</application> by running the following commands:
fr: Installez <application>GNOME Dictionary</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
