Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gnome-boxes.po
Languages: fr

source: 768 KB
fr: 768 Kio

source: 20 MB
fr: 20 Mio

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-boxes-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-boxes-download-http;"/>

source: Download (FTP): <ulink url="&gnome-boxes-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-boxes-download-ftp;"/>

source: Download MD5 sum: &gnome-boxes-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-boxes-md5sum;

source: Download size: &gnome-boxes-size;
fr: Taille du téléchargement&nbsp;: &gnome-boxes-size;

source: Estimated disk space required: &gnome-boxes-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-boxes-buildsize;

source: Estimated build time: &gnome-boxes-time;
fr: Estimation du temps de construction&nbsp;: &gnome-boxes-time;

source: GNOME Boxes Dependencies
fr: Dépendances de GNOME Boxes

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/gnome-boxes"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-boxes"/>

source: Installation of GNOME Boxes
fr: Installation de GNOME Boxes

source: Install <application>GNOME Boxes</application> by running the following commands:
fr: Installez <application>GNOME Boxes</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Directory
fr: Répertoire installé

source: Short Descriptions
fr: Descriptions courtes
