Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gnome-contacts.po
Languages: fr

source: 596 KB
fr: 596 Kio

source: 25 MB
fr: 25 Mio

source: Introduction to GNOME Contacts
fr: Introduction à GNOME Contacts

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-contacts-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-contacts-download-http;"/>

source: Download (FTP): <ulink url="&gnome-contacts-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-contacts-download-ftp;"/>

source: Download MD5 sum: &gnome-contacts-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-contacts-md5sum;

source: Download size: &gnome-contacts-size;
fr: Taille du téléchargement&nbsp;: &gnome-contacts-size;

source: Estimated disk space required: &gnome-contacts-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-contacts-buildsize;

source: Estimated build time: &gnome-contacts-time;
fr: Estimation du temps de construction&nbsp;: &gnome-contacts-time;

source: GNOME Contacts Dependencies
fr: Dépendances de GNOME Contacts

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: Additional Runtime Dependencies
fr: Dépendances de Additional Runtime

source: User Notes: <ulink url="&blfs-wiki;/gnome-contacts"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-contacts"/>

source: Installation of GNOME Contacts
fr: Installation de GNOME Contacts

source: Install <application>GNOME Contacts</application> by running the following commands:
fr: Installez <application>GNOME Contacts</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
