Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gnome-devel-docs.po
Languages: fr

source: 5.9 MB
fr: 5.9 Mio

source: 52 MB
fr: 52 Mio

source: Introduction to GNOME Devel Docs
fr: Introduction à GNOME Devel Docs

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-devel-docs-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-devel-docs-download-http;"/>

source: Download (FTP): <ulink url="&gnome-devel-docs-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-devel-docs-download-ftp;"/>

source: Download MD5 sum: &gnome-devel-docs-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-devel-docs-md5sum;

source: Download size: &gnome-devel-docs-size;
fr: Taille du téléchargement&nbsp;: &gnome-devel-docs-size;

source: Estimated disk space required: &gnome-devel-docs-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-devel-docs-buildsize;

source: Estimated build time: &gnome-devel-docs-time;
fr: Estimation du temps de construction&nbsp;: &gnome-devel-docs-time;

source: GNOME Devel Docs Dependencies
fr: Dépendances de GNOME Devel Docs

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: User Notes: <ulink url="&blfs-wiki;/gnome-devel-docs"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-devel-docs"/>

source: Installation of GNOME Devel Docs
fr: Installation de GNOME Devel Docs

source: Install <application>GNOME Devel Docs</application> by running the following commands:
fr: Installez <application>GNOME Devel Docs</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Directories
fr: Répertoires installés
