Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gtksourceviewmm.po
Languages: fr

source: 725 KB
fr: 725 Kio

source: 23 MB
fr: 23 Mio

source: Introduction to GtkSourceViewmm
fr: Introduction à GtkSourceViewmm

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gtksourceviewmm-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gtksourceviewmm-download-http;"/>

source: Download (FTP): <ulink url="&gtksourceviewmm-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gtksourceviewmm-download-ftp;"/>

source: Download MD5 sum: &gtksourceviewmm-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gtksourceviewmm-md5sum;

source: Download size: &gtksourceviewmm-size;
fr: Taille du téléchargement&nbsp;: &gtksourceviewmm-size;

source: Estimated disk space required: &gtksourceviewmm-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gtksourceviewmm-buildsize;

source: Estimated build time: &gtksourceviewmm-time;
fr: Estimation du temps de construction&nbsp;: &gtksourceviewmm-time;

source: GtkSourceViewmm Dependencies
fr: Dépendances de GtkSourceViewmm

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/gtksourceviewmm"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gtksourceviewmm"/>

source: Installation of GtkSourceViewmm
fr: Installation de GtkSourceViewmm

source: Install <application>GtkSourceViewmm</application> by running the following commands:
fr: Installez <application>GtkSourceViewmm</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue: <command>make check</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make check</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
