Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gupnp-vala.po
Languages: fr

source: 88 KB
fr: 88 Kio

source: 832 KB
fr: 832 Kio

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gupnp-vala-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gupnp-vala-download-http;"/>

source: Download (FTP): <ulink url="&gupnp-vala-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gupnp-vala-download-ftp;"/>

source: Download MD5 sum: &gupnp-vala-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gupnp-vala-md5sum;

source: Download size: &gupnp-vala-size;
fr: Taille du téléchargement&nbsp;: &gupnp-vala-size;

source: Estimated disk space required: &gupnp-vala-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gupnp-vala-buildsize;

source: Estimated build time: &gupnp-vala-time;
fr: Estimation du temps de construction&nbsp;: &gupnp-vala-time;

source: GUPnP Vala Dependencies
fr: Dépendances de GUPnP Vala

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/gupnp-vala"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gupnp-vala"/>

source: Installation of GUPnP Vala
fr: Installation de GUPnP Vala

source: Install <application>GUPnP Vala</application> by running the following commands:
fr: Installez <application>GUPnP Vala</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:
