Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/gupnp-av.po
Languages: fr

source: 284 KB
fr: 284 Kio

source: 8.1 MB
fr: 8.1 Mio

source: Introduction to GUPnP AV
fr: Introduction à GUPnP AV

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gupnp-av-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gupnp-av-download-http;"/>

source: Download (FTP): <ulink url="&gupnp-av-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gupnp-av-download-ftp;"/>

source: Download MD5 sum: &gupnp-av-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gupnp-av-md5sum;

source: Download size: &gupnp-av-size;
fr: Taille du téléchargement&nbsp;: &gupnp-av-size;

source: Estimated disk space required: &gupnp-av-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gupnp-av-buildsize;

source: Estimated build time: &gupnp-av-time;
fr: Estimation du temps de construction&nbsp;: &gupnp-av-time;

source: GUPnP AV Dependencies
fr: Dépendances de GUPnP AV

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/gupnp-av"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gupnp-av"/>

source: Installation of GUPnP AV
fr: Installation de GUPnP AV

source: Install <application>GUPnP AV</application> by running the following commands:
fr: Installez <application>GUPnP AV</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue: <command>make check</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make check</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: contains the <application>GUPnP AV</application> API functions.
fr: Contient les fonctions de l'API de <application>GUPnP AV</application>
