Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/mobile-broadband-provider-info.po
Languages: fr

source: 69 KB
fr: 69 Kio

source: 648 KB
fr: 648 Kio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Mobile Broadband Provider Info
fr: Introduction à Mobile Broadband Provider Info

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&mobile-broadband-provider-info-download-http;"> HTTP link to mobile-broadband-provider-info-&mobile-broadband-provider-info-version;.tar.xz </ulink>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&mobile-broadband-provider-info-download-http;"> HTTP link to mobile-broadband-provider-info-&mobile-broadband-provider-info-version;.tar.xz </ulink>

source: Download (FTP): <ulink url="&mobile-broadband-provider-info-download-ftp;"> FTP link to mobile-broadband-provider-info-&mobile-broadband-provider-info-version;.tar.xz </ulink>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&mobile-broadband-provider-info-download-ftp;"> FTP link to mobile-broadband-provider-info-&mobile-broadband-provider-info-version;.tar.xz </ulink>

source: Download MD5 sum: &mobile-broadband-provider-info-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &mobile-broadband-provider-info-md5sum;

source: Download size: &mobile-broadband-provider-info-size;
fr: Taille du téléchargement&nbsp;: &mobile-broadband-provider-info-size;

source: Estimated disk space required: &mobile-broadband-provider-info-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &mobile-broadband-provider-info-buildsize;

source: Estimated build time: &mobile-broadband-provider-info-time;
fr: Estimation du temps de construction&nbsp;: &mobile-broadband-provider-info-time;

source: User Notes: <ulink url="&blfs-wiki;/mobile-broadband-provider-info"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/mobile-broadband-provider-info"/>

source: Installation of Mobile Broadband Provider Info
fr: Installation de Mobile Broadband Provider Info

source: Install <application>Mobile Broadband Provider Info</application> by running the following commands:
fr: Installez <application>Mobile Broadband Provider Info</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Directory
fr: Répertoire installé
