Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/mousetweaks.po
Languages: fr

source: 280 KB
fr: 280 Kio

source: 5.5 MB
fr: 5.5 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Mouse Tweaks
fr: Introduction à Mouse Tweaks

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&mousetweaks-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&mousetweaks-download-http;"/>

source: Download (FTP): <ulink url="&mousetweaks-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&mousetweaks-download-ftp;"/>

source: Download MD5 sum: &mousetweaks-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &mousetweaks-md5sum;

source: Download size: &mousetweaks-size;
fr: Taille du téléchargement&nbsp;: &mousetweaks-size;

source: Estimated disk space required: &mousetweaks-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &mousetweaks-buildsize;

source: Estimated build time: &mousetweaks-time;
fr: Estimation du temps de construction&nbsp;: &mousetweaks-time;

source: Mouse Tweaks Dependencies
fr: Dépendances de Mouse Tweaks

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/mousetweaks"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/mousetweaks"/>

source: Installation of Mouse Tweaks
fr: Installation de Mouse Tweaks

source: Install <application>Mouse Tweaks</application> by running the following commands:
fr: Installez <application>Mouse Tweaks</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: Short Descriptions
fr: Descriptions courtes
