Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/nautilus-sendto.po
Languages: fr

source: 376 KB
fr: 376 Kio

source: 8.0 MB
fr: 8.0 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Nautilus Sendto
fr: Introduction à Nautilus Sendto

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&nautilus-sendto-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&nautilus-sendto-download-http;"/>

source: Download (FTP): <ulink url="&nautilus-sendto-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&nautilus-sendto-download-ftp;"/>

source: Download MD5 sum: &nautilus-sendto-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &nautilus-sendto-md5sum;

source: Download size: &nautilus-sendto-size;
fr: Taille du téléchargement&nbsp;: &nautilus-sendto-size;

source: Estimated disk space required: &nautilus-sendto-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &nautilus-sendto-buildsize;

source: Estimated build time: &nautilus-sendto-time;
fr: Estimation du temps de construction&nbsp;: &nautilus-sendto-time;

source: Nautilus Sendto Dependencies
fr: Dépendances de Nautilus Sendto

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/nautilus-sendto"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/nautilus-sendto"/>

source: Installation of Nautilus Sendto
fr: Installation de Nautilus Sendto

source: Install <application>Nautilus Sendto</application> by running the following commands:
fr: Installez <application>Nautilus Sendto</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
