Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome/telepathy-farstream.po
Languages: fr

source: 584 KB
fr: 584 Kio

source: 6.0 MB
fr: 6.0 Mio

source: Introduction to Telepathy Farstream
fr: Introduction à Telepathy Farstream

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&telepathy-farstream-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&telepathy-farstream-download-http;"/>

source: Download (FTP): <ulink url="&telepathy-farstream-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&telepathy-farstream-download-ftp;"/>

source: Download MD5 sum: &telepathy-farstream-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &telepathy-farstream-md5sum;

source: Download size: &telepathy-farstream-size;
fr: Taille du téléchargement&nbsp;: &telepathy-farstream-size;

source: Estimated disk space required: &telepathy-farstream-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &telepathy-farstream-buildsize;

source: Estimated build time: &telepathy-farstream-time;
fr: Estimation du temps de construction&nbsp;: &telepathy-farstream-time;

source: Telepathy Farstream Dependencies
fr: Dépendances de Telepathy Farstream

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/telepathy-farstream"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/telepathy-farstream"/>

source: Installation of Telepathy Farstream
fr: Installation de Telepathy Farstream

source: Install <application>Telepathy Farstream</application> by running the following commands:
fr: Installez <application>Telepathy Farstream</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
