Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/other/openldap.xml.1.chaine.po
Languages: fr

source: 5.4 MB
fr: 5.4 Mo

source: 53 MB (client), 102 MB (server)
fr: 53 Mo (client), 102 Mo (server)

source: Introduction to OpenLDAP
fr: Introduction à OpenLDAP

source: The _A578_ package provides an open source implementation of the Lightweight Directory Access Protocol.
fr: Le paquet _A578_ fournit une implémentation libre de _fpo_Lightweight Directory Access Protocol_fpf_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: OpenLDAP Dependencies
fr: Dépendances d'OpenLDAP

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of OpenLDAP
fr: Installation d'OpenLDAP

source: If you only need to install the client side _C2041_ binaries, corresponding man pages, libraries and header files (referred to as a
fr: Si vous souhaitez installer seulement le client _C2041_ , les man-pages correspondantes, les bibliothèques et fichiers d'entêtes (soit une installation comme

source: client-only
fr: client-seul

source: Then, as the _U1_ user:
fr: Ensuite, en tant qu'utilisateur _U1_ :

source: There should be a dedicated user and group to take control of the _C2044_ daemon after it is started.
fr: Il doit y avoir un utilisateur et un groupe dédié pour prendre le contrôle du démon _C2044_ après son démarrage.

source: Issue the following commands as the _U1_ user:
fr: Tapez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Install _A578_ by running the following commands:
fr: Installez _A578_ en lançant les commandes suivantes :

source: The tests appear to be fragile.
fr: Les tests semblent fragiles.

source: Errors may cause the tests to abort prior to finishing, apparently due to timing issues.
fr: Des erreurs peuvent faire que les tests s'arrêtent avant la fin, a priori a cause de problèmes de temps.

source: The tests take about 65 minutes and are processor independent.
fr: Les tests prennent environ 65 minutes indépendement du processeur.

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch disables the debugging code in _A578_ .
fr: Ce paramètre désactive le code de déboguage dans _A578_.

source: This switch forces the _A578_ libraries to be dynamically linked to the executable programs.
fr: Ce paramètre oblige les bibliothèques _A578_ à se lier dynamiquement aux programmes de l'exécutable.

source: This switch enables using of _C2045_ passwords.
fr: Ce paramètre active les mots de passe _C2045_.

source: This switch enables _A762_ password verification.
fr: Ce paramètre active la vérification de mot de passe avec _A762_.

source: This switch enables dynamic module support.
fr: Ce paramètre active le support des modules dynamiques.

source: This switch enables reverse lookups of client hostnames.
fr: Ce paramètre active les recherches inversées des noms d'hôte du client.

source: This switch enables all available backends.
fr: Ce paramètre active toutes les fondations disponibles.

source: This switch enables all available overlays.
fr: Ce paramètre active toutes les couches disponibles.

source: This switch disables _A738_ NDB Cluster backend which causes configure to fail if _A738_ is present.
fr: Ce paramètre désactive le serveur de Cluster _A738_ NDB qui cause un échec de configuration si _A738_ est présent.

source: This switch explicitly disables the SQL backend.
fr: Ce paramètre désactive explicitement le terminal sql.

source: Omit this switch if a SQL server is installed and you are going to use a SQL backend.
fr: Ne mettez pas ce paramètre si un serveur SQL est installé et que vous l'utilisez.

source: This switch controls where the _F818_ directory is installed.
fr: Ce paramètre contrôle où le répertoire _F818_ est installé.

source: Everything in that directory is a library, so it belongs under _F408_ instead of _F383_ .
fr: Ce répertoire ne contient que des bibliothèques, donc il est mieux dans _F408_ au lieu de _F383_.

source: This switch enables SLPv2 support.
fr: Ce paramètre active le support SLPv2.

source: Use it if you have installed _L296_.
fr: Utilisez ce paramètre si vous avez installé _L296_.

source: You can run _C276_ to see if there are other switch you can pass to the _C121_ command to enable other options or dependency packages.
fr: Vous pouvez lancer _C276_ pour voir s'il y a d'autres paramètres que vous pouvez passer à la commande _C121_ pour activer d'autres options ou d'autres paquets de dépendance.

source: Having slapd configuration files and ldap databases in /var/lib/openldap readable by anyone is a SECURITY ISSUE, especially since a file stores the admin password in PLAIN TEXT.
fr: Avoir les fichiers de configuration slapd et les bases de données ldap dans /var/lib/openldap lisible par tous est un PROBLEME DE SECURITE, spécialement depuis qu'un fichier stocke les mots de passe admin en TEXTE BRUT.

source: The owner is root, so only root can modify the file, and group is ldap, so that the group which owns slapd daemon could read but not modify the file in case of a security breach.
fr: Le propriétaire est root, donc seulement root peut modifier le fichier, et le groupe est ldap, pour que le groupe à qui appartient le démon slapd puisse lire mais pas modifier le fichier dans le cas d'une faille de sécurité.

source: Configuring OpenLDAP
fr: Configuration de OpenLDAP

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Configuring the _C2044_ servers can be complex.
fr: Configurer des serveurs _C2044_ peut être complexe.

source: Securing the LDAP directory, especially if you are storing non-public data such as password databases, can also be a challenging task.
fr: Securiser le repertoire LDAP, spécialement si vous stocker des données privées comme une base de données de mots de passe, peut être également une tache compliquée.

source: Resources to assist you with topics such as choosing a directory configuration, backend and database definitions, access control settings, running as a user other than _U1_ and setting a _C1183_ environment include:
fr: Parmi les ressources pour vous aider sur des sujets tels que le choix de configuration d'un répertoire, les définitions de la fondation et de la base de données, les paramètres du contrôle d'accès, l'exécution en tant qu'utilisateur différent de _U1_ et le paramétrage d'un environnement _C1183_ , il y a :

source: The _C2044_ man page.
fr: La page de man _C2044_.

source: The _F821_ man page.
fr: La page de man _F821_.

source: The _L298_ (also installed locally in _F822_ ).
fr: Le _L298_ (guide de l'administrateur).

source: Documents located at _L299_ .
fr: Des documents qui se trouve sur _L299_.

source: Mozilla Address Directory
fr: Répertoire d'adresse Mozilla

source: By default, LDAPv2 support is disabled in the _F821_ file.
fr: Par défaut le support LDAPv2 est désactivé dans le fichier _F821_.

source: Once the database is properly set up and _A252_ is configured to use the directory, you must add _O274_ to the _F821_ file.
fr: Une fois que la base de données est correctement paramétrée et que _A252_ est configuré pour utiliser le répertoire, vous devez ajouter _O274_ au fichier _F821_.

source: Boot Script
fr: Script de démarrage

source: To automate the startup of the LDAP server at system bootup, install the _F823_ init script included in the _X203_ package using the following command:
fr: Pour automatiser le démarrage du serveur LDAP au lancement du système, installez le script de démarrage _F823_ inclu dans le paquet _X203_ en utilisant la commande suivante :

source: See the _C2044_ man page for parameter information.
fr: Voir les pages de man de _C2044_ pour des informations de paramètre.

source: Testing the Configuration
fr: Tester la Configuration

source: Start the LDAP server using the init script:
fr: Démarrez le serveur LDAP en utilisant le script de démarrage :

source: Verify access to the LDAP server with the following command:
fr: Vérifiez l'accès au serveur LDAP avec la commande suivante :

source: The expected result is:
fr: Le résultat attendu est :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
