Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/other/unbound.xml.1.chaine.po
Languages: fr

source: 4.7 MB
fr: 4.7 Mo

source: 47 MB (with tests)
fr: 47 Mo (avec les tests)

source: 0.7 SBU (with tests)
fr: 0.7 SBU (avec les tests)

source: Introduction to Unbound
fr: Introduction à Unbound

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Unbound Dependencies
fr: Dépendances de Unbound

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Unbound
fr: Installation de Unbound

source: There should be a dedicated user and group to take control of the _C2064_ daemon after it is started.
fr: Il doit y avoir un utilisateur et un groupe dédié pour prendre le contrôle du démon _C2064_ après son démarrage.

source: Issue the following commands as the _U1_ user:
fr: Tapez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Install _A763_ by running the following commands:
fr: Installez _A763_ en lançant les commandes suivantes :

source: If you have _X68_ package installed and want to build html documentation, run the following command:
fr: si vous avez le paquet _X68_ installé et voulez construire la documentation html, lancez les commandes suivantes :

source: To test the results, issue _C1_ .
fr: Pour tester les résultats, tapez _C1_.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you built html documentation, install it by running the following commands as the _U1_ user:
fr: Si vous avez construit la documentation html, installez la en lançant les commandes suivantes en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This option enables libevent support allowing use of large outgoing port ranges.
fr: Cette option active le support libevent permettant une utilisation d'une plage de port de sortie importante.

source: This option enables building of the Python bindings.
fr: Cette option active la construction des liaisons Python.

source: Configuring Unbound
fr: Configuration de Unbound

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: In the default configuration, _C2064_ will bind to localhost (127.0.0.1 IP address) and allow recursive queries only from localhost clients.
fr: Dans la configuration par défaut, _C2064_ se liera au localhost (adresse IP 127.0.0.1) et permettra les requetes récursives seulement depuis les clients locaux.

source: If you want to use _C2064_ for local DNS resolution, run the following command as the _U1_ user:
fr: Si vous voulez utiliser _C2064_ pour la résolution DNS local, lancez les commandes suivantes en tant qu'utilisateur _U1_ :

source: If you are using a DHCP client for connecting to a network, _F829_ gets overwritten with values provided by DHCP server.
fr: Si vous utilisez un client DHCP pour vous connecter au réseau, _F829_ sera écrasé avec les valeurs fournies par le serveur DHCP.

source: For advanced configuration see _F828_ file and the documentation.
fr: Pour une configuration avancée, regardez le fichier _F828_ et la documentation.

source: When _A763_ is installed, some package builds fail if the file _F830_ is not found.
fr: Quand _A763_ est installé, quelques paquets échoue à la construction si le fichier _F830_ n'est pas trouvé.

source: This file is created by running the boot script (install instructions below).
fr: Ce fichier est créé en lançant le script de démarrage (les instructions d'installation sont à la suite).

source: Alternatively, it can be created by running the following command as the _U1_ user:
fr: Alternativement, il peut être créé en lançant la commant suivant en tant qu'utilisateur _U1_ :

source: Boot Script
fr: Script de démarrage

source: If you want the _A763_ server to start automatically when the system is booted, install the _F831_ init script included in the _X203_ package.
fr: Si vous voulez que le serveur _A763_ démarre automatiquement quand le système est démarré, installez le script d'initialisation _F831_ inclu dans le paquet _X203_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: /etc/unbound and /usr/share/doc/unbound-&unbound-version;
fr: /etc/unbound et /usr/share/doc/unbound-&unbound-version;

source: Short Descriptions
fr: Descriptions courtes

source: is a DNS resolver daemon.
fr: est le démon du solveur DNS.

source: performs setup or update of the root trust anchor for DNSSEC validation.
fr: réalise la configuration ou la mise à jour l'ancre de confiance de la racine pour la validation DNSSEC.

source: checks _C2064_ configuration file for syntax and other errors.
fr: vérifie la syntaxe du fichier de configuration _C2064_ et les autres erreurs.

source: performs remote administration on the _C2064_ DNS resolver.
fr: réalise l'administration distante du solveur DNS _C2064_.

source: generates self-signed certificate and private keys for the server and client.
fr: génère un certification auto-signé et les clès privées pour le serveur et le client.

source: is a DNS lookup utility similar to _C2005_ from _X277_ .
fr: est l'utilitaire de recherhce DNS similaire à _C2005_ de _X277_.

source: provides the _A763_ API functions to programs.
fr: fournit les fonctions de l'API de _A763_ pour programmer.
