Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/other/xinetd.xml.1.chaine.po
Languages: fr

source: 308 KB
fr: 308 Ko

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to xinetd
fr: Introduction à xinetd

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: xinetd Dependencies
fr: Dépendances de xinetd

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of xinetd
fr: Installation de xinetd

source: Install _A764_ by running the following commands:
fr: Installez _A764_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This command fixes a security issue.
fr: Cette commande corrige un problème de sécurité.

source: This command fixes some compiler warnings.
fr: Cette commande corrige quelques avertissement du compilateur.

source: Configuring xinetd
fr: Configuration de xinetd

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Ensure the path to all daemons is _F474_ , rather than the default path of _F223_ , and install the _A764_ configuration files by running the following commands as the _U1_ user:
fr: Assurez-vous que le chemin vers tous les démons est _F474_ , plutôt que celui path of _F223_ par défaut et installez les fichiers de configuration de _A764_ en lançant les commandes suivantes en tant qu'utilisateur _U1_ :

source: All of the following files have the statement, "disable = yes".
fr: Tous les fichiers suivants contiennent la ligne "disable = yes".

source: To activate any of the services, this statement will need to be changed to "disable = no".
fr: Pour activer n'importe lequel de ces services, il faudra modifier ce paramètre en "disable = no".

source: The following files are listed to demonstrate several _A764_ applications.
fr: Les fichiers suivants sont listés pour démontrer quelques applications de _A764_.

source: In many cases, these applications are not needed.
fr: Dans bien des cas, ces applications sont inutiles.

source: Some classic applications are considered security risks.
fr: Quelques applications classiques sont considérées risqués pour la sécurité.

source: For example, _C764_ , _C768_ , _C2072_ , and _C1213_ transmit unencrypted usernames and passwords over the network and can be easily replaced with a more secure alternative:
fr: Par exemple, _C764_ , _C768_ , _C2072_ et _C1213_ transmettent des noms d'utilisateur et des mots de passe en clair sur le réseau et on peut facilement les remplacer par une alternative plus sécurisée :

source: The format of the _F833_ is documented in the _F835_ man page.
fr: Le format de _F833_ est documenté dans la page de man _F835_.

source: Boot Script
fr: Script de démarrage

source: As the _U1_ user, install the _F836_ init script included in the _X203_ package.
fr: En tant qu'utilisateur _U1_, installez le script de démarrage _F836_ inclu dans le paquet _X203_.

source: As the _U1_ user, use the new boot script to start _C823_ :
fr: En tant qu'utilisateur _U1_, utilisez le nouveau script de démarrage pour lancer _C823_ :

source: Check the _F837_ to ensure the appropriate services are started.
fr: Vérifier le fichier _F837_ pour vous assurer que les services appropriés sont démarrés.

source: If no services are enabled, the program will not start without the _O277_ option.
fr: Si aucun service n'est activé, le programme ne démarrera pas sans l'option _O277_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: itox, xconv.pl, and xinetd
fr: itox, xconv.pl, et xinetd

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a utility used for converting _F838_ files to _F839_ format.
fr: est un outil utilisé pour convertir des fichiers _F838_ au format _F839_.

source: is a _A107_ script used for converting _F838_ files to _F839_ format, similar to _C2073_ .
fr: est un script _A107_ utilisé pour convertir des fichiers _F838_ au format _F839_ , ressemblant à _C2073_.

source: is the Internet services daemon.
fr: est le démon des services Internet.
