Repository: espindula/br-lfs
Catalog: clfs/*/boot/ppc/yaboot.po
Languages: fr

source: Making the Temporary System Bootable
fr: Rendre le système temporaire amorçable

source: Some of the idiosyncracies of booting on ppc are discussed in <xref linkend="appendixe" role="."/>. Essentially, there are two options here - either copy the bootloader to an OSX root partition and boot from Open Firmware, or use an install, Live, or rescue CD to set up a bootstrap partition.
fr: Certaines particularités de l'amorçage de ppc sont décrites dans <xref linkend="appendixe" role="."/>. En gros, il y a deux options — soit copier le chargeur d'amorçage sur une partition racine OSX et démarrer depuis Open firmware, soit utiliser un CD d'installation, Live ou de secours pour initialiser une partition bootstrap.

source: Copying the bootloader to OSX and booting from OF.
fr: Copier le chargeur d'amorçage vers OSX et démarrer depuis OF.

source: You must now ensure that <filename>/tools/etc/yaboot.conf</filename> contains the correct details for the CLFS system. Consult <xref linkend="ch-bootable-yaboot" role="."/> for details, but note that at this point you do not need the <literal>install, magicboot, enablecdboot </literal>or <literal>macosx</literal> parameters because these are not available when you boot from Open Firmware.
fr: Vous devez maintenant vous assurer que <filename>/tools/etc/yaboot.conf</filename> contient les détails adéquats pour le système CLFS. Consultez <xref linkend="ch-bootable-yaboot" role="."/> pour plus de détails, mais remarquez que maintenant vous n'avez pas besoin des paramètres <literal>install, magicboot, enablecdboot</literal> ou <literal>macosx</literal> car ils ne sont pas disponibles lors du démarrage sur Open Firmware.

source: By this stage, you should have the temporary system on an ext2 filesystem on your Mac. Now, from within OSX, copy <filename>/tools/lib/yaboot/yaboot</filename>) and <filename>/tools/etc/yaboot.conf</filename>) to the OSX <filename>/</filename> directory.
fr: Maintenant, vous devriez avoir le système temporaire sur un système de fichiers ext2 sur votre Mac. Maintenant, depuis OSX, copiez <filename>/tools/lib/yaboot/yaboot</filename> et <filename>/tools/etc/yaboot.conf</filename> vers le répertoire OSX <filename>/</filename>.

source: Each time you want to boot into the temporary system, hold down the option-command-o-f keys to get to Open Firmware, then use the following command, replacing <literal>X</literal> with the number of the partition containing the <emphasis>OSX</emphasis> root filesystem (typically, this will be '3').
fr: À chaque fois que vous voudrez démarrer dans le système temporaire, maintenez les touches option-commande-o pour obtenir l'Open Firmware puis utilisez la commande suivante, en remplace <literal>X</literal> par le numéro de partition du système de fichier racine d'<emphasis>OSX</emphasis> (typiquement «&nbsp;3&nbsp;»)

source: Using a CD to set up the bootstrap partition.
fr: Utiliser un CD pour initialiser la partition de bootstrap.

source: This is particularly appropriate if you cannot write to an ext2 filesystem from OSX. Boot from the CD, and (as necessary) create partitions and filesystems, mount the CLFS partition at <filename>/tools</filename> and untar the temporary system there.
fr: Ceci est particulièrement approprié si vous ne pouvez pas écrire sur un système de fichier ext2 depuis OSX. Démarrez depuis un CD et (si nécessaire) créez les partitions et les systèmes de fichiers, montez la partition CLFS sur <filename>/tools</filename> et décompressez-y le système temporaire.

source: Now set up <filename>/tools/etc/yaboot.conf</filename> - see <xref linkend="ch-bootable-yaboot" role="."/> for details of what should be in it, but note that the <emphasis>install</emphasis> and <emphasis>magicboot </emphasis>specifications should point to<filename>/tools/lib/yaboot/</filename> and <emphasis>not</emphasis> <filename>/usr/lib/yaboot</filename>.
fr: Maintenant initialisez <filename>/tools/etc/yaboot.conf</filename> — voir <xref linkend="ch-bootable-yaboot" role="."/> pour des détails sur ce qui devrait s'y trouver, mais remarquez que les spécifications <emphasis>install</emphasis> et <emphasis>magicboot</emphasis> devraient pointer vers <filename>/tools/lib/yaboot/</filename> et <emphasis>non</emphasis> <filename>/usr/lib/yaboot</filename>.

source: To write the bootloader to the disk, with <filename>/tools/sbin </filename>first on your path and <filename>/proc</filename> mounted, run the following command:
fr: Pour écrire le chargeur d'amorçage sur le disque, avec <filename>/tools/sbin</filename> en premier dans votre path et <filename>/proc</filename> monté, lancez la commande suivante&nbsp;:
