Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/welcome/askhelp.xml.1.chaine.po
Languages: fr

source: Asking for Help and the FAQ
fr: Demander de l'aide et la FAQ

source: If you encounter a problem while using this book, and your problem is not listed in the FAQ (_L2839_ ), you will find that most of the people on Internet Relay Chat (IRC) and on the mailing lists are willing to help you.
fr: Si vous rencontrez un problème en utilisant ce livre, et si votre problème n'est pas indiqué dans la FAQ, (. ), vous trouverez que la plupart des gens sur Internet Relay Chat (IRC) et sur les listes de diffusion veulent vous aider.

source: An overview of the LFS mailing lists can be found in _X535_ .
fr: Vous pouvez trouver un aperçu des listes de diffusion LFS dans _X535_.

source: To assist us in diagnosing and solving your problem, include as much relevant information as possible in your request for help.
fr: Pour nous aider à diagnostiquer et résoudre votre problème, mettez autant d'informations pertinentes que possible dans votre demande d'aide.

source: Things to Check Prior to Asking
fr: Les choses à vérifier avant de demander

source: Before asking for help, you should review the following items:
fr: Avant de demander de l'aide, vous devriez revoir les éléments suivants :

source: Is the hardware support compiled into the kernel or available as a module to the kernel? If it is a module, is it configured properly in _F1495_ and has it been loaded? You should use _C2391_ as the _U2_ user to see if it's loaded.
fr: Le support du matériel est-il compilé dans le noyau ou disponible comme module du noyau? Si c'est un module, est-il configuré correctement dans _F1495_ et a-t-il été chargé? Vous devriez utiliser _C2391_ en tant qu'utilisateur _U2_ pour voir s'il est chargé.

source: Check the _F1496_ file or run _C2392_ to review any error message.
fr: Vérifiez le fichier _F1496_ ou lancez _C2395_ pour voir un message d'erreur.

source: If it loads properly, you may need to add the _C2393_ command to your boot scripts.
fr: S'il se charge correctement, il se peut que vous deviez ajouter la commande _C2393_ à vos scripts de démarrage.

source: Are your permissions properly set, especially for devices? LFS uses groups to make these settings easier, but it also adds the step of adding users to groups to allow access.
fr: Vos droits sont-ils bien réglés, surtout pour des périphériques? LFS utilise des groupes pour faciliter ces réglages mais il ajoute aussi l'étape de l'ajout des utilisateurs aux groupes pour leur autoriser l'accès.

source: A simple _C2394_ may be all that's necessary for that user to have access to the sound system.
fr: Un simple _C2396_ peut être la seule chose nécessaire pour que l'utilisateur ait accès au son.

source: Any question that starts out with
fr: Toute question commençant par

source: It works as root, but not as .. .
fr: Ça marche en root, mais pas sous . .

source: requires a thorough review of permissions prior to asking.
fr: exige une revue complète des droits avant de demander.

source: BLFS liberally uses _F855_ .
fr: BLFS utilise de façon libérale _F855_.

source: The main objection to this centers around the need to expand your environment variables for each package placed there (e.g., PATH=$PATH:/opt/kde/bin).
fr: La principale objection à cela se focalise sur le besoin d'étendre vos variables d'environnement pour chaque paquet qui y est placé (comme PATH=$PATH:/opt/kde/bin).

source: In most cases, the package instructions will walk you through the changes, but some will not.
fr: Dans la plupart des cas, les instructions du paquet vous guideront à travers les changements, mais pas tous.

source: The section called
fr: La section nommée

source: is available to help you check.
fr: est disponible pour vous aider à vérifier.

source: Things to Mention
fr: Les choses à mentionner

source: Apart from a brief explanation of the problem you're having, the essential things to include in your request are:
fr: Outre une courte explication du problème que vous avez, les choses essentielles à inclure dans votre demande sont :

source: the version of the book you are using (being &version; ),
fr: la version du livre que vous utilisez (donc &version; ),

source: the package or section giving you problems,
fr: le paquet ou la section qui vous pose problème,

source: the exact error message or symptom you are receiving,
fr: le message d'erreur exact ou le symptôme que vous recevez,

source: whether you have deviated from the book or LFS at all,
fr: si vous avez dévié du livre ou pas,

source: if you are installing a BLFS package on a non-LFS system.
fr: si vous installez un paquet BLFS sur un système non LFS.

source: (Note that saying that you've deviated from the book doesn't mean that we won't help you.
fr: (Remarquez que le fait de dire que vous avez dévié du livre ne signifie pas que nous ne vous aiderons pas.

source: It'll just help us to see other possible causes of your problem. )
fr: Cela nous aidera simplement à voir d'autres causes possibles de votre problème)

source: Expect guidance instead of specific instructions.
fr: Attendez-vous à des repères plutôt que des instructions.

source: If you are instructed to read something, please do so.
fr: Si on vous demande de lire quelque chose, merci de le faire.

source: It generally implies that the answer was way too obvious and that the question would not have been asked if a little research was done prior to asking.
fr: Cela implique en général que la réponse était trop évidente et que la question n'aurait pas été posée si vous aviez fait un minimum de recherche avant de demander.

source: The volunteers in the mailing list prefer not to be used as an alternative to doing reasonable research on your end.
fr: Les volontaires sur la liste de diffusion préfèrent ne pas devenir une habitude alternative à faire des recherches de votre côté.

source: In addition, the quality of your experience with BLFS is also greatly enhanced by this research, and the quality of volunteers is enhanced because they don't feel that their time has been abused, so they are far more likely to participate.
fr: En outre, la qualité de votre expérience de BLFS est considérablement améliorée par cette recherche et la qualité des volontaires est améliorée car ils ne croient pas qu'on abuse de leur temps, donc ils sont bien plus disposés à participer.

source: An excellent article on asking for help on the Internet in general has been written by Eric S.
fr: Un excellent article sur la demande d'aide sur Internet en général a été écrit par Eric S.

source: It is available online at _L2840_ .
fr: Il est disponible en ligne sur _L2841_.

source: Read and follow the hints in that document and you are much more likely to get a response to start with and also to get the help you actually need.
fr: Lisez et suivez les astuces de ce document et vous serez très probablement beaucoup plus sûr d'obtenir une réponse et d'avoir l'aide dont vous avez réellement besoin.
