Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/welcome/conventions.xml.1.chaine.po
Languages: fr

source: Conventions Used in this Book
fr: Conventions utilisées dans ce livre

source: Conventions Used for Package Dependencies
fr: Conventions utilisées pour les dépendances de paquets

source: When packages are created, the authors depend on prior work.
fr: Quand des paquets sont créés, les auteurs dépendent de travaux antérieur.

source: In order to build a package in BLFS, these dependencies must be built prior to the desired package.
fr: Pour pouvoir construire un paquet dans BLFS, ces dépendances doivent être construites avant le paquet désiré.

source: For each package, any prerequsite packages are listed in one or more separate sections:
fr: Pour chaque paquet, quelques paquets pré-requis sont listés dans une ou plusieurs sections séparées :

source: Required, Recommended, and Optional.
fr: Requise, recommandée et facultative.

source: Required Dependencies
fr: Dépendances requises

source: These dependencies are the minimum prerequsite packages required to build the package.
fr: Ces dépendances sont les paquets prérequis minimum requis pour construire le paquet.

source: Omitted from the list are packages in LFS and required dependencies of other required packages.
fr: Les paquets omis de cette liste sont les paquets de LFS et les dépendances requises par d'autres paquets requis.

source: Recommended Dependencies
fr: Dépendances recommandées

source: These dependencies are those that the BLFS editors have determined are important to give the package reasonable capabilities.
fr: Ces dépendances sont celle que les éditeurs de BLFS ont déterminée comme importante pour donner au paquet des possibilités raisonnables.

source: Package installation instructions assume thay are installed.
fr: Les instructions d'installation du paquet considèrent qu'elles sont installées.

source: If a recommended package is not desired, the instructions may need to be modified to accommodate the missing package.
fr: Si un paquet recommandé n'est pas souhaité, les instructions pourront être modifiées pour s'accomoder de ce paquet oublié.

source: Optional Dependencies
fr: Dépendances facultatives

source: These dependencies are those that the package may use.
fr: Ces dépendances sont celle que le paquet peut utiliser.

source: Integration of optional dependencies may be automatic by the package or may need additional instructions not presented by BLFS.
fr: L'integration de dépendances facultatives peuvent être automatiquement faite par le paquet ou peut demander des instructions supplémentaires non présentes dans BLFS.

source: Optional packages may be listed without corresponding BLFS instructions.
fr: Les paquets facultatifs peuvent être listés sans les instructions de BLFS correspondantes.

source: In this case it is up to the user to determine appropriate installation instructions.
fr: Dans ce cas c'est à l'utilisateur de déterminer les instructions d'installation appropriées.

source: Conventions Used for Kernel Configuration Options
fr: Convention utilisées pour les options de configuration du noyau

source: Some packages have specific needs regarding the kernel configuration.
fr: Certains paquets ont des besoins spécifiques par rapport à la configuration du noyau.

source: The general layout is the following:
fr: Le modèle général est le suivant :

source: [CONFIG_...] on the right gives the name of the option, so you can easily check whether it is set in your _F1043_ file.
fr: [CONFIG_...] sur la droite donne le nom de l'option, pour que vous puissiez facilement vérifier ce qui est initialisé dans votre fichier _F1043_.

source: The meaning of the various entries is:
fr: La signification des différentes entrées est :

source: top level menu item
fr: item supérieur du menu

source: submenu item
fr: item du sous menu

source: the option could be either built-in or not selected:
fr: l'option peut être soit "built-in" ou "not selected" :

source: it must be selected
fr: elle doit être sélectionnée

source: the option could be either built-in, module, or not selected:
fr: l'option peut être soit "built-in", "module", ou "not selected" :

source: it must be selected as built-in
fr: elle doit être sélectionnée comme "built-in"

source: it must be selected, either as built-in or module
fr: elle doit être sélectionnée, soit comme "built-in" ou "module"

source: rarely used:
fr: rarement utilisé :

source: it may be selected at will
fr: elle peut être sélectionnée comme vous voulez

source: it must
fr: elle ne doit

source: not
fr: non

source: be selected
fr: être sélectionnée

source: Note that, depending on other selections, the angle brackets (&lt;&gt; ) may appear as braces ({}), if the option cannot be unselected, or even dashes (-*- or -M-), when the choice is imposed.
fr: Notez que, en fonctione d'autres sélections, les signes (&lt;&gt; ) peuvent apparaître comme des parenthèses ({}), si l'option ne peut pas être déselectionnée, ou entre tirets (-*- ou -M-), alors le choix est imposé.

source: The help text about the option specifies the other selections on which this option relies, and how those other selections are set.
fr: Le texte d'aide à propos d'une option spécifie les autres choix qui sont reliés à cette option, et comment ces autres choix sont initialisés.

source: SBU values in BLFS
fr: Valeurs de SBU dans BLFS

source: As in LFS, each package in BLFS has a build time listed in Standard Build Units (SBUs).
fr: Comme dans LFS, chaque paquet dans BLFS a un temps de construction d'indiqué en Unité de construction Standard (SBU).

source: These times are relative to the time it took to build binutils in LFS and are intended to provide some insight into how long it will take to build a package.
fr: Ces temps sont relatifs au temps mis pour construire binutils dans LFS et sont destinés à fournir quelques indications sur le temps que va mettre le paquet à se construire.

source: Most times listed are for a single processor or core to build the package.
fr: La plupart des temps sont indiqués pour constuire le paquet avec un seul processeur ou coeur.

source: These values indicate testing was done using multiple cores.
fr: Cette valeur indique que le test a été réalisé en utilisant plusieurs coeurs.

source: Note that while this speeds up the build on systems with the appropriate hardware, the speedup is not linear and to some extent depends on the individual package and specific hardware used.
fr: Notez que cela peut augmenter la vitesse de construction sur des systèmes avec le matériel approprié, l'augmentation de vitesse n'est pas linéaire et certaines améliorations dépendent des paquets ou du matériel spécifique utilisé.

source: Some packages do not support parallel builds and using -j1 for the make command is required.
fr: Certains paquets ne supportent pas la construction parallèle et l'utilisation de -j1 pour la commande make est requise.

source: Packages that are known to have such limits are marked as such in the text.
fr: Les paquets qui sont connus pour avoir ces limites sont marqués comme tel dans le texte.
