Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/welcome/packages.xml.1.chaine.po
Languages: fr

source: Getting the Source Packages
fr: Obtenir les sources des paquets

source: Within the BLFS instructions, each package has two references for finding the source files for the package&mdash;an HTTP link and an FTP link (some packages may only list one of these links).
fr: Dans les instructions BLFS, chaque paquet a deux références pour trouver les fichiers sources d'un paquet&mdash;un lien HTTP et un lien FTP (il se peut que certains paquets ne listent qu'un de ces liens).

source: Every effort has been made to ensure that these links are accurate.
fr: On a fait tous nos efforts pour s'assurer que ces liens sont soignés.

source: However, the World Wide Web is in continuous flux.
fr: Cependant, le World Wide Web est en évolution constante.

source: Packages are sometimes moved or updated and the exact URL specified is not always available.
fr: Des paquets sont parfois déplacés ou mis à jour et l'adresse exacte indiquée n'est pas toujours disponible.

source: This site has all the sources of the exact versions of the packages used in BLFS.
fr: Ce site contient toutes les sources des versions exactes des paquets utilisés dans BLFS.

source: We would like to ask a favor, however.
fr: Nous aimerions cependant vous demander une faveur.

source: Although this is a public resource for you to use, please do not abuse it.
fr: Bien que ce soit une ressource publique pour vous, merci de ne pas en abuser.

source: We have already had one unthinking individual download over 3 GB of data, including multiple copies of the same files that are placed at different locations (via symlinks) to make finding the right package easier.
fr: Nous avons déjà eu un nombre impensable de téléchargements de plus de 3 Go de données, incluant plusieurs copies des mêmes fichiers situés sur les différents endroits (via des liens symboliques) pour faciliter la recherche du bon paquet.

source: This person clearly did not know what files he needed and downloaded everything.
fr: Cette personne ne savait clairement pas les fichiers dont elle avait besoin et elle a tout téléchargé.

source: The best place to download files is the site or sites set up by the source code developer.
fr: Le meilleur endroit pour télécharger des fichiers est le site ou les sites du développeur du code source.

source: Please try there first.
fr: Merci d'essayer d'abord là-bas.
