Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/welcome/wiki.xml.1.chaine.po
Languages: fr

source: wiki
fr: wiki BLFS

source: BLFS Wiki
fr: Wiki BLFS

source: The BLFS Project has created a Wiki for users to comment on pages and instructions at _L4327_.
fr: Le projet BLFS a créé un Wiki pour que les utilisateurs commentent les pages et les instructions sur _L4327_.

source: Comments are welcome from all users.
fr: Les commentaires de tous les utilisateurs sont bienvenus.

source: The following are the rules for posting:
fr: Ce qui suit sont les règles pour poster :

source: Users must register and log in to edit a page.
fr: Les utilisateurs doivent s'enregistrer et se connecter pour éditer une page.

source: Suggestions to change the book should be made by creating a new ticket,
fr: Les suggestions de changements du livre devraient se faire en créant un nouveau ticket,

source: not
fr: non

source: by making comments in the Wiki.
fr: en commentant le Wiki.

source: Questions with your specific installation problems should be made by subscribing and mailing to the BLFS Support Mailing List at _L4328_.
fr: Les questions sur vos problèmes d'installation spécifique devraient être posées en s'abonnant et en écrivant à la listes de diffusion BLFS Support sur _L4328_.

source: Discussions of build instructions should be made by subscribing and mailing to the BLFS Development List at _L4329_.
fr: Les discussions sur les instructions de construction devraient se faire en s'abonnant et en écrivant à la liste de diffusion BLFS Development sur _L4329_.

source: Inappropriate material will be removed.
fr: Les sujets non appropriés seront supprimés.
