Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/kf5/kf5-intro.xml.1.chaine.po
Languages: fr

source: 30 MB
fr: 30 Mo

source: KDE Frameworks 5 Pre-installation Configuration
fr: Configuration de préinstallation de KDE Frameworks 5

source: KF5 can be installed in /usr or /opt/kf5.
fr: KF5 peut être installé dans /usr ou /opt/kf5.

source: The BLFS editors recommend the latter in the BLFS environment.
fr: Les éditeurs de BLFS recommandent la dernière dans un environement BLFS.

source: Installing in /usr
fr: Installation dans /usr

source: One option is to install _A645_ into the _F291_ hierarchy.
fr: Une option est d'installer _A645_ dans la hiérarchie _F291_.

source: This creates a simpler setup but makes it more difficult to try multiple versions of _A631_ .
fr: Cela crée un simple setup mais rend plus difficile d'essayer des versions différentes de _A631_.

source: It is a good idea to add the following variables to your system or personal profiles:
fr: C'est une bonne idée d'ajouter les variables suivantes à votre système ou à votre profile personnel :

source: If _A646_ was installed in /usr, the $QT5DIR/lib/ portions of the above paths may need to be changed to $QT5DIR/lib/qt5/.
fr: Si _A646_ est installé dans /usr, la partie $QT5DIR/lib/ des chemins précédents doit être changée en $QT5DIR/lib/qt5/.

source: If _A647_ is installed in _F291_ , some packages from this chapter might overwrite some programs installed by _A647_ packages.
fr: Si _A291_ est installé dans _F647_ , certains paquets de ce chapitre peuvent écraser certains programmes installés par les paquets _A647_.

source: Installing in /opt
fr: Installation dans /opt

source: A method of building multiple versions installs _A645_ in the _F335_ hierarchy:
fr: Une méthode d'installer plusieurs versions de _A645_ est de construire dans la hiérarchie _F335_ :

source: If you are not installing _A645_ in _F291_ , you will need to make some additional configuration changes.
fr: Si vous n'avez pas installé _A645_ dans _F291_ , vous devrez faire des modifications de configurations supplémentaires.

source: Best practice is to add those to your system or personal profile:
fr: La meilleure pratique est d'ajouter cela à votre système ou profile personnel :

source: Expand your _F680_ file:
fr: Complêter votre fichier _F680_ :

source: Several _A645_ packages install files into _A5_ directories.
fr: Plusieurs paquets de _A645_ installent des fichiers dans les répertoires _A5_.

source: When installing _A645_ in a location other than _F291_ , _A5_ needs to be able to find these files.
fr: Quand on installe _A645_ dans un endroit autre que _F291_ , _A5_ doit pouvoir trouver ces fichiers.

source: The easiest way to achieve this is to create the following symlinks (as the _U1_ user):
fr: La façon la plus simple de faire cela est de créer le lien symbolique suivant (en tant qu'utilisatekr _U1_) :

source: Some packages may also install icons from the "hicolor" icon set.
fr: Quelques paquets peuvent aussi installer des icônes de l'ensemble "hicolor".

source: Since that icon set is used by many packages, it is a good idea to create a symlink to the one in _F155_ to avoid having multiple installations of _X48_ .
fr: Depuis que cet ensemble d'icônes est utilisé par beaucoup de paquets, c'est une bonne idée de créer un lien symbolique vers un ensemble dans _F155_ pour éviter d'avoir des installations multiples de _X48_.

source: Run the following commands as the _U1_ user:
fr: LAncez la commande suivante en tant qu'utilisateur _U1_ :

source: Sometimes, the installation paths are hardcoded into installed files.
fr: Parfois, les chemins d'installation sont codés en durs dans les fichiers installés.

source: This is the reason why _F681_ is used as installation prefix instead of _F682_ .
fr: C'est la raison pourquoi _F681_ est utilisé comme préfx d'installation au lieu de _F682_.

source: After installing _A631_ , you may rename the directory and create a symlink:
fr: Après l'installation de _A631_ , vous pouvez renommer le répertoire et créer un lien symbolique :

source: Later on, you may want to install other versions of _A645_ .
fr: Plus tard, vous pouvez vouloir installer d'autres versions de _A645_.

source: To do that, just remove the symlink and use _F681_ as the prefix again.
fr: Pour faire cela, supprimez juste le lien symbolique et utilisez _F681_ de nouveau comme préfix.

source: Which version of _A645_ you use depends only on where the symlink points.
fr: La version de _A645_ que vous utilisez dépend seulement d'où pointe le lien symbolique.

source: No other reconfiguration will be needed.
fr: Pas d'autres reconfiguration seront nécessaire.
