Repository: espindula/br-lfs
Catalog: blfs/*/kde/core/automoc4.po
Languages: fr

source: 0.9 MB
fr: 0.9 Mio

source: 488 KB
fr: 488 Kio

source: Introduction to Automoc4
fr: Introduction à Automoc4

source: <application>Automoc4</application> is a tool to add rules for generating <application>Qt</application> moc files automatically to projects that use <application>CMake</application> as the buildsystem.
fr: <application>Automoc4</application> est un outil pour ajouter des règles pour la génération des fichiers <application>Qt</application> moc automatiquement pour les projets qui utilisent <application>CMake</application> comme système de construction.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&automoc4-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&automoc4-download-http;"/>

source: Download (FTP): <ulink url="&automoc4-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&automoc4-download-ftp;"/>

source: Download MD5 sum: &automoc4-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &automoc4-md5sum;

source: Download size: &automoc4-size;
fr: Taille du téléchargement&nbsp;: &automoc4-size;

source: Estimated disk space required: &automoc4-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &automoc4-buildsize;

source: Estimated build time: &automoc4-time;
fr: Estimation du temps de construction&nbsp;: &automoc4-time;

source: Automoc4 Dependencies
fr: Dépendances de Automoc4

source: Required
fr: Requises

source: <xref linkend="cmake"/> and <xref linkend="qt4"/>
fr: <xref linkend="cmake"/> et <xref linkend="qt4"/>

source: User Notes: <ulink url="&blfs-wiki;/automoc4"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/automoc4"/>

source: Installation of Automoc4
fr: Installation de Automoc4

source: Install <application>automoc4</application> by running the following commands:
fr: Installez <application>automoc4</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <option>-Wno-dev</option>: Suppress warnings that are meant for the author of the CMakeLists.txt files.
fr: <option>-Wno-dev</option>&nbsp;: Supprime les avertissements qui sont données par l'auteur des fichiers CMakeLists.txt.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: is a utility generating <application>Qt</application> moc files.
fr: est un utilitaire générant des fichiers <application>Qt</application> moc.
