Repository: espindula/br-lfs
Catalog: blfs/*/kde/core/config.po
Languages: fr

source: Starting KDE4
fr: Démarrage de KDE4

source: KDE4 Startup Dependencies
fr: Dépendances de KDE4 Startup

source: Recommended Runtime Dependencies
fr: Dépendances de Recommended Runtime

source: <xref linkend="consolekit"/> and <xref linkend="dbus"/>
fr: <xref linkend="consolekit"/> et <xref linkend="dbus"/>

source: After <application>Kde-workspace</application> has been installed, the first important milestone has been reached. Now you need to configure your system to start KDE4.
fr: Après avoir installé <application>Kde-workspace</application>, une première étape importante a été franchie. Maintenant, vous devez configurer votre système pour démarrer KDE4.

source: Starting KDE4 from the command prompt
fr: Démarrage de KDE4 à partir de l'invite de commande

source: You can start <application>KDE4</application> from runlevel 3, using <xref linkend="xinit"/>, or from runlevel 5, using a Display Manager, such as <xref linkend="sddm"/>.
fr: Vous pouvez démarrer <application>KDE4</application> depuis le niveau d'exécution 3, en utilisant <xref linkend="xinit"/>, ou depuis le niveau d'exécution 5, en utilisant un gestionnaire d'affichage, comme <xref linkend="sddm"/>.

source: To start <application>KDE4</application> using <xref linkend="xinit"/>, run the following commands:
fr: Pour démarrer <application>KDE4</application>, en utilisant <xref linkend="xinit"/>, lancez la commande suivante:

source: The X session starts on the first unused virtual terminal, normally vt7. You can switch to another vt<emphasis>n</emphasis> simultaneously pressing the keys Ctrl-Alt-F<emphasis>n</emphasis> (<emphasis>n</emphasis>=1, 2, ...). To switch back to the X session, normally started at vt7, use Ctrl-Alt-F7. The vt where the command <command>startx</command> was executed will display many messages, including X starting messages, applications automatically started with the session, and eventually, some warning and error messages. You may prefer to redirect those messages to a log file, which not only will keep the initial vt uncluttered, but can also be used for debug purposes. This can be done starting X with:
fr: La session X démarre dans le premier terminal virtuel inutilisé, normalement vt7. Vous pouvez passer à vt<emphasis>n</emphasis> en pressant simultanément les touches Ctrl-Alt-F<emphasis>n</emphasis> (<emphasis>n</emphasis>=1, 2, ...). Pour retourner à la session X, normalement démarrée dans vt7, utilisez Ctrl-Alt-F7. Le Vt ou la commande <command>startx</command> est démarré affichera beaucoup de messages, incluant les messages de démarrage de X, les applications automatiquement démarrée avec la session, et éventuellement, quelques avertissements et erreurs. Vous pouvez préférer rediriger ces messages dans un fichier log, qui non seulement laissera vt1 propre, mais aussi pourra servir pour le débogage. Cela peut être fait en démarrant X avec:

source: You may wish to drop consolekit and/or dbus-launch, e.g., just using startkde in ~/.xinitrc. However some capabilities such as mounting or umounting file systems from a file manager will not be possible, or the reboot option will be absent or inoperative, among other problems.
fr: vous pouvez souhaiter abandonner consolekit et/ou dbus-launch, c'est à dire, en utilisant juste startkde dans .~/.xinitrc, mais quelques fonctionnalités comme mount/umount des systèmes de fichier depuis un gestionnaire de fichiers ne seront pas possible, ou les options de redémarrage seront absent ou non fonctionnelles, entre autres problèmes.

source: When shutting down or rebooting, the shutdown messages appear on the vt where X was running. If you wish to see those messages, simultaneously press keys Alt-F7 (assuming that X was running on vt7).
fr: Quand vous arrêtez ou redémarrez, Les messages d'arrêt apparaissent sur le vt ou X était lancé. Si vous souhaitez voir ses messages appuyez simultanément sur Alt-F7 (en considérant que X était lancé sur vt7).

source: Starting KDE4 at boot
fr: Démarrage de KDE4 à l'amorçage

source: KDE4 comes with a graphical login interface called KDM (the KDE4 Display Manager), which provides a customizable graphical login at boot. To use KDM, you need to edit your <filename>/etc/inittab</filename> file (as the <systemitem class="username">root</systemitem> user). First, setup run-level 5 to start KDM (adjust the path to kdm according to your system):
fr: KDE4 est fourni avec une interface de connexion graphique appelée KDM (le <foreignphrase>KDE4 Display Manager</foreignphrase> (gestionnaire d'affichage KDE4)) qui offre une connexion graphique personnalisable au démarrage. Pour utiliser KDM, vous devez éditer votre fichier <filename>/etc/inittab</filename> (en tant qu'utilisateur <systemitem class="username">root</systemitem>). Tout d'abord, réglez le niveau d'exécution 5 pour lancer KDM (ajustez le chemin vers KDM selon votre système)&nbsp;:

source: Additionally, you need to change the default run-level from 3 to 5:
fr: En plus, vous devez changer le niveau d'exécution par défaut de 3 à 5:

source: You can now restart your system and see the KDE4 login screen.
fr: Vous pouvez maintenant redémarrer votre système et vous verrez l'écran de connexion KDE4.

source: Installing further languages (l10n)
fr: Installation de langues supplémentaires (l10n)

source: You may want to install support for your locale language. The l10n packages can be found at <ulink url="&kde-download-http;applications/&kde-apps-version;/src/kde-l10n/"> &kde-download-http;applications/&kde-apps-version;/src/kde-l10n/</ulink>. See <xref linkend="kde-add-pkgs"/> for build instructions. If you are in a KDE4 session when installing a new language and configure KDE4 to use it, the session needs to be restarted, in order to see the effects.
fr: vous pouvez vouloir installer le support pour votre langue locale. Le paquet l10n peut être trouvé à l'adresse <ulink url="&kde-download-http;applications/&kde-apps-version;/src/kde-l10n/">&kde-download-http;applications/&kde-apps-version;/src/kde-l10n/</ulink>. Regardez <xref linkend="kde-add-pkgs"/> pour les instructions de construction. Si vous êtes dans une session KDE4 quand vous installez une nouvelle langue et configurez KDE4 pour l'utiliser, la session doit être redémarrée, pour voir les effets.

source: Installing further KDE4 packages
fr: Installation de paquets KDE4 supplémentaires

source: Every subsequent package can be built while having <application>KDE4</application> up and running, but remember to keep <envar>&kde-dir;</envar> and <envar>&qt4-dir;</envar> set.
fr: Tous les paquets suivants peuvent être construits alors que <application>KDE4</application> est actif et fonctionne, mais souvenez-vous de garder le réglage de <envar>&kde-dir;</envar> et <envar>&qt4-dir;</envar>.
