Repository: espindula/br-lfs
Catalog: blfs/*/kde/core/kactivities.po
Languages: fr

source: 88 KB
fr: 88 Kio

source: 9.2 MB
fr: 9.2 Mio

source: Introduction to Kactivities
fr: Introduction à Kactivities

source: This package provides the activitymanager for KDE.
fr: Ce paquet fournit un gestionnaire d'activité pour KDE.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kactivities-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kactivities-download-http;"/>

source: Download (FTP): <ulink url="&kactivities-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kactivities-download-ftp;"/>

source: Download MD5 sum: &kactivities-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kactivities-md5sum;

source: Download size: &kactivities-size;
fr: Taille du téléchargement&nbsp;: &kactivities-size;

source: Estimated disk space required: &kactivities-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kactivities-buildsize;

source: Estimated build time: &kactivities-time;
fr: Estimation du temps de construction&nbsp;: &kactivities-time;

source: Kactivities Dependencies
fr: Dépendances de Kactivities

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/kactivities"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kactivities"/>

source: Installation of Kactivities
fr: Installation de Kactivities

source: Install <application>Kactivities</application> by running the following commands:
fr: Installez <application>Kactivities</application> en lançant les commandes suivantes&nbsp;:

source: This package does not ship a default test suite.
fr: Ce paquet ne contient pas de test de suites par défaut.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libkactivities.so, libkactivities-models.so and several in &kde-dir;/lib/kde4
fr: libkactivities.so, libkactivities-models.so et plusieurs dans &kde-dir;/lib/kde4

source: &kde-dir;/include/kactivities, &kde-dir;/include/kactivities-models, &kde-dir;/include/KDE/KActivities, &kde-dir;/lib/cmake/KActivities, &kde-dir;/lib/cmake/KActivities-models, and several in &kde-dir;/share
fr: &kde-dir;/include/kactivities, &kde-dir;/include/kactivities-models, &kde-dir;/include/KDE/KActivities, &kde-dir;/lib/cmake/KActivities, &kde-dir;/lib/cmake/KActivities-models, et plusieurs dans &kde-dir;/share
