Repository: espindula/br-lfs
Catalog: blfs/*/kde/core/kde-runtime.po
Languages: fr

source: 7.5 MB
fr: 7.5 Mio

source: 110 MB
fr: 110 Mio

source: Introduction to Kde-runtime
fr: Introduction à Kde-runtime

source: Kde-runtime contains runtime applications and libraries essential for <application>KDE</application>.
fr: kde-runtime contient des binaires et des bibliothèques d'exécution à <application>KDE</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kde-runtime-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kde-runtime-download-http;"/>

source: Download (FTP): <ulink url="&kde-runtime-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kde-runtime-download-ftp;"/>

source: Download MD5 sum: &kde-runtime-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kde-runtime-md5sum;

source: Download size: &kde-runtime-size;
fr: Taille du téléchargement&nbsp;: &kde-runtime-size;

source: Estimated disk space required: &kde-runtime-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kde-runtime-buildsize;

source: Estimated build time: &kde-runtime-time;
fr: Estimation du temps de construction&nbsp;: &kde-runtime-time;

source: Kde-runtime Dependencies
fr: Dépendances de Kde-runtime

source: Required
fr: Requises

source: <xref linkend="kdelibs"/> and <xref linkend="libgcrypt"/>
fr: <xref linkend="kdelibs"/> et <xref linkend="libgcrypt"/>

source: Recommended
fr: Recommandées

source: <xref linkend="alsa-lib"/>, <xref linkend="exiv2"/>, <xref linkend="kactivities"/>, <xref linkend="kdepimlibs"/>, and <xref linkend="libjpeg"/>
fr: <xref linkend="alsa-lib"/>, <xref linkend="exiv2"/>, <xref linkend="kactivities"/>, <xref linkend="kdepimlibs"/> et <xref linkend="libjpeg"/>

source: Optional
fr: Facultatives

source: <xref linkend="libcanberra"/>, <xref linkend="NetworkManager"/>, <xref linkend="pulseaudio"/>, <xref linkend="samba"/>, <xref linkend="xine-lib"/>, <ulink url="http://www.libssh.org/">libssh</ulink>, <ulink url="https://projects.kde.org/projects/kde/kdelibs/nepomuk-core">nepomuk-core</ulink>, <ulink url="http://www.openexr.com/">OpenEXR</ulink>, <ulink url="http://www.openslp.org/">OpenSLP</ulink>, and <ulink url="http://launchpad.net/ntrack">QNtrack</ulink>
fr: <xref linkend="libcanberra"/>, <xref linkend="NetworkManager"/>, <xref linkend="pulseaudio"/>, <xref linkend="samba"/>, <xref linkend="xine-lib"/>, <ulink url="http://www.libssh.org/">libssh</ulink>, <ulink url="https://projects.kde.org/projects/kde/kdelibs/nepomuk-core">nepomuk-core</ulink>, <ulink url="http://www.openexr.com/">OpenEXR</ulink>, <ulink url="http://www.openslp.org/">OpenSLP</ulink> et <ulink url="http://launchpad.net/ntrack">QNtrack</ulink>

source: User Notes: <ulink url="&blfs-wiki;/kde-runtime"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kde-runtime"/>

source: Installation of Kde-runtime
fr: Installation de Kde-runtime

source: Install <application>kde-runtime</application> by running the following commands:
fr: Installez <application>kde-runtime</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue <command>make test</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make test</command>.

source: Now as the <systemitem class="username">root</systemitem> user:
fr: Maintenant en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <parameter>-DSAMBA_INCLUDE_DIR=/usr/include/samba-4.0</parameter>: This switch is used so that <application>CMake</application> can properly find <application>Samba</application> headers which got moved in version 4.
fr: <parameter>-DSAMBA_INCLUDE_DIR=/usr/include/samba-4.0</parameter>&nbsp;: Ce paramètre est utilisé pour que <application>CMake</application> puisse proprement trouver les entêtes <application>Samba</application> qui ont été déplacés dans la version 4.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: kcmshell4, kde-cp, kde-mv, kde-open, kde4, kde4-menu, kdebugdialog, keditfiletype, kfile4, kglobalaccel, khelpcenter, khotnewstuff-upload, khotnewstuff4, kiconfinder, kioclient, kmimetypefinder, knotify4, kquitapp, kreadconfig, kstart, ksvgtopng, ktraderclient, ktrash, kuiserver, kwalletd, kwriteconfig, plasma-remote-helper, plasmapkg and solid-hardware.
fr: kcmshell4, kde-cp, kde-mv, kde-open, kde4, kde4-menu, kdebugdialog, keditfiletype, kfile4, kglobalaccel, khelpcenter, khotnewstuff-upload, khotnewstuff4, kiconfinder, kioclient, kmimetypefinder, knotify4, kquitapp, kreadconfig, kstart, ksvgtopng, ktraderclient, ktrash, kuiserver, kwalletd, kwriteconfig, plasma-remote-helper, plasmapkg et solid-hardware.

source: several in &kde-dir;/lib
fr: plusieurs dans &kde-dir;/lib

source: several in &kde-dir;/lib and &kde-dir;/share
fr: plusieurs dans &kde-dir;/lib et &kde-dir;/share
