Repository: espindula/br-lfs
Catalog: blfs/*/kde/core/kde-*-artwork.po
Languages: fr

source: 7.1 MB
fr: 7.1 Mio

source: 7.7 MB
fr: 7.7 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Kde-base-artwork
fr: Introduction à Kde-base-artwork

source: This package provides the default splash screen for KDE.
fr: Ce paquet fournit l'écran par défaut de KDE.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kde-base-artwork-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kde-base-artwork-download-http;"/>

source: Download (FTP): <ulink url="&kde-base-artwork-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kde-base-artwork-download-ftp;"/>

source: Download MD5 sum: &kde-base-artwork-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kde-base-artwork-md5sum;

source: Download size: &kde-base-artwork-size;
fr: Taille du téléchargement&nbsp;: &kde-base-artwork-size;

source: Estimated disk space required: &kde-base-artwork-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kde-base-artwork-buildsize;

source: Estimated build time: &kde-base-artwork-time;
fr: Estimation du temps de construction&nbsp;: &kde-base-artwork-time;

source: Kde-base-artwork Dependencies
fr: Dépendances de Kde-base-artwork

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/kde-base-artwork"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kde-base-artwork"/>

source: Installation of Kde-base-artwork
fr: Installation de Kde-base-artwork

source: Install <application>Kde-base-artwork</application> by running the following commands:
fr: Installez <application>Kde-base-artwork</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé
