Repository: espindula/br-lfs
Catalog: blfs/*/kde/core/kdepimlibs.po
Languages: fr

source: 2.7 MB
fr: 2.7 Mio

source: 213 MB
fr: 213 Mio

source: Introduction to Kdepimlibs
fr: Introduction à Kdepimlibs

source: <application>Kdepimlibs</application> is the common library for <application>KDE</application> PIM applications like <command>kmail</command>, <command>kalarm</command>, etc.
fr: <application>Kdepimlibs</application> est la bibliothèque commune pour les applications PIM de <application>KDE</application> comme <command>kmail</command>, <command>kalarm</command> etc.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kdepimlibs-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kdepimlibs-download-http;"/>

source: Download (FTP): <ulink url="&kdepimlibs-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kdepimlibs-download-ftp;"/>

source: Download MD5 sum: &kdepimlibs-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kdepimlibs-md5sum;

source: Download size: &kdepimlibs-size;
fr: Taille du téléchargement&nbsp;: &kdepimlibs-size;

source: Estimated disk space required: &kdepimlibs-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kdepimlibs-buildsize;

source: Estimated build time: &kdepimlibs-time;
fr: Estimation du temps de construction&nbsp;: &kdepimlibs-time;

source: Kdepimlibs Dependencies
fr: Dépendances de Kdepimlibs

source: Required
fr: Requises

source: <xref linkend="kdelibs"/>, <xref linkend="libxslt"/>, <xref linkend="gpgme"/>, <xref linkend="libical"/>, <xref linkend="akonadi"/>, <xref linkend="cyrus-sasl"/>, <xref linkend="boost"/>, and <xref linkend="qjson"/>
fr: <xref linkend="kdelibs"/>, <xref linkend="libxslt"/>, <xref linkend="gpgme"/>, <xref linkend="libical"/>, <xref linkend="akonadi"/>, <xref linkend="cyrus-sasl"/>, <xref linkend="boost"/> et <xref linkend="qjson"/>

source: Recommended
fr: Recommandées

source: <xref linkend="openldap"/> (if connecting to an LDAP server)
fr: <xref linkend="openldap"/> (si vous vous connectez à un serveur LDAP)

source: Optional
fr: Facultatives

source: <xref linkend="openssl"/> and <ulink url="http://projects.kde.org/prison">prison</ulink>
fr: <xref linkend="openssl"/> et <ulink url="http://projects.kde.org/prison">prison</ulink>

source: User Notes: <ulink url="&blfs-wiki;/kdepimlibs"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kdepimlibs"/>

source: Installation of Kdepimlibs
fr: Installation de Kdepimlibs

source: Install <application>kdepimlibs</application> by running the following commands:
fr: Installez <application>kdepimlibs</application> en lançant les commandes suivantes&nbsp;:

source: The full test suite for this package is not enabled by default and not tested by the BLFS team.
fr: La suite de tests complètes pour ce paquet n'est pas active par défaut et pas testée par l'équipe de BLFS.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: akonadi2xml, akonadi_benchmarker, and akonaditest
fr: akonadi2xml, akonadi_benchmarker et akonaditest

source: several in &kde-dir;/lib
fr: plusieurs dans &kde-dir;/lib

source: several in &kde-dir;/include, &kde-dir;/lib and &kde-dir;/share
fr: plusieurs dans &kde-dir;/include, &kde-dir;/lib et &kde-dir;/share
