Repository: espindula/br-lfs
Catalog: blfs/*/kde/core/polkit-kde-agent.po
Languages: fr

source: 34 KB
fr: 34 Kio

source: 6.8 MB
fr: 6.8 Mio

source: Introduction to Polkit-kde-agent
fr: Introduction à Polkit-kde-agent

source: <application>Polkit-kde-agent</application> provides a graphical authentication prompt so non-priviledged users can authenticate themselves for performing administrative tasks in KDE.
fr: <application>Polkit-kde-agent</application> fournit une boîte de dialogue graphique pour l'authentification, pour que des utilisateurs non privilégiés puissent s'authentifier et effectuer des tâches administratives dans KDE.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&polkit-kde-agent-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&polkit-kde-agent-download-http;"/>

source: Download (FTP): <ulink url="&polkit-kde-agent-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&polkit-kde-agent-download-ftp;"/>

source: Download MD5 sum: &polkit-kde-agent-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &polkit-kde-agent-md5sum;

source: Download size: &polkit-kde-agent-size;
fr: Taille du téléchargement&nbsp;: &polkit-kde-agent-size;

source: Estimated disk space required: &polkit-kde-agent-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &polkit-kde-agent-buildsize;

source: Estimated build time: &polkit-kde-agent-time;
fr: Estimation du temps de construction&nbsp;: &polkit-kde-agent-time;

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Optional patch: <ulink url="&patch-root;/polkit-kde-agent-1-&polkit-kde-agent-version;-remember_password-1.patch"/>
fr: Correctif facultatif&nbsp;:: <ulink url="&patch-root;/polkit-kde-agent-1-&polkit-kde-agent-version;-remember_password-1.patch"/>

source: Polkit-kde-agent Dependencies
fr: Dépendances de Polkit-kde-agent

source: Required
fr: Requises

source: <xref linkend="polkit-qt"/> and <xref linkend="kdelibs"/>
fr: <xref linkend="polkit-qt"/> et <xref linkend="kdelibs"/>

source: User Notes: <ulink url="&blfs-wiki;/polkit-kde-agent"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/polkit-kde-agent"/>

source: Installation of Polkit-kde-agent
fr: Installation de Polkit-kde-agent

source: Install <application>polkit-kde-agent</application> by running the following commands:
fr: Installez <application>polkit-kde-agent</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
