Repository: espindula/br-lfs
Catalog: blfs/*/kde/core/qimageblitz.po
Languages: fr

source: 57 KB
fr: 57 Kio

source: 1.4 MB
fr: 1.4 Mio

source: Introduction to QImageblitz
fr: Introduction à QImageblitz

source: <application>QImageblitz</application> is a graphical effect and filter library for <application>KDE</application>.
fr: <application>QImageblitz</application> est un effet graphique et une bibliothèque de filtres pour <application>KDE</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&qimageblitz-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&qimageblitz-download-http;"/>

source: Download (FTP): <ulink url="&qimageblitz-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&qimageblitz-download-ftp;"/>

source: Download MD5 sum: &qimageblitz-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &qimageblitz-md5sum;

source: Download size: &qimageblitz-size;
fr: Taille du téléchargement&nbsp;: &qimageblitz-size;

source: Estimated disk space required: &qimageblitz-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &qimageblitz-buildsize;

source: Estimated build time: &qimageblitz-time;
fr: Estimation du temps de construction&nbsp;: &qimageblitz-time;

source: QImageblitz Dependencies
fr: Dépendances de QImageblitz

source: Required
fr: Requises

source: <xref linkend="qt4"/> and <xref linkend="cmake"/>
fr: <xref linkend="qt4"/> et <xref linkend="cmake"/>

source: User Notes: <ulink url="&blfs-wiki;/qimageblitz"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/qimageblitz"/>

source: Installation of QImageblitz
fr: Installation de QImageblitz

source: Install <application>QImageblitz</application> by running the following commands:
fr: Installez <application>QImageblitz</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: is a testing utility for qimageblitz.
fr: est un utilitaire de test pour qimageblitz.
