Repository: espindula/br-lfs
Catalog: lfs/*/appendices/acknowledgments.po
Languages: fr, pt_br

source: Appendix B
fr: Annexe B
pt_br: Anexo B

source: Acknowledgments
fr: Remerciements
pt_br: Reconhecimentos

source: We would like to thank the following people and organizations for their contributions to the Linux From Scratch Project.
fr: Nous aimerions remercier les personnes et organisations suivantes pour leurs contributions au projet Linux From Scratch.
pt_br: Nós gostaríamos de agradecer às seguintes pessoas e organizações pelas contribuições delas para o Linux From Scratch Project.

source: <ulink url="mailto:gerard@linuxfromscratch.org">Gerard Beekmans</ulink> &lt;gerard@linuxfromscratch.org&gt; &ndash; LFS Creator
fr: <ulink url="mailto:gerard@linuxfromscratch.org">Gerard Beekmans</ulink> &lt;gerard@linuxfromscratch.org&gt; &ndash; Créateur de LFS
pt_br: <ulink url="mailto:gerard@linuxfromscratch.org">Gerard Beekmans</ulink> &lt;gerard@linuxfromscratch.org&gt; &ndash; Criador do LFS

source: <ulink url="mailto:bdubbs@linuxfromscratch.org">Bruce Dubbs</ulink> &lt;bdubbs@linuxfromscratch.org&gt; &ndash; LFS Managing Editor
fr: <ulink url="mailto:bdubbs@linuxfromscratch.org">Bruce Dubbs</ulink> &lt;bdubbs@linuxfromscratch.org&gt; &ndash; Rédacteur en chef de LFS
pt_br: <ulink url="mailto:bdubbs@linuxfromscratch.org">Bruce Dubbs</ulink> &lt;bdubbs@linuxfromscratch.org&gt; &ndash; Editor-chefe do LFS

source: <ulink url="mailto:jim@linuxfromscratch.org">Jim Gifford</ulink> &lt;jim@linuxfromscratch.org&gt; &ndash; CLFS Project Co-Leader
fr: <ulink url="mailto:jim@linuxfromscratch.org">Jim Gifford</ulink> &lt;jim@linuxfromscratch.org&gt; &ndash; Co-Leader du projet CLFS
pt_br: <ulink url="mailto:jim@linuxfromscratch.org">Jim Gifford</ulink> &lt;jim@linuxfromscratch.org&gt; &ndash; Colíder do Projeto CLFS

source: <ulink url="mailto:pierre@linuxfromscratch.org">Pierre Labastie</ulink> &lt;pierre@linuxfromscratch.org&gt; &ndash; BLFS Editor and ALFS Lead
fr: <ulink url="mailto:pierre@linuxfromscratch.org">Pierre Labastie</ulink> &lt;pierre@linuxfromscratch.org&gt; &ndash; Rédacteur de BLFS et meneur de ALFS
pt_br: <ulink url="mailto:pierre@linuxfromscratch.org">Pierre Labastie</ulink> &lt;pierre@linuxfromscratch.org&gt; &ndash; Editor do BLFS e Líder do ALFS

source: <ulink url="mailto:dj@linuxfromscratch.org">DJ Lucas</ulink> &lt;dj@linuxfromscratch.org&gt; &ndash; LFS and BLFS Editor
fr: <ulink url="mailto:dj@linuxfromscratch.org">DJ Lucas</ulink> &lt;dj@linuxfromscratch.org&gt; &ndash; Rédacteur de LFS et de BLFS
pt_br: <ulink url="mailto:dj@linuxfromscratch.org">DJ Lucas</ulink> &lt;dj@linuxfromscratch.org&gt; &ndash; Editor do LFS e BLFS

source: <ulink url="mailto:ken@linuxfromscratch.org">Ken Moffat</ulink> &lt;ken@linuxfromscratch.org&gt; &ndash; BLFS Editor
fr: <ulink url="mailto:ken@linuxfromscratch.org">Ken Moffat</ulink> &lt;ken@linuxfromscratch.org&gt; &ndash; Rédacteur de BLFS
pt_br: <ulink url="mailto:ken@linuxfromscratch.org">Ken Moffat</ulink> &lt;ken@linuxfromscratch.org&gt; &ndash; Editor do BLFS

source: Countless other people on the various LFS and BLFS mailing lists who helped make this book possible by giving their suggestions, testing the book, and submitting bug reports, instructions, and their experiences with installing various packages.
fr: Sans compter les autres personnes sur les diverses listes de diffusion de LFS et BLFS qui ont aidé à rendre possible ce livre par leurs suggestions, leurs tests&nbsp;; leurs soumissions de rapports de bogue, d'instructions et leurs retours d'expérience en installant divers paquets.
pt_br: Incontáveis outras pessoas nas várias listas de discussão do LFS e do BLFS que ajudaram a tornar este livro possível dando as sugestões delas; testando o livro; e submetendo relatórios de defeitos; instruções; e suas experiências com a instalação de vários pacotes.

source: Translators
fr: Traducteurs
pt_br: Tradutores(as)

source: <ulink url="mailto:macana@macana-es.com">Manuel Canales Esparcia</ulink> &lt;macana@macana-es.com&gt; &ndash; Spanish LFS translation project
fr: <ulink url="mailto:macana@macana-es.com">Manuel Canales Esparcia</ulink> &lt;macana@macana-es.com&gt; &ndash; Projet de traduction de LFS en espagnol
pt_br: <ulink url="mailto:macana@macana-es.com">Manuel Canales Esparcia</ulink> &lt;macana@macana-es.com&gt; &ndash; Projeto de tradução do LFS para espanhol

source: <ulink url="mailto:johan@linuxfromscratch.org">Johan Lenglet</ulink> &lt;johan@linuxfromscratch.org&gt; &ndash; French LFS translation project until 2008
fr: <ulink url="mailto:johan@linuxfromscratch.org">Johan Lenglet</ulink> &lt;johan@linuxfromscratch.org&gt; &ndash; Projet de traduction de LFS en français jusqu'en 2008
pt_br: <ulink url="mailto:johan@linuxfromscratch.org">Johan Lenglet</ulink> &lt;johan@linuxfromscratch.org&gt; &ndash; Projeto de tradução do LFS para francês até 2008

source: <ulink url="mailto:jmengual@linuxfromscratch.org">Jean-Philippe Mengual </ulink> &lt;jmengual@linuxfromscratch.org&gt; &ndash; French LFS translation project 2008-2016
fr: <ulink url="mailto:jmengual@linuxfromscratch.org">Jean-Philippe Mengual </ulink> &lt;jmengual@linuxfromscratch.org&gt; &ndash; Projet de traduction de LFS en français de 2008 à 2016
pt_br: <ulink url="mailto:jmengual@linuxfromscratch.org">Jean-Philippe Mengual</ulink> &lt;jmengual@linuxfromscratch.org&gt; &ndash; Projeto de tradução do LFS para francês 2008-2016

source: <ulink url="mailto:jlepiller@linuxfromscratch.org">Julien Lepiller </ulink> &lt;jlepiller@linuxfromscratch.org&gt; &ndash; French LFS translation project 2017-present
fr: <ulink url="mailto:jlepiller@linuxfromscratch.org">Julien Lepiller </ulink> &lt;jlepiller@linuxfromscratch.org&gt; &ndash; Projet de traduction de LFS en français depuis 2017
pt_br: <ulink url="mailto:jlepiller@linuxfromscratch.org">Julien Lepiller</ulink> &lt;jlepiller@linuxfromscratch.org&gt; &ndash; Projeto de tradução do LFS para francês 2017-presente

source: <ulink url="mailto:lizardo@linuxfromscratch.org">Anderson Lizardo</ulink> &lt;lizardo@linuxfromscratch.org&gt; &ndash; Portuguese LFS translation project
fr: <ulink url="mailto:lizardo@linuxfromscratch.org">Anderson Lizardo</ulink> &lt;lizardo@linuxfromscratch.org&gt; &ndash; Projet de traduction de LFS en portugais

source: <ulink url="mailto:tr@erdfunkstelle.de">Thomas Reitelbach </ulink> &lt;tr@erdfunkstelle.de&gt; &ndash; German LFS translation project
fr: <ulink url="mailto:tr@erdfunkstelle.de">Thomas Reitelbach </ulink> &lt;tr@erdfunkstelle.de&gt; &ndash; Projet de traduction de LFS en allemand
pt_br: <ulink url="mailto:tr@erdfunkstelle.de">Thomas Reitelbach</ulink> &lt;tr@erdfunkstelle.de&gt; &ndash; Projeto de tradução do LFS para alemão

source: Mirror Maintainers
fr: Mainteneurs de miroirs
pt_br: Mantenedores(as) de Espelhos

source: North American Mirrors
fr: Miroirs nord-américains
pt_br: Espelhos da América do Norte

source: <ulink url="mailto:scott@osuosl.org">Scott Kveton</ulink> &lt;scott@osuosl.org&gt; &ndash; lfs.oregonstate.edu mirror
fr: <ulink url="mailto:scott@osuosl.org">Scott Kveton</ulink> &lt;scott@osuosl.org&gt; &ndash; miroir lfs.oregonstate.edu
pt_br: <ulink url="mailto:scott@osuosl.org">Scott Kveton</ulink> &lt;scott@osuosl.org&gt; &ndash; espelho lfs.oregonstate.edu

source: <ulink url="mailto:lost@l-w.net">William Astle</ulink> &lt;lost@l-w.net&gt; &ndash; ca.linuxfromscratch.org mirror
fr: <ulink url="mailto:lost@l-w.net">William Astle</ulink> &lt;lost@l-w.net&gt; &ndash; miroir ca.linuxfromscratch.org
pt_br: <ulink url="mailto:lost@l-w.net">William Astle</ulink> &lt;lost@l-w.net&gt; &ndash; espelho ca.linuxfromscratch.org

source: <ulink url="mailto:eujon.sellers@gmail.com">Eujon Sellers</ulink> &lt;jpolen@rackspace.com&gt; &ndash; lfs.introspeed.com mirror
fr: <ulink url="mailto:eujon.sellers@gmail.com">Eujon Sellers</ulink> &lt;jpolen@rackspace.com&gt; &ndash; miroir lfs.introspeed.com
pt_br: <ulink url="mailto:eujon.sellers@gmail.com">Eujon Sellers</ulink> &lt;jpolen@rackspace.com&gt; &ndash; espelho lfs.introspeed.com

source: <ulink url="mailto:justin@knierim.org">Justin Knierim</ulink> &lt;tim@idge.net&gt; &ndash; lfs-matrix.net mirror
fr: <ulink url="mailto:justin@knierim.org">Justin Knierim</ulink> &lt;tim@idge.net&gt; &ndash; miroir lfs-matrix.net
pt_br: <ulink url="mailto:justin@knierim.org">Justin Knierim</ulink> &lt;tim@idge.net&gt; &ndash; espelho lfs-matrix.net

source: South American Mirrors
fr: Miroirs sud-américains
pt_br: Espelhos da América do Sul

source: <ulink url="mailto:manuel@linuxfromscratch.org">Manuel Canales Esparcia</ulink> &lt;manuel@linuxfromscratch.org&gt; &ndash; lfsmirror.lfs-es.info mirror
fr: <ulink url="mailto:manuel@linuxfromscratch.org">Manuel Canales Esparcia</ulink> &lt;manuel@linuxfromscratch.org&gt; &ndash; miroir lfsmirror.lfs-es.info
pt_br: <ulink url="mailto:manuel@linuxfromscratch.org">Manuel Canales Esparcia</ulink> &lt;manuel@linuxfromscratch.org&gt; &ndash; espelho lfsmirror.lfs-es.info

source: <ulink url="mailto:lfalcon@thymbra.com">Luis Falcon</ulink> &lt;Luis Falcon&gt; &ndash; torredehanoi.org mirror
fr: <ulink url="mailto:lfalcon@thymbra.com">Luis Falcon</ulink> &lt;Luis Falcon&gt; &ndash; miroir torredehanoi.org
pt_br: <ulink url="mailto:lfalcon@thymbra.com">Luis Falcon</ulink> &lt;Luis Falcon&gt; &ndash; espelho torredehanoi.org

source: European Mirrors
fr: Miroirs européens
pt_br: Espelhos Europeus

source: <ulink url="mailto:guido@primerelay.net">Guido Passet</ulink> &lt;guido@primerelay.net&gt; &ndash; nl.linuxfromscratch.org mirror
fr: <ulink url="mailto:guido@primerelay.net">Guido Passet</ulink> &lt;guido@primerelay.net&gt; &ndash; miroir nl.linuxfromscratch.org
pt_br: <ulink url="mailto:guido@primerelay.net">Guido Passet</ulink> &lt;guido@primerelay.net&gt; &ndash; espelho nl.linuxfromscratch.org

source: <ulink url="mailto:baafie@planet.nl">Bastiaan Jacques</ulink> &lt;baafie@planet.nl&gt; &ndash; lfs.pagefault.net mirror
fr: <ulink url="mailto:baafie@planet.nl">Bastiaan Jacques</ulink> &lt;baafie@planet.nl&gt; &ndash; miroir lfs.pagefault.net
pt_br: <ulink url="mailto:baafie@planet.nl">Bastiaan Jacques</ulink> &lt;baafie@planet.nl&gt; &ndash; espelho lfs.pagefault.net

source: <ulink url="mailto:sven.cranshoff@lineo.be">Sven Cranshoff</ulink> &lt;sven.cranshoff@lineo.be&gt; &ndash; lfs.lineo.be mirror
fr: <ulink url="mailto:sven.cranshoff@lineo.be">Sven Cranshoff</ulink> &lt;sven.cranshoff@lineo.be&gt; &ndash; miroir lfs.lineo.be
pt_br: <ulink url="mailto:sven.cranshoff@lineo.be">Sven Cranshoff</ulink> &lt;sven.cranshoff@lineo.be&gt; &ndash; espelho lfs.lineo.be

source: Scarlet Belgium &ndash; lfs.scarlet.be mirror
fr: Scarlet Belgium &ndash; miroir lfs.scarlet.be
pt_br: Scarlet Belgium &ndash; espelho lfs.scarlet.be

source: <ulink url="mailto:info@aliensoft.org">Sebastian Faulborn</ulink> &lt;info@aliensoft.org&gt; &ndash; lfs.aliensoft.org mirror
fr: <ulink url="mailto:info@aliensoft.org">Sebastian Faulborn</ulink> &lt;info@aliensoft.org&gt; &ndash; miroir lfs.aliensoft.org
pt_br: <ulink url="mailto:info@aliensoft.org">Sebastian Faulborn</ulink> &lt;info@aliensoft.org&gt; &ndash; espelho lfs.aliensoft.org

source: <ulink url="mailto:stuart@dontuse.ms">Stuart Fox</ulink> &lt;stuart@dontuse.ms&gt; &ndash; lfs.dontuse.ms mirror
fr: <ulink url="mailto:stuart@dontuse.ms">Stuart Fox</ulink> &lt;stuart@dontuse.ms&gt; &ndash; miroir lfs.dontuse.ms
pt_br: <ulink url="mailto:stuart@dontuse.ms">Stuart Fox</ulink> &lt;stuart@dontuse.ms&gt; &ndash; espelho lfs.dontuse.ms

source: <ulink url="mailto:admin@realhost.de">Ralf Uhlemann</ulink> &lt;admin@realhost.de&gt; &ndash; lfs.oss-mirror.org mirror
fr: <ulink url="mailto:admin@realhost.de">Ralf Uhlemann</ulink> &lt;admin@realhost.de&gt; &ndash; miroir lfs.oss-mirror.org
pt_br: <ulink url="mailto:admin@realhost.de">Ralf Uhlemann</ulink> &lt;admin@realhost.de&gt; &ndash; espelho lfs.oss-mirror.org

source: <ulink url="mailto:Antonin.Sprinzl@tuwien.ac.at">Antonin Sprinzl</ulink> &lt;Antonin.Sprinzl@tuwien.ac.at&gt; &ndash; at.linuxfromscratch.org mirror
fr: <ulink url="mailto:Antonin.Sprinzl@tuwien.ac.at">Antonin Sprinzl</ulink> &lt;Antonin.Sprinzl@tuwien.ac.at&gt; &ndash; miroir at.linuxfromscratch.org
pt_br: <ulink url="mailto:Antonin.Sprinzl@tuwien.ac.at">Antonin Sprinzl</ulink> &lt;Antonin.Sprinzl@tuwien.ac.at&gt; &ndash; espelho at.linuxfromscratch.org

source: <ulink url="mailto:fredan-lfs@fredan.org">Fredrik Danerklint</ulink> &lt;fredan-lfs@fredan.org&gt; &ndash; se.linuxfromscratch.org mirror
fr: <ulink url="mailto:fredan-lfs@fredan.org">Fredrik Danerklint</ulink> &lt;fredan-lfs@fredan.org&gt; &ndash; miroir se.linuxfromscratch.org
pt_br: <ulink url="mailto:fredan-lfs@fredan.org">Fredrik Danerklint</ulink> &lt;fredan-lfs@fredan.org&gt; &ndash; espelho se.linuxfromscratch.org

source: <ulink url="mailto:franck@linuxpourtous.com">Franck</ulink> &lt;franck@linuxpourtous.com&gt; &ndash; lfs.linuxpourtous.com mirror
fr: <ulink url="mailto:franck@linuxpourtous.com">Franck</ulink> &lt;franck@linuxpourtous.com&gt; &ndash; miroir lfs.linuxpourtous.com
pt_br: <ulink url="mailto:franck@linuxpourtous.com">Franck</ulink> &lt;franck@linuxpourtous.com&gt; &ndash; espelho lfs.linuxpourtous.com

source: <ulink url="mailto:baque@cict.fr">Philippe Baque</ulink> &lt;baque@cict.fr&gt; &ndash; lfs.cict.fr mirror
fr: <ulink url="mailto:baque@cict.fr">Philippe Baque</ulink> &lt;baque@cict.fr&gt; &ndash; miroir lfs.cict.fr
pt_br: <ulink url="mailto:baque@cict.fr">Philippe Baque</ulink> &lt;baque@cict.fr&gt; &ndash; espelho lfs.cict.fr

source: <ulink url="mailto:gyouja@pilgrims.ru">Vitaly Chekasin</ulink> &lt;gyouja@pilgrims.ru&gt; &ndash; lfs.pilgrims.ru mirror
fr: <ulink url="mailto:gyouja@pilgrims.ru">Vitaly Chekasin</ulink> &lt;gyouja@pilgrims.ru&gt; &ndash; miroir lfs.pilgrims.ru
pt_br: <ulink url="mailto:gyouja@pilgrims.ru">Vitaly Chekasin</ulink> &lt;gyouja@pilgrims.ru&gt; &ndash; espelho lfs.pilgrims.ru

source: <ulink url="mailto:kontakt@wankoo.org">Benjamin Heil</ulink> &lt;kontakt@wankoo.org&gt; &ndash; lfs.wankoo.org mirror
fr: <ulink url="mailto:kontakt@wankoo.org">Benjamin Heil</ulink> &lt;kontakt@wankoo.org&gt; &ndash; miroir lfs.wankoo.org
pt_br: <ulink url="mailto:kontakt@wankoo.org">Benjamin Heil</ulink> &lt;kontakt@wankoo.org&gt; &ndash; espelho lfs.wankoo.org

source: <ulink url="mailto:info@linuxfromscratch.org.ru">Anton Maisak</ulink> &lt;info@linuxfromscratch.org.ru&gt; &ndash; linuxfromscratch.org.ru mirror
fr: <ulink url="mailto:info@linuxfromscratch.org.ru">Anton Maisak</ulink> &lt;info@linuxfromscratch.org.ru&gt; &ndash; miroir linuxfromscratch.org.ru
pt_br: <ulink url="mailto:info@linuxfromscratch.org.ru">Anton Maisak</ulink> &lt;info@linuxfromscratch.org.ru&gt; &ndash; espelho linuxfromscratch.org.ru

source: Asian Mirrors
fr: Miroirs asiatiques
pt_br: Espelhos Asiáticos

source: <ulink url="mailto:satit@wbac.ac.th">Satit Phermsawang</ulink> &lt;satit@wbac.ac.th&gt; &ndash; lfs.phayoune.org mirror
fr: <ulink url="mailto:satit@wbac.ac.th">Satit Phermsawang</ulink> &lt;satit@wbac.ac.th&gt; &ndash; miroir lfs.phayoune.org
pt_br: <ulink url="mailto:satit@wbac.ac.th">Satit Phermsawang</ulink> &lt;satit@wbac.ac.th&gt; &ndash; espelho lfs.phayoune.org

source: <ulink url="mailto:info@shizu-net.jp">Shizunet Co.,Ltd.</ulink> &lt;info@shizu-net.jp&gt; &ndash; lfs.mirror.shizu-net.jp mirror
fr: <ulink url="mailto:info@shizu-net.jp">Shizunet Co.,Ltd.</ulink> &lt;info@shizu-net.jp&gt; &ndash; miroir lfs.mirror.shizu-net.jp
pt_br: <ulink url="mailto:info@shizu-net.jp">Shizunet Co.,Ltd.</ulink> &lt;info@shizu-net.jp&gt; &ndash; espelho lfs.mirror.shizu-net.jp

source: <ulink url="http://www.initworld.com/">Init World</ulink> &lt;http://www.initworld.com/&gt; &ndash; lfs.initworld.com mirror
fr: <ulink url="http://www.initworld.com/">Init World</ulink> &lt;http://www.initworld.com/&gt; &ndash; miroir lfs.initworld.com

source: Australian Mirrors
fr: Miroirs australiens
pt_br: Espelhos da Austrália

source: <ulink url="mailto:jason@dstc.edu.au">Jason Andrade</ulink> &lt;jason@dstc.edu.au&gt; &ndash; au.linuxfromscratch.org mirror
fr: <ulink url="mailto:jason@dstc.edu.au">Jason Andrade</ulink> &lt;jason@dstc.edu.au&gt; &ndash; miroir au.linuxfromscratch.org
pt_br: <ulink url="mailto:jason@dstc.edu.au">Jason Andrade</ulink> &lt;jason@dstc.edu.au&gt; &ndash; espelho au.linuxfromscratch.org

source: Former Project Team Members
fr: Anciens membres de l'équipe du projet
pt_br: Ex-membros da Equipe do Projeto

source: <ulink url="mailto:theladyskye@linuxfromscratch.org">Christine Barczak</ulink> &lt;theladyskye@linuxfromscratch.org&gt; &ndash; LFS Book Editor
fr: <ulink url="mailto:theladyskye@linuxfromscratch.org">Christine Barczak</ulink> &lt;theladyskye@linuxfromscratch.org&gt; &ndash; Rédacteur du livre LFS
pt_br: <ulink url="mailto:theladyskye@linuxfromscratch.org">Christine Barczak</ulink> &lt;theladyskye@linuxfromscratch.org&gt; &ndash; Editor do Livro LFS

source: Archaic &lt;archaic@linuxfromscratch.org&gt; &ndash; LFS Technical Writer/Editor, HLFS Project Leader, BLFS Editor, Hints and Patches Project Maintainer
fr: Archaic &lt;archaic@linuxfromscratch.org&gt; &ndash; Rédacteur technique LFS, leader du projet HLFS, éditeur de BLFS, mainteneur des projets d'astuces et correctifs
pt_br: Archaic &lt;archaic@linuxfromscratch.org&gt; &ndash; Escritor/Editor Técnico do LFS (Dicas e Patches); Líder do Projeto HLFS; Editor do BLFS; Mantenedor do Projeto Dicas e Patches

source: <ulink url="mailto:matthew@linuxfromscratch.org">Matthew Burgess</ulink> &lt;matthew@linuxfromscratch.org&gt; &ndash; LFS Project Leader, LFS Technical Writer/Editor
fr: <ulink url="mailto:matthew@linuxfromscratch.org">Matthew Burgess</ulink> &lt;matthew@linuxfromscratch.org&gt; &ndash; Leader du projet LFS, rédacteur technique LFS/éditeur
pt_br: <ulink url="mailto:matthew@linuxfromscratch.org">Matthew Burgess</ulink> &lt;matthew@linuxfromscratch.org&gt; &ndash; Líder de Projeto do LFS; Escritor/Editor Técnico do LFS

source: <ulink url="mailto:nathan@linuxfromscratch.org">Nathan Coulson</ulink> &lt;nathan@linuxfromscratch.org&gt; &ndash; LFS-Bootscripts Maintainer
fr: <ulink url="mailto:nathan@linuxfromscratch.org">Nathan Coulson</ulink> &lt;nathan@linuxfromscratch.org&gt; &ndash; Mainteneur de LFS-Bootscripts
pt_br: <ulink url="mailto:nathan@linuxfromscratch.org">Nathan Coulson</ulink> &lt;nathan@linuxfromscratch.org&gt; &ndash; Mantenedor de Scripts de Inicialização do LFS

source: <ulink url="mailto:jeroen@linuxfromscratch.org">Jeroen Coumans</ulink> &lt;jeroen@linuxfromscratch.org&gt; &ndash; Website Developer, FAQ Maintainer
fr: <ulink url="mailto:jeroen@linuxfromscratch.org">Jeroen Coumans</ulink> &lt;jeroen@linuxfromscratch.org&gt; &ndash; Développeur du site Web, mainteneur de la FAQ
pt_br: <ulink url="mailto:jeroen@linuxfromscratch.org">Jeroen Coumans</ulink> &lt;jeroen@linuxfromscratch.org&gt; &ndash; Desenvolvedor de Sítio da Web; Mantenedor de FAQ

source: <ulink url="mailto:manuel@linuxfromscratch.org">Manuel Canales Esparcia</ulink> &lt;manuel@linuxfromscratch.org&gt; &ndash; LFS/BLFS/HLFS XML and XSL Maintainer
fr: <ulink url="mailto:manuel@linuxfromscratch.org">Manuel Canales Esparcia</ulink> &lt;manuel@linuxfromscratch.org&gt; &ndash; Mainteneur de LFS/BLFS/HLFS en XML et XSL
pt_br: <ulink url="mailto:manuel@linuxfromscratch.org">Manuel Canales Esparcia</ulink> &lt;manuel@linuxfromscratch.org&gt; &ndash; Mantenedor de XML e XSL do LFS/BLFS/HLFS

source: Alex Groenewoud &ndash; LFS Technical Writer
fr: Alex Groenewoud &ndash; Rédacteur technique LFS
pt_br: Alex Groenewoud &ndash; Escritor Técnico do LFS

source: <ulink url="mailto:jhuntwork@linuxfromscratch.org">Jeremy Huntwork</ulink> &lt;jhuntwork@linuxfromscratch.org&gt; &ndash; LFS Technical Writer, LFS LiveCD Maintainer
fr: <ulink url="mailto:jhuntwork@linuxfromscratch.org">Jeremy Huntwork</ulink> &lt;jhuntwork@linuxfromscratch.org&gt; &ndash; Rédacteur technique LFS, mainteneur du LiveCD LFS
pt_br: <ulink url="mailto:jhuntwork@linuxfromscratch.org">Jeremy Huntwork</ulink> &lt;jhuntwork@linuxfromscratch.org&gt; &ndash; Escritor Técnico do LFS; Mantenedor de LiveCD do LFS

source: <ulink url="mailto:bryan@linuxfromscratch.org">Bryan Kadzban</ulink> &lt;bryan@linuxfromscratch.org&gt; &ndash; LFS Technical Writer
fr: <ulink url="mailto:bryan@linuxfromscratch.org">Bryan Kadzban</ulink> &lt;bryan@linuxfromscratch.org&gt; &ndash; Rédacteur technique LFS
pt_br: <ulink url="mailto:bryan@linuxfromscratch.org">Bryan Kadzban</ulink> &lt;bryan@linuxfromscratch.org&gt; &ndash; Escritor Técnico do LFS

source: Seth W. Klein &ndash; FAQ maintainer
fr: Seth W. Klein &ndash; Mainteneur de la FAQ
pt_br: Seth W. Klein &ndash; Mantenedor do FAQ

source: <ulink url="mailto:nicholas@linuxfromscratch.org">Nicholas Leippe</ulink> &lt;nicholas@linuxfromscratch.org&gt; &ndash; Wiki Maintainer
fr: <ulink url="mailto:nicholas@linuxfromscratch.org">Nicholas Leippe</ulink> &lt;nicholas@linuxfromscratch.org&gt; &ndash; Mainteneur du Wiki
pt_br: <ulink url="mailto:nicholas@linuxfromscratch.org">Nicholas Leippe</ulink> &lt;nicholas@linuxfromscratch.org&gt; &ndash; Mantenedor da Wiki

source: <ulink url="mailto:lizardo@linuxfromscratch.org">Anderson Lizardo</ulink> &lt;lizardo@linuxfromscratch.org&gt; &ndash; Website Backend-Scripts Maintainer
fr: <ulink url="mailto:lizardo@linuxfromscratch.org">Anderson Lizardo</ulink> &lt;lizardo@linuxfromscratch.org&gt; &ndash; Mainteneur des scripts d'arrière-plan du site Web
pt_br: <ulink url="mailto:lizardo@linuxfromscratch.org">Anderson Lizardo</ulink> &lt;lizardo@linuxfromscratch.org&gt; &ndash; Mantenedor de Scripts de Infraestrutura de Sítio Web

source: <ulink url="mailto:randy@linuxfromscratch.org">Randy McMurchy</ulink> &lt;randy@linuxfromscratch.org&gt; &ndash; BLFS Project Leader, LFS Editor
fr: <ulink url="mailto:randy@linuxfromscratch.org">Randy McMurchy</ulink> &lt;randy@linuxfromscratch.org&gt; &ndash; Leader du projet BLFS, éditeur LFS
pt_br: <ulink url="mailto:randy@linuxfromscratch.org">Randy McMurchy</ulink> &lt;randy@linuxfromscratch.org&gt; &ndash; Líder de Projeto do BLFS; Editor do LFS

source: <ulink url="mailto:dnicholson@linuxfromscratch.org">Dan Nicholson</ulink> &lt;dnicholson@linuxfromscratch.org&gt; &ndash; LFS and BLFS Editor
fr: <ulink url="mailto:dnicholson@linuxfromscratch.org">Dan Nicholson</ulink> &lt;dnicholson@linuxfromscratch.org&gt; &ndash; Rédacteur de LFS et BLFS
pt_br: <ulink url="mailto:dnicholson@linuxfromscratch.org">Dan Nicholson</ulink> &lt;dnicholson@linuxfromscratch.org&gt; &ndash; Editor do LFS e BLFS

source: <ulink url="mailto:alexander@linuxfromscratch.org">Alexander E. Patrakov</ulink> &lt;alexander@linuxfromscratch.org&gt; &ndash; LFS Technical Writer, LFS Internationalization Editor, LFS Live CD Maintainer
fr: <ulink url="mailto:alexander@linuxfromscratch.org">Alexander E. Patrakov</ulink> &lt;alexander@linuxfromscratch.org&gt; &ndash; Rédacteur Technique LFS, éditeur des traductions LFS, mainteneur du LiveCD LFS
pt_br: <ulink url="mailto:alexander@linuxfromscratch.org">Alexander E. Patrakov</ulink> &lt;alexander@linuxfromscratch.org&gt; &ndash; Escritor Técnico do LFS; Editor de Internacionalização do LFS; Mantenedor de Live CD do LFS

source: <ulink url="mailto:scot@linuxfromscratch.org">Scot Mc Pherson</ulink> &lt;scot@linuxfromscratch.org&gt; &ndash; LFS NNTP Gateway Maintainer
fr: <ulink url="mailto:scot@linuxfromscratch.org">Scot Mc Pherson</ulink> &lt;scot@linuxfromscratch.org&gt; &ndash; Mainteneur de LFS NNTP Gateway
pt_br: <ulink url="mailto:scot@linuxfromscratch.org">Scot Mc Pherson</ulink> &lt;scot@linuxfromscratch.org&gt; &ndash; Mantenedor do Gateway NNTP do LFS
