Repository: espindula/br-lfs
Catalog: lfs/*/appendices/acknowledgments.po
Languages: fr, pt_br

source: <ulink url="mailto:renodr@linuxfromscratch.org">Douglas R. Reno</ulink> &lt;renodr@linuxfromscratch.org&gt; &ndash; Systemd Editor
fr: <ulink url="mailto:renodr@linuxfromscratch.org">Douglas R. Reno</ulink> &lt;renodr@linuxfromscratch.org&gt; &ndash; Rédacteur Systemd
pt_br: <ulink url="mailto:renodr@linuxfromscratch.org">Douglas R. Reno</ulink> &lt;renodr@linuxfromscratch.org&gt; &ndash; Editor do Systemd

source: <ulink url="mailto:ryan@linuxfromscratch.org">Ryan Oliver</ulink> &lt;ryan@linuxfromscratch.org&gt; &ndash; CLFS Project Co-Leader
fr: <ulink url="mailto:ryan@linuxfromscratch.org">Ryan Oliver</ulink> &lt;ryan@linuxfromscratch.org&gt; &ndash; Co-Leader du projet CLFS
pt_br: <ulink url="mailto:ryan@linuxfromscratch.org">Ryan Oliver</ulink> &lt;ryan@linuxfromscratch.org&gt; &ndash; Colíder de Projeto do CLFS

source: <ulink url="mailto:gschafer@zip.com.au">Greg Schafer</ulink> &lt;gschafer@zip.com.au&gt; &ndash; LFS Technical Writer and Architect of the Next Generation 64-bit-enabling Build Method
fr: <ulink url="mailto:gschafer@zip.com.au">Greg Schafer</ulink> &lt;gschafer@zip.com.au&gt; &ndash; Rédacteur technique LFS et architecte de la nouvelle méthode de construction activant le 64 bits
pt_br: <ulink url="mailto:gschafer@zip.com.au">Greg Schafer</ulink> &lt;gschafer@zip.com.au&gt; &ndash; Escritor Técnico do LFS e Arquiteto do Método de Construção de Habilitação de 64 bits de Próxima Geração

source: Jesse Tie-Ten-Quee &ndash; LFS Technical Writer
fr: Jesse Tie-Ten-Quee &ndash; Rédacteur technique LFS
pt_br: Jesse Tie-Ten-Quee &ndash; Escritor Técnico do LFS

source: <ulink url="mailto:jwrober@linuxfromscratch.org">James Robertson</ulink> &lt;jwrober@linuxfromscratch.org&gt; &ndash; Bugzilla Maintainer
fr: <ulink url="mailto:jwrober@linuxfromscratch.org">James Robertson</ulink> &lt;jwrober@linuxfromscratch.org&gt; &ndash; Mainteneur Bugzilla
pt_br: <ulink url="mailto:jwrober@linuxfromscratch.org">James Robertson</ulink> &lt;jwrober@linuxfromscratch.org&gt; &ndash; Mantenedor do Bugzilla

source: <ulink url="mailto:tushar@linuxfromscratch.org">Tushar Teredesai</ulink> &lt;tushar@linuxfromscratch.org&gt; &ndash; BLFS Book Editor, Hints and Patches Project Leader
fr: <ulink url="mailto:tushar@linuxfromscratch.org">Tushar Teredesai</ulink> &lt;tushar@linuxfromscratch.org&gt; &ndash; Rédacteur du livre BLFS, leader du projet d'astuces et correctifs
pt_br: <ulink url="mailto:tushar@linuxfromscratch.org">Tushar Teredesai</ulink> &lt;tushar@linuxfromscratch.org&gt; &ndash; Editor do Livro BLFS; Líder de Projeto de Dicas e Patches

source: <ulink url="mailto:jeremy@linuxfromscratch.org">Jeremy Utley</ulink> &lt;jeremy@linuxfromscratch.org&gt; &ndash; LFS Technical Writer, Bugzilla Maintainer, LFS-Bootscripts Maintainer
fr: <ulink url="mailto:jeremy@linuxfromscratch.org">Jeremy Utley</ulink> &lt;jeremy@linuxfromscratch.org&gt; &ndash; Rédacteur technique LFS, mainteneur Bugzilla, mainteneur de LFS-Bootscripts
pt_br: <ulink url="mailto:jeremy@linuxfromscratch.org">Jeremy Utley</ulink> &lt;jeremy@linuxfromscratch.org&gt; &ndash; Escritor Técnico do LFS; Mantenedor do Bugzilla; Mantenedor de Scripts de Inicialização do LFS

source: <ulink url="mailto:zwinkles@gmail.com">Zack Winkles</ulink> &lt;zwinkles@gmail.com&gt; &ndash; LFS Technical Writer
fr: <ulink url="mailto:zwinkles@gmail.com">Zack Winkles</ulink> &lt;zwinkles@gmail.com&gt; &ndash; Rédacteur technique LFS
pt_br: <ulink url="mailto:zwinkles@gmail.com">Zack Winkles</ulink> &lt;zwinkles@gmail.com&gt; &ndash; Escritor Técnico do LFS
