Repository: espindula/br-lfs
Catalog: lfs/*/appendices/dependencies.po
Languages: fr, pt_br

source: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Gperf, Make, Sed, and Util-linux
fr: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Gperf, Make, Sed et Util-linux

source: Glibc, Kmod, Xz, Util-linux, and Zlib.
fr: Glibc, Kmod, Xz, Util-linux et Zlib.

source: Bash, Binutils, Coreutils, Diffutils, Findutils, Gawk, GCC, Gettext, Glibc, GMP, Grep, M4, Make, MPC, MPFR, Patch, Perl, Sed, Tar, Texinfo, and Zstd
fr: Bash, Binutils, Coreutils, Diffutils, Findutils, Gawk, GCC, Gettext, Glibc, GMP, Grep, M4, Make, MPC, MPFR, Patch, Perl, Sed, Tar, Texinfo et Zstd

source: <ulink url="https://gcc.gnu.org/wiki/GNAT">GNAT</ulink> and <ulink url="https://repo.or.cz/isl.git">ISL</ulink>
fr: <ulink url="https://gcc.gnu.org/wiki/GNAT">GNAT</ulink> et <ulink url="https://repo.or.cz/isl.git">ISL</ulink>

source: Bash, Bison, Coreutils, Flex, GCC, Glibc, Make, Libcap, Libelf, Linux API Headers, and Zlib
fr: Bash, Bison, Coreutils, Flex, GCC, Glibc, Make, Libcap, Libelf, Linux API Headers et Zlib

source: <ulink url="&blfs-book;server/db.html">Berkeley DB</ulink> and <ulink url="&blfs-book;postlfs/iptables.html">iptables</ulink>
fr: <ulink url="&blfs-book;server/db.html">Berkeley DB</ulink> et <ulink url="&blfs-book;postlfs/iptables.html">iptables</ulink>

source: Bash, Binutils, Bison, Coreutils, Flex, GCC, Gettext, Glibc, Gzip, Make, OpenSSL, Pkg-config, Sed, Xz, and Zlib
fr: Bash, Binutils, Bison, Coreutils, Flex, GCC, Gettext, Glibc, Gzip, Make, OpenSSL, Pkg-config, Sed, Xz et Zlib

source: Bash, Binutils, Bzip2, Coreutils, Flex, GCC, GDBM, Gettext, Glibc, Grep, Groff, Gzip, Less, Libpipeline, Make, Sed, and Xz
fr: Bash, Binutils, Bzip2, Coreutils, Flex, GCC, GDBM, Gettext, Glibc, Grep, Groff, Gzip, Less, Libpipeline, Make, Sed et Xz

source: <phrase revision='sysv'>None</phrase> <phrase revision='systemd'>Systemd</phrase>
fr: <phrase revision='sysv'>Aucune</phrase> <phrase revision='systemd'>Systemd</phrase>

source: Coreutils, Kmod, and Linux
fr: Coreutils, Kmod et Linux

source: Bash, Binutils, Coreutils, Gawk, GCC, GDBM, Glibc, Grep, Groff, Make, Sed, and Zlib
fr: Bash, Binutils, Coreutils, Gawk, GCC, GDBM, Glibc, Grep, Groff, Make, Sed et Zlib

source: GDBM and Glibc
fr: GDBM et Glibc

source: Bash, Binutils, Coreutils, GCC, Glibc, Make, and Ncurses
fr: Bash, Binutils, Coreutils, GCC, Glibc, Make et Ncurses

source: Bash, Binutils, Coreutils, Expat, GCC, Gdbm, Gettext, Glibc, Grep, Libffi, Make, Ncurses, OpenSSL, Sed, and Util-linux
fr: Bash, Binutils, Coreutils, Expat, GCC, Gdbm, Gettext, Glibc, Grep, Libffi, Make, Ncurses, OpenSSL, Sed et Util-linux

source: Bzip2, Expat, Gdbm, Glibc, Libffi, Ncurses, OpenSSL, and Zlib
fr: Bzip2, Expat, Gdbm, Glibc, Libffi, Ncurses, OpenSSL et Zlib

source: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, Findutils, Gawk, GCC, Gettext, Glibc, Grep, Libcap, Make, and Sed
fr: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, Findutils, Gawk, GCC, Gettext, Glibc, Grep, Libcap, Make et Sed

source: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, Expat, Gawk, GCC, Glibc, Gperf, Grep, Jinja2, Libcap, Meson, Sed, Util-linux, and Zstd
fr: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, Expat, Gawk, GCC, Glibc, Gperf, Grep, Jinja2, Libcap, Meson, Sed, Util-linux et Zstd

source: Acl, Attr, Glibc, Libcap, and Util-linux
fr: Acl, Attr, Glibc, Libcap et Util-linux

source: <ulink url="&blfs-book;postlfs/btrfs-progs.html">btrfs-progs</ulink>, <ulink url="&blfs-book;basicnet/curl.html">cURL</ulink>, <ulink url="&blfs-book;postlfs/cryptsetup.html">cryptsetup</ulink>, <ulink url="&blfs-book;pst/docbook.html">docbook-xml</ulink>, <ulink url="&blfs-book;pst/docbook-xsl.html">docbook-xsl-nons</ulink>, <ulink url="https://sourceware.org/elfutils/">elfutils</ulink>, <ulink url="&blfs-book;general/git.html">Git</ulink>, <ulink url="https://sourceforge.net/projects/gnu-efi/">gnu-efi</ulink>, <ulink url="&blfs-book;postlfs/gnutls.html">GnuTLS</ulink>, <ulink url="&blfs-book;postlfs/iptables.html">iptables</ulink>, <ulink url="https://www.kernel.org/pub/linux/utils/kernel/kexec/"> kexec-tools</ulink>, <ulink url="https://developers.yubico.com/libfido2/">libfido2</ulink>, <ulink url="&blfs-book;general/libgcrypt.html">libgcrypt</ulink>, <ulink url="&blfs-book;general/libidn2.html">libidn2</ulink>, <ulink url="https://www.gnu.org/software/libmicrohttpd/"> Libmicrohttpd</ulink>, <ulink url="&blfs-book;postlfs/libpwquality.html">libpwquality</ulink>, <ulink url="&blfs-book;general/libseccomp.html">libseccomp</ulink>, <ulink url="&blfs-book;general/libxkbcommon.html">libxkbcommon</ulink>, <ulink url="&blfs-book;general/libxslt.html">libxslt</ulink>, <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>, <ulink url="&blfs-book;general/python-modules.html#lxml">lxml</ulink>, <ulink url="https://lz4.github.io/lz4/">LZ4</ulink>, <ulink url="&blfs-book;postlfs/make-ca.html">make-ca</ulink>, <ulink url="&blfs-book;postlfs/p11-kit.html">p11-kit</ulink>, <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink>, <ulink url="&blfs-book;postlfs/polkit.html">Polkit</ulink>, <ulink url="&blfs-book;postlfs/qemu.html">qemu</ulink>, <ulink url="&blfs-book;general/qrencode.html">qrencode</ulink>, <ulink url="https://sourceforge.net/projects/linuxquota/"> quota-tools</ulink>, <ulink url="&blfs-book;basicnet/rsync.html">rsync</ulink>, <ulink url="&blfs-book;general/python-modules.html#sphinx"> Sphinx</ulink>, <ulink url="https://tpm2-tss.readthedocs.io/en/latest/"> tpm2-tss</ulink>, <ulink url="&blfs-book;general/valgrind.html">Valgrind</ulink>, and <ulink url="&blfs-book;postlfs/zsh.html">zsh</ulink>
fr: <ulink url="&blfs-book;postlfs/btrfs-progs.html">btrfs-progs</ulink>, <ulink url="&blfs-book;basicnet/curl.html">cURL</ulink>, <ulink url="&blfs-book;postlfs/cryptsetup.html">cryptsetup</ulink>, <ulink url="&blfs-book;pst/docbook.html">docbook-xml</ulink>, <ulink url="&blfs-book;pst/docbook-xsl.html">docbook-xsl-nons</ulink>, <ulink url="https://sourceware.org/elfutils/">elfutils</ulink>, <ulink url="&blfs-book;general/git.html">Git</ulink>, <ulink url="https://sourceforge.net/projects/gnu-efi/">gnu-efi</ulink>, <ulink url="&blfs-book;postlfs/gnutls.html">GnuTLS</ulink>, <ulink url="&blfs-book;postlfs/iptables.html">iptables</ulink>, <ulink url="https://www.kernel.org/pub/linux/utils/kernel/kexec/"> kexec-tools</ulink>, <ulink url="https://developers.yubico.com/libfido2/">libfido2</ulink>, <ulink url="&blfs-book;general/libgcrypt.html">libgcrypt</ulink>, <ulink url="&blfs-book;general/libidn2.html">libidn2</ulink>, <ulink url="https://www.gnu.org/software/libmicrohttpd/"> Libmicrohttpd</ulink>, <ulink url="&blfs-book;postlfs/libpwquality.html">libpwquality</ulink>, <ulink url="&blfs-book;general/libseccomp.html">libseccomp</ulink>, <ulink url="&blfs-book;general/libxkbcommon.html">libxkbcommon</ulink>, <ulink url="&blfs-book;general/libxslt.html">libxslt</ulink>, <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>, <ulink url="&blfs-book;general/python-modules.html#lxml">lxml</ulink>, <ulink url="https://lz4.github.io/lz4/">LZ4</ulink>, <ulink url="&blfs-book;postlfs/make-ca.html">make-ca</ulink>, <ulink url="&blfs-book;postlfs/p11-kit.html">p11-kit</ulink>, <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink>, <ulink url="&blfs-book;postlfs/polkit.html">Polkit</ulink>, <ulink url="&blfs-book;postlfs/qemu.html">qemu</ulink>, <ulink url="&blfs-book;general/qrencode.html">qrencode</ulink>, <ulink url="https://sourceforge.net/projects/linuxquota/"> quota-tools</ulink>, <ulink url="&blfs-book;basicnet/rsync.html">rsync</ulink>, <ulink url="&blfs-book;general/python-modules.html#sphinx"> Sphinx</ulink>, <ulink url="https://tpm2-tss.readthedocs.io/en/latest/"> tpm2-tss</ulink>, <ulink url="&blfs-book;general/valgrind.html">Valgrind</ulink> et <ulink url="&blfs-book;postlfs/zsh.html">zsh</ulink>

source: Bash, Binutils, Coreutils, Diffutils, <phrase revision="sysv">Eudev, </phrase>Findutils, Gawk, GCC, Gettext, Glibc, Grep, Make, Ncurses, Sed, <phrase revision="systemd">Systemd, </phrase>and Zlib
fr: Bash, Binutils, Coreutils, Diffutils, <phrase revision="sysv">Eudev, </phrase>Findutils, Gawk, GCC, Gettext, Glibc, Grep, Make, Ncurses, Sed<phrase revision="systemd">, Systemd</phrase> et Zlib

source: Glibc, Ncurses, Readline, and Zlib
fr: Glibc, Ncurses, Readline et Zlib

source: <ulink url="https://people.redhat.com/sgrubb/libcap-ng/">Libcap-NG</ulink>, <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink> and <ulink url="&blfs-book;postlfs/smartmontools.html">smartmontools</ulink>
fr: <ulink url="https://people.redhat.com/sgrubb/libcap-ng/">Libcap-NG</ulink>, <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink> et <ulink url="&blfs-book;postlfs/smartmontools.html">smartmontools</ulink>

source: <phrase revision="sysv">Eudev, </phrase>File, GRUB, Kmod, <phrase revision="sysv">and </phrase>Man-DB<phrase revision="systemd">, and Systemd</phrase>
fr: <phrase revision="sysv">Eudev, </phrase>File, GRUB, Kmod, <phrase revision="sysv">et </phrase>Man-DB<phrase revision="systemd"> et Systemd</phrase>

source: File, Kmod, Perl, and Util-linux
fr: File, Kmod, Perl et Util-linux

source: Binutils, Coreutils, GCC, Glibc, Gzip, Make, and Xz
fr: Binutils, Coreutils, GCC, Glibc, Gzip, Make et Xz

source: GCC <phrase revision='systemd'>and Systemd</phrase>
fr: GCC <phrase revision='systemd'>et Systemd</phrase>
