Repository: espindula/br-lfs
Catalog: lfs/*/appendices/dependencies.po
Languages: fr, pt_br

source: <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink> or <ulink url="&blfs-book;general/pcre.html">PCRE</ulink>
fr: <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink> ou <ulink url="&blfs-book;general/pcre.html">PCRE</ulink>
pt_br: <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink> ou <ulink url="&blfs-book;general/pcre.html">PCRE</ulink>

source: Attr, Bash, Binutils, Coreutils, GCC, Glibc, Perl, Make, and Sed
fr: Attr, Bash, Binutils, Coreutils, GCC, Glibc, Perl, Make et Sed
pt_br: Attr, Bash, Binutils, Coreutils, GCC, Glibc, Perl, Make e Sed

source: IProute2 and Shadow
fr: IProute2 et Shadow
pt_br: IProute2 e Shadow

source: Bash, Binutils, Bzip2, Coreutils, GCC, Glibc, Make, Xz, Zlib, and Zstd
pt_br: Bash, Binutils, Bzip2, Coreutils, GCC, Glibc, Make, Xz, Zlib e Zstd

source: Bzip2, Glibc, Xz, Zlib, and Zstd
pt_br: Bzip2, Glibc, Xz, Zlib e Zstd

source: IProute2 and Linux
fr: IProute2 et Linux
pt_br: IProute2 e Linux

source: Bash, Binutils, Coreutils, GCC, Glibc, Make, and Sed
fr: Bash, Binutils, Coreutils, GCC, Glibc, Make et Sed
pt_br: Bash, Binutils, Coreutils, GCC, Glibc, Make e Sed

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Sed e Texinfo

source: Check and Pkgconf
pt_br: Check e Pkgconf

source: Autoconf, Automake, Bash, Binutils, Coreutils, File, GCC, Glibc, Grep, Make, and Sed
fr: Autoconf, Automake, Bash, Binutils, Coreutils, File, GCC, Glibc, Grep, Make et Sed
pt_br: Autoconf, Automake, Bash, Binutils, Coreutils, File, GCC, Glibc, Grep, Make e Sed

source: Autoconf, Automake, and Findutils
fr: Autoconf, Automake et Findutils
pt_br: Autoconf, Automake e Findutils

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Perl, and Sed
pt_br: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Perl e Sed

source: GCC, Perl, Python, Shadow, and &systemd-udev;
pt_br: GCC, Perl, Python, Shadow e &systemd-udev;

source: Bash, Bc, Binutils, Coreutils, Diffutils, Findutils, GCC, Glibc, Grep, Gzip, Kmod, Libelf, Make, Ncurses, OpenSSL, Perl, and Sed
fr: Bash, Bc, Binutils, Coreutils, Diffutils, Findutils, GCC, Glibc, Grep, Gzip, Kmod, Libelf, Make, Ncurses, OpenSSL, Perl et Sed
pt_br: Bash, Bc, Binutils, Coreutils, Diffutils, Findutils, GCC, Glibc, Grep, Gzip, Kmod, Libelf, Make, Ncurses, OpenSSL, Perl e Sed

source: <ulink url="&blfs-book;general/cpio.html">cpio</ulink> and <ulink url="&blfs-book;general/llvm.html">LLVM</ulink> (with Clang)
fr: <ulink url="&blfs-book;general/cpio.html">cpio</ulink> et <ulink url="&blfs-book;general/llvm.html">LLVM</ulink> (avec Clang)
pt_br: <ulink url="&blfs-book;general/cpio.html">cpio</ulink> e <ulink url="&blfs-book;general/llvm.html">LLVM</ulink> (com o Clang)

source: Linux API Headers
pt_br: Cabeçalhos da API do Linux

source: Bash, Binutils, Coreutils, Findutils, GCC, Glibc, Grep, Gzip, Make, Perl, and Sed
fr: Bash, Binutils, Coreutils, Findutils, GCC, Glibc, Grep, Gzip, Make, Perl et Sed
pt_br: Bash, Binutils, Coreutils, Findutils, GCC, Glibc, Grep, Gzip, Make, Perl e Sed

source: Autoconf and Bison
fr: Autoconf et Bison
pt_br: Autoconf e Bison

source: Perl and Procps-ng
fr: Perl et Procps-ng
pt_br: Perl e Procps-ng

source: Bash, Binutils, Bzip2, Coreutils, Flex, GCC, GDBM, Gettext, Glibc, Grep, Groff, Gzip, Less, Libpipeline, Make, Pkgconf, Sed, <phrase revision='systemd'>Systemd, </phrase>and Xz
pt_br: Bash, Binutils, Bzip2, Coreutils, Flex, GCC, GDBM, Gettext, Glibc, Grep, Groff, Gzip, Less, Libpipeline, Make, Pkgconf, Sed <phrase revision='systemd'>, Systemd </phrase>e Xz

source: Bash, GDBM, Groff, Glibc, Gzip, Less, Libpipeline, and Zlib
fr: Bash, GDBM, Groff, Glibc, Gzip, Less, Libpipeline et Zlib
pt_br: Bash, GDBM, Groff, Glibc, Gzip, Less, Libpipeline e Zlib

source: <ulink url="&blfs-book;general/libseccomp.html">libseccomp</ulink> and <ulink url="https://po4a.org/index.php.en">po4a</ulink>
fr: <ulink url="&blfs-book;general/libseccomp.html">libseccomp</ulink> et <ulink url="https://po4a.org/index.php.en">po4a</ulink>
pt_br: <ulink url="&blfs-book;general/libseccomp.html">libseccomp</ulink> e <ulink url="https://po4a.org/index.php.en">po4a</ulink>

source: Bash, Coreutils, and Make
fr: Bash, Coreutils et Make
pt_br: Bash, Coreutils e Make

source: Ninja and Python
fr: Ninja et Python
pt_br: Ninja e Python

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, GMP, Make, MPFR, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, GMP, Make, MPFR, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, GMP, Make, MPFR, Sed e Texinfo

source: Glibc, GMP, and MPFR
fr: Glibc, GMP et MPFR
pt_br: Glibc, GMP e MPFR

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, GMP, Make, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, GMP, Make, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, GMP, Make, Sed e Texinfo

source: Glibc and GMP
fr: Glibc et GMP
pt_br: Glibc e GMP

source: Gawk and GCC
fr: Gawk et GCC
pt_br: Gawk e GCC

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Patch, and Sed
fr: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Patch et Sed
pt_br: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Patch e Sed

source: Bash, GRUB, Inetutils, Less, Procps-ng, Psmisc, Readline, Texinfo, Util-linux, and Vim
fr: Bash, GRUB, Inetutils, Less, Procps-ng, Psmisc, Readline, Texinfo, Util-linux et Vim
pt_br: Bash, GRUB, Inetutils, Less, Procps-ng, Psmisc, Readline, Texinfo, Util-linux e Vim

source: Binutils, Coreutils, GCC, and Python
fr: Binutils, Coreutils, GCC et Python
pt_br: Binutils, Coreutils, GCC e Python

source: <ulink url="&blfs-book;general/asciidoc.html">Asciidoc</ulink>, <ulink url="&blfs-book;general/doxygen.html">Doxygen</ulink>, <ulink url="&blfs-book;postlfs/emacs.html">Emacs</ulink>, and <ulink url="https://re2c.org/">re2c</ulink>
fr: <ulink url="&blfs-book;general/asciidoc.html">Asciidoc</ulink>, <ulink url="&blfs-book;general/doxygen.html">Doxygen</ulink>, <ulink url="&blfs-book;postlfs/emacs.html">Emacs</ulink> et <ulink url="https://re2c.org/">re2c</ulink>
pt_br: <ulink url="&blfs-book;general/asciidoc.html">Asciidoc</ulink>, <ulink url="&blfs-book;general/doxygen.html">Doxygen</ulink>, <ulink url="&blfs-book;postlfs/emacs.html">Emacs</ulink> e <ulink url="https://re2c.org/">re2c</ulink>

source: Binutils, Coreutils, GCC, Make, and Perl
fr: Binutils, Coreutils, GCC, Make et Perl
pt_br: Binutils, Coreutils, GCC, Make e Perl

source: Glibc and Perl
fr: Glibc et Perl
pt_br: Glibc e Perl

source: Coreutils, Kmod, Linux, and &systemd-udev;
pt_br: Coreutils, Kmod, Linux e &systemd-udev;

source: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make, and Sed
fr: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make et Sed
pt_br: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make e Sed

source: Bash, Binutils, Coreutils, Gawk, GCC, GDBM, Glibc, Grep, Groff, Libxcrypt, Make, Sed, and Zlib
pt_br: Bash, Binutils, Coreutils, Gawk, GCC, GDBM, Glibc, Grep, Groff, Libxcrypt, Make, Sed e Zlib

source: GDBM, Glibc, and Libxcrypt
pt_br: GDBM, Glibc e Libxcrypt

source: Iana-Etc, Less. and Procps-ng
fr: Iana-Etc, Less et Procps-ng
pt_br: Iana-Etc, Less e Procps-ng

source: <phrase revision='systemd'>D-Bus, </phrase>E2fsprogs, IProute2, Kmod, Man-DB, Procps-ng, Python, &systemd-udev;, and Util-linux
pt_br: <phrase revision='systemd'>D-Bus, </phrase>E2fsprogs, IProute2, Kmod, Man-DB, Procps-ng, Python, &systemd-udev; e Util-linux

source: Bash, Binutils, Coreutils, GCC, Glibc, Make, Ncurses, <phrase revision='sysv'>and </phrase>Pkgconf<phrase revision='systemd'>, and Systemd</phrase>
pt_br: Bash, Binutils, Coreutils, GCC, Glibc, Make, Ncurses <phrase revision='sysv'>e </phrase>Pkgconf<phrase revision='systemd'> e Systemd</phrase>

source: <phrase revision='systemd'>None</phrase> <phrase revision='sysv'> <ulink url='&blfs-book;general/elogind.xml'>elogind</ulink> </phrase>
pt_br: <phrase revision='systemd'>Nenhum</phrase> <phrase revision='sysv'> <ulink url='&blfs-book;general/elogind.xml'>elogind</ulink> </phrase>

source: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Ncurses, and Sed
fr: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Ncurses, et Sed
pt_br: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Ncurses e Sed

source: Bash, Binutils, Coreutils, Expat, GCC, Gdbm, Gettext, Glibc, Grep, Libffi, Libxcrypt, Make, Ncurses, OpenSSL, Pkgconf, Sed, and Util-linux
pt_br: Bash, Binutils, Coreutils, Expat, GCC, Gdbm, Gettext, Glibc, Grep, Libffi, Libxcrypt, Make, Ncurses, OpenSSL, Pkgconf, Sed e Util-linux

source: Bzip2, Expat, Gdbm, Glibc, Libffi, Libxcrypt, Ncurses, OpenSSL, and Zlib
pt_br: Bzip2, Expat, Gdbm, Glibc, Libffi, Libxcrypt, Ncurses, OpenSSL e Zlib

source: GDB and Valgrind
fr: GDB et Valgrind
pt_br: GDB e Valgrind

source: <ulink url="&blfs-book;server/db.html">Berkeley DB</ulink>, <ulink url="&blfs-book;basicnet/libnsl.html">libnsl</ulink>, <ulink url="&blfs-book;server/sqlite.html">SQLite</ulink>, and <ulink url="&blfs-book;general/tk.html">Tk</ulink>
fr: <ulink url="&blfs-book;server/db.html">Berkeley DB</ulink>, <ulink url="&blfs-book;basicnet/libnsl.html">libnsl</ulink>, <ulink url="&blfs-book;server/sqlite.html">SQLite</ulink> et <ulink url="&blfs-book;general/tk.html">Tk</ulink>
pt_br: <ulink url="&blfs-book;server/db.html">Berkeley DB</ulink>, <ulink url="&blfs-book;basicnet/libnsl.html">libnsl</ulink>, <ulink url="&blfs-book;server/sqlite.html">SQLite</ulink> e <ulink url="&blfs-book;general/tk.html">Tk</ulink>

source: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Patch, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Patch, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Patch, Sed e Texinfo

source: Bash, Bc, and Gawk
fr: Bash, Bc et Gawk
pt_br: Bash, Bc e Gawk

source: Acl, Attr, and Glibc
fr: Acl, Attr et Glibc
pt_br: Acl, Attr e Glibc

source: Diffutils and Gawk
fr: Diffutils et Gawk
pt_br: Diffutils e Gawk

source: E2fsprogs, File, Libtool, and Shadow
fr: E2fsprogs, File, Libtool et Shadow
pt_br: E2fsprogs, File, Libtool e Shadow

source: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, Findutils, Gawk, GCC, Gettext, Glibc, Grep, Libcap, Libxcrypt, Make, and Sed
pt_br: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, Findutils, Gawk, GCC, Gettext, Glibc, Grep, Libcap, Libxcrypt, Make e Sed

source: Glibc and Libxcrypt
pt_br: Glibc e Libxcrypt

source: <ulink url="&blfs-book;postlfs/cracklib.html">CrackLib</ulink> and <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>
fr: <ulink url="&blfs-book;postlfs/cracklib.html">CrackLib</ulink> et <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>
pt_br: <ulink url="&blfs-book;postlfs/cracklib.html">CrackLib</ulink> e <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>

source: Binutils, Coreutils, GCC, Glibc, Make, and Patch
fr: Binutils, Coreutils, GCC, Glibc, Make et Patch
pt_br: Binutils, Coreutils, GCC, Glibc, Make e Patch

source: Acl, Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Gperf, Grep, Jinja2, Libcap, Libxcrypt, Meson, OpenSSL, Pkgconf, Sed, Util-linux, and Zstd
pt_br: Acl, Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Gperf, Grep, Jinja2, Libcap, Libxcrypt, Meson, OpenSSL, Pkgconf, Sed, Util-linux e Zstd

source: Acl, Glibc, Libcap, Libxcrypt, OpenSSL, Util-linux, Xz, Zlib, and Zstd
pt_br: Acl, Glibc, Libcap, Libxcrypt, OpenSSL, Util-linux, Xz, Zlib e Zstd

source: D-Bus, E2fsprogs, Man-DB, Procps-ng, and Util-linux
pt_br: D-Bus, E2fsprogs, Man-DB, Procps-ng e Util-linux

source: <ulink url="https://www.apparmor.net/">AppArmor</ulink>, <ulink url="&github;/linux-audit/audit-userspace"> audit-userspace</ulink>, <ulink url="&github;/scop/bash-completion"> bash-completion</ulink>, <ulink url="&blfs-book;postlfs/btrfs-progs.html">btrfs-progs</ulink>, <ulink url="&blfs-book;basicnet/curl.html">cURL</ulink>, <ulink url="&blfs-book;postlfs/cryptsetup.html">cryptsetup</ulink>, <ulink url="&blfs-book;pst/docbook.html">docbook-xml</ulink>, <ulink url="&blfs-book;pst/docbook-xsl.html">docbook-xsl-nons</ulink>, <ulink url="&blfs-book;general/git.html">Git</ulink>, <ulink url="&blfs-book;postlfs/gnutls.html">GnuTLS</ulink>, <ulink url="&blfs-book;postlfs/iptables.html">iptables</ulink>, <ulink url='https://jekyllrb.com/'>jekyll</ulink>, <ulink url="https://www.kernel.org/pub/linux/utils/kernel/kexec/"> kexec-tools</ulink>, <ulink url='&github;/libbpf/libbpf'>libbpf</ulink>, <ulink url="https://sourceware.org/elfutils/">libdw</ulink>, <ulink url="https://developers.yubico.com/libfido2/">libfido2</ulink>, <ulink url="&blfs-book;general/libgcrypt.html">libgcrypt</ulink>, <ulink url="&blfs-book;general/libidn2.html">libidn2</ulink>, <ulink url="https://www.gnu.org/software/libmicrohttpd/"> libmicrohttpd</ulink>, <ulink url="&blfs-book;postlfs/libpwquality.html">libpwquality</ulink>, <ulink url="&blfs-book;general/libseccomp.html">libseccomp</ulink>, <ulink url="&blfs-book;general/libxkbcommon.html">libxkbcommon</ulink>, <ulink url="&blfs-book;general/libxslt.html">libxslt</ulink>, <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>, <ulink url="&blfs-book;general/python-modules.html#lxml">lxml</ulink>, <ulink url="https://lz4.github.io/lz4/">LZ4</ulink>, <ulink url="&blfs-book;postlfs/make-ca.html">make-ca</ulink>, <ulink url="&blfs-book;postlfs/p11-kit.html">p11-kit</ulink>, <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink>, <ulink url="&blfs-book;postlfs/polkit.html">Polkit</ulink>, <ulink url='&pypi-home;/pyelftools'>pyelftools</ulink>, <ulink url="&blfs-book;postlfs/qemu.html">qemu</ulink>, <ulink url="&blfs-book;general/qrencode.html">qrencode</ulink>, <ulink url="https://sourceforge.net/projects/linuxquota/" >quota-tools</ulink>, <ulink url="https://rpm.org">rpm</ulink>, <ulink url="&blfs-book;basicnet/rsync.html">rsync</ulink>, <ulink url="&github;/SELinuxProject/selinux"> SELinux</ulink>, <ulink url="&blfs-book;general/python-modules.html#sphinx"> Sphinx</ulink>, <ulink url="https://sourceware.org/systemtap/"> systemtap</ulink>, <ulink url="https://tpm2-tss.readthedocs.io/en/latest/"> tpm2-tss</ulink>, <ulink url="&blfs-book;general/valgrind.html">Valgrind</ulink>, <ulink url="https://xenproject.org">Xen</ulink>, and <ulink url="&blfs-book;postlfs/zsh.html">zsh</ulink>
pt_br: <ulink url="https://www.apparmor.net/">AppArmor</ulink>, <ulink url="&github;/linux-audit/audit-userspace"> audit-userspace</ulink>, <ulink url="&github;/scop/bash-completion"> bash-completion</ulink>, <ulink url="&blfs-book;postlfs/btrfs-progs.html">btrfs-progs</ulink>, <ulink url="&blfs-book;basicnet/curl.html">cURL</ulink>, <ulink url="&blfs-book;postlfs/cryptsetup.html">cryptsetup</ulink>, <ulink url="&blfs-book;pst/docbook.html">docbook-xml</ulink>, <ulink url="&blfs-book;pst/docbook-xsl.html">docbook-xsl-nons</ulink>, <ulink url="&blfs-book;general/git.html">Git</ulink>, <ulink url="&blfs-book;postlfs/gnutls.html">GnuTLS</ulink>, <ulink url="&blfs-book;postlfs/iptables.html">iptables</ulink>, <ulink url='https://jekyllrb.com/'>jekyll</ulink>, <ulink url="https://www.kernel.org/pub/linux/utils/kernel/kexec/"> kexec-tools</ulink>, <ulink url='&github;/libbpf/libbpf'>libbpf</ulink>, <ulink url="https://sourceware.org/elfutils/">libdw</ulink>, <ulink url="https://developers.yubico.com/libfido2/">libfido2</ulink>, <ulink url="&blfs-book;general/libgcrypt.html">libgcrypt</ulink>, <ulink url="&blfs-book;general/libidn2.html">libidn2</ulink>, <ulink url="https://www.gnu.org/software/libmicrohttpd/"> libmicrohttpd</ulink>, <ulink url="&blfs-book;postlfs/libpwquality.html">libpwquality</ulink>, <ulink url="&blfs-book;general/libseccomp.html">libseccomp</ulink>, <ulink url="&blfs-book;general/libxkbcommon.html">libxkbcommon</ulink>, <ulink url="&blfs-book;general/libxslt.html">libxslt</ulink>, <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>, <ulink url="&blfs-book;general/python-modules.html#lxml">lxml</ulink>, <ulink url="https://lz4.github.io/lz4/">LZ4</ulink>, <ulink url="&blfs-book;postlfs/make-ca.html">make-ca</ulink>, <ulink url="&blfs-book;postlfs/p11-kit.html">p11-kit</ulink>, <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink>, <ulink url="&blfs-book;postlfs/polkit.html">Polkit</ulink>, <ulink url='&pypi-home;/pyelftools'>pyelftools</ulink>, <ulink url="&blfs-book;postlfs/qemu.html">qemu</ulink>, <ulink url="&blfs-book;general/qrencode.html">qrencode</ulink>, <ulink url="https://sourceforge.net/projects/linuxquota/">quota-tools</ulink>, <ulink url="https://rpm.org">rpm</ulink>, <ulink url="&blfs-book;basicnet/rsync.html">rsync</ulink>, <ulink url="&github;/SELinuxProject/selinux"> SELinux</ulink>, <ulink url="&blfs-book;general/python-modules.html#sphinx"> Sphinx</ulink>, <ulink url="https://sourceware.org/systemtap/"> systemtap</ulink>, <ulink url="https://tpm2-tss.readthedocs.io/en/latest/"> tpm2-tss</ulink>, <ulink url="&blfs-book;general/valgrind.html">Valgrind</ulink>, <ulink url="https://xenproject.org">Xen</ulink> e <ulink url="&blfs-book;postlfs/zsh.html">zsh</ulink>

source: Binutils, Coreutils, GCC, Glibc, Make, and Sed
fr: Binutils, Coreutils, GCC, Glibc, Make et Sed
pt_br: Binutils, Coreutils, GCC, Glibc, Make e Sed

source: Acl, Attr, Bash, Binutils, Bison, Coreutils, GCC, Gettext, Glibc, Grep, Inetutils, Make, Sed, and Texinfo
fr: Acl, Attr, Bash, Binutils, Bison, Coreutils, GCC, Gettext, Glibc, Grep, Inetutils, Make, Sed et Texinfo
pt_br: Acl, Attr, Bash, Binutils, Bison, Coreutils, GCC, Gettext, Glibc, Grep, Inetutils, Make, Sed e Texinfo

source: Acl, Attr, Bzip2, Glibc, Gzip, and Xz
fr: Acl, Attr, Bzip2, Glibc, Gzip et Xz
pt_br: Acl, Attr, Bzip2, Glibc, Gzip e Xz

source: Autoconf, Diffutils, Findutils, Gawk, and Gzip
fr: Autoconf, Diffutils, Findutils, Gawk et Gzip
pt_br: Autoconf, Diffutils, Findutils, Gawk e Gzip

source: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, and Sed
fr: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make et Sed
pt_br: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make e Sed

source: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Ncurses, Patch, and Sed
fr: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Ncurses, Patch et Sed
pt_br: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Ncurses, Patch e Sed

source: Acl, Glibc, Libcap, OpenSSL, and Util-linux
pt_br: Acl, Glibc, Libcap, OpenSSL e Util-linux

source: Bash, Binutils, Coreutils, Diffutils, File, Findutils, Gawk, GCC, Gettext, Glibc, Grep, Make, Ncurses, Pkgconf, Sed, &systemd-udev;, and Zlib
pt_br: Bash, Binutils, Coreutils, Diffutils, File, Findutils, Gawk, GCC, Gettext, Glibc, Grep, Make, Ncurses, Pkgconf, Sed, &systemd-udev; e Zlib

source: Glibc, Ncurses, Readline, &systemd-udev;, and Zlib
pt_br: Glibc, Ncurses, Readline, &systemd-udev; e Zlib

source: <ulink url="https://people.redhat.com/sgrubb/libcap-ng/">Libcap-NG</ulink>, <ulink url="&github;/openSUSE/libeconf">libeconf</ulink>, <ulink url="https://pagure.io/libuser/">libuser</ulink>, <ulink url="&github;/altlinux/libutempter">libutempter</ulink>, <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>, <ulink url="&blfs-book;postlfs/smartmontools.html">smartmontools</ulink>, and <ulink url="&blfs-book;general/slang.html">slang</ulink>
pt_br: <ulink url="https://people.redhat.com/sgrubb/libcap-ng/">Libcap-NG</ulink>, <ulink url="&github;/openSUSE/libeconf">libeconf</ulink>, <ulink url="https://pagure.io/libuser/">libuser</ulink>, <ulink url="&github;/altlinux/libutempter">libutempter</ulink>, <ulink url="&blfs-book;postlfs/linux-pam.html">Linux-PAM</ulink>, <ulink url="&blfs-book;postlfs/smartmontools.html">smartmontools</ulink> e <ulink url="&blfs-book;general/slang.html">slang</ulink>

source: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Ncurses, and Sed
fr: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Ncurses et Sed
pt_br: Acl, Attr, Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Ncurses e Sed

source: Acl, Attr, Glibc, Python, Ncurses, and Tcl
fr: Acl, Attr, Glibc, Python, Ncurses et Tcl
pt_br: Acl, Attr, Glibc, Python, Ncurses e Tcl

source: <ulink url="&blfs-book;x/installing.html">Xorg</ulink>, <ulink url="&blfs-book;x/gtk2.html">GTK+2</ulink>, <ulink url="https://lesstif.sourceforge.net/">LessTif</ulink>, <ulink url="&blfs-book;general/ruby.html">Ruby</ulink>, and <ulink url="&blfs-book;general/gpm.html">GPM</ulink>
fr: <ulink url="&blfs-book;x/installing.html">Xorg</ulink>, <ulink url="&blfs-book;x/gtk2.html">GTK+2</ulink>, <ulink url="https://lesstif.sourceforge.net/">LessTif</ulink>, <ulink url="&blfs-book;general/ruby.html">Ruby</ulink> et <ulink url="&blfs-book;general/gpm.html">GPM</ulink>
pt_br: <ulink url="&blfs-book;x/installing.html">Xorg</ulink>, <ulink url="&blfs-book;x/gtk2.html">GTK+2</ulink>, <ulink url="http://lesstif.sourceforge.net/">LessTif</ulink>, <ulink url="&blfs-book;general/ruby.html">Ruby</ulink> e <ulink url="&blfs-book;general/gpm.html">GPM</ulink>

source: Python and Flit-core
pt_br: Python e Flit-core

source: <phrase revision='sysv'>None</phrase> <phrase revision='systemd'>Jinja2</phrase>
fr: <phrase revision='sysv'>Aucune</phrase> <phrase revision='systemd'>Jinja2</phrase>
pt_br: <phrase revision='sysv'>Nenhum</phrase> <phrase revision='systemd'>Jinja2</phrase>

source: Bash, Binutils, Coreutils, Expat, GCC, Glibc, Make, and Perl
fr: Bash, Binutils, Coreutils, Expat, GCC, Glibc, Make et Perl
pt_br: Bash, Binutils, Coreutils, Expat, GCC, Glibc, Make e Perl

source: Expat, Glibc, and Perl
fr: Expat, Glibc et Perl
pt_br: Expat, Glibc e Perl

source: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, and Make
fr: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc et Make
pt_br: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc e Make

source: File, GRUB, Kmod, Libelf, Man-DB, and &systemd-udev;
pt_br: File, GRUB, Kmod, Libelf, Man-DB e &systemd-udev;

source: File, Kmod, Libelf, Perl, and Util-linux
pt_br: File, Kmod, Libelf, Perl e Util-linux

source: Binutils, Coreutils, GCC, Glibc, Gzip, Make, Xz, and Zlib
pt_br: Binutils, Coreutils, GCC, Glibc, Gzip, Make, Xz e Zlib

source: GCC, Libelf, and &systemd-udev;
pt_br: GCC, Libelf e &systemd-udev;

source: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, GMP, Grep, Libcap, Make, OpenSSL, Patch, Perl, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, GMP, Grep, Libcap, Make, OpenSSL, Patch, Perl, Sed et Texinfo

source: Bash, Diffutils, <phrase revision="sysv">Eudev, </phrase> Findutils, <phrase revision="sysv">and </phrase>Man-DB<phrase revision="systemd">, and Systemd</phrase>
fr: Bash, Diffutils, <phrase revision="sysv">Eudev, </phrase> Findutils, <phrase revision="sysv">et </phrase>Man-DB<phrase revision="systemd"> et Systemd</phrase>

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Sed, Systemd, and Util-linux
fr: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Sed, Systemd et Util-linux

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Gzip, Make, Sed, Texinfo, and Util-linux
fr: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Gzip, Make, Sed, Texinfo et Util-linux
