Repository: espindula/br-lfs
Catalog: lfs/*/appendices/dependencies.po
Languages: fr, pt_br

source: Appendix C
fr: Annexe C
pt_br: Anexo C

source: Dependencies
fr: Dépendances
pt_br: Dependências

source: Every package built in LFS relies on one or more other packages in order to build and install properly. Some packages even participate in circular dependencies, that is, the first package depends on the second which in turn depends on the first. Because of these dependencies, the order in which packages are built in LFS is very important. The purpose of this page is to document the dependencies of each package built in LFS.
fr: La bonne compilation et la bonne installation de chaque paquet compilé dans LFS dépend d'un ou de plusieurs autres paquets. Certains paquets participent même aux dépendances circulaires, c'est-à-dire que le premier paquet dépend du second qui dépend à son tour du premier. À cause de ces dépendances, l'ordre dans lequel les paquets sont compilés dans LFS est très important. Le but de cette page est de documenter les dépendances de chaque paquet compilé dans LFS.
pt_br: Cada pacote construído no LFS depende de um ou mais outros pacotes para a finalidade de construir e instalar adequadamente. Alguns pacotes até participam em dependências circulares, isto é, o primeiro pacote depende do segundo o qual, na sequência, depende do primeiro. Por causa dessas dependências, a ordem na qual pacotes são construídos no LFS é muito importante. O propósito desta página é o de documentar as dependências de cada pacote construído no LFS.

source: For each package that is built, there are three, and sometimes up to five types of dependencies listed below. The first lists what other packages need to be available in order to compile and install the package in question. The second lists the packages that must be available when any programs or libraries from the package are used at runtime. The third lists what packages, in addition to those on the first list, need to be available in order to run the test suites. The fourth list of dependencies are packages that require this package to be built and installed in its final location before they are built and installed. In most cases, this is because these packages will hard code paths to binaries within their scripts. If not built in a certain order, this could result in paths of /tools/bin/[binary] being placed inside scripts installed to the final system. This is obviously not desirable.
fr: Pour chaque paquet que nous compilons, nous avons listé trois, voire cinq types de dépendances. La première répertorie quels autres paquets doivent être disponibles afin de compiler et d'installer le paquet en question. La deuxième liste les paquets qui doivent être disponibles lorsqu'un programme ou une bibliothèque du paquet est exécuté. La troisième concerne les paquets qui, en plus de ceux de la première liste, doivent être disponibles afin de lancer les suites de test. La quatrième liste de dépendances contient les paquets qui exigent que ce paquet soit compilé et installé à l'emplacement final avant qu'ils ne soient compilés et installés. Dans la plupart des cas, c'est parce que ces paquets encoderont les chemins vers les binaires à l'intérieur de leurs scripts. S'ils ne sont pas compilés dans un certain ordre, ceci pourrait aboutir à ce que des chemins vers /tools/bin/[binaire] soient placés à l'intérieur de scripts installés dans le système final, ce qui n'est évidemment pas souhaitable.
pt_br: Para cada pacote que é construído, existem três, e às vezes até cinco tipos de dependências listadas abaixo. A primeira lista que outros pacotes necessitam estar disponíveis para a finalidade de compilar e instalar o pacote em questão. A segunda lista os pacotes que precisam estar disponíveis quando quaisquer aplicativos ou bibliotecas oriundos do pacote forem usados em tempo de execução. A terceira lista que pacotes, em adição àqueles na primeira lista, necessitam estar disponíveis para a finalidade de executar as suítes de teste. A quarta lista de dependências são pacotes que exigem que esse pacote esteja construído e instalado no local final dele antes que eles sejam construídos e instalados. Na maioria dos casos, isso é porque esses pacotes codificarão rigidamente caminhos para binários dentro dos scripts deles. Se não for construído em uma certa ordem, [então] isso poderia resultar em caminhos como /tools/bin/[binário] sendo colocados dentro de scripts instalados para o sistema final. Isso obviamente não é desejável.

source: The last list of dependencies are optional packages that are not addressed in LFS, but could be useful to the user. These packages may have additional mandatory or optional dependencies of their own. For these dependencies, the recommended practice is to install them after completion of the LFS book and then go back and rebuild the LFS package. In several cases, re-installation is addressed in BLFS.
fr: La dernière liste de dépendances répertorie les paquets facultatifs qui ne sont pas destinées à LFS mais qui pourraient vous être utiles. Ces paquets peuvent avoir eux-mêmes des dépendances supplémentaires obligatoires ou facultatives. Pour ces dépendances, la pratique recommandée consiste à les installer après avoir terminé le livre LFS puis à revenir en arrière pour reconstruire le paquet LFS. Dans certains cas, la réinstallation est traitée dans BLFS.
pt_br: A última lista de dependências são pacotes opcionais que não são endereçados no LFS, porém poderiam ser úteis para o(a) usuário(a). Esses pacotes possivelmente tenham dependências adicionais obrigatórias ou opcionais deles próprios. Para essas dependências, a prática recomendada é a de instalá-las depois de completar o livro LFS e então voltar e reconstruir o pacote LFS. Em muitos casos, a reinstalação é endereçada no BLFS.

source: Attr, Bash, Binutils, Coreutils, GCC, Gettext, Grep, M4, Make, Perl, Sed, and Texinfo
fr: Attr, Bash, Binutils, Coreutils, GCC, Gettext, Grep, M4, Make, Perl, Sed et Texinfo
pt_br: Attr, Bash, Binutils, Coreutils, GCC, Gettext, Grep, M4, Make, Perl, Sed e Texinfo

source: Attr and Glibc
fr: Attr et Glibc
pt_br: Attr e Glibc

source: Automake, Diffutils, Findutils, and Libtool
fr: Automake, Diffutils, Findutils et Libtool
pt_br: Automake, Diffutils, Findutils e Libtool

source: Coreutils, Sed, Tar, and Vim
fr: Coreutils, Sed, Tar et Vim
pt_br: Coreutils, Sed, Tar e Vim

source: None
fr: Aucun
pt_br: Nenhum

source: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Perl, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Perl, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Perl, Sed e Texinfo

source: Acl and Libcap
fr: Acl et Libcap
pt_br: Acl e Libcap

source: Bash, Coreutils, Grep, M4, Make, Perl, Sed, and Texinfo
fr: Bash, Coreutils, Grep, M4, Make, Perl, Sed et Texinfo
pt_br: Bash, Coreutils, Grep, M4, Make, Perl, Sed e Texinfo

source: Bash, Coreutils, Grep, M4, Make, Sed, and Texinfo
fr: Bash, Coreutils, Grep, M4, Make, Sed et Texinfo
pt_br: Bash, Coreutils, Grep, M4, Make, Sed e Texinfo

source: Automake, Diffutils, Findutils, GCC, and Libtool
fr: Automake, Diffutils, Findutils, GCC et Libtool
pt_br: Automake, Diffutils, Findutils, GCC e Libtool

source: Automake and Coreutils
pt_br: Automake e Coreutils

source: Autoconf, Bash, Coreutils, Gettext, Grep, M4, Make, Perl, Sed, and Texinfo
fr: Autoconf, Bash, Coreutils, Gettext, Grep, M4, Make, Perl, Sed et Texinfo
pt_br: Autoconf, Bash, Coreutils, Gettext, Grep, M4, Make, Perl, Sed e Texinfo

source: Bash, Coreutils, Grep, M4, Sed, and Texinfo
fr: Bash, Coreutils, Grep, M4, Sed et Texinfo
pt_br: Bash, Coreutils, Grep, M4, Sed e Texinfo

source: Binutils, Bison, Bzip2, DejaGNU, Diffutils, Expect, Findutils, Flex, GCC, Gettext, Gzip, Libtool, and Tar
fr: Binutils, Bison, Bzip2, DejaGNU, Diffutils, Expect, Findutils, Flex, GCC, Gettext, Gzip, Libtool et Tar
pt_br: Binutils, Bison, Bzip2, DejaGNU, Diffutils, Expect, Findutils, Flex, GCC, Gettext, Gzip, Libtool e Tar

source: Bash, Binutils, Bison, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Patch, Readline, Sed, and Texinfo
fr: Bash, Binutils, Bison, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Patch, Readline, Sed et Texinfo
pt_br: Bash, Binutils, Bison, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Patch, Readline, Sed e Texinfo

source: Glibc, Ncurses, and Readline
fr: Glibc, Ncurses et Readline
pt_br: Glibc, Ncurses e Readline

source: Expect and Shadow
fr: Expect et Shadow
pt_br: Expect e Shadow

source: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make, and Readline
fr: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make et Readline
pt_br: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make e Readline

source: Bash, Binutils, Coreutils, Diffutils, File, Flex, Gawk, GCC, Glibc, Grep, Make, Perl, Sed, Texinfo, and Zlib
fr: Bash, Binutils, Coreutils, Diffutils, File, Flex, Gawk, GCC, Glibc, Grep, Make, Perl, Sed, Texinfo et Zlib
pt_br: Bash, Binutils, Coreutils, Diffutils, File, Flex, Gawk, GCC, Glibc, Grep, Make, Perl, Sed, Texinfo e Zlib

source: Glibc and Zlib
fr: Glibc et Zlib
pt_br: Glibc e Zlib

source: DejaGNU and Expect
fr: DejaGNU et Expect
pt_br: DejaGNU e Expect

source: <ulink url="https://sourceware.org/elfutils/">Elfutils</ulink> and <ulink url="&blfs-book;general/jansson.html">Jansson</ulink>
fr: <ulink url="https://sourceware.org/elfutils/">Elfutils</ulink> et <ulink url="&blfs-book;general/jansson.html">Jansson</ulink>
pt_br: <ulink url="https://sourceware.org/elfutils/">Elfutils</ulink> e <ulink url="&blfs-book;general/jansson.html">Jansson</ulink>

source: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Perl, and Sed
fr: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Perl et Sed
pt_br: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Perl e Sed

source: Diffutils, Findutils, and Flex
fr: Diffutils, Findutils et Flex
pt_br: Diffutils, Findutils e Flex

source: Kbd and Tar
fr: Kbd et Tar
pt_br: Kbd e Tar

source: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Make, and Patch
fr: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Make, et Patch
pt_br: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Make e Patch

source: File and Libelf
pt_br: File e Libelf

source: Gawk, GCC, Grep, Make, Sed, and Texinfo
fr: Gawk, GCC, Grep, Make, Sed et Texinfo
pt_br: Gawk, GCC, Grep, Make, Sed e Texinfo

source: Bash and Gawk
fr: Bash et Gawk
pt_br: Bash e Gawk

source: Autoconf, Automake, Bash, Binutils, Coreutils, GCC, Gettext, Glibc, GMP, Grep, Libcap, Make, OpenSSL, Patch, Perl, Sed, and Texinfo
pt_br: Autoconf, Automake, Bash, Binutils, Coreutils, GCC, Gettext, Glibc, GMP, Grep, Libcap, Make, OpenSSL, Patch, Perl, Sed e Texinfo

source: Diffutils, E2fsprogs, Findutils, Shadow, and Util-linux
fr: Diffutils, E2fsprogs, Findutils, Shadow et Util-linux
pt_br: Diffutils, E2fsprogs, Findutils, Shadow e Util-linux

source: Bash, Diffutils, Findutils, Man-DB, and &systemd-udev;
pt_br: Bash, Diffutils, Findutils, Man-DB e &systemd-udev;

source: <ulink url="https://metacpan.org/pod/Expect">Expect.pm</ulink> and <ulink url="https://metacpan.org/pod/IO::Tty">IO::Tty</ulink>
fr: <ulink url="https://metacpan.org/pod/Expect">Expect.pm</ulink> et <ulink url="https://metacpan.org/pod/IO::Tty">IO::Tty</ulink>
pt_br: <ulink url="https://metacpan.org/pod/Expect">Expect.pm</ulink> e <ulink url="https://metacpan.org/pod/IO::Tty">IO::Tty</ulink>

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Pkgconf, Sed, Systemd, and Util-linux
pt_br: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Pkgconf, Sed, Systemd e Util-linux

source: Glibc and Systemd
fr: Glibc et Systemd
pt_br: Glibc e Systemd

source: Several packages in BLFS
fr: Plusieurs paquets dans BLFS
pt_br: Vários pacotes no BLFS

source: <ulink url="&blfs-book;x/x7lib.html">Xorg Libraries</ulink>
fr: <ulink url="&blfs-book;x/x7lib.html">Bibliothèques Xorg</ulink>
pt_br: <ulink url="&blfs-book;x/x7lib.html">Bibliotecas do Xorg</ulink>

source: Bash, Coreutils, Diffutils, Expect, GCC, Grep, Make, Sed, and Texinfo
fr: Bash, Coreutils, Diffutils, Expect, GCC, Grep, Make, Sed et Texinfo
pt_br: Bash, Coreutils, Diffutils, Expect, GCC, Grep, Make, Sed e Texinfo

source: Expect and Bash
fr: Expect et Bash
pt_br: Expect e Bash

source: Bash, Binutils, Coreutils, Gawk, GCC, Gettext, Glibc, Grep, Make, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, Gawk, GCC, Gettext, Glibc, Grep, Make, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, Gawk, GCC, Gettext, Glibc, Grep, Make, Sed e Texinfo

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Gzip, Make, Pkgconf, Sed, <phrase revision='systemd'>Systemd, </phrase>Texinfo, and Util-linux
pt_br: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Gzip, Make, Pkgconf, Sed, <phrase revision='systemd'>Systemd, </phrase>Texinfo e Util-linux

source: Glibc and Util-linux
fr: Glibc et Util-linux
pt_br: Glibc e Util-linux

source: Procps-ng and Psmisc
fr: Procps-ng et Psmisc
pt_br: Procps-ng e Psmisc

source: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make, and Sed
fr: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make et Sed
pt_br: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make e Sed

source: Python and XML::Parser
fr: Python et XML::Parser
pt_br: Python e XML::Parser

source: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Patch, Sed, and Tcl
fr: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Patch, Sed et Tcl
pt_br: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Patch, Sed e Tcl

source: Glibc and Tcl
fr: Glibc et Tcl
pt_br: Glibc e Tcl

source: Bash, Binutils, Bzip2, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Sed, Xz, and Zlib
fr: Bash, Binutils, Bzip2, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Sed, Xz et Zlib
pt_br: Bash, Binutils, Bzip2, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, Make, Sed, Xz e Zlib

source: Glibc, Bzip2, Xz, and Zlib
fr: Glibc, Bzip2, Xz et Zlib
pt_br: Glibc, Bzip2, Xz e Zlib

source: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, Make, Sed e Texinfo

source: Bash and Glibc
fr: Bash et Glibc
pt_br: Bash e Glibc

source: DejaGNU, Diffutils, and Expect
fr: DejaGNU, Diffutils et Expect
pt_br: DejaGNU, Diffutils e Expect

source: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Patch, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Patch, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, Grep, M4, Make, Patch, Sed e Texinfo

source: Bash, Glibc, and M4
fr: Bash, Glibc et M4
pt_br: Bash, Glibc e M4

source: Bison and Gawk
fr: Bison et Gawk
pt_br: Bison e Gawk

source: Binutils, IProute2, Kbd, Kmod, and Man-DB
fr: Binutils, IProute2, Kbd, Kmod et Man-DB
pt_br: Binutils, IProute2, Kbd, Kmod e Man-DB

source: No test suite available
fr: Aucune suite de tests disponible
pt_br: Nenhuma suíte de teste disponível

source: <ulink url='&blfs-book;general/python-modules.html#pytest'>pytest</ulink> and <ulink url='&pypi-home;/testpath'>testpath</ulink>
pt_br: <ulink url='&blfs-book;general/python-modules.html#pytest'>pytest</ulink> e <ulink url='&pypi-home;/testpath'>testpath</ulink>

source: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, GMP, Grep, Make, MPFR, Patch, Readline, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, GMP, Grep, Make, MPFR, Patch, Readline, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, GCC, Gettext, Glibc, GMP, Grep, Make, MPFR, Patch, Readline, Sed e Texinfo

source: Bash, Glibc, and Mpfr
fr: Bash, Glibc et Mpfr
pt_br: Bash, Glibc e Mpfr

source: Bash, Binutils, Coreutils, Diffutils, Findutils, Gawk, GCC, Gettext, Glibc, GMP, Grep, Libxcrypt, M4, Make, MPC, MPFR, Patch, Perl, Sed, Tar, Texinfo, and Zstd
pt_br: Bash, Binutils, Coreutils, Diffutils, Findutils, Gawk, GCC, Gettext, Glibc, GMP, Grep, Libxcrypt, M4, Make, MPC, MPFR, Patch, Perl, Sed, Tar, Texinfo e Zstd

source: Bash, Binutils, Glibc, Mpc, and Python
fr: Bash, Binutils, Glibc, Mpc et Python
pt_br: Bash, Binutils, Glibc, Mpc e Python

source: DejaGNU, Expect, and Shadow
fr: DejaGNU, Expect et Shadow
pt_br: DejaGNU, Expect e Shadow

source: <ulink url="https://www.gdcproject.org/">GDC</ulink>, <ulink url="https://gcc.gnu.org/wiki/GNAT">GNAT</ulink>, and <ulink url="https://repo.or.cz/isl.git">ISL</ulink>
pt_br: <ulink url="https://www.gdcproject.org/">GDC</ulink>, <ulink url="https://gcc.gnu.org/wiki/GNAT">GNAT</ulink> e <ulink url="https://repo.or.cz/isl.git">ISL</ulink>

source: Bash, Binutils, Coreutils, Diffutils, GCC, Grep, Make, and Sed
fr: Bash, Binutils, Coreutils, Diffutils, GCC, Grep, Make et Sed
pt_br: Bash, Binutils, Coreutils, Diffutils, GCC, Grep, Make e Sed

source: Bash, Glibc, and Readline
fr: Bash, Glibc et Readline
pt_br: Bash, Glibc e Readline

source: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, Gawk, GCC, Glibc, Grep, Make, Ncurses, Sed e Texinfo

source: Acl, Bash, Gcc, and Glibc
fr: Acl, Bash, Gcc et Glibc
pt_br: Acl, Bash, Gcc e Glibc

source: Diffutils, Perl, and Tcl
fr: Diffutils, Perl et Tcl
pt_br: Diffutils, Perl e Tcl

source: Automake and Bison
fr: Automake et Bison
pt_br: Automake e Bison

source: Bash, Binutils, Bison, Coreutils, Diffutils, Gawk, GCC, Gettext, Grep, Gzip, Linux API Headers, Make, Perl, Python, Sed, and Texinfo
fr: Bash, Binutils, Bison, Coreutils, Diffutils, Gawk, GCC, Gettext, Grep, Gzip, Linux API Headers, Make, Perl, Python, Sed et Texinfo
pt_br: Bash, Binutils, Bison, Coreutils, Diffutils, Gawk, GCC, Gettext, Grep, Gzip, Cabeçalhos da API do Linux, Make, Perl, Python, Sed e Texinfo

source: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, M4, Make, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, M4, Make, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, Diffutils, Gawk, GCC, Glibc, Grep, M4, Make, Sed e Texinfo

source: GCC and Glibc
fr: GCC et Glibc
pt_br: GCC e Glibc

source: MPFR and GCC
fr: MPFR et GCC
pt_br: MPFR e GCC

source: Bash, Binutils, Coreutils, GCC, Glibc, and Make
fr: Bash, Binutils, Coreutils, GCC, Glibc et Make
pt_br: Bash, Binutils, Coreutils, GCC, Glibc e Make

source: Diffutils and Expect
fr: Diffutils et Expect
pt_br: Diffutils e Expect

source: Bash, Binutils, Coreutils, Diffutils, GCC, Gettext, Glibc, Grep, Make, Patch, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, Diffutils, GCC, Gettext, Glibc, Grep, Make, Patch, Sed et Texinfo
pt_br: Bash, Binutils, Coreutils, Diffutils, GCC, Gettext, Glibc, Grep, Make, Patch, Sed e Texinfo

source: <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink> and <ulink url="&blfs-book;general/libsigsegv.html">libsigsegv</ulink>
fr: <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink> et <ulink url="&blfs-book;general/libsigsegv.html">libsigsegv</ulink>
pt_br: <ulink url="&blfs-book;general/pcre2.html">PCRE2</ulink> e <ulink url="&blfs-book;general/libsigsegv.html">libsigsegv</ulink>

source: Bash, Binutils, Bison, Coreutils, Gawk, GCC, Glibc, Grep, Make, Patch, Sed, and Texinfo
fr: Bash, Binutils, Bison, Coreutils, Gawk, GCC, Glibc, Grep, Make, Patch, Sed et Texinfo
pt_br: Bash, Binutils, Bison, Coreutils, Gawk, GCC, Glibc, Grep, Make, Patch, Sed e Texinfo

source: GCC, Glibc, and Perl
fr: GCC, Glibc et Perl
pt_br: GCC, Glibc e Perl

source: Man-DB and Perl
fr: Man-DB et Perl
pt_br: Man-DB e Perl

source: <ulink url="&blfs-book;pst/gs.html">ghostscript</ulink> and <ulink url="&blfs-book;general/uchardet.html">Uchardet</ulink>
fr: <ulink url="&blfs-book;pst/gs.html">ghostscript</ulink> et <ulink url="&blfs-book;general/uchardet.html">Uchardet</ulink>
pt_br: <ulink url="&blfs-book;pst/gs.html">ghostscript</ulink> e <ulink url="&blfs-book;general/uchardet.html">Uchardet</ulink>

source: Bash, Binutils, Bison, Coreutils, Diffutils, GCC, Gettext, Glibc, Grep, Make, Ncurses, Sed, Texinfo, and Xz
fr: Bash, Binutils, Bison, Coreutils, Diffutils, GCC, Gettext, Glibc, Grep, Make, Ncurses, Sed, Texinfo et Xz
pt_br: Bash, Binutils, Bison, Coreutils, Diffutils, GCC, Gettext, Glibc, Grep, Make, Ncurses, Sed, Texinfo e Xz

source: Bash, GCC, Gettext, Glibc, Xz, and Sed.
fr: Bash, GCC, Gettext, Glibc, Xz et Sed.
pt_br: Bash, GCC, Gettext, Glibc, Xz e Sed.

source: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make, Sed, and Texinfo
fr: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make, Sed, et Texinfo
pt_br: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make, Sed e Texinfo

source: Diffutils and Less
fr: Diffutils et Less
pt_br: Diffutils e Less

source: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make, Ncurses, Patch, Sed, Texinfo, and Zlib
fr: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make, Ncurses, Patch, Sed, Texinfo et Zlib
pt_br: Bash, Binutils, Coreutils, GCC, Glibc, Grep, Make, Ncurses, Patch, Sed, Texinfo e Zlib

source: GCC, Glibc, Ncurses, and Readline
fr: GCC, Glibc, Ncurses et Readline
pt_br: GCC, Glibc, Ncurses e Readline

source: Bash, Gawk, Glibc, Make, Perl, Sed, and XML::Parser
fr: Bash, Gawk, Glibc, Make, Perl, Sed et XML::Parser
pt_br: Bash, Gawk, Glibc, Make, Perl, Sed e XML::Parser

source: Autoconf, Automake, Bash, Glibc, Grep, Perl, and Sed
fr: Autoconf, Automake, Bash, Glibc, Grep, Perl et Sed
pt_br: Autoconf, Automake, Bash, Glibc, Grep, Perl e Sed

source: Bash, Bison, Coreutils, Flex, GCC, Glibc, Make, Libcap, Libelf, Linux API Headers, Pkgconf, and Zlib
pt_br: Bash, Bison, Coreutils, Flex, GCC, Glibc, Make, Libcap, Libelf, Cabeçalhos da API do Linux, Pkgconf e Zlib

source: Bash, Coreutils, Glibc, Libcap, Libelf, and Zlib
fr: Bash, Coreutils, Glibc, Libcap, Libelf et Zlib
pt_br: Bash, Coreutils, Glibc, Libcap, Libelf e Zlib

source: <ulink url="&blfs-book;server/db.html">Berkeley DB</ulink>, <ulink url="&blfs-book;postlfs/iptables.html">iptables</ulink>, <ulink url="&github;/libbpf/libbpf">libbpf</ulink>, <ulink url="&blfs-book;basicnet/libmnl.html">libmnl</ulink>, and <ulink url="&blfs-book;basicnet/libtirpc.html">libtirpc</ulink>
pt_br: <ulink url="&blfs-book;server/db.html">Berkeley DB</ulink>, <ulink url="&blfs-book;postlfs/iptables.html">iptables</ulink>, <ulink url="&github;/libbpf/libbpf">libbpf</ulink>, <ulink url="&blfs-book;basicnet/libmnl.html">libmnl</ulink> e <ulink url="&blfs-book;basicnet/libtirpc.html">libtirpc</ulink>

source: MarkupSafe and Python
fr: MarkupSafe et Python
pt_br: MarkupSafe e Python

source: Bash, Binutils, Bison, Check, Coreutils, Flex, GCC, Gettext, Glibc, Gzip, Make, Patch, and Sed
fr: Bash, Binutils, Bison, Check, Coreutils, Flex, GCC, Gettext, Glibc, Gzip, Make, Patch et Sed
pt_br: Bash, Binutils, Bison, Check, Coreutils, Flex, GCC, Gettext, Glibc, Gzip, Make, Patch e Sed

source: Bash, Coreutils, and Glibc
fr: Bash, Coreutils et Glibc
pt_br: Bash, Coreutils e Glibc

source: Bash, Binutils, Bison, Coreutils, Flex, GCC, Gettext, Glibc, Gzip, Make, OpenSSL, Pkgconf, Sed, Xz, and Zlib
pt_br: Bash, Binutils, Bison, Coreutils, Flex, GCC, Gettext, Glibc, Gzip, Make, OpenSSL, Pkgconf, Sed, Xz e Zlib

source: Glibc, Xz, and Zlib
fr: Glibc, Xz et Zlib
pt_br: Glibc, Xz e Zlib

source: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Ncurses, and Sed
fr: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Ncurses et Sed
pt_br: Bash, Binutils, Coreutils, Diffutils, GCC, Glibc, Grep, Make, Ncurses e Sed

source: Glibc and Ncurses
fr: Glibc et Ncurses
pt_br: Glibc e Ncurses
