Repository: espindula/br-lfs
Catalog: blfs/*/general/prog/python-dependencies/sphinxcontrib-devhelp.po
Languages: fr

source: 17 KB
fr: 17&nbsp;Ko

source: 2.7 MB (with tests)
fr: 2,7&nbsp;Mo (avec les tests)

source: less than 0.1 SBU (with tests)
fr: moins de 0,1&nbsp;SBU (avec les tests)

source: Introduction to Sphinxcontrib-devhelp Module
fr: Introduction Sphinxcontrib-devhelp Module

source: The <application>Sphinxcontrib-devhelp</application> package is a <application>Sphinx</application> extension which outputs <ulink url="https://wiki.gnome.org/Apps/Devhelp">Devhelp</ulink> documents.
fr: Le paquet <application>Sphinxcontrib-devhelp</application> est une extension <application>Sphinx</application> qui fournit le format des documents <ulink url="https://wiki.gnome.org/Apps/Devhelp">Develp</ulink>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&sc-devhelp-download-http;"/>
fr: Tlchargement (HTTP)&nbsp;: <ulink url="&sc-devhelp-download-http;"/>

source: Download (FTP): <ulink url="&sc-devhelp-download-ftp;"/>
fr: Tlchargement (FTP)&nbsp;: <ulink url="&sc-devhelp-download-ftp;"/>

source: Download MD5 sum: &sc-devhelp-md5sum;
fr: Somme de contrle MD5&nbsp;: &sc-devhelp-md5sum;

source: Download size: &sc-devhelp-size;
fr: Taille du tlchargement&nbsp;: &sc-devhelp-size;

source: Estimated disk space required: &sc-devhelp-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &sc-devhelp-buildsize;

source: Estimated build time: &sc-devhelp-time;
fr: Estimation du temps de construction&nbsp;: &sc-devhelp-time;

source: Sphinxcontrib-devhelp Dependencies
fr: Dpendances de Sphinxcontrib-devhelp

source: Optional (for testing)
fr: Facultatives (pour les tests)

source: <xref linkend="pytest"/> and <xref linkend="sphinx"/> (circular dependency)
fr: <xref linkend="pytest"/> et <xref linkend="sphinx"/> (dépendance circulaire)

source: Installation of Sphinxcontrib-devhelp
fr: Installation de Sphinxcontrib-devhelp

source: Build the module:
fr: Construisez le module&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: To test the installation, run <command>pytest</command>.
fr: Pour tester l'installation, exécutez <command>pytest</command>.

source: Installed Programs
fr: Programmes installs

source: Installed Libraries
fr: Bibliothques installes

source: Installed Directories
fr: Rpertoires installs

source: /usr/lib/python&python3-majorver;/site-packages/sphinxcontrib and /usr/lib/python&python3-majorver;/site-packages/sphinxcontrib_devhelp-&sc-devhelp-version;.dist-info
fr: /usr/lib/python&python3-majorver;/site-packages/sphinxcontrib et /usr/lib/python&python3-majorver;/site-packages/sphinxcontrib_devhelp-&sc-devhelp-version;.dist-info
