Repository: espindula/br-lfs
Catalog: blfs/*/general/prog/python-dependencies/sphinxcontrib-applehelp.po
Languages: fr

source: 28 KB
fr: 28&nbsp;Ko

source: 2.0 MB (with tests)
fr: 2,0&nbsp;Mo (avec les tests)

source: less than 0.1 SBU (with tests)
fr: moins de 0,1&nbsp;SBU (avec les tests)

source: Introduction to Sphinxcontrib-applehelp Module
fr: Introduction Sphinxcontrib-applehelp Module

source: The <application>Sphinxcontrib-applehelp</application> package is a <application>Sphinx</application> extension which outputs Apple help books.
fr: Le paquet <application>Sphinxcontrib-applehelp</application> est une extension <application>Sphinx</application> qui fournit le format des livres d'aide d'Apple.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&sc-applehelp-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&sc-applehelp-download-http;"/>

source: Download (FTP): <ulink url="&sc-applehelp-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&sc-applehelp-download-ftp;"/>

source: Download MD5 sum: &sc-applehelp-md5sum;
fr: Somme de contrôle MD5&nbsp;: &sc-applehelp-md5sum;

source: Download size: &sc-applehelp-size;
fr: Taille du téléchargement&nbsp;: &sc-applehelp-size;

source: Estimated disk space required: &sc-applehelp-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &sc-applehelp-buildsize;

source: Estimated build time: &sc-applehelp-time;
fr: Estimation du temps de construction&nbsp;: &sc-applehelp-time;

source: Sphinxcontrib-applehelp Dependencies
fr: Dpendances de Sphinxcontrib-applehelp

source: Optional (for testing)
fr: Facultatives (pour les tests)

source: <xref linkend="pytest"/> and <xref linkend="sphinx"/> (circular dependency)
fr: <xref linkend="pytest"/> et <xref linkend="sphinx"/> (dépendance circulaire)

source: Installation of Sphinxcontrib-applehelp
fr: Installation de Sphinxcontrib-applehelp

source: Build the module:
fr: Construisez le module&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: To test the installation, run <command>pytest</command>. Several warnings may be issued, due to the use of deprecated functions.
fr: Pour tester l'installation, exécutez <command>pytest</command>. Plusieurs avertissements peuvent s'afficher, à cause de l'utilisation de fonctions obsolètes.

source: Installed Programs
fr: Programmes installs

source: Installed Libraries
fr: Bibliothques installes

source: Installed Directories
fr: Rpertoires installs

source: /usr/lib/python&python3-majorver;/site-packages/sphinxcontrib and /usr/lib/python&python3-majorver;/site-packages/sphinxcontrib_applehelp-&sc-applehelp-version;.dist-info
fr: /usr/lib/python&python3-majorver;/site-packages/sphinxcontrib et /usr/lib/python&python3-majorver;/site-packages/sphinxcontrib_applehelp-&sc-applehelp-version;.dist-info
