Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/core/config.xml.1.chaine.po
Languages: fr

source: The intention of LFS is to provide a basic system which you can build upon.
fr: Le but de LFS est de fournir un système de base sur lequel vous pouvez construire.

source: There are several things about tidying up the system which many people wonder about once they have done the base install.
fr: Il y a plusieurs choses liées au rangement du système sur lesquelles de nombreux utilisateurs se posent des questions une fois qu'ils ont fait le système de base.

source: We hope to cover these issues in this chapter.
fr: Nous espérons traiter ces questions dans ce chapitre.

source: Most people coming from non-Unix like backgrounds to Linux find the concept of text-only configuration files slightly strange.
fr: La plupart des gens issus d'environnements de type non Unix et découvrant Linux trouvent un peu étrange le concept des fichiers de configuration en texte brut.

source: In Linux, just about all configuration is done via the manipulation of text files.
fr: Sur Linux, toute la configuration se fait en manipulant des fichiers textes.

source: The majority of these files can be found in the _F133_ hierarchy.
fr: On peut trouver la majorité de ces fichiers dans la hiérarchie _F133_.

source: There are often graphical configuration programs available for different subsystems but most are simply pretty front ends to the process of editing a text file.
fr: Des programmes graphiques de configuration sont souvent disponibles pour différents sous-systèmes, mais la plupart d'entre eux sont simplement des interfaces conviviales avec les processus d'édition d'un fichier texte.

source: The advantage of text-only configuration is that you can edit parameters using your favorite text editor, whether that be _C350_ , _C1394_ , or any other editor.
fr: L'avantage de la configuration en texte brut est que vous pouvez éditer les paramètres en utilisant votre éditeur de texte favori, qu'il s'agisse de _C350_ , _C1394_ , ou d'un autre éditeur.

source: Hardware issues relevant to firmware and other devices is addressed next.
fr: Les problèmes matériels liés aux firmwares et aux autres périphériques sont traités ensuite.

source: The system is then configured to ease addition of new users, because this can affect the choices you make in the two subsequent topics&mdash;_X239_ and _X353_ .
fr: Puis, le système est configuré pour faciliter l'ajout de nouveaux utilisateurs car cela peut influencer votre choix dans les deux domaines consécutifs&mdash;_X239_ et _X353_.

source: The remaining topics, _X381_ , _X382_ , _X383_ , and _X384_ are then addressed, in that order.
fr: Les autres sujets, _X381_ , _X382_ , _X383_ et _X384_ sont ensuite évoqués, dans cet ordre.
