Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/core/kdelibs.xml.1.chaine.po
Languages: fr

source: 11.1 MB
fr: 11.1 Mo

source: Introduction to Kdelibs
fr: Introduction à Kdelibs

source: This package includes programs and libraries that are central to development and execution of KDE programs.
fr: Ce paquet inclus des programmes et des bibliothèques qui sont centraux dans le développement et l'exécution des programmes de KDE.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Kdelibs Dependencies
fr: Dependances de Kdelibs

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Kdelibs
fr: Installation de Kdelibs

source: Fix file conflicts with _A653_ by running the following commands:
fr: Corrigez des conflits de fichier avec _A653_ en lançant les commandes suivantes :

source: Install _A654_ by running the following commands:
fr: Installez _A654_ en lançant les commandes suivantes :

source: The unit regression tests are designed to be run after _A655_ is installed.
fr: Les tests de régression unitaires sont prévus pour être lancés après que _A655_ soit installé.

source: Now as the _U1_ user:
fr: Maintenant en tant qu'utilisateur _U1_ :

source: To run the unit regression tests, you must have a current KDE session running and issue _C97_ .
fr: Pour lancer les tests de regression unitaires, vous devez avoir une session de KDE de lancée et tapez _C97_.

source: Command Explanations
fr: Explications des commandes

source: This switch is used to install configuration files in /etc.
fr: Ce paramètre est utilisé pour installer les fichiers de configuration dans /etc.

source: This switch is used to apply higher level of compiler optimizations.
fr: Ce paramètre est utilisé pour appliquer des optimisations de compilation de haut niveau.

source: This switch is used to tell _C583_ where to find the XML DTDs.
fr: Ce paramètre est utilisé pour dire à _C583_ ou trouver les DTD de XML.

source: Use this switch if you have _A656_ .
fr: Utilisez ce paramètre si vous avez _A656_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: checkXML, kbuildsycoca4, kconfig_compiler, kcookiejar4, kde4-config, kded4, kdeinit4, kdeinit4_shutdown, kdeinit4_wrapper, kfilemetadatareader, kjs, kjscmd, kmailservice, kross, kshell4, ktelnetservice, kunittestmodrunner, kwrapper4, makekdewidgets, meinproc4, meinproc4_simple, nepomuk-rcgen and preparetips
fr: checkXML, kbuildsycoca4, kconfig_compiler, kcookiejar4, kde4-config, kded4, kdeinit4, kdeinit4_shutdown, kdeinit4_wrapper, kfilemetadatareader, kjs, kjscmd, kmailservice, kross, kshell4, ktelnetservice, kunittestmodrunner, kwrapper4, makekdewidgets, meinproc4, meinproc4_simple, nepomuk-rcgen et preparetips

source: several in &kde-dir;/lib
fr: plusieurs dans &kde-dir;/lib

source: several in &kde-dir;/include, &kde-dir;/lib and &kde-dir;/share
fr: plusieurs dans /etc/kde, &kde-dir;/include et &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: is a tool used to check for syntax errors in KDE DocBook XML files.
fr: est un outil pour vérifier les erreurs de syntaxe dans les fichiers XML de la documentation KDE.

source: is used to rebuild the system configuration cache.
fr: est utilisé pour reconstruire le cache du système de configuration.

source: is the KDE configuration compiler.
fr: est le compilateur de configuration de KDE.

source: is the KDE HTTP cookie daemon.
fr: est le démon HTTP de cookie de KDE.

source: is used to print the KDE installation paths.
fr: est utilisé pour afficher les chemins de configuration de KDE.

source: is the KDE daemon.
fr: est le démon KDE.

source: is the KDE process launcher.
fr: est le lanceur de processus de KDE.

source: is the KDE ECMAScript/JavaScript engine.
fr: est le moteur ECMAScript/JavaScript de KDE.

source: is a tool used for launching KJSEmbed scripts from the command line.
fr: est un outil utilisé pour lancer le script KJSEmbed depuis la ligne de commande.

source: is the KDE application used to run kross scripts.
fr: est l'application KDE utilisée pour lancer les scripts kross.

source: is used to build Qt widget plugins from an ini style description file.
fr: est utilisé pour construire les plugins Qt widget depuis un fichier ini de description de style.

source: is used to convert DocBook files to HTML.
fr: est utilisé pour convertir les fichiers de DocBook en HTML.

source: is a script used to extract the text from a tips file.
fr: est un script utilisé pour extraire du texte depuis les fichiers d'astuces.
