Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/core/pre-install-config.xml.1.chaine.po
Languages: fr

source: KDE4 Pre-installation Configuration
fr: configuration de la pré-installation de KDE4

source: If you did not install _A200_ in _F291_ , some of the _A310_ modules in _A163_ look for packages at hard coded locations.
fr: Si vous n'avez pas installé _A200_ dans _F291_ , certain des modules _A310_ dans _A163_ cherche des paquets dans des chemins codés en durs.

source: To accommodate this issue, create the following symbolic link (as the root user):
fr: Pour résoudre ce problème créé les liens symboliques suivants (en tant qu'utilisateur root) :

source: Installing in /usr
fr: Installation dans /usr

source: One option is to put _A163_ into the _F190_ hierarchy.
fr: Une option est de mettre _A163_ dans la hiérarchie _F190_.

source: This creates a simpler setup but makes it more difficult to try multiple versions of _A163_ .
fr: Cela crée un simple setup mais rend plus difficile d'essayer des versions différentes de _A163_.

source: Installing in /opt
fr: Installation dans /opt

source: A method of building multiple versions installs _A163_ in the _F685_ hierarchy:
fr: Une méthode d'installer plusieurs versions de _A163_ est de construire dans la hiérarchie _F685_ :

source: If you are not installing _A163_ in _F291_ , you will need to make some additional configuration changes.
fr: Si vous n'avez pas installé _A163_ dans _F291_ , vous devrez faire des modifications de configurations supplémentaires.

source: Add to your _F680_ :
fr: Ajouter dans votre _F680_ :

source: Several KDE packages install files into D-Bus and polkit directories.
fr: Quelques paquets KDE installent des fichiers dans les répertoires D-BUS et polkit.

source: When installing KDE in a location other than _F291_ , D-Bus and polkit need to find these files.
fr: Quand on installe KDE ailleurs que dans _F291_ , D-Bus et polkit ont besoin de trouver ces fichiers.

source: The easiest way to achieve this is to create the following symlinks (as the _U1_ user):
fr: La façon la plus simple de faire cela est de créer le lien symbolique suivant (en tant qu'utilisatekr _U1_) :

source: Sometimes, the installation paths are coded into installed files.
fr: Parfois, les chemins d'installation sont corrigés dans les fichies installés.

source: This is the reason why _F686_ is used as installation prefix instead of _F687_ .
fr: C'est la raison pourquoi _F686_ est utilisé comme préfx d'installation au lieu de _F687_.

source: After installing _A163_ , you may rename the directory and create a symlink:
fr: Après l'installation de _A163_ , vous pouvez renommer le répertoire et créer un lien symbolique :

source: Later on, you may want to install other versions of _A163_ .
fr: Plus tard, vous pouvez vouloir installer d'autres versions de _A163_.

source: To do that, just remove the symlink and use _F686_ as the prefix again (_A163_ must not be started).
fr: Pour faire cela, supprimez juste le lien symbolique et utilisez _F686_ de nouveau comme préfix (_A163_ ne doit pas être démarré).

source: Which version of _A163_ you use depends only on where the symlink points to.
fr: La version de _A163_ que vous utiliserez dépendra uniquement de la cible du lien symbolique.

source: No other reconfiguration will be needed.
fr: Pas d'autres reconfiguration seront nécessaire.
