Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netlibs/libnl.xml.1.chaine.po
Languages: fr

source: 888 KB
fr: 888 Ko

source: 74 MB (with tests and API documentation)
fr: 74 Mo (avec les tests and API documentation)

source: 0.4 SBU (with tests and API documentation)
fr: 0.4 SBU (avec les tests and API documentation)

source: 15 MB
fr: 15 Mo

source: Introduction to libnl
fr: Introduction à libnl

source: The _A826_ suite is a collection of libraries providing APIs to netlink protocol based Linux kernel interfaces.
fr: La suite _A826_ est une collection de bibliothèques fournissant des API pour le protocole netlink basé sur le noyau Linux.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Optional Download
fr: Téléchargement facultatif

source: libnl Dependencies
fr: Dépendances de libnl

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of libnl
fr: Installation de libnl

source: Install _A826_ by running the following commands:
fr: Installez _A826_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you wish to install the API documentation, as the _U1_ user:
fr: Si vous souhaitez installer la documentation de l'API, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: genl-ctrl-list, idiag-socket-details, nl-class-add, nl-class-delete, nl-classid-lookup, nl-class-list, nl-cls-add, nl-cls-delete, nl-cls-list, nl-link-list, nl-pktloc-lookup, nl-qdisc-add, nl-qdisc-delete, nl-qdisc-list, and 32 other helper programs with nl- and nf- prefixes
fr: genl-ctrl-list, idiag-socket-details, nl-class-add, nl-class-delete, nl-classid-lookup, nl-class-list, nl-cls-add, nl-cls-delete, nl-cls-list, nl-link-list, nl-pktloc-lookup, nl-qdisc-add, nl-qdisc-delete, nl-qdisc-list, et 32 autres programmes d'aide avec le préfixe nl- et nf-

source: libnl-3.so, libnl-cli-3.so, libnl-genl-3.so, libnl-idiag-3.so, libnl-nf-3.so, libnl-route-3.so, libnl-xfrm-3.so, and cli modules under /usr/lib/libnl/cli tree
fr: libnl-3.so, libnl-cli-3.so, libnl-genl-3.so, libnl-idiag-3.so, libnl-nf-3.so, libnl-route-3.so, libnl-xfrm-3.so, et des modules cli sous l'arborescence /usr/lib/libnl/cli

source: /etc/libnl, /usr/include/libnl3, /usr/lib/libnl, and /usr/share/doc/libnl-&libnl-version;
fr: /etc/libnl, /usr/include/libnl3, /usr/lib/libnl, et /usr/share/doc/libnl-&libnl-version;

source: Short Descriptions
fr: Descriptions courtes

source: queries the Generic Netlink controller in kernel and prints a list of all registered Generic Netlink families including the version of the interface that has been registered.
fr: interroge le controleur générique Netlink dans le noyau et affiche la liste de toutes les familles Generic Netlink enregistrés incluses dans la version de l'interface qui a été enregistrée.

source: add or update or replace Traffic Classes
fr: ajoute, ou met à jour ou remplace les Traffic Classes

source: delete Traffic Classes
fr: supprime les Traffic Classes

source: is used to resolve qdisc/class names to classid values and vice versa.
fr: est utilisé pour résoudre les noms qdisc/class en valeurs classid et vice versa.

source: list Traffic Classes.
fr: affiche les Traffic Classes.

source: add a classifier.
fr: ajoute un classifieur.

source: delete a classifier.
fr: supprime un classifieur.

source: list classifiers.
fr: affiche les classifieurs.

source: dump link attributes.
fr: décharge les attributs de lien.

source: lookup packet location definitions.
fr: recherhce les définitions d'emplacement de paquets.

source: add queueing disciplines (qdiscs) in the kernel.
fr: ajoute des disciplines de files d'attentes (qdiscs) dans le noyau.

source: delete queueing disciplines (qdiscs) in the kernel.
fr: supprime des disciplines de files d'attentes (qdiscs) dans le noyau.

source: list queueing disciplines (qdiscs) in the kernel.
fr: affiche les disciplines de files d'attentes (qdiscs) dans le noyau.

source: These libraries contain API functions used to access Netlink interfaces in Linux kernel.
fr: Ces bibliothèques contiennent les fonctions API utilisées pour accéder aux interfaces Netlink dans le noyau Linux.
