Repository: espindula/br-lfs
Catalog: clfs/*/materials/ppc/packages.po
Languages: fr

source: Additional Packages for PowerPC
fr: Paquets supplémentaires pour PowerPC

source: Hfsutils (&hfsutils-version;) - <token>&hfsutils-size;</token>:
fr: Hfsutils (&hfsutils-version;) - <token>&hfsutils-size;</token>&nbsp;:

source: Home page: <ulink url="&hfsutils-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&hfsutils-home;"/>

source: Download: <ulink url="&hfsutils-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&hfsutils-url;"/>

source: MD5 sum: <literal>&hfsutils-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&hfsutils-md5;</literal>

source: Parted (&parted-version;) - <token>&parted-size;</token>:
fr: Parted (&parted-version;) - <token>&parted-size;</token>&nbsp;:

source: Home page: <ulink url="&parted-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&parted-home;"/>

source: Download: <ulink url="&parted-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&parted-url;"/>

source: MD5 sum: <literal>&parted-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&parted-md5;</literal>

source: Powerpc-utils (&powerpcutils-version;) - <token>&powerpcutils-size;</token>:
fr: Powerpc-utils (&powerpcutils-version;) - <token>&powerpcutils-size;</token>&nbsp;:

source: Home page: <ulink url="&powerpcutils-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&powerpcutils-home;"/>

source: Download: <ulink url="&powerpcutils-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&powerpcutils-url;"/>

source: MD5 sum: <literal>&powerpcutils-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&powerpcutils-md5;</literal>

source: Yaboot (&yaboot-version;) - <token>&yaboot-size;</token>:
fr: Yaboot (&yaboot-version;) - <token>&yaboot-size;</token>&nbsp;:

source: Home page: <ulink url="&yaboot-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&yaboot-home;"/>

source: Download: <ulink url="&yaboot-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&yaboot-url;"/>

source: MD5 sum: <literal>&yaboot-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&yaboot-md5;</literal>
