Repository: espindula/br-lfs
Catalog: clfs/*/materials/ppc/patches.po
Languages: fr

source: Additional Patches for PowerPC
fr: Correctifs supplémentaires pour PowerPC

source: HFS Utils Fixes Patch - <token>&hfsutils-fixes-patch-size;</token>:
fr: HFS Utils Correctif - <token>&hfsutils-fixes-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&hfsutils-fixes-patch;"/>
fr: Téléchargement&nbsp; <ulink url="&patches-root;&hfsutils-fixes-patch;"/>

source: MD5 sum: <literal>&hfsutils-fixes-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&hfsutils-fixes-patch-md5;</literal>

source: Powerpc-utils Fixes Patch - <token>&powerpcutils-patch-size;</token>:
fr: Powerpc-utils Correctif - <token>&powerpcutils-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&powerpcutils-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&powerpcutils-patch;"/>

source: MD5 sum: <literal>&powerpcutils-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&powerpcutils-patch-md5;</literal>

source: Yaboot Ofpath_Path_Prefix Patch - <token>&yaboot-ofpath_path-patch-size;</token>:
fr: Yaboot Ofpath_Path_Prefix Correctif - <token>&yaboot-ofpath_path-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&yaboot-ofpath_path-patch;"/>
fr: Télécargement&nbsp;: <ulink url="&patches-root;&yaboot-ofpath_path-patch;"/>

source: MD5 sum: <literal>&yaboot-ofpath_path-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&yaboot-ofpath_path-patch-md5;</literal>

source: Yaboot Parted Patch - <token>&yaboot-parted-patch-size;</token>:
fr: Yaboot Correctfi Parted - <token>&yaboot-parted-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&yaboot-parted-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&yaboot-parted-patch;"/>

source: MD5 sum: <literal>&yaboot-parted-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&yaboot-parted-patch-md5;</literal>

source: Yaboot Stubfuncs Patch - <token>&yaboot-stubfuncs-patch-size;</token>:
fr: Yaboot Correctif Stubfuncs - <token>&yaboot-stubfuncs-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&yaboot-stubfuncs-patch;"/>
fr: Télécharement&nbsp;: <ulink url="&patches-root;&yaboot-stubfuncs-patch;"/>

source: MD5 sum: <literal>&yaboot-stubfuncs-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&yaboot-stubfuncs-patch-md5;</literal>
