Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netutils/networkmanager.xml.1.chaine.po
Languages: fr

source: 3.4 MB
fr: 3.4 Mo

source: 358 MB (with tests)
fr: 358 Mo (avec les tests)

source: 2.5 SBU (with tests)
fr: 2.5 SBU (avec les tests)

source: Introduction to NetworkManager
fr: Introduction à NetworkManager

source: Whether WiFi, wired, 3G, or Bluetooth, NetworkManager allows you to quickly move from one network to another:
fr: Que ce soit en WiFi, filaire, 3G ou Bluetooth, NetworkManager vous permet de passer rapidement d'un réseau à l'autre :

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: NetworkManager Dependencies
fr: Dépendances de NetworkManager

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of NetworkManager
fr: Installation de NetworkManager

source: Install _A508_ by running the following commands:
fr: Installez _A508_ en lançant les commandes suivantes :

source: An already active graphical session with bus address is necessary to run the tests.
fr: Une session graphique déjà active avec une adresse dbus est nécessaire pour lancer les tests.

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This parameter enables build of _C2128_ .
fr: Ce paramètre active la construction de _C2128_.

source: This parameter is used for sysv init systems.
fr: Ce paramètre est utilisé pour le système d'initialisation sysv.

source: If you use systemd, replace "no" by the proper directory.
fr: Si vous utilisez systemd, remplacez "no" par le bon répertoire.

source: This parameter disables parameteral _A780_ support in _A508_ .
fr: Ce paramètre désactive le support facultatif de _A780_ dans _A508_.

source: Use this switch if you have installed _X16_ and wish to build the API manuals.
fr: Utilisez ce paramètre si vous avez installé _X16_ et souhaitez construire les manuels de l'API.

source: Configuring NetworkManager
fr: Configuration de NetworkManager

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: For _A508_ to work, at least minimal configuration file must be present.
fr: Pour que _A508_ fonctionne, il faut qu'il y ait au moins un fichier de configuration minimal.

source: Such file is not installed with _C846_ .
fr: Ce fichier n'est pas installé par _C846_.

source: Issue following command as the _U1_ user to create minimal _F906_ file:
fr: Lancez la commande suivante en tant qu'utilisateur _U1_ pour créer un fichier _F906_ minimal :

source: You can add _O296_ to suppress changes to _F829_ .
fr: Vous pouvez ajouter _O296_ pour supprimer les changements de _F829_.

source: See _C2129_ for any additional options.
fr: Voir _C2129_ pour toutes les options supplémentaires.

source: Boot Script
fr: Script de démarrage

source: To automatically start the _C2130_ daemon when the system is rebooted, install the _F907_ bootscript from the _X203_ package.
fr: Pour démarrer automatiquement le démon _C2130_ au moment du redémarrage du système, installez le script de démarrage _F907_ du paquet _X203_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: NetworkManager, nmcli, nm-online, and, hardlinked to each other:
fr: NetworkManager, nmcli, nm-online, et, lié en dur à chacun des autres :

source: libnm-glib.so, libnm-glib-vpn.so, libnm.so, libnm-util.so, and modules under /usr/lib/NetworkManager
fr: libnm.so, libnm-glib.so, libnm-glib-vpn.so, libnm-util.so, et des modules sous /usr/lib/NetworkManager

source: /etc/NetworkManager, /usr/include/{libnm, libnm-glib, NetworkManager}, /usr/lib/NetworkManager, /usr/share/doc/NetworkManager-&NetworkManager-version;, /usr/share/gtk-doc/html/{libnm, libnm-glib, libnm-util, NetworkManager}, and /var/{lib, run}/NetworkManager
fr: /etc/NetworkManager, /usr/include/{libnm, libnm-glib, NetworkManager}, /usr/lib/NetworkManager, /usr/share/doc/NetworkManager-&NetworkManager-version;, /usr/share/gtk-doc/html/{libnm, libnm-glib, libnm-util, NetworkManager}, et /var/{lib, run}/NetworkManager

source: Short Descriptions
fr: Descriptions courtes

source: is a command-line tool for controlling _A508_ and getting its status.
fr: est un outil en ligne de commande pour contrôler _A508_ et obtenir son état.

source: is a utility to find out whether you are online.
fr: est un outil pour savoir si on est connecté.

source: interactive ncurses based interface for _A781_ .
fr: interface basée sur ncurses pour _A781_.

source: interactive ncurses based interface connection activate/deactivate.
fr: interface intéractive basée sur ncurses pour activer/désactiver les connexions.

source: interactive ncurses based interface connection editor.
fr: interface intéractive basée sur ncurses pour editer les connexions.

source: interactive ncurses based interface hostname editor.
fr: interface intéractive basée sur ncurses pour editer le nom d'hote.

source: is the network management daemon.
fr: est le démon de gestion réseau.

source: contains functions used by _A508_ .
fr: contient des fonctions utilisées par _A508_.

source: contains functions used by _A508_ VPN plugins.
fr: contient des fonctions utilisées par les greffons VPN de _A508_.

source: contains functions used by _A508_ utils.
fr: contient des fonctions utilisées par les outils de _A508_.
