Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/netutils/wireshark.xml.1.chaine.po
Languages: fr

source: 30 MB
fr: 30 Mo

source: 2 GB, with default GUI front-ends
fr: 2 Go, with default GUI front-ends

source: Introduction to Wireshark
fr: Introduction à Wireshark

source: The _A307_ package contains a network protocol analyzer, also known as a
fr: Le paquet _A307_ contient un analyseur de protocole réseau connu aussi sous le nom de

source: This is useful for analyzing data captured
fr: Ceci est utile pour analyser les données capturées

source: off the wire
fr: hors connexion

source: from a live network connection, or data read from a capture file.
fr: à partir d'une connexion réseau en direct ou de données lues à partir d'un fichier de capture.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Optional patch:
fr: Correctif facultatif :

source: Additional Documentation:
fr: Documentation supplémentaire :

source: Wireshark dependencies
fr: Dépendances de Wireshark

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: Optional (for GUI front-ends)
fr: Optionnelles (pour les interfaces graphiques)

source: The _A211_ GUI needs one of _X706_ or _X105_ .
fr: L'interface _A211_ demande soit _X706_ ou _X105_.

source: If both are installed, GTK+3 is used by default.
fr: Si les deux sont installés, GTK+3 est utilisé par défaut.

source: The _A105_ GUI needs one of _X707_ or _X76_ .
fr: L'interface _A105_ demande soit _X707_ ou _X76_.

source: If both are installed, Qt5 is used by default.
fr: Si les deux sont installés, Qt5 est utilisé par défaut.

source: Both GTK+ and Qt GUI front-ends are built, as recommended by the upstream developers.
fr: Les interfaces GTK+ et Qt sont construites, comme recommandé par les développeurs.

source: If you want to override the defaults, some configure switches have to be set (see
fr: Si vous voulez écraser les valeurs par défaut, quelques paramètres de configure doivent être initialisés (voir

source: Command Explanations
fr: Explications des commandes

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: The kernel must have the Packet protocol enabled for _A310_ to capture live packets from the network:
fr: Le noyau doit avoir le protocole de paquets :

source: If built as a module, the name is _F926_ .
fr: Si la construction est faite en tant qu'un module, le nom est _F926_.

source: Installation of Wireshark
fr: Installation de Wireshark

source: These instructions provide additional security measures to ensure that only trusted users are allowed to view network traffic.
fr: Ces instructions donnent les mesures de sécurité pour garantir que seuls les utilisateurs de confiance soient autorisés à voir le trafic réseau.

source: First, set up a system group for wireshark.
fr: Tout d'abord, définissez le groupe system pour wireshark.

source: As the _U2_ user:
fr: En tant qu'utilisateur _U2_ :

source: Continue to install _A307_ by running the following commands:
fr: Continuez à installer _A307_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: If you downloaded any of the documentation files from the page listed in the 'Additional Downloads', install them by issuing the following commands as the _U2_ user:
fr: Si vous avez téléchargé un des fichiers de documentation mentionnés dans 'Téléchargements supplémentaires', installez les en suivant les commandes suivantes en tant qu'utilisateur _U2_ :

source: Now, set ownership and permissions of sensitive applications to only allow authorized users.
fr: Maintenant, définissez le propriétaire et les droits des applications sensibles pour ne permettre qu'aun utilisateurs autorisés de l'utiliser.

source: As the _U5_ user:
fr: En tant qu'utilisateur _U5_ :

source: Finally, add any users to the wireshark group (as _U2_ user):
fr: Enfin, ajoutez les utilisateurs au groupe wireshark (en tant qu'utilisateur _U2_) :

source: If you are installing wireshark for the first time, it will be necessary to leave the session and login again, thus you will now have wireshark between your groups, otherwise, it will not run properly.
fr: Si vous installez wireshark pour la première fois, il sera nécessaire de quitter la session et de se loguer de nouveau, afin que vous ayez maintenant wireshark dans vos groupes, sinon, il ne fonctionnera pas correctement.

source: For the Gtk+2 GUI.
fr: Pour l'interface Gtk+2.

source: If both Gtk+2 and 3 are installed, default is no.
fr: Si Gtk+2 et 3 sont installés, la valeur par défaut est no.

source: Notice that the GUI for only one Gtk+ version (either 2 or 3) can be built.
fr: Notez que l'interface pour seulement une des versions de Gtk+ (soit 2 ou 3) peut être construite.

source: For the Gtk+3 GUI.
fr: Pour l'interface Gtk+3.

source: If both Gtk+2 and 3 are installed, default is yes.
fr: Si Gtk+2 et 3 sont installé, la valeur par défaut est yes.

source: For the Qt GUI.
fr: Pour l'interface Qt.

source: Default is yes.
fr: La valeur par défaut est yes.

source: If both Qt4 and 5 are installed, Qt5 is chosen by default.
fr: Si Qt4 et 5 sont installés, Qt5 est choisi par défaut.

source: Notice that the GUI for only one Qt version (either 4 or 5) can be built.
fr: Notez que seulement l'interface pour une version de Qt (soit 4 ou 5) peut être construite.

source: Use this switch if you have _A211_ installed but do not want to build any of the GUIs.
fr: Cette option est requise si vous avez installé _A211_ mais ne voulez pas construire les interfaces.

source: Configuring Wireshark
fr: Configurer Wireshark

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Though the default configuration parameters are very sane, reference the configuration section of the _L34_ for configuration information.
fr: Si les paramètres de configuration par défaut sont très clairs, reportez vous à la section de configuration du _L3973_ pour les informations de configuration.

source: Most of _A307_ 's configuration can be accomplished using the menu options of the _C560_ graphical interfaces.
fr: La majorité de la configuration de _A307_ peut être réalisée en utilisant les options du menu des interfaces graphiques de _C560_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: androiddump, capinfos, captype, dftest, dumpcap, editcap, idl2wrs, mergecap, randpkt, rawshark, reordercap, text2pcap, tshark, wireshark, and wireshark-gtk
fr: androiddump, capinfos, captype, dftest, dumpcap, editcap, idl2wrs, mergecap, randpkt, rawshark, reordercap, text2pcap, tshark, wireshark, et wireshark-gtk

source: libwireshark.so, libwiretap.so, libwsutil.so, and numerous modules under /usr/lib/wireshark/plugins
fr: libwireshark.so, libwiretap.so, libwsutil.so, et de nombreux modules dans /usr/lib/wireshark/plugins

source: /usr/{lib, share}/wireshark and /usr/share/doc/wireshark-&wireshark-version;
fr: /usr/{lib, share}/wireshark et /usr/share/doc/wireshark-&wireshark-version;

source: Short Descriptions
fr: Descriptions courtes

source: reads a saved capture file and returns any or all of several statistics about that file.
fr: lit un fichier de capture sauvegardé et retourne certaines ou toutes les différentes statistiques sur ce fichier.

source: It is able to detect and read any capture supported by the _A307_ package.
fr: Il est capable de détecter et lire toutes les captures supportées par le paquet _A307_.

source: prints the file types of capture files.
fr: affiche les types de fichier des fichiers de capture.

source: is a display-filter-compiler test program.
fr: est un programme test d'affichage-filtrage-compilation.

source: is a network traffic dump tool.
fr: est un outil de vidage de traffic réseau.

source: It lets you capture packet data from a live network and write the packets to a file.
fr: Il vous permet de capturer en direct les paquets de données d'un réseau et écrire ces paquets dans un fichier.

source: edits and/or translates the format of capture files.
fr: édite et/ou traduit le format des fichiers de capture.

source: It knows how to read _A311_ capture files, including those of _C566_ , _A307_ and other tools that write captures in that format.
fr: Il sait comment lire les fichiers de capture _A311_ dont ceux de _C566_ , _A307_ et autres outils qui capturent dans ce format.

source: combines multiple saved capture files into a single output file.
fr: combine de multiples fichiers de capture en un fichier unique de sortie.

source: creates random-packet capture files.
fr: crée des fichiers de capture de paquets aléatoires.

source: dump and analyze raw libpcap data.
fr: crée et analyse des données raw libpcap.

source: reorder timestamps of input file frames into output file.
fr: re-arrange les marqueurs de temps des paquets d'un fichier d'entrée vers un fichier de sortie.

source: reads in an ASCII hex dump and writes the data described into a _A311_ -style capture file.
fr: lit dans une sauvegarde ASCII hexadécimale et écrit les données décrites dans un fichier de capture de style _A311_.

source: is a TTY-mode network protocol analyzer.
fr: est un analyseur de protocole réseau mode TTY.

source: It lets you capture packet data from a live network or read packets from a previously saved capture file.
fr: Il vous permet de capturer directement les paquets de donnée à partir d'un réseau ou lire les paquets à partir d'un fichier de capture sauvegardé précédemment.

source: is the Qt GUI network protocol analyzer.
fr: est l'interface Qt de l'analyseur de protocole réseau.

source: It lets you interactively browse packet data from a live network or from a previously saved capture file.
fr: Il vous permet de parcourir intéractivement en direct les paquets à partir d'un réseau ou à partir d'un fichier de capture sauvegardé précédemment.

source: is the Gtk+ GUI network protocol analyzer.
fr: est l'interface GTK+ de l'analyseur de protocole réseau.

source: contains functions used by the _A307_ programs to perform filtering and packet capturing.
fr: contient les fonctions utilisés par les programmes de _A307_ pour effectuer le filtrage et la capture de paquets.

source: is a library being developed as a future replacement for _F187_ , the current standard Unix library for packet capturing.
fr: est une bibliothèque développée afin de remplacer dans le futur _F187_ , la bibliothèque Unix standard actuelle pour la capture de paquets.

source: For more information, see the _F930_ file in the source _F188_ directory.
fr: Pour plus d'informations, consultez le fichier _F930_ dans le répertoire source _F188_.
