Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/xml/docbook.xml.1.chaine.po
Languages: fr

source: 96 KB
fr: 96 Ko

source: 1.2 MB
fr: 1.2 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: docbook-xml-&DocBook-version;
fr: DocBook XML-DTD-&DocBook-version;

source: Introduction to DocBook XML DTD
fr: Introduction à DocBook XML DTD

source: The _A813_ -&DocBook-version; package contains document type definitions for verification of XML data files against the DocBook rule set.
fr: Le paquet _A813_ -&DocBook-version; contient des définitions de types de document pour la vérification de données de fichiers XML vis-à-vis de la réglementation DocBook.

source: These are useful for structuring books and software documentation to a standard allowing you to utilize transformations already written for that standard.
fr: Elles sont utiles pour structurer des livres et des documentations de logiciel selon un standard vous permettant d'utiliser des transformations déjà écrites pour ce standard.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: DocBook XML DTD Dependencies
fr: Dépendances de DocBook XML DTD

source: Required
fr: Requises

source: User Notes:
fr: Notes utilisateur :

source: Installation of DocBook XML DTD
fr: Installation de DocBook XML DTD

source: Install _A813_ by running the following commands as the _U2_ user:
fr: Installez _A813_ en exécutant les commantes suivantes en tant qu'utilisateur _U2_ :

source: Create (or update) and populate the _F1243_ catalog file by running the following commands as the _U2_ user:
fr: Créez (ou mettez à jour) et peuplez un fichier catalogue _F1243_ en lançant les commandes suivantes en tant qu'utilisateur _U2_ :

source: Create (or update) and populate the _F1064_ catalog file by running the following commands as the _U2_ user:
fr: Créez (ou mettez à jour) et peuplez un fichier catalogue _F1064_ en lançant les commandes suivantes en tant qu'utilisateur _U2_ :

source: Configuring DocBook XML DTD
fr: Configuration de DocBook XML DTD

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: The above installation creates the files and updates the catalogs.
fr: L'installation ci-dessus crée les fichiers et met à jour les catalogues.

source: In order to install _A814_ or to utilize _A813_ V&DocBook-version; when any version 4.x is requested in the System Identifier, you need to add additional statements to the catalog files.
fr: Afin d'installer ou de mettre à jour _A814_ , utilisez _A813_ V&DocBook-version; quand on vous demande la version 4.x dans l'identifiant système, vous devez ajouter des données supplémentaires aux fichiers catalogues.

source: If you have any of the _A813_ 's referenced below already installed on your system, remove those entries from the _C1519_ command below (issue the commands as the _U2_ user):
fr: Si vous avez déjà installé sur votre système un des _A813_ référencé ci-dessous, supprimez ces entrées de la commande _C1519_ ci-dessous (effectuez les commandes en tant qu'utilisateur _U2_) :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: DTD, MOD and ENT files
fr: Fichiers DTD, MOD et ENT

source: /etc/xml and /usr/share/xml/docbook/xml-dtd-&DocBook-version;
fr: /etc/xml et /usr/share/xml/docbook/xml-dtd-&DocBook-version;

source: Short Descriptions
fr: Descriptions courtes

source: contain a document type definition which defines the element types and the attribute lists that can be used in the corresponding _F1245_ files.
fr: contient une définition de type de document qui définit les types d'élément et les listes d'attributs qu'on peut utiliser dans les fichiers _F1245_ correspondants.

source: files contain components of the document type definition that are sourced into the _F1103_ files.
fr: ces fichiers contiennent les composants de la définition du type de document ayant pour source les fichiers _F1103_.

source: files contain lists of named character entities allowed in HTML.
fr: fichiers contenant des listes d'entités de caractères nommés autorisées en HTML.
