Repository: espindula/br-lfs
Catalog: clfs/*/appendices/ppc/macmiscellany.po
Languages: fr

source: Open Firmware and Mac issues.
fr: Problèmes Open Firmware et Mac.

source: This appendix documents some of the features of ppc macintoshes, and in particular the requirements of coexisting with Mac OS's (OSX or the old OS9). It is only relevant to NewWorld hardware.
fr: Cette annexe documente certaines fonctionnalités des macintoshs ppc, en particulier les prérequis pour la coexistence avec Mac OS (OSX ou le vieux OS9). Ce n'est pertinent que pour les machines NewWorld.

source: <emphasis role="bold">Open Firmware and blessed partitions</emphasis>
fr: <emphasis role="bold">Open Firmware et partitions amorçables</emphasis>

source: The Open Firmware (OF) is the code in ROM or nvram which controls how the machine boots. If booting automatically, it will boot from the first valid blessed partition it finds (this is a simplification, but it is adequate for normal purposes).
fr: L'Open Firmware (OF) est le code en ROM ou nvram qui contrôle comment la machine démarre. Si vous démarrez automatiquement, il démarrera depuis la première partition amorçable valide qu'il trouvera (c'est une simplification, mais c'est suffisant pour un usage normal).

source: It can only read apple filesystems (hfs, hfs+, or hfsx depending on the version of the firmware). For disks under linux, the blessing is done by ybin when it installs yaboot (the loader) and yaboot.conf.
fr: Il ne peut lire que des systèmes de fichier apple (hfs, hfs+ ou hfsx en fonction de la version du firmware). Pour les disques sous Linux, l'amorçage est effectué par ybin quand il installe yaboot (le chargeur) et yaboot.conf.

source: Mac OS's have a tendency to look at other hfs{,+,x} filesystems on the disk, and unbless them if they do not match their expectations. Unblessing makes them unbootable. Fortunately, a filesystem of type <literal>Apple_Bootstrap</literal> can be read as hfs by the OF, but will be ignored by Mac OS.
fr: Mac OS a tendance à regarder les autres systèmes de fichiers hfs{,+,x} sur le disque et à les rendre non amorçables si ils ne correspondent pas à ses attentes. Cela rend impossible de démarrer dessus. Heureusement, un système de fichier de type <literal>Apple_Bootstrap</literal> peut être lu en tant que hfs par l'OF, mais sera ignoré par Mac OS.

source: <emphasis role="bold">Partitioning</emphasis>
fr: <emphasis role="bold">Partitionnement</emphasis>

source: Macintoshes use their own partition format - this means that other machines are unlikely to be able to read or write to macintosh partitions (in particular, fdisk does not understand them). The format allows a large number of individual partitions, and the native Mac tools had a tendency to insert small "filler" partitions between the real partitions. Under linux, using more than 15 partitions can be problematic (shortage of device nodes), so the normal approach is to use the Mac tools to create an area of freespace at the <emphasis>front</emphasis> of the disk, then put the Mac OS partition(s) after it and (re-)install the Mac OS. The freespace can then be partitioned using <command>parted</command> or the older <command>mac-fdisk</command>. It seems that recent versions of the Mac tools may no longer insert the filler partitions, so it may be possible to do all the partitioning before installing OSX.
fr: Les Macintoshs utilisent leur propre format de partition - cela signifie que les autres machines seront probablement incapables de lire ou écrire sur les partitions macintosh (en particulier, fdisk ne les comprend pas). Le format permet un grand nombre de partitions individuelles et les outils Mac natifs ont tendance à insérer de petites partitions pour remplir l'espace entre les partitions réelles. Sous Linux, plus de 15 partitions peut être problématique (rupture de stock de nœud de périphérique), donc l'approche habituelle est d'utiliser les outils Mac pour créer un espace libre au <emphasis>début</emphasis> du disque, puis de mettre les partitions Mac OS après et de réinstaller Mac OS. L'espace libre peut ensuite être partitionné avec <command>parted</command> ou le plus vieux <command>mac-fdisk</command>. Il semble que les versions récentes des outils Mac n'insèrent plus de petites partitions, donc il est possible de faire tout le partitionnement avant d'installer OSX.

source: The Macintosh resizing and partitioning tools are destructive and may delete all data when a partition is resized, even on unaltered partitions.
fr: Les outils de redimensionnement et de partitionnement des Macintoshs sont destructifs et peuvent supprimer toutes les donnée quand une partition est redimensionnée, même sur des partitions qui n'ont rien à voir.

source: For the Linux partitions, you will need a bootstrap partition - this can normally be a mere 800KB in size (the smallest hfs partition available) although the Fedora installer has been known to insist on 800MB. This has to be in front of the Mac OS partition. The bootstrap is <emphasis>never</emphasis> mounted as a regular partition and should not be confused with a <literal>/boot</literal> partition. Other partitions are as normal (at least one rootfs, perhaps swap, perhaps others).
fr: Pour les partitions Linux, vous aurez besoin d'une partition bootstrap - qui peut normalement faire seulement 800 Ko en taille (la plus petite partition hfs possible) bien que l'installateur Fedora soit connu pour insister à en faire une de 800 Mo. Elle doit être devant la partition Mac OS. Le bootstrap n'est <emphasis>jamais</emphasis> monté comme une partition normale et ne devrait pas être confondue avec une partition <literal>/boot</literal>. Les autres partitions sont normales (au moins une rootfs, peut-être une d'espace d'échange, et peut-être d'autres).

source: According to the lfs-from-osx hint, the Mac partitioning tools can create an apple_bootstrap partition and therefore there is no need to use a Linux CD to create the desired partitions from freespace, but using a Linux CD to create the partitions is a more widely tested approach.
fr: D'après l'astuce lfs-from-osx, les outils de partitionnement de Mac peuvent créer une partition apple_bootstrap et donc il est inutile d'utiliser un CD Linux pour créer les partitions désirée dans l'espace libre, mais utiliser un CD Linux pour créer les partitions est une approche bien mieux testée.

source: If you follow this approach, partition 1 will be the apple partition map, partition 2 will be the bootstrap at the start of the disk, the linux partitions will follow, and then the mac partition(s) - under OSX the first mac partition will be number 3, under OS9 it would have a higher number and there would be some apple driver partitions.
fr: Si vous suivez cette approche, la partition 1 sera la table des partitions, la partition 2 sera la partition bootstrap au début du disque, la partition Linux suivra, et ensuite les partitions mac - sous OSX, la première partition mac sera la 3, sous OS9 ce sera un plus grand nombre et il y aura des partitions pilotes apple.

source: <emphasis role="bold">OSX or OF upgrades</emphasis>
fr: <emphasis role="bold">Mise à jour OSX ou OF</emphasis>

source: If the machine is dual-booted with OSX, the mac kernel or the OF will probably be upgraded at some point. This appears to either unbless the bootstrap, or else just point the OF boot device to the mac partition - so, the linux system will no longer be bootable.
fr: Si la machine est en dual-boot avec OSX, le noyau d'OSX ou l'Open Firmware sera très certainement mis à jour à un moment donné. Cela ne semble pas impacter le bootstrap. Dans le cas contraire, il faut faire pointer le périphérique Open Firmware sur la partition MAC, sinon le système Linux ne démarrera pas.

source: Therefore, you will need to know which partition contains the bootstrap so that you can boot it from OF (on an apple keyboard, hold down option-command-o-f (that is, alt-apple-o-f) while booting then enter a command like:
fr: Donc, vous devrez connaître quelle partition contient le bootstrap pour que vous puissiez démarrer dessus depuis l'OF, sur un clavier apple, restez appuyé sur option-commande-o-f (c'est à dire, alt-apple-o-f) au démarrage puis entrez une command comme&nbsp;:

source: This will allow you to select a linux boot, and from there you will have to rerun <command>ybin</command>.
fr: Cela vous permettra de sélectionner un système Linux et à partir de là vous devrez relancer <command>ybin</command>.

source: The "OS chooser" menu that yaboot typically loads is stored in the OF and will not be available after a Mac kernel or firmware upgrade until <command>ybin</command> has been rerun.
fr: Le menu «&nbsp;OS chooser&nbsp;» que yaboot charge en général est stocké dans l'OF et ne sera pas disponible après une mise à jour du noyau Mac ou du firmware tant que <command>ybin</command> ne sera pas relancé.

source: <emphasis role="bold">Yaboot's requirements</emphasis>
fr: <emphasis role="bold">Prérequis de Yaboot</emphasis>

source: Yaboot is the boot loader for linux, sometimes referred to as the second stage loader. It reads the yaboot.conf file on the bootstrap partition to find which linux system(s) should be available, and attempts to load the required kernel.
fr: Yaboot est le chargeur d'amorçage pour Linux, parfois nommé le chargeur de deuxième étape. Il lit le fichier yaboot.conf sur la partition bootstrap pour trouver les système Linux disponibles et tente de charger le noyau requis.

source: The bootstrap man page warns that the path to the kernel should contain no more than one directory for reliability.
fr: La page de manuel de bootstrap avertit que le chemin vers le noyau ne devrait pas contenir plus d'un répertoire pour plus de fiabilité.

source: Yaboot has to be able to understand the filesystem, so that it can find the kernel. It understands hfs (not useful for linux, it is not case-sensitive), ext2 (and therefore it can read ext3), reiser3, and xfs. If you want to use a different type of filesystem for '/' you will have to create a separate boot partition with a supported filesystem, and use that to hold the kernels.
fr: Yaboot doit être capable de comprendre le système de fichier pour qu'il puisse trouver le noyau. Il comprend hfs (inutile pour Linux, il n'est pas sensible à la casse), ext2 (et donc il peut lire ext3), reiser3 et xfs. Si vous voulez utiliser un type de système de fichier différent pour «&nbsp;/&nbsp;» vous devrez créer une partition boot séparée avec un système de fichier supporté et l'utiliser pour contenir le noyau.

source: <emphasis role="bold">Requirements if starting from OSX</emphasis>
fr: <emphasis role="bold">Prérequis si vous démarrez depuis OSX</emphasis>

source: Older versions of OSX (panther, leopard) can write to ext2 filesystems using version 1.3 of ext2fsx. The upgrade to tiger broke this, and version 1.4 of ext2fsx only supports reading. Users of current OSX will therefore have to find some other way of creating a suitable filesystem and populating it, such as a Live CD or rescue CD.
fr: Les plus vieilles versions d'OSX (panther, leopard) peuvent écrire sur les systèmes de fichiers ext2 avec la version 1.3 de ext2fsx. La mise à jour vers tiger a cassé cela, et la version 1.4 de ext2fsx ne supporte plus que la lecture. Les utilisateurs d'OSX devront donc trouver un autre moyen pour créer un système de fichier convenable et le remplir, comme un Live CD ou un CD de récupération.
