Repository: espindula/br-lfs
Catalog: lfs/*/chapter11/afterlfs.po
Languages: pt_br

source: Getting Started After LFS
pt_br: Começando Depois do LFS

source: Deciding what to do next
pt_br: Decidindo o que fazer a seguir

source: Now that LFS is complete and you have a bootable system, what do you do? The next step is to decide how to use it. Generally, there are two broad categories to consider: workstation or server. Indeed, these categories are not mutually exclusive. The applications needed for each category can be combined onto a single system, but let's look at them separately for now.
pt_br: Agora que o LFS está completo e você tem um sistema inicializável, o que você faz? O próximo passo é o de decidir como usá-lo. Geralmente, existem duas grandes categorias a considerar: estação de trabalho ou servidor. De fato, essas categorias não são mutuamente exclusivas. Os aplicativos necessários para cada categoria podem ser combinados em um sistema, mas vamos vê-los separadamente por enquanto.

source: A server is the simpler category. Generally this consists of a web server such as the <ulink url="&blfs-book;server/apache.html">Apache HTTP Server</ulink> and a database server such as <ulink url="&blfs-book;server/mariadb.html">MariaDB</ulink>. However other services are possible. The operating system embedded in a single use device falls into this category.
pt_br: Um servidor é a categoria mais simples. Geralmente, isso consiste de um servidor da Web, como o <ulink url="&blfs-book;server/apache.html">Servidor HTTP Apache</ulink> e um servidor de base de dados, como <ulink url="&blfs-book;server/ mariadb.html">MariaDB</ulink>. No entanto, outros serviços são possíveis. O sistema operacional embutido em um dispositivo de uso único se enquadra nessa categoria.

source: On the other hand, a workstation is much more complex. It generally requires a graphical user environment such as <ulink url="&blfs-book;lxde/lxde.html">LXDE</ulink>, <ulink url="&blfs-book;xfce/xfce.html">XFCE</ulink>, <ulink url="&blfs-book;kde/kde.html">KDE</ulink>, or <ulink url="&blfs-book;gnome/gnome.html">Gnome</ulink> based on a basic <ulink url="&blfs-book;x/installing.html">graphical environment</ulink> and several graphical based applications such as the <ulink url="&blfs-book;xsoft/firefox.html">Firefox web browser</ulink>, <ulink url="&blfs-book;xsoft/thunderbird.html">Thunderbird email client</ulink>, or <ulink url="&blfs-book;xsoft/libreoffice.html">LibreOffice office suite</ulink>. These applications require many (several hundred depending on desired capabilities) more packages of support applications and libraries.
pt_br: Por outro lado, uma estação de trabalho é muito mais complexa. Geralmente exige um ambiente gráfico de usuário(a), como <ulink url="&blfs-book;lxde/lxde.html">LXDE</ulink>, <ulink url="&blfs-book;xfce/xfce.html">XFCE</ulink>, <ulink url="&blfs-book;kde/kde.html">KDE</ulink> ou <ulink url="&blfs-book;gnome/gnome.html">Gnome</ulink>, baseado em um <ulink url="&blfs-book;x/installing.html">ambiente gráfico</ulink> básico e vários aplicativos baseados em gráficos, como o <ulink url="&blfs-book;xsoft/firefox.html">navegador da Web Firefox </ulink>, <ulink url="&blfs-book;xsoft/thunderbird.html">cliente de correio eletrônico Thunderbird</ulink> ou <ulink url="&blfs-book;xsoft/libreoffice.html">suíte de escritório LibreOffice</ulink>. Esses aplicativos exigem muitos (várias centenas, dependendo dos recursos desejados) mais pacotes de aplicativos e bibliotecas de suporte.

source: In addition to the above, there is a set of applications for system management for all kinds of systems. These applications are all in the BLFS book. Not all packages are needed in every environments. For example <ulink url="&blfs-book;basicnet/dhcpcd.html">dhcpcd</ulink>, is not normally appropriate for a server and <ulink url="&blfs-book;basicnet/wireless_tools.html">wireless_tools</ulink>, are normally only useful for a laptop system.
pt_br: Além do acima, existe um conjunto de aplicativos para gerenciamento de sistemas para todos os tipos de sistemas. Esses aplicativos estão todos no livro BLFS. Nem todos os pacotes são necessários em todos os ambientes. Por exemplo <ulink url="&blfs-book;basicnet/dhcpcd.html">dhcpcd</ulink>, normalmente não é apropriado para um servidor e <ulink url="&blfs-book;basicnet/wireless_tools.html">wireless_tools</ulink>, normalmente são úteis somente para um sistema de laptop.

source: Working in a basic LFS environment
pt_br: Trabalhando em um ambiente básico do LFS

source: When you initially boot into LFS, you have all the internal tools to build additional packages. Unfortunately, the user environment is quite sparse. There are a couple of ways to improve this:
pt_br: Quando inicializa inicialmente no LFS, você tem todas as ferramentas internas para construir pacotes adicionais. Infelizmente, o ambiente de usuário(a) é bastante esparso. Existem algumas maneiras de melhorar isso:

source: Work from the LFS host in chroot
pt_br: Trabalhar a partir do anfitrião LFS em chroot

source: This method provides a complete graphical environment where a full featured browser and copy/paste capabilities are available. This method allows using applications like the host's version of wget to download package sources to a location available when working in the chroot envirnment.
pt_br: Esse método fornece um ambiente gráfico completo onde um navegador completo e recursos de copiar/colar estão disponíveis. Esse método permite usar aplicativos, como a versão do anfitrião do Wget, para baixar os fontes do pacote para um local disponível ao trabalhar no ambiente chroot.

source: In order to properly build packages in chroot, you will also need to remember to mount the virtual file systems if they are not already mounted. One way to do this is to create a script on the <emphasis role="bold">HOST</emphasis> system:
pt_br: Para a finalidade de construir adequadamente pacotes no chroot, você também precisará se lembrar de montar os sistemas virtuais de arquivos, se eles ainda não estiverem montados. Uma maneira de fazer isso é a de criar um script no sistema <emphasis role="bold">ANFITRIÃO</emphasis>:

source: <command>cat &gt; ~/mount-virt.sh &lt;&lt; "EOF" #!/bin/bash function mountbind { if ! mountpoint $LFS/$1 >/dev/null; then $SUDO mount --bind /$1 $LFS/$1 echo $LFS/$1 mounted else echo $LFS/$1 already mounted fi } function mounttype { if ! mountpoint $LFS/$1 >/dev/null; then $SUDO mount -t $2 $3 $4 $5 $LFS/$1 echo $LFS/$1 mounted else echo $LFS/$1 already mounted fi } if [ $EUID -ne 0 ]; then SUDO=sudo else SUDO="" fi if [ x$LFS == x ]; then echo "LFS not set" exit 1 fi mountbind dev mounttype dev/pts devpts devpts -o gid=5,mode=620 mounttype proc proc proc mounttype sys sysfs sysfs mounttype run tmpfs run if [ -h $LFS/dev/shm ]; then mkdir -pv $LFS/$(readlink $LFS/dev/shm) else mounttype dev/shm tmpfs tmpfs -o nosuid,nodev fi #mountbind usr/src #mountbind boot #mountbind home EOF</command>
pt_br: <command>cat &gt; ~/mount-virt.sh &lt;&lt; "EOF" #!/bin/bash function mountbind { if ! mountpoint $LFS/$1 >/dev/null; then $SUDO mount --bind /$1 $LFS/$1 echo $LFS/$1 montado else echo $LFS/$1 já montado fi } function mounttype { if ! mountpoint $LFS/$1 >/dev/null; then $SUDO mount -t $2 $3 $4 $5 $LFS/$1 echo $LFS/$1 montado else echo $LFS/$1 já montado fi } if [ $EUID -ne 0 ]; then SUDO=sudo else SUDO="" fi if [ x$LFS == x ]; then echo "LFS not set" exit 1 fi mountbind dev mounttype dev/pts devpts devpts -o gid=5,mode=620 mounttype proc proc proc mounttype sys sysfs sysfs mounttype run tmpfs run if [ -h $LFS/dev/shm ]; then mkdir -pv $LFS/$(readlink $LFS/dev/shm) else mounttype dev/shm tmpfs tmpfs -o nosuid,nodev fi #mountbind usr/src #mountbind boot #mountbind home EOF</command>

source: Note that the last three commands in the script are commented out. These are useful if those directories are mounted as separate partitions on the host system and will be mounted when booting the completed LFS/BLFS system.
pt_br: Observe que os últimos três comandos no script são comentados. Eles são úteis se aqueles diretórios forem montados como partições separadas no sistema anfitrião e serão montados quando inicializar o sistema LFS/BLFS completo.

source: The script can be run with <command>bash ~/mount-virt.sh</command> as either a regular user (recommended) or as &root;. If run as a regular user, sudo is required on the host system.
pt_br: O script pode ser executado com <command>bash ~/mount-virt.sh</command> como ou um(a) usuário(a) comum (recomendado) ou como &root;. Se executado como um(a) usuário(a) comum, o sudo é exigido no sistema anfitrião.

source: Another issue pointed out by the script is where to store downloaded package files. This location is arbitrary. It can be in a regular user's home directory such as ~/sources or in a global location like /usr/src. Our recommendation is not to mix BLFS sources and LFS sources in (from the chroot environment) /sources. In any case, the packages must be accessible inside the chroot environment.
pt_br: Outro problema apontado pelo script é o de onde armazenar os arquivos baixados do pacote. Esse local é arbitrário. Ele pode estar em um diretório lar de usuário(a) comum, como ~/sources ou em um local global, como /usr/src. Nossa recomendação é a de não misturar fontes BLFS e fontes LFS em (a partir do ambiente chroot) /sources. Em qualquer caso, os pacotes precisam estar acessíveis dentro do ambiente chroot.

source: A last convenience feature presented here is to streamline the process of entering the chroot environment. This can be done with an alias placed in a user's ~/.bashrc file on the host system:
pt_br: Um último recurso de conveniência apresentado aqui é o de simplificar o processo de entrada no ambiente chroot. Isso pode ser feito com um apelido colocado em um arquivo ~/.bashrc de usuário(a) no sistema anfitrião:

source: This alias is a little tricky because of the quoting and levels of backslash characters. It must be all on a single line. The above command has been split in two for presentation purposes.
pt_br: Esse apelido é um pouco complicado, por causa das aspas e dos níveis dos caracteres de barra invertida. Precisa estar tudo em uma linha. O comando acima foi dividido em dois para propósitos de apresentação.

source: Work remotely via ssh
pt_br: Trabalhar remotamente via ssh

source: This method also provides a full graphical environment, but first requires installing <ulink url="&blfs-book;postlfs/openssh.html">sshd</ulink> and <ulink url="&blfs-book;basicnet/wget.html">wget</ulink> on the LFS system, usually in chroot. It also requires a second computer. This method has the advantage of being simple by not requiring the complexity of the chroot environment. It also uses your LFS built kernel for all additional packages and still provides a complete system for installing packages.
pt_br: Esse método também fornece um ambiente completo gráfico, mas primeiro exige a instalação de <ulink url="&blfs-book;postlfs/openssh.html">sshd</ulink> e <ulink url="&blfs-book;basicnet/wget.html" >wget</ulink> no sistema LFS, geralmente em chroot. Também exige um segundo computador. Esse método tem a vantagem de ser simples, por não exigir a complexidade do ambiente chroot. Ele também usa seu núcleo do LFS construído para todos os pacotes adicionais e ainda fornece um sistema completo para instalar de pacotes.

source: Work from the LFS command line
pt_br: Trabalhar a partir da linha de comando do LFS

source: This method requires installing <ulink url="&blfs-book;general/libtasn1.html">libtasn1</ulink>, <ulink url="&blfs-book;postlfs/p11-kit.html">p11-kit</ulink>, <ulink url="&blfs-book;postlfs/make-ca.html">make-ca</ulink>, <ulink url="&blfs-book;basicnet/wget.html">wget</ulink>, <ulink url="&blfs-book;general/gpm.html">gpm</ulink>, and <ulink url="&blfs-book;basicnet/links.html">links</ulink> (or <ulink url="&blfs-book;basicnet/lynx.html">lynx</ulink>) in chroot and then rebooting into the new LFS system. At this point the default system has six virtual consoles. Switching consoles is as easy as using the <keycombo> <keycap>Alt</keycap> <keycap>Fx</keycap> </keycombo> key combinations where <keycap>Fx</keycap> is between <keycap>F1</keycap> and <keycap>F6</keycap>. The <keycombo> <keycap>Alt</keycap> <keycap function='left'/> </keycombo> and <keycombo> <keycap>Alt</keycap> <keycap function='right'/> </keycombo> combinations also will change the console.
pt_br: Esse método exige instalar <ulink url="&blfs-book;general/libtasn1.html">libtasn1</ulink>, <ulink url="&blfs-book;postlfs/p11-kit.html">p11-kit</ulink >, <ulink url="&blfs-book;postlfs/make-ca.html">make-ca</ulink>, <ulink url="&blfs-book;basicnet/wget.html">wget</ulink>, <ulink url="&blfs-book;general/gpm.html">gpm</ulink> e <ulink url="&blfs-book;basicnet/links.html">links</ulink> (ou <ulink url= "&blfs-book;basicnet/lynx.html">lynx</ulink>) no chroot e, em seguida, reinicializar no novo sistema LFS. Neste ponto, o sistema padrão tem seis consoles virtuais. Alternar consoles é tão fácil quanto usar as combinações de teclas <keycombo> <keycap>Alt</keycap> <keycap>Fx</keycap> </keycombo>, onde <keycap>Fx</keycap> está entre <keycap>F1</keycap> e <keycap>F6</keycap>. As combinações <keycombo> <keycap>Alt</keycap> <keycap function='left'/> </keycombo> e <keycombo> <keycap>Alt</keycap> <keycap function='right'/> </keycombo> também mudarão o console.

source: At this point you can log into two different virtual consoles and run the links or lynx browser in one console and bash in the other. GPM then allows copying commands from the browser with the left mouse button, switching consoles, and pasting into the other console.
pt_br: Neste ponto, você pode logar-se em dois consoles virtuais e executar o navegador Links ou o Lynx em um console e o Bash no outro. O GPM então permite copiar comandos a partir do navegador com o botão esquerdo do mouse, alternar consoles e colar no outro console.

source: As a side note, switching of virtual consoles can also be done from an X Window instance with the <keycombo> <keycap>Ctrl</keycap> <keycap>Alt</keycap> <keycap>Fx</keycap> </keycombo> key combination, but the mouse copy operation does not work between the graphical interface and a virtual console. You can return to the X Window display with the <keycombo> <keycap>Ctrl</keycap> <keycap>Alt</keycap> <keycap>Fx</keycap> </keycombo> combination, where <keycap>Fx</keycap> is usually <keycap>F1</keycap> but may be <keycap>F7</keycap>.
pt_br: Como uma observação lateral, alternância de consoles virtuais também pode ser feita a partir de uma instância do X Window com a combinação de teclas <keycombo> <keycap>Ctrl</keycap> <keycap>Alt</keycap> <keycap>Fx</keycap> </keycombo >, mas a operação de cópia do mouse não funciona entre a interface gráfica e um console virtual. Você pode retornar para exibição do X Window com a combinação <keycombo> <keycap>Ctrl</keycap> <keycap>Alt</keycap> <keycap>Fx</keycap> </keycombo>, onde <keycap>Fx</keycap> geralmente é <keycap>F1</keycap>, mas possivelmente seja <keycap>F7</keycap>.
