Repository: espindula/br-lfs
Catalog: lfs/*/chapter11/whatnow.po
Languages: fr

source: Additional Resources
fr: Ressources supplémentaires

source: Thank you for reading this LFS book. We hope that you have found this book helpful and have learned more about the system creation process.
fr: Merci d'avoir lu le livre LFS. Nous espérons que vous avez trouvé ce livre utile et que vous en avez appris davantage sur le processus de création d'un système.

source: Now that the LFS system is installed, you may be wondering <quote>What next?</quote> To answer that question, we have compiled a list of resources for you.
fr: Maintenant que le système LFS est installé, vous êtes peut-être en train de vous demander <quote>Et ensuite&nbsp;?</quote> Pour répondre à cette question, nous vous avons préparé une liste de ressources.

source: Bugs and security notices are reported regularly for all software. Since an LFS system is compiled from source, it is up to you to keep abreast of such reports. There are several online resources that track such reports, some of which are shown below:
fr: Les bogues et informations de sécurité sont rapportés régulièrement pour tous les logiciels. Comme un système LFS est compilé à partir des sources, c'est à vous de prendre en compte ces rapports. Il existe plusieurs ressources en ligne pour garder trace de tels rapports, quelques-unes d'entre elles sont indiquées ci-dessous&nbsp;:

source: <ulink url="&lfs-root;lfs/advisories/">LFS Security Advisories</ulink>
fr: <ulink url="&lfs-root;lfs/advisories/">Informations de sécurité LFS</ulink>

source: This is a list of security vulnerabilities discovered in the LFS book after it's published.
fr: C'est une liste de vulnérabilités de sécurité découvertes dans le livre LFS après sa publication.

source: This is a mailing list for discussion of security flaws, concepts, and practices in the Open Source community.
fr: C'est une liste de diffusion pour discuter des failles de sécurité, des concepts et des pratiques de sécurité dans la communauté Open Source.

source: LFS Hints
fr: Astuces LFS

source: The LFS Hints are a collection of educational documents submitted by volunteers in the LFS community. The hints are available at <ulink url="&hints-root;"/>.
fr: Les astuces LFS sont une collection de documents éducatifs soumis par des volontaires à la communauté LFS. Ces astuces sont disponibles sur <ulink url="&hints-root;"/>.

source: Mailing lists
fr: Listes de diffusion

source: There are several LFS mailing lists you may subscribe to if you are in need of help, want to stay current with the latest developments, want to contribute to the project, and more. See <xref linkend="ch-intro-maillists"/> for more information.
fr: Il existe plusieurs listes de diffusion LFS auxquelles vous pouvez vous abonner si vous cherchez de l'aide, voulez suivre les derniers développements, voulez contribuer au projet et plus. Consultez le <xref linkend="ch-intro-maillists"/> pour plus d'informations.

source: The Linux Documentation Project
fr: Le projet de documentation Linux

source: The goal of The Linux Documentation Project (TLDP) is to collaborate on all of the issues of Linux documentation. The TLDP features a large collection of HOWTOs, guides, and man pages. It is located at <ulink url="https://tldp.org/"/>.
fr: Le projet de documentation Linux (LDP) a pour but de favoriser la collaboration concernant la documentation de Linux. Le LDP offre une large collection de guides pratiques, livres et pages de manuel. Il est disponible sur <ulink url="https://fr.tldp.org/"/>.
