Repository: espindula/br-lfs
Catalog: lfs/*/part3intro/generalinstructions.po
Languages: fr, pt_br

source: General Compilation Instructions
fr: Instructions générales de compilation
pt_br: Instruções Gerais de Compilação

source: Here are some things you should know about building each package:
pt_br: Aqui estão algumas coisas que você deveria saber a respeito de construir cada pacote:

source: Several packages are patched before compilation, but only when the patch is needed to circumvent a problem. A patch is often needed in both the current and the following chapters, but sometimes, when the same package is built more than once, the patch is not needed right away. Therefore, do not be concerned if instructions for a downloaded patch seem to be missing. Warning messages about <emphasis>offset</emphasis> or <emphasis>fuzz</emphasis> may also be encountered when applying a patch. Do not worry about these warnings; the patch was still successfully applied.
pt_br: Vários pacotes são remendados antes da compilação, porém somente quando o remendo for necessário para contornar um problema. Um remendo frequentemente é necessário tanto neste quanto nos capítulos seguintes, porém às vezes, quando o mesmo pacote é construído mais que uma vez. o remendo não é necessário imediatamente. Portanto, não se preocupe se as instruções para um remendo baixado pareçam estar ausentes. Mensagens de aviso acerca de <emphasis>offset</emphasis> ou <emphasis>fuzz</emphasis> também possivelmente sejam encontradas quando da aplicação de um remendo. Não se preocupe com esses alertas; o remendo ainda foi aplicado com sucesso.

source: During the compilation of most packages, some warnings will scroll by on the screen. These are normal and can safely be ignored. These warnings are usually about deprecated, but not invalid, use of the C or C++ syntax. C standards change fairly often, and some packages have not yet been updated. This is not a serious problem, but it does cause the warnings to appear.
pt_br: Durante a compilação da maior parte dos pacotes, alguns avisos rolarão na tela. Esses são normais e seguramente podem ser ignorados. Esses alertas usualmente são a respeito do uso de sintaxe C ou C++ obsoleta, porém não inválida. Padrões C mudam com ampla frequência e alguns pacotes ainda não foram atualizados. Esse não é um problema sério, porém causa o aparecimento dos avisos.

source: Check one last time that the <envar>LFS</envar> environment variable is set up properly:
fr: Vérifiez une dernière fois que la variable d'environnement <envar>LFS</envar> est configurée correctement&nbsp;:
pt_br: Verifique uma última vez se a variável de ambiente <envar>LFS</envar> está configurada adequadamente:

source: Make sure the output shows the path to the LFS partition's mount point, which is <filename class="directory">/mnt/lfs</filename>, using our example.
fr: Assurez-vous que le résultat contient le bon répertoire vers le point de montage de la partition LFS, qui est <filename class="directory">/mnt/lfs</filename>, suivant notre exemple.
pt_br: Certifique-se de que a saída gerada mostra o caminho para o ponto de montagem da partição do LFS, que é <filename class="directory">/mnt/lfs</filename>, usando nosso exemplo.

source: Finally, two important items must be emphasized:
fr: Enfin, deux points importants doivent être précisés&nbsp;:
pt_br: Finalmente, dois itens importantes precisam ser enfatizados:

source: The build instructions assume that the <xref linkend='ch-partitioning-hostreqs'/>, including symbolic links, have been set properly:
fr: Les instructions de construction supposent que vous avez défini correctement les <xref linkend='ch-partitioning-hostreqs'/>, y compris les liens symboliques&nbsp;:
pt_br: As instruções de construção assumem que as <xref linkend='ch-partitioning-hostreqs'/>, incluindo links simbólicos, tenham sido configuradas adequadamente:

source: <command>bash</command> is the shell in use.
fr: <command>bash</command> est le shell utilisé.
pt_br: <command>bash</command> é o shell em uso.

source: <command>sh</command> is a symbolic link to <command>bash</command>.
fr: <command>sh</command> est un lien symbolique vers <command>bash</command>.
pt_br: <command>sh</command> é um link simbólico para <command>bash</command>.

source: <command>/usr/bin/awk</command> is a symbolic link to <command>gawk</command>.
fr: <command>/usr/bin/awk</command> est un lien symbolique vers <command>gawk</command>.
pt_br: <command>/usr/bin/awk</command> é um link simbólico para <command>gawk</command>.

source: <command>/usr/bin/yacc</command> is a symbolic link to <command>bison</command>, or to a small script that executes bison.
pt_br: <command>/usr/bin/yacc</command> é um link simbólico para <command>bison</command> ou um script pequeno que executa bison.

source: Here is a synopsis of the build process.
pt_br: Aqui está uma sinopse do processo de construção.

source: Place all the sources and patches in a directory that will be accessible from the chroot environment, such as <filename class="directory">/mnt/lfs/sources/</filename>.
pt_br: Coloque todos os pacotes e os remendos em um diretório que estará acessível a partir do ambiente chroot, tal como <filename class="directory">/mnt/lfs/sources/</filename>.

source: Change to the <filename class="directory">/mnt/lfs/sources/</filename> directory.
pt_br: Mude para o diretório <filename class="directory">/mnt/lfs/sources/</filename>.

source: Package build instructions
pt_br: Instruções de construção de pacote

source: For each package:
fr: Pour chaque paquet&nbsp;:
pt_br: Para cada pacote:

source: Using the <command>tar</command> program, extract the package to be built. In <xref linkend="chapter-cross-tools"/> and <xref linkend="chapter-temporary-tools"/>, ensure you are the <emphasis>lfs</emphasis> user when extracting the package.
fr: En utilisant le programme <command>tar</command>, décompressez le paquet à construire. Dans les chapitres <xref linkend="chapter-cross-tools"/> et <xref linkend="chapter-temporary-tools"/>, assurez-vous d'être l'utilisateur <emphasis>lfs</emphasis> lors de l'extraction du paquet.
pt_br: Usando o aplicativo <command>tar</command>, extraia o pacote para ser construído. Em <xref linkend="chapter-cross-tools"/> e <xref linkend="chapter-temporary-tools"/>, certifique-se de que você seja o(a) usuário(a) <emphasis>lfs</emphasis> quando extrair o pacote.

source: Do not use any method except the <command>tar</command> command to extract the source code. Notably, using the <command>cp -R</command> command to copy the source code tree somewhere else can destroy links and timestamps in the source tree, and cause the build to fail.
pt_br: Não use nenhum método, exceto o comando <command>tar</command> para extrair o código fonte. Notadamente, usar o comando <command>cp -R</command> para copiar a árvore de código fonte para outro lugar pode destruir links e carimbos de tempo na árvore de fonte e causar falha de construção.

source: Change to the directory created when the package was extracted.
fr: Allez dans le répertoire créé lorsque le paquet a été décompressé.
pt_br: Mude para o diretório criado quando o pacote foi extraído.

source: Follow the instructions for building the package.
pt_br: Siga as instruções para construir o pacote.

source: Change back to the sources directory when the build is complete.
pt_br: Mude de volta para o diretório dos fontes quando a construção estiver completa.

source: Delete the extracted source directory unless instructed otherwise.
fr: Supprimez le répertoire source que vous avez extrait sauf instruction contraire.
pt_br: Delete o diretório do fonte extraído, a menos que instruído(a) do contrário.

source: When building packages there are several assumptions made within the instructions:
fr: Lorsque vous construisez des paquets, il y a plusieurs présupposés dans les instructions&nbsp;:

source: Several of the packages are patched before compilation, but only when the patch is needed to circumvent a problem. A patch is often needed in both this and the following chapters, but sometimes in only one location. Therefore, do not be concerned if instructions for a downloaded patch seem to be missing. Warning messages about <emphasis>offset</emphasis> or <emphasis>fuzz</emphasis> may also be encountered when applying a patch. Do not worry about these warnings, as the patch was still successfully applied.
fr: Plusieurs paquets sont corrigés avant d'être compilés, mais seulement dans le cas où la correction est nécessaire pour résoudre un problème. Souvent, le correctif est nécessaire à la fois dans ce chapitre et dans les suivants, mais quelques fois dans un seul chapitre. Donc, ne vous inquiétez pas lorsque des instructions pour un correctif téléchargé semblent manquer. Des messages d'avertissements sur un décalage (<emphasis>offset</emphasis>) ou sur autre chose (<emphasis>fuzz</emphasis>) peuvent apparaître lors de l'application d'un correctif. Ne vous inquiétez pas pour ces messages, le correctif a bien été appliqué.

source: During the compilation of most packages, there will be several warnings that scroll by on the screen. These are normal and can safely be ignored. These warnings are as they appear&mdash;warnings about deprecated, but not invalid, use of the C or C++ syntax. C standards change fairly often, and some packages still use the older standard. This is not a problem, but does prompt the warning.
fr: Pendant la compilation de la plupart des paquets, plusieurs messages d'avertissement du compilateur défileront sur votre écran. Ceci est normal et peut être ignoré sans danger. Ces messages d'avertissement ne sont que des avertissements&mdash; sur une utilisation obsolète, mais pas invalide, de la syntaxe de C ou de C++. Les standards C changent assez souvent et quelques paquets continuent à utiliser les anciens standards. Ce n'est pas un véritable problème mais cela provoque les messages.

source: <command>/usr/bin/yacc</command> is a symbolic link to <command>bison</command> or a small script that executes bison.
fr: <command>/usr/bin/yacc</command> est un lien symbolique vers <command>bison</command> ou un petit script qui exécute bison.

source: To re-emphasize the build process:
fr: Pour remettre en évidence la procédure de construction&nbsp;:

source: Place all the sources and patches in a directory that will be accessible from the chroot environment such as <filename class="directory">/mnt/lfs/sources/</filename>.
fr: Mettez tous les codes sources et les correctifs dans un répertoire qui sera accessible depuis l'environnement chroot, tel que <filename class="directory">/mnt/lfs/sources/</filename>.

source: Change to the sources directory.
fr: Allez dans le répertoire des codes sources.

source: Follow the book's instructions for building the package.
fr: Suivez les instructions du livre pour construire le paquet.

source: Change back to the sources directory.
fr: Revenez au répertoire des codes sources.
