Repository: espindula/br-lfs
Catalog: lfs/*/part3intro/toolchaintechnotes.po
Languages: fr, pt_br

source: As mentioned above, the standard C++ library is compiled next, followed in <xref linkend="chapter-temporary-tools"/> by other programs that must be cross-compiled to break circular dependencies at build time. The install step of all those packages uses the <envar>DESTDIR</envar> variable to force installation in the LFS filesystem.
fr: Comme indiqué précédemment, la bibliothèque standard C++ est ensuite compilée, suivie dans le <xref linkend="chapter-temporary-tools"/> par les autres programmes qui nécessitent une compilation croisée en raison des dépendances circulaires qu’ils cassent lors de la construction. L’installation forcée de tous ces paquets sur le système de fichiers LFS nécessite la variable <envar>DESTDIR</envar>.
pt_br: Como mencionado acima, a biblioteca C++ padrão é compilada depois, seguida no <xref linkend="chapter-temporary-tools"/> por outros aplicativos que precisam ser compilados cruzadamente para quebrar dependências circulares em tempo de construção. A etapa de instalação de todos aqueles pacotes usa a variável <envar>DESTDIR</envar> para forçar a instalação no sistema de arquivos do LFS.

source: At the end of <xref linkend="chapter-temporary-tools"/> the native LFS compiler is installed. First binutils-pass2 is built, in the same <envar>DESTDIR</envar> directory as the other programs, then the second pass of gcc is constructed, omitting some non-critical libraries. Due to some weird logic in gcc's configure script, <envar>CC_FOR_TARGET</envar> ends up as <command>cc</command> when the host is the same as the target, but different from the build system. This is why <parameter>CC_FOR_TARGET=$LFS_TGT-gcc</parameter> is declared explicitly as one of the configuration options.
fr: À la fin du <xref linkend="chapter-temporary-tools"/>, le compilateur LFS natif est installé.binutils-pass2 est construit en premier, avec le même répertoire d’installation <envar>DESTDIR</envar> que les autres programmes, puis la deuxième passe de gcc est construite sans les bibliothèques inutiles.En raison d’un comportement illogique dans le script configure de gcc, <envar>CC_FOR_TARGET</envar> devient <command>cc</command> lorsque l'hôte est identique à la cible, mais différent du système de construction.C'est pourquoi le paramètre <parameter>CC_FOR_TARGET=$LFS_TGT-gcc</parameter> est déclaré de façon explicite dans les options de configure.
pt_br: Ao final do <xref linkend="chapter-temporary-tools"/> o compilador nativo do LFS é instalado. Primeiro binutils passagem 2 é construído, no mesmo diretório <envar>DESTDIR</envar> que os outros aplicativos, então a segunda passagem do gcc é construída, omitindo algumas bibliotecas não críticas. Devido a algumas lógicas estranhas no script configure do gcc, <envar>CC_FOR_TARGET</envar> termina como <command>cc</command> quando o anfitrião for o mesmo que o alvo, porém for diferente do sistema de construção. Essa é a razão pela qual <parameter>CC_FOR_TARGET=$LFS_TGT-gcc</parameter> é declarado explicitamente como uma das opções de configuração.

source: Upon entering the chroot environment in <xref linkend="chapter-chroot-temporary-tools"/>, the temporary installations of programs needed for the proper operation of the toolchain are performed. From this point onwards, the core toolchain is self-contained and self-hosted. In <xref linkend="chapter-building-system"/>, final versions of all the packages needed for a fully functional system are built, tested, and installed.
fr: À l’entrée de l'environnement chroot dans le <xref linkend="chapter-chroot-temporary-tools"/>, les programmes nécessaires au bon fonctionnement de la chaîne de compilation sont installés de manière temporaire. À partir de là, la chaîne de construction de base est auto-suffisante et auto-hébergée. Dans le <xref linkend="chapter-building-system"/>, vous construirez, testerez et installerez les versions finales de tous les paquets nécessaires au bon fonctionnement du système complet.
pt_br: Uma vez dentro do ambiente chroot no <xref linkend="chapter-chroot-temporary-tools"/>, as instalações temporárias de aplicativos necessários para a operação apropriada do conjunto de ferramentas são realizadas. Deste ponto em diante, o conjunto central de ferramentas está auto-contido e auto-hospedado. No <xref linkend="chapter-building-system"/>, as versões finais de todos os pacotes necessários para um sistema completamente funcional são construídas, testadas e instaladas.
