Repository: espindula/br-lfs
Catalog: lfs/*/part3intro/toolchaintechnotes.po
Languages: fr, pt_br

source: Toolchain Technical Notes
fr: Remarques techniques sur la chaîne de compilation
pt_br: Observações Técnicas do Conjunto de Ferramentas

source: This section explains some of the rationale and technical details behind the overall build method. Don't try to immediately understand everything in this section. Most of this information will be clearer after performing an actual build. Come back and re-read this chapter at any time during the build process.
fr: Cette section explique certains détails logiques et techniques de la méthode de construction. Il n'est pas essentiel de tout comprendre immédiatement. La plupart de ces informations seront plus claires une fois votre première construction complète terminée. Cette section peut servir de référence à tout moment lors du processus de construction.
pt_br: Esta seção explica algumas das razões e detalhes técnicos por trás do método completo de construção. Não tente imediatamente entender tudo nesta seção. A maior parte desta informação ficará mais clara depois de realizar uma construção atual. Volte e releia este capítulo a qualquer tempo durante o processo de construção.

source: The overall goal of <xref linkend="chapter-cross-tools"/> and <xref linkend="chapter-temporary-tools"/> is to produce a temporary area containing a set of tools that are known to be good, and that are isolated from the host system. By using the <command>chroot</command> command, the compilations in the remaining chapters will be isolated within that environment, ensuring a clean, trouble-free build of the target LFS system. The build process has been designed to minimize the risks for new readers, and to provide the most educational value at the same time.
fr: Le but global du <xref linkend="chapter-cross-tools"/> et du <xref linkend="chapter-temporary-tools"/> est de générer un espace temporaire comportant un ensemble d'outils connus et approuvés, qui sont isolés du système hôte. En utilisant la commande <command>chroot</command>, les compilations réalisées dans le reste des chapitres se cantonneront à cet environnement, en assurant une construction du système LFS cible propre et sans faille. Le processus de construction a été conçu pour minimiser les risques auprès des nouveaux lecteurs et pour fournir une valeur éducative maximale.
pt_br: O objetivo geral do <xref linkend="chapter-cross-tools"/> e do <xref linkend="chapter-temporary-tools"/> é o de produzir uma área temporária que contendo um conjunto de ferramentas que são conhecidas por serem boas e que estão isoladas do sistema anfitrião. Usando-se o comando <command>chroot</command>, as compilações nos capítulos subsequentes estarão isolados naquele ambiente, assegurando uma construção limpa e livre de problemas do sistema LFS alvo. O processo de construção foi projetado para minimizar os riscos para leitores(as) novatos(as) e para prover o maior valor educacional ao mesmo tempo.

source: This build process is based on <emphasis>cross-compilation</emphasis>. Cross-compilation is normally used to build a compiler and its associated toolchain for a machine different from the one that is used for the build. This is not strictly necessary for LFS, since the machine where the new system will run is the same as the one used for the build. But cross-compilation has one great advantage: anything that is cross-compiled cannot depend on the host environment.
fr: Le processus de construction se base sur la <emphasis>compilation croisée</emphasis>. La compilation croisée est normalement utilisée pour construire un compilateur ainsi que sa chaîne de compilation sur une machine différente de celle utilisée pour la construction. Ce n’est pas nécessaire pour LFS, puisque la machine sur laquelle le nouveau système est construit est la même que celle utilisée pour la construction. Mais le grand avantage de la compilation croisée, c’est que tout ce qui est compilé est indépendant de l'environnement hôte.
pt_br: O processo de construção é baseado em <emphasis>compilação cruzada</emphasis>. A compilação cruzada normalmente é usada para construir um compilador e o conjunto de ferramentas associadas dele para uma máquina diferente daquela que é usada para a construção. Isso não é estritamente necessário para o LFS, dado que a máquina onde o novo sistema executará é a mesma que aquela usada para a construção. Porém, a compilação cruzada tem a grande vantagem: tudo o que for compilado cruzadamente não pode depender do ambiente do anfitrião.

source: About Cross-Compilation
fr: À propos de la compilation croisée
pt_br: Acerca da Compilação Cruzada

source: The LFS book is not (and does not contain) a general tutorial to build a cross- (or native) toolchain. Don't use the commands in the book for a cross-toolchain for some purpose other than building LFS, unless you really understand what you are doing.
fr: Le livre LFS n'est pas (et ne contient pas) un tutoriel générique sur la construction d'une chaîne de compilation croisée (ou native). N'utilisez pas les commandes de ce livre pour construire une chaîne de compilation croisée autre que celle utilisée pour LFS, à moins de vraiment comprendre ce que vous faites.
pt_br: O livro LFS não é (e não contém) um tutorial geral para construir um conjunto de ferramentas cruzado (ou nativo). Não use os comandos no livro para um conjunto de ferramentas cruzado para algum outro propósito que não construir o LFS, a menos que você realmente entenda o que está fazendo.

source: Cross-compilation involves some concepts that deserve a section of their own. Although this section may be omitted on a first reading, coming back to it later will help you gain a fuller understanding of the process.
fr: La compilation croisée utilise certains concepts qui mériteraient une section à part. Même si vous pouvez passer cette section lors de votre première lecture, nous vous recommandons fortement d'y revenir plus tard pour bien comprendre le processus de construction.
pt_br: Compilação cruzada envolve alguns conceitos que merecem uma seção por si próprios. Apesar que esta seção possivelmente seja omitida em uma primeira leitura, retornar até ela posteriormente te ajudará a ganhar um entendimento mais completo do processo.

source: Let us first define some terms used in this context.
fr: Définissons d'abord certains termes utilisés dans ce contexte&nbsp;:
pt_br: Permita-nos primeiro definir alguns termos usados nesse contexto.

source: The build
fr: La construction (build)
pt_br: A construtora

source: is the machine where we build programs. Note that this machine is also referred to as the <quote>host</quote>.
fr: est la machine où nous construisons les programmes. Cette machine est appelée <quote>hôte</quote> dans les autres sections.
pt_br: é a máquina onde nós construímos aplicativos. Observe que essa máquina também é referenciada como sendo a <quote>anfitriã</quote>.

source: The host
fr: L’hôte (host)
pt_br: A anfitriã

source: is the machine/system where the built programs will run. Note that this use of <quote>host</quote> is not the same as in other sections.
fr: est la machine ou le système où les programmes seront lancés. Le terme <quote>hôte</quote> n’a pas la même définition dans les autres sections.
pt_br: é a máquina/sistema onde os aplicativos construídos executarão. Observe que esse uso de <quote>host</quote> não é o mesmo que em outras seções.

source: The target
fr: La cible (target)
pt_br: O alvo

source: is only used for compilers. It is the machine the compiler produces code for. It may be different from both the build and the host.
fr: est seulement utilisée pour les compilateurs. C'est la machine pour laquelle le compilateur produit du code. Elle peut être différente de l’hôte et de la construction.
pt_br: é usado somente para compiladores. Ele é a máquina para a qual o compilador produz código. Ele possivelmente seja diferente tanto da construtora quanto da anfitriã.

source: As an example, let us imagine the following scenario (sometimes referred to as <quote>Canadian Cross</quote>). We have a compiler on a slow machine only, let's call it machine A, and the compiler ccA. We also have a fast machine (B), but no compiler for (B), and we want to produce code for a third, slow machine (C). We will build a compiler for machine C in three stages.
fr: Par exemple, imaginons le scénario suivant (parfois appelé <quote>Canadian Cross</quote>)&nbsp;: nous avons un compilateur sur une machine lente, que nous appellerons A, et le compilateur ccA. Nous avons également une machine rapide (B), mais aucun compilateur pour (B). Nous voulons produire du code pour une troisième machine, lente cette fois (C). Il y a trois étapes à suivre pour construire un compilateur destiné à la machine C&nbsp;:
pt_br: Como um exemplo, permita-nos imaginar o seguinte cenário (de vez em quando referenciado como <quote>Cruzado Canadense</quote>). Nós temos um compilador somente em uma máquina lenta, vamos chamá-la de máquina A, e o compilador de ccA. Nós também temos uma máquina rápida (B), porém nenhum compilador para (B), e nós queremos produzir código para uma terceira, máquina lenta (C). Nós construiremos um compilador para a máquina C em três estágios.

source: Stage
fr: Étape
pt_br: Estágio

source: Build
fr: Construction
pt_br: Construtora

source: Host
fr: Hôte
pt_br: Anfitriã

source: Target
fr: Cible
pt_br: Alvo

source: Action
pt_br: Ação

source: Build cross-compiler cc1 using ccA on machine A.
fr: Construire un compilateur croisé cc1 avec ccA sur la machine A.
pt_br: Construir compilador cruzado cc1 usando ccA na máquina A.

source: Build cross-compiler cc2 using cc1 on machine A.
fr: Construire un compilateur croisé cc2 avec cc1 sur la machine A.
pt_br: Construir compilador cruzado cc2 usando cc1 na máquina A.

source: Build compiler ccC using cc2 on machine B.
fr: Construire le compilateur ccC avec cc2 sur la machine B.
pt_br: Construir compilador ccC usando cc2 na máquina B.

source: Then, all the programs needed by machine C can be compiled using cc2 on the fast machine B. Note that unless B can run programs produced for C, there is no way to test the newly built programs until machine C itself is running. For example, to run a test suite on ccC, we may want to add a fourth stage:
fr: Ensuite, tous les programmes requis par la machine C peuvent être compilés avec cc2 sur la machine rapide B. À moins que B ne puisse lancer les programmes produits pour C, il n'existe aucun moyen de tester les nouveaux programmes construits avant de les lancer sur la machine C. Par exemple, pour tester ccC, nous pouvons ajouter une quatrième étape&nbsp;:
pt_br: Então, todos os aplicativos necessários para a máquina C podem ser compilados usando cc2 na rápida máquina B. Observe que a menos que B possa executar aplicativos produzidos por C, não existe maneira de testar os aplicativos recém construídos até que a própria máquina C esteja em execução. Por exemplo, para executar uma suíte de teste em ccC, nós possivelmente queiramos adicionar um quarto estágio:

source: Rebuild and test ccC using ccC on machine C.
fr: Reconstruire et tester ccC avec lui-même sur la machine C.
pt_br: Reconstruir e testar ccC usando ccC na máquina C.

source: In the example above, only cc1 and cc2 are cross-compilers, that is, they produce code for a machine different from the one they are run on. The other compilers ccA and ccC produce code for the machine they are run on. Such compilers are called <emphasis>native</emphasis> compilers.
fr: Dans l'exemple ci-dessus, seuls cc1 et cc2 sont des compilateurs croisés, c'est-à-dire qu'ils produisent du code pour une machine différente de celle sur laquelle ils tournent. Les autres compilateurs ccA et ccC produisent du code pour la machine sur laquelle ils tournent. Ces compilateurs sont appelés compilateurs <emphasis>natifs</emphasis>.
pt_br: No exemplo acima, somente cc1 e cc2 são compiladores cruzados, isto é, eles produzem código para uma máquina diferente daquela na qual estão em execução. Os outros compiladores, ccA e ccC, produzem código para a máquina na qual estão em execução. Tais compiladores são chamados de compiladores <emphasis>nativos</emphasis>.

source: Implementation of Cross-Compilation for LFS
fr: Implémentation de la compilation croisée dans LFS
pt_br: Implementação da Compilação Cruzada para o LFS

source: All the cross-compiled packages in this book use an autoconf-based building system. The autoconf-based building system accepts system types in the form cpu-vendor-kernel-os, referred to as the system triplet. Since the vendor field is often irrelevant, autoconf lets you omit it.
fr: Tous les paquets compilés de manière croisée dans ce livre utilisent un système de construction basé sur autoconf. Le système de construction basé sur autoconf accepte des types de systèmes de la forme cpu-fabriquant-noyau-os, nommés triplets systèmes. Comme le champ fabriquant est souvent inutile, autoconf vous autorise à ne pas le renseigner.
pt_br: Todos os pacotes compilados cruzadamente neste livro usam um sistema de construção baseado no autoconf. O sistema de construção baseado no autoconf aceita tipos de sistema na forma cpu-vendor-kernel-os, referenciado como o triplo do sistema. Dado que o campo vendor frequentemente é irrelevante, o autoconf te permite omiti-lo.

source: An astute reader may wonder why a <quote>triplet</quote> refers to a four component name. The kernel field and the os field began as a single <quote>system</quote> field. Such a three-field form is still valid today for some systems, for example, <literal>x86_64-unknown-freebsd</literal>. But two systems can share the same kernel and still be too different to use the same triplet to describe them. For example, Android running on a mobile phone is completely different from Ubuntu running on an ARM64 server, even though they are both running on the same type of CPU (ARM64) and using the same kernel (Linux).
fr: Le lecteur attentif se demandera pourquoi un <quote>triplet</quote> désigne un nom à quatre composantes. Le champ du noyau et de l'os ont d'abord commencé comme un seul champ <quote>système</quote>. Cette forme à trois champs est toujours valide de nos jours pour certains systèmes, par exemple <literal>x86_64-unknown-freebsd</literal>. Mais deux systèmes peuvent partager le même noyau et être trop différents pour utiliser le même triplet pour les désigner. Par exemple Android qui tourne sur les téléphones est complètement différent d'Ubuntu sur un serveur ARM64, même s'ils utilisent tous les deux le même type de CPU (ARM64) et utilisent le même noyau (Linux).
pt_br: Um(a) leitor(a) astuto(a) possivelmente questione porque <quote>trio</quote> se refere a um nome de quatro componentes. O campo "kernel" e o campo "os" iniciaram como um campo único do <quote>sistema</quote>. Tal forma de três campos ainda é válida atualmente para alguns sistemas, por exemplo, <literal>x86_64-unknown-freebsd</literal>. Porém, dois sistemas conseguem compartilhar o mesmo núcleo e ainda serem muito diferentes para usarem o mesmo trio para descrevê-los. Por exemplo, o Android executando em um telefone móvel é completamente diferente do Ubuntu executando em um servidor ARM64, apesar de ambos estarem executando no mesmo tipo de CPU (ARM64) e usando o mesmo núcleo (Linux).

source: Without an emulation layer, you cannot run an executable for a server on a mobile phone or vice versa. So the <quote>system</quote> field has been divided into kernel and os fields, to designate these systems unambiguously. In our example, the Android system is designated <literal>aarch64-unknown-linux-android</literal>, and the Ubuntu system is designated <literal>aarch64-unknown-linux-gnu</literal>.
fr: Sans une couche d'émulation, vous ne pouvez pas lancer un exécutable pour un serveur sur un téléphone portable et vice-versa. Donc le champ <quote>système</quote> a été divisé en les champs noyau et os, pour désigner trois systèmes sans ambiguïté. Dans notre exemple, le système Android est appelé <literal>aarch64-unknown-linux-android</literal> et le système Ubuntu est appelé <literal>aarch64-unknown-linux-gnu</literal>.
pt_br: Sem uma camada de emulação, você não consegue executar um executável para um servidor em um telefone móvel ou vice versa. Assim, o campo <quote>system</quote> foi dividido nos campos "kernel" e "os" para designar esses sistemas inequívoca. No nosso exemplo, O sistema Android é designado como <literal>aarch64-unknown-linux-android</literal> e o sistema Ubuntu é designado como <literal>aarch64-unknown-linux-gnu</literal>.

source: The word <quote>triplet</quote> remains embedded in the lexicon. A simple way to determine your system triplet is to run the <command>config.guess</command> script that comes with the source for many packages. Unpack the binutils sources, run the script <userinput>./config.guess</userinput>, and note the output. For example, for a 32-bit Intel processor the output will be <emphasis>i686-pc-linux-gnu</emphasis>. On a 64-bit system it will be <emphasis>x86_64-pc-linux-gnu</emphasis>. On most Linux systems the even simpler <command>gcc -dumpmachine</command> command will give you similar information.
fr: Le mot <quote>triplet</quote> reste ancré dans le vocabulaire informatique. Pour déterminer simplement votre triplet système, vous pouvez lancer le script <command>config.guess</command> fournit avec les sources de nombreux paquets. Désarchivez les sources de binutils, lancez le script <userinput>./config.guess</userinput>, et notez la sortie. Par exemple pour un processeur Intel 32&nbsp;bits la sortie sera <emphasis>i686-pc-linux-gnu</emphasis>. Sur un système 64&nbsp;bits elle sera <emphasis>x86_64-pc-linux-gnu</emphasis>. Sur la plupart des systèmes Linux la commande encore plus simple <command>gcc -dumpmachine</command> vous donner cette information.
pt_br: A palavra <quote>trio</quote> permanece embutida no léxico. Uma maneira simples para determinar o seu trio do sistema é a de executar o script <command>config.guess</command> que vem com o fonte para muitos pacotes. Desempacote os fontes do binutils, execute o script <userinput>./config.guess</userinput> e observe a saída gerada. Por exemplo, para um processador Intel de 32 bits, a saída gerada será <emphasis>i686-pc-linux-gnu</emphasis>. Em um sistema de 64 bits, será <emphasis>x86_64-pc-linux-gnu</emphasis>. Na maior parte dos sistemas Linux, o comando ainda mais simples <command>gcc -dumpmachine</command> te dará informação semelhante.

source: You should also be aware of the name of the platform's dynamic linker, often referred to as the dynamic loader (not to be confused with the standard linker <command>ld</command> that is part of binutils). The dynamic linker provided by package glibc finds and loads the shared libraries needed by a program, prepares the program to run, and then runs it. The name of the dynamic linker for a 32-bit Intel machine is <filename class="libraryfile">ld-linux.so.2</filename>; it's <filename class="libraryfile">ld-linux-x86-64.so.2</filename> on 64-bit systems. A sure-fire way to determine the name of the dynamic linker is to inspect a random binary from the host system by running: <userinput>readelf -l &lt;name of binary&gt; | grep interpreter</userinput> and noting the output. The authoritative reference covering all platforms is in the <filename>shlib-versions</filename> file in the root of the glibc source tree.
fr: Faites également attention au nom de l'éditeur de liens dynamiques de la plateforme, souvent appelé chargeur dynamique (à ne pas confondre avec l'éditeur de liens standard <command>ld</command> qui fait partie de binutils).Le chargeur dynamique fourni par glibc trouve et charge les bibliothèques partagées nécessaires à l’exécution d’un programme, prépare le programme, puis l'exécute.Le nom du chargeur dynamique pour une machine Intel 32&nbsp;bits sera <filename class="libraryfile">ld-linux.so.2</filename> (<filename class="libraryfile">ld-linux-x86-64.so.2</filename> pour les systèmes 64&nbsp;bits).Pour déterminer le nom du chargeur dynamique, inspectez un binaire au hasard sur le système hôte en exécutant&nbsp;: <userinput>readelf -l &lt;nom du binaire&gt; | grep interpreter</userinput> et récupérez le résultat.La référence officielle qui couvre toutes les plateformes se trouve dans le fichier <filename>shlib-versions</filename>, à la racine de l’arborescence des sources de glibc.
pt_br: Você também deveria estar ciente do nome do vinculador dinâmico da plataforma, frequentemente referido como o carregador dinâmico (não seja confundido com o vinculador padrão <command>ld</command> que é parte do binutils). O vinculador dinâmico fornecido pelo pacote glibc encontra e carrega as bibliotecas compartilhadas necessárias para um aplicativo, prepara o aplicativo para execução e então o executa. O nome do vinculador dinâmico para uma máquina Intel de 32 bits é <filename class="libraryfile">ld-linux.so.2</filename>; e é <filename class="libraryfile">ld-linux-x86-64.so.2</filename> em sistemas de 64 bits. Uma maneira infalível para determinar o nome do vinculador dinâmico é a de inspecionar uma biblioteca aleatória oriunda do sistema anfitrião executando: <userinput>readelf -l &lt;nome do binário&gt; | grep interpreter</userinput> e observar a saída gerada. A referência oficial cobrindo todas as plataformas está no arquivo <filename>shlib-versions</filename> na raiz da árvore do fonte do glibc.

source: In order to fake a cross-compilation in LFS, the name of the host triplet is slightly adjusted by changing the &quot;vendor&quot; field in the <envar>LFS_TGT</envar> variable so it says &quot;lfs&quot;. We also use the <parameter>--with-sysroot</parameter> option when building the cross-linker and cross-compiler, to tell them where to find the needed host files. This ensures that none of the other programs built in <xref linkend="chapter-temporary-tools"/> can link to libraries on the build machine. Only two stages are mandatory, plus one more for tests.
fr: Pour simuler une compilation croisée dans LFS, le nom du triplet hôte est légèrement modifié en changeant le champ «&nbsp;fabriquant&nbsp;» dans la variable d’environnement <envar>LFS_TGT</envar> pour qu’il indique «&nbsp;lfs&nbsp;. Nous utilisons également l'option <parameter>--with-sysroot</parameter> lors de la construction de l'éditeur de liens et du compilateur croisés pour leur indiquer l’emplacement des fichiers hôte requis. Cette option permet de s’assurer qu'aucun autre programme construit dans le <xref linkend="chapter-temporary-tools"/> ne peut s’associer aux bibliothèques sur la machine de construction.Seules deux étapes sont obligatoires, en plus d’une étape supplémentaire destinée aux tests&nbsp;:
pt_br: Para a finalidade de falsificar uma compilação cruzada no LFS, o nome do trio do anfitrião é ligeiramente ajustado mudando-se o campo &quot;vendor&quot; na variável <envar>LFS_TGT</envar>, de forma que diga &quot;lfs&quot;. Nós também usamos a opção <parameter>--with-sysroot</parameter> quando da construção do vinculador cruzado e do compilador cruzado para informá-los onde encontrar os arquivos necessários do anfitrião. Isso assegura que nenhum dos outros aplicativos construídos no <xref linkend="chapter-temporary-tools"/> consegue se vincular a bibliotecas na máquina de construção. Somente dois estágios são obrigatórios e mais um para testes.

source: Build cross-compiler cc1 using cc-pc on pc.
fr: Construire un compilateur croisé cc1 avec cc-pc sur pc.
pt_br: Construir compilador cruzado cc1 usando cc-pc em pc.

source: Build compiler cc-lfs using cc1 on pc.
fr: Construire un compilateur cc-lfs avec cc1 sur pc.
pt_br: Construir compilador cc-lfs usando cc1 em pc.
