Repository: espindula/br-lfs
Catalog: lfs/*/part3intro/toolchaintechnotes.po
Languages: fr, pt_br

source: Rebuild and test cc-lfs using cc-lfs on lfs.
fr: Reconstruire et tester cc-lfs avec lui-même sur lfs.
pt_br: Reconstruir e testar cc-lfs usando cc-lfs em lfs.

source: In the preceding table, <quote>on pc</quote> means the commands are run on a machine using the already installed distribution. <quote>On lfs</quote> means the commands are run in a chrooted environment.
fr: Dans le tableau précédent, <quote>sur pc</quote> signifie que les commandes sont exécutées sur une machine qui utilise la distribution déjà installée.<quote>Sur lfs</quote> signifie que les commandes sont exécutées dans un environnement chroot.
pt_br: Na tabela precedente, <quote>em pc</quote> significa que os comandos são executados em uma máquina usando a distribuição já instalada. <quote>Em lfs</quote> significa que os comandos são executados em um ambiente chroot.

source: This is not yet the end of the story. The C language is not merely a compiler; it also defines a standard library. In this book, the GNU C library, named glibc, is used (there is an alternative, &quot;musl&quot;). This library must be compiled for the LFS machine; that is, using the cross-compiler cc1. But the compiler itself uses an internal library providing complex subroutines for functions not available in the assembler instruction set. This internal library is named libgcc, and it must be linked to the glibc library to be fully functional. Furthermore, the standard library for C++ (libstdc++) must also be linked with glibc. The solution to this chicken and egg problem is first to build a degraded cc1-based libgcc, lacking some functionalities such as threads and exception handling, and then to build glibc using this degraded compiler (glibc itself is not degraded), and also to build libstdc++. This last library will lack some of the functionality of libgcc.
fr: Ce n'est pas la fin de l'histoire. Le langage C n'est pas seulement un compilateur, mais il définit aussi une bibliothèque standard. Dans ce livre, nous utilisons la bibliothèque C de GNU, appelée glibc (son alternative étant «&nbsp;musl&nbsp;»). Cette bibliothèque doit être compilée pour la machine LFS, c'est-à-dire à l’aide du compilateur croisé cc1. Mais le compilateur lui-même utilise une bibliothèque interne qui exécute des instructions complexes indisponibles dans le jeu d'instructions de l'assembleur. Cette bibliothèque interne, libgcc, doit être liée à la bibliothèque glibc pour fonctionner correctement&nbsp;! De plus, la bibliothèque standard C++ (libstdc++) a aussi besoin d'être associée à glibc. La solution à ce problème consiste d'abord à construire une libgcc inférieure basée sur cc1, qui ne dispose pas de fonctionnalités avancées comme les threads et le traitement des exceptions, puis de construire glibc avec ce compilateur inférieur (glibc elle-même n'étant pas inférieure), puis de construire libstdc++. Cette bibliothèque ne dispose pas des fonctionnalités avancées de libgcc.
pt_br: Esse não é ainda o fim da estória. A linguagem C não é apenas um compilador; também define uma biblioteca padrão. Neste livro, a biblioteca GNU C, chamada de glibc, é usada (existe uma alternativa, &quot;musl&quot;). Essa biblioteca precisa ser compilada para a máquina LFS; isto é, usando o compilador cruzado cc1. Porém, o próprio compilador usa uma biblioteca interna fornecendo sub rotinas complexas para funções não disponíveis no conjunto de instruções do montador. Essa biblioteca interna é chamada de libgcc e precisa ser vinculada à biblioteca glibc para ser completamente funcional. Além disso, a biblioteca padrão para C++ (libstdc++) também precisa estar vinculada com a glibc. A solução para esse problema de ovo e galinha é a de primeiro construir uma libgcc degradada baseada em cc1, faltando algumas funcionalidades, tais como camadas e manuseio de exceções, e então construir a glibc usando esse compilador degradado (a própria glibc não é degradada), e também construir a libstdc++. Essa última biblioteca carecerá de algumas das funcionalidades da libgcc.

source: The upshot of the preceding paragraph is that cc1 is unable to build a fully functional libstdc++ with the degraded libgcc, but cc1 is the only compiler available for building the C/C++ libraries during stage 2. There are two reasons we don't immediately use the compiler built in stage 2, cc-lfs, to build those libraries.
fr: La conséquence du paragraphe précédent est que cc1 est incapable de construire une libstdc++ complètement fonctionnelle avec la libgcc dégradée, mais cc1 est le seul compilateur disponible pour construire les bibliothèques C/C++ à la deuxième étape. Il y a deux raisons pour lesquelles nous n'utilisons pas immédiatement le compilateur construit à l'étape 2, cc-lfs, pour construire ces bibliothèques.
pt_br: O resultado do parágrafo precedente é o de que cc1 é inapto para construir uma libstdc++ completamente funcional com a libgcc degradada, porém cc1 é o único compilador disponível para construir as bibliotecas C/C++ durante o estágio 2. Existem duas razões pelas quais nós não usamos imediatamente o compilador construído no estágio 2, cc-lfs, para construir essas bibliotecas.

source: Generally speaking, cc-lfs cannot run on pc (the host system). Even though the triplets for pc and lfs are compatible with each other, an executable for lfs must depend on glibc-&glibc-version;; the host distro may utilize either a different implementation of libc (for example, musl), or a previous release of glibc (for example, glibc-2.13).
fr: En général, cc-lfs ne peut pas se lancer sur pc (le système hôte). Même si les triplets pour pc et lfs sont compatibles l'un avec l'autre, un exécutable pour lfs doit dépendre de glibc-&glibc-version;. La distribution hôte peut utiliser une implémentation différent de la libc (par exemple, musl) ou une version précédente de glibc (par exemple glibc-2.13).
pt_br: Falando genericamente, cc-lfs não consegue executar em pc (o sistema anfitrião). Ainda que os trios para pc e lfs sejam compatíveis entre si, um executável para lfs precisa depender da glibc-&glibc-version;; a distribuição anfitriã possivelmente utilize ou uma implementação diferente da libc (por exemplo, musl), ou um lançamento anterior da glibc (por exemplo, glibc-2.13).

source: Even if cc-lfs can run on pc, using it on pc would create a risk of linking to the pc libraries, since cc-lfs is a native compiler.
fr: Même si cc-lfs peut s'exécuter sur pc, l'utiliser sur pc induirait le risque de se lier aux bibliothèques de pc, comme cc-lfs est un compilateur natif.
pt_br: Ainda se cc-lfs conseguisse executar em pc, usá-la em pc criaria um risco de vinculação às bibliotecas de pc, dado que cc-lfs é um compilador nativo.

source: So when we build gcc stage 2, we instruct the building system to rebuild libgcc and libstdc++ with cc1, but we link libstdc++ to the newly rebuilt libgcc instead of the old, degraded build. This makes the rebuilt libstdc++ fully functional.
fr: Ainsi, lorsque nous construisons l’étape 2 du gcc, nous demandons au système de construction de reconstruire libgcc et libstdc++ avec cc1, mais nous lions libstdc++ au nouveau libgcc reconstruit plutôt qu’à l'ancienne construction dégradée, pour faire en sorte que le libstdc++ reconstruit soit entièrement opérationnel.
pt_br: Assim, quando nós construirmos gcc estágio 2, nós instruímos o sistema de construção a reconstruir libgcc e libstdc++ com cc1, porém nós vinculamos libstdc++ à libgcc reconstruída recentemente, em vez da antiga, degradada construção. Isso torna a libstdc++ reconstruída completamente funcional.

source: In &ch-final; (or <quote>stage 3</quote>), all the packages needed for the LFS system are built. Even if a package has already been installed into the LFS system in a previous chapter, we still rebuild the package. The main reason for rebuilding these packages is to make them stable: if we reinstall an LFS package on a completed LFS system, the reinstalled content of the package should be the same as the content of the same package when first installed in &ch-final;. The temporary packages installed in &ch-tmp-cross; or &ch-tmp-chroot; cannot satisfy this requirement, because some of them are built without optional dependencies, and autoconf cannot perform some feature checks in &ch-tmp-cross; because of cross-compilation, causing the temporary packages to lack optional features, or use suboptimal code routines. Additionally, a minor reason for rebuilding the packages is to run the test suites.
fr: Dans &ch-final;, (ou <quote>l’étape 3</quote>), tous les paquets nécessaires au système LFS sont construits.Même si vous avez déjà installé un paquet sur le système LFS dans un chapitre précédent, vous devrez reconstruire le paquet, à moins d’être certain qu’il n’est pas nécessaire. La stabilisation de ces paquets est la raison principale de leur reconstruction&nbsp;: si vous réinstallez un paquet LFS sur un système complet LFS, le contenu du paquet installé devrait être identique au contenu de ce paquet installé dans&ch-final;. Les paquets temporaires installés dans&ch-tmp-cross; ou&ch-tmp-chroot; ne sont pas concernés, car certains d’entre eux sont construits sans dépendance optionnelle, et autoconf ne peut pas exécuter certaines vérifications dans &ch-tmp-cross; à cause de la compilation croisée. Les paquets temporaires ne disposent donc pas de certaines fonctionnalités optionnelles ou utilisent des routines sous-optimales. De plus, en reconstruisant les paquets, vous permettez l’exécution de la suite de tests.
pt_br: No &ch-final; (ou <quote>estágio 3</quote>), todos os pacotes necessários para o sistema LFS são construídos. Ainda se um pacote já tenha sido instalado no sistema LFS em um capítulo anterior, nós ainda reconstruímos o pacote. A razão principal para reconstruir esses pacotes é a de torná-los estáveis: se nós reinstalarmos um pacote LFS em um sistema LFS completo, [então] o conteúdo reinstalado do pacote deveria ser o mesmo que o conteúdo do mesmo pacote quando primeiro instalado no &ch-final;. Os pacotes temporários instalados no &ch-tmp-cross; ou no &ch-tmp-chroot; não conseguem satisfazer essa exigência, pois alguns deles são construídos sem dependências opcionais e o autoconf não consegue realizar algumas verificações de recursos no &ch-tmp-cross;, por causa da compilação cruzada, causando nos pacotes temporários a falta de recursos opcionais ou o uso de rotinas sub ótimas de código. Adicionalmente, uma razão menor para reconstruir os pacotes é a de executar as suítes de teste.

source: Other Procedural Details
fr: Détails supplémentaires de procédure
pt_br: Outros Detalhes Procedurais

source: The cross-compiler will be installed in a separate <filename class="directory">$LFS/tools</filename> directory, since it will not be part of the final system.
fr: Le compilateur croisé sera installé dans un répertoire <filename class="directory">$LFS/tools</filename> séparé, puisqu’il ne fera pas partie du système final.
pt_br: O compilador cruzado será instalado em um diretório <filename class="directory">$LFS/tools</filename> separado, dado que ele não será parte do sistema final.

source: Binutils is installed first because the <command>configure</command> runs of both gcc and glibc perform various feature tests on the assembler and linker to determine which software features to enable or disable. This is more important than one might realize at first. An incorrectly configured gcc or glibc can result in a subtly broken toolchain, where the impact of such breakage might not show up until near the end of the build of an entire distribution. A test suite failure will usually highlight this error before too much additional work is performed.
fr: Binutils est installé en premier parce que la commande <command>configure</command>de gcc et glibc effectuent des tests de fonctionnalités sur l'assembleur et l'éditeur de liens pour déterminer quelles fonctionnalités logicielles activer ou désactiver.Cette installation est plus importante que ce que vous pouvez penser.Un gcc ou une glibc mal configurés peuvent casser la chaîne de compilation, et l'impact d’une telle configuration ne se verrait qu’à la fin de la construction de la distribution complète.La suite de tests indiquera généralement cette erreur avant que vous n’ayez trop avancé.
pt_br: O Binutils é instalado primeiro, pois as execuções do <command>configure</command> de ambos gcc e glibc realizam vários testes de recursos no montador e no vinculador para determinar quais recursos de software habilitar ou desabilitar. Isso é mais importante do que, inicialmente, alguém possa perceber. Um gcc ou uma glibc configurado incorretamente pode resultar em um conjunto de ferramentas sutilmente quebrado, onde o impacto de tal quebra talvez não se manifeste até próximo do final da construção de uma distribuição inteira. Uma falha de suíte de teste normalmente destacará tal erro antes que muito mais trabalho adicional seja realizado.

source: Binutils installs its assembler and linker in two locations, <filename class="directory">$LFS/tools/bin</filename> and <filename class="directory">$LFS/tools/$LFS_TGT/bin</filename>. The tools in one location are hard linked to the other. An important facet of the linker is its library search order. Detailed information can be obtained from <command>ld</command> by passing it the <parameter>--verbose</parameter> flag. For example, <command>$LFS_TGT-ld --verbose | grep SEARCH</command> will illustrate the current search paths and their order. (Note that this example can be run as shown only while logged in as user <systemitem class="username">lfs</systemitem>. If you come back to this page later, replace <command>$LFS_TGT-ld</command> with <command>ld</command>).
fr: Binutils installe son assembleur et son éditeur de liens à deux emplacements, <filename class="directory">$LFS/tools/bin</filename> et <filename class="directory">$LFS/tools/$LFS_TGT/bin</filename>. Les outils situés à un emplacement sont liés à l’autre par un lien dur. L’ordre de recherche des bibliothèques est un aspect important de l’éditeur de liens. Vous pouvez obtenir des informations détaillées à partir de la commande <command>ld</command> en lui passant l’option <parameter>--verbose</parameter>. Par exemple, la commande <command>ld --verbose | grep SEARCH</command> affichera les chemins de recherche actuels et leur ordre. Cet exemple peut être exécuté en mode lecture par l’utilisateur <systemitem class="username">lfs</systemitem>.Si vous revenez plus tard sur cette page, remplacez la commande <command>$LFS_TGT-ld</command> par <command>ld</command>.
pt_br: O Binutils instala o montador e o vinculador dele em dois locais, <filename class="directory">$LFS/tools/bin</filename> e <filename class="directory">$LFS/tools/$LFS_TGT/bin</filename>. As ferramentas em um local são rigidamente vinculadas às outras. Uma faceta importante do vinculador é a ordem de procura de biblioteca dele. Informação detalhada pode ser obtida do <command>ld</command> passando-lhe a flag <parameter>--verbose</parameter>. Por exemplo, <command>$LFS_TGT-ld --verbose | grep SEARCH</command> exibirá os caminhos atuais de procura e a ordem deles. (Observe que esse exemplo pode ser executado como mostrado somente enquanto logado(a) como usuário(a) <systemitem class="username">lfs</systemitem>. Se você retornar a esta página posteriormente, [então] substitua <command>$LFS_TGT-ld</command> por <command>ld</command>).

source: The next package installed is gcc. An example of what can be seen during its run of <command>configure</command> is:
fr: Le prochain paquet installé est gcc. Voici un exemple de ce qui peut s’afficher pendant l'exécution de la commande <command>configure</command>&nbsp;:
pt_br: O próximo pacote instalado é o gcc. Um exemplo do que pode ser visto durante a execução dele do <command>configure</command> é:

source: This is important for the reasons mentioned above. It also demonstrates that gcc's configure script does not search the PATH directories to find which tools to use. However, during the actual operation of <command>gcc</command> itself, the same search paths are not necessarily used. To find out which standard linker <command>gcc</command> will use, run: <command>$LFS_TGT-gcc -print-prog-name=ld</command>. (Again, remove the <command>$LFS_TGT-</command> prefix if coming back to this later.)
fr: Il s’agit d’un paquet important pour les raisons mentionnées plus haut. C’est également la preuve que le script configure de gcc ne parcourt pas les répertoires du PATH pour trouver quels outils utiliser. Cependant, lors de l’exécution normale de la commande <command>gcc</command>, les mêmes chemins de recherche ne sont pas forcément utilisés. Pour trouver quel éditeur de liens standard <command>gcc</command> utilise, exécutez la commande <command>$LFS_TGT-gcc -print-prog-name=ld</command>. À nouveau, retirez la commande <command>$LFS_TGT-</command> si vous revenez ici plus tard.
pt_br: Isso é importante pelas razões mencionadas acima. Também demonstra que o script de configuração do gcc não procura nos diretórios do PATH para encontrar quais ferramentas usar. Entretanto, durante a operação atual do próprio <command>gcc</command>, os mesmos caminhos de procura não são necessariamente usados. Para descobrir qual vinculador padrão o <command>gcc</command> usará, execute: <command>$LFS_TGT-gcc -print-prog-name=ld</command>. (Novamente, remova o prefixo <command>$LFS_TGT-</command> se retornar a isso posteriormente).

source: Detailed information can be obtained from <command>gcc</command> by passing it the <parameter>-v</parameter> command line option while compiling a program. For example, <command>$LFS_TGT-gcc -v <replaceable>example.c</replaceable></command> (or without <command> $LFS_TGT-</command> if coming back later) will show detailed information about the preprocessor, compilation, and assembly stages, including <command>gcc</command>'s search paths for included headers and their order.
fr: Vous pouvez obtenir des informations détaillées grâce à la commande <command>gcc</command> en lui passant l’option <parameter>-v</parameter> lors de la compilation d'un programme. Par exemple, la commande <command>$LFS_TGT-gcc -v <replaceable>example.c</replaceable></command> (sans <command> $LFS_TGT-</command> si vous revenez plus tard) affichera des informations détaillées sur les phases de préprocesseur, de compilation et d’assemblage, ainsi que les chemins de recherche de <command>gcc</command> pour les headers inclus et leur ordre.
pt_br: Informação detalhada pode ser obtida do <command>gcc</command> passando-se a opção de linha de comando <parameter>-v</parameter> enquanto compilar um aplicativo. Por exemplo, <command>$LFS_TGT-gcc -v <replaceable>example.c</replaceable></command> (ou sem <command> $LFS_TGT-</command> se retornar posteriormente) exibirá informação detalhada acerca do preprocessador, compilação e estágios da montagem, incluindo os caminhos de procura do <command>gcc</command> para cabeçalhos inclusos e a ordem deles.

source: Next up: sanitized Linux API headers. These allow the standard C library (glibc) to interface with features that the Linux kernel will provide.
fr: L’installation suivante concerne les headers nettoyés de l’API de Linux. Ils permettent à la bibliothèque standard C (glibc) d’interagir avec les fonctionnalités fournies par le noyau Linux.
pt_br: Em seguida: cabeçalhos sanitizados da API do Linux. Eles permitem que a biblioteca C padrão (glibc) interaja com os recursos que o núcleo Linux fornecerá.

source: Next comes glibc. The most important considerations for building glibc are the compiler, binary tools, and kernel headers. The compiler is generally not an issue since glibc will always use the compiler relating to the <parameter>--host</parameter> parameter passed to its configure script; e.g., in our case, the compiler will be <command>$LFS_TGT-gcc</command>. The binary tools and kernel headers can be a bit more complicated. Therefore, we take no risks and use the available configure switches to enforce the correct selections. After the run of <command>configure</command>, check the contents of the <filename>config.make</filename> file in the <filename class="directory">build</filename> directory for all important details. Note the use of <parameter>CC="$LFS_TGT-gcc"</parameter> (with <envar>$LFS_TGT</envar> expanded) to control which binary tools are used and the use of the <parameter>-nostdinc</parameter> and <parameter>-isystem</parameter> flags to control the compiler's include search path. These items highlight an important aspect of the glibc package&mdash;it is very self-sufficient in terms of its build machinery, and generally does not rely on toolchain defaults.
fr: glibc est le paquet suivant à installer. Le compilateur, les outils binaires et les headers du noyau sont les éléments les plus importants à prendre en considération pour construire glibc. Le compilateur ne pose généralement pas de problème car glibc utilise toujours le compilateur lié à l’option <parameter>--host</parameter> passée à son script configure. Par exemple, dans notre cas, le compilateur sera <command>$LFS_TGT-gcc</command>. Les outils binaires et les headers du noyau s’avèrent un peu plus compliqués. Ne prenez donc pas de risque et utilisez les options de configure disponibles pour exécuter les bonnes sélections. Après l'exécution de <command>configure</command>, vérifiez le contenu et les détails importants du fichier <filename>config.make</filename> dans le répertoire <filename class="directory">glibc-build</filename>. Pour sélectionner les outils binaires à utiliser, servez-vous du paramètre <parameter>CC="$LFS_TGT-gcc"</parameter> (avec la variable étendue <envar>$LFS_TGT</envar>). Pour sélectionner le chemin de recherche des headers du compilateur, utilisez les options <parameter>-nostdinc</parameter> et <parameter>-isystem</parameter>. Ces éléments mettent en avant un aspect important du paquet glibc&nbsp;: il est auto-suffisant en termes de construction et ne repose généralement pas sur la chaîne de compilation par défaut.
pt_br: Próximo vem a glibc. As considerações mais importantes para a construção da glibc são o compilador, ferramentas binárias e os cabeçalhos do núcleo. O compilador geralmente não é um problema dado que a glibc sempre usará o compilador relacionado ao parâmetro <parameter>--host</parameter> passado ao script configure dela; por exemplo, em nosso caso, o compilador será <command>$LFS_TGT-gcc</command>. As ferramentas binárias e os cabeçalhos do núcleo podem ser um bocado mais complicados. Dessa maneira, nós não nos arriscamos e usamos as chaves do configure disponíveis para impor as seleções corretas. Após a execução do <command>configure</command>, verifique o conteúdo do arquivo <filename>config.make</filename> no diretório <filename class="directory">build</filename> para todos os detalhes importantes. Observe o uso de <parameter>CC="$LFS_TGT-gcc"</parameter> (com <envar>$LFS_TGT</envar> expandida) para controlar quais ferramentas binárias são usadas e o uso das flags <parameter>-nostdinc</parameter> e <parameter>-isystem</parameter> para controlar o caminho de procura de include do compilador. Esses itens destacam um importante aspecto do pacote glibc&mdash;ele é muito autossuficiente em termos de maquinário de construção e geralmente não confia em padrões de conjuntos de ferramentas.
