Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/audioutils/audacious.xml.1.chaine.po
Languages: fr

source: 560 KB
fr: 560 Ko

source: 47 MB (with Gtk and Qt5 user interfaces)
fr: 47 Mo (with Gtk and Qt5 user interfaces)

source: 1.8 MB
fr: 1.8 Mo

source: 139 MB (with Gtk and Qt5 user interfaces)
fr: 139 Mo (with Gtk and Qt5 user interfaces)

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Audacious
fr: Installation de Audacious

source: Install _A1722_ by running the following commands (you may wish to change the stamp to another string):
fr: Installez _A1722_ en lançant les commandes suivantes (vous pouvez souhaiter changer le tampon par une autre chaîne) :

source: This package does not come with a test suite, but you can run, before installing, test _C3213_ .
fr: Ce paquet n'est pas livré avec une suite de tests, mais vous pouvez lancer, avant l'installation , le test _C3213_.

source: You will see a lot of debugging messages scrolling in the console.
fr: Vous verrez beaucoup de messages de debuogage défiler sur la console.

source: This is actually useful because they can be used to track down a bug.
fr: C'est actuellement utile car cela peut être utilisé pour chercher un bogue.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Installation of Audacious Plugins
fr: Installation des plugins d'Audacious

source: Install the required plugins package by unpacking the tarball, changing into the newly created directory, and issuing the following commands:
fr: Installez le paquet exigé des plugins en déballant l'archive tar, en vous rendant dans le répertoire nouvellement créé et en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Command Explanations
fr: Explications des commandes

source: the default is for _C150_ to output text in color.
fr: le réglage par défaut fait en sorte que _C150_ affiche le texte en couleur.

source: This is fine if you are building in a terminal, but if you script the build process and pipe the output from _C150_ to a log file then the control characters used to color the text can make the logfile unreadable.
fr: Ceci est parfait si vous construisez dans un terminal, mais si vous scriptez le processus de construction et si vous pipez la sortie de _C150_ vers un fichier journal, les caractères de contrôle utilisés pour colorer le texte peuvent rendre le fichier journal illisible.

source: This option stops it coloring the text.
fr: Cette option désactive la coloration du texte.

source: This switch appends the given text to the version string.
fr: Ce paramètre ajoute le texte donné à la chaine de version.

source: Use this to disable GTK+ support.
fr: Utilisez cela pour désactiver le support GTK+.

source: Use this for the plugins if you have not installed mpg123 and do not wish to play mp3 files.
fr: Utilisez cela pour les plugins si vous n'avez pas installé mpg123 et ne souhaitez pas lire des fichiers mp3.

source: Use this to enable Qt support.
fr: Utilisez cela pour activer le support Qt.

source: Allow better Valgrind leak checks.
fr: Permet des meilleures vérifications de Valgrind.

source: Configuring Audacious
fr: Configuration d'Audacious

source: If you prefer the old, smaller Winamp/XMMS interface, click on View&gt; Interface&gt; Winamp Classic Interface.
fr: Si vous préférez l'ancienne interface Winamp/XMMS, plus petite, Cliquez sur _fpo_View_fpf_&gt; .

source: If you built with both Gtk and Qt user interfaces, the Qt version can be executed from a terminal, issuing _C3214_ .
fr: Si vous construisez avec les deux interfaces utilisateur Gtk et Qt, la version Qt peut être exécutée depuis un terminal, en tapant _C3214_.

source: If you wish a desktop menu entry to execute this Qt version, issue the following commands as the _U2_ user:
fr: Si vous souhaitez une entrée de menu dans votre bureau pour exécuter la version Qt, tapez les commandes suivantes en tant qu'utilisateur _U2_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: audacious and audtool
fr: audacious et audtool

source: libaudcore.so, libaudgui.so, libaudqt.so, libaudtag.so, and several plugin libraries under /usr/lib/audacious/ sub-directories
fr: libaudcore.so, libaudgui.so, libaudqt.so, libaudtag.so, et plusieurs bibliothèques de greffon dans les sous-répertoires de /usr/lib/audacious/

source: /usr/include/{audacious, libaudcore, libaudgui, libaudqt}, /usr/lib/audacious and /usr/share/audacious
fr: /usr/include/{audacious, libaudcore, libaudgui, libaudqt}, /usr/lib/audacious et /usr/share/audacious

source: Short Descriptions
fr: Descriptions courtes

source: is a GTK+2 port of _A479_ based on the _A1723_ .
fr: est un port GTK+2 de _A479_ basé sur le lecteur _A1723_.

source: is a small tool to modify the behavior of a running _C3215_ instance.
fr: est un petit outil pour modifier le comportement d'une instance _C3215_ en cours.
