Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/audioutils/freetts.xml.1.chaine.po
Languages: fr

source: 13.5 MB
fr: 13.5 Mo

source: 92 MB
fr: 92 Mo

source: 3.8 MB
fr: 3.8 Mo

source: Introduction to FreeTTS
fr: Introduction à FreeTTS

source: The _A547_ package contains a speech synthesis system written entirely in the _A370_ programming language.
fr: Le paquet _A547_ contient un système de synthèse vocale écrit entièrement en langage de programmation _A370_.

source: It is based upon _L525_ :
fr: Il se base sur _L525_ :

source: a small run-time speech synthesis engine developed at Carnegie Mellon University.
fr: un petit moteur de synthèse vocale en exécution développé là l'Université de Carnegie Mellon.

source: The _A547_ package is used to convert text to audible speech through the system audio hardware.
fr: Le paquet _A547_ est utilisé pour convertir du texte en parole audible sur du matériel audio.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Test suite:
fr: Suite de tests :

source: FreeTTS Dependencies
fr: Dépendances de FreeTTS

source: Required
fr: Requises

source: User Notes:
fr: Notes utilisateur :

source: Installation of FreeTTS
fr: Installation de FreeTTS

source: The _A547_ package is distributed in ZIP format and the _C436_ command will default to creating an unused source directory.
fr: Le paquet _A547_ est distribué au format ZIP et la commande _C436_ command va créer par défaut un répertoire source inhabituel.

source: Additionally, unzipping the test suite file will prompt for questions about overwriting existing files.
fr: En outre, la décompression du fichier de la suite de tes!s posera des questions sur le remplacement de fichiers existant.

source: Use the following commands to _C436_ the source files:
fr: Utilisez les commandes suivantes pour _C436_ les fichiers des sources :

source: The _C1079_ command below installs the Java Speech API components into the _A547_ source tree.
fr: La commande _C1079_ ci-dessous installe les composants de l'API vocal de Java dans l'arborescence du source de _A547_.

source: You will be required to view, and then accept (by entering a
fr: Vous devrez regarder et accepter (en entrant un appui sur la touche

source: If you are scripting (automating) the build, you'll need to account for this.
fr: Si vous scriptez (automatisez) la construction, vous devrez en tenir compte.

source: There is information about automating build commands in the _X340_ section of Chapter 2.
fr: Il y a des information abouts sur l'automatisation des commandes de construction dans la section _X340_ du chapitre 2.

source: Towards the end of this section, specific information for automating this type of installation is discussed.
fr: Vers la fin de cette section, sont données des informations spécifiques pour automatser ce type d'installation.

source: Install _A547_ by running the following commands:
fr: Installez _A547_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Optionally, install any or all of the additional _A547_ components using the following commands as the _U2_ user (see the Command Explanations section for details):
fr: À titre facultatif, installez un ou tous les composants _A547_ supplémentaires en utilisant les commandes suivantes en tant qu'utilisateur _U2_ (voir la section d'explication des commandes pour des détails) :

source: Command Explanations
fr: Explications des commandes

source: Fix an error in the build file to allow the program to find the source.
fr: corrige une erreur dans le fichier de construction pour permettre au programme de trouver les sources.

source: This command installs the _A548_ components into the _A547_ source tree.
fr: Cette commande installe les composants _A548_ dans l'arborescence des sources de _A547_.

source: This commands builds everything, including the class libraries, tools and demos.
fr: Ces commandes construit tout, même les bibliothèques de classe, les outils et les démos.

source: These two commands install the demonstration programs.
fr: Ces deux commandes installent les programmes de démonstration.

source: Optionally copy the _F1121_ file to _F1122_ if you don't want to make it available system-wide.
fr: Copiez éventuellement le fichier _F1121_ vers _F1122_ si vous ne voulez pas le rendre disponible pour tout le système.

source: This installs the voice data import utilities.
fr: Ceci installe les outils d'importation de données de voix.

source: See the _F1123_ files in the _F304_ subdirectories for information and instructions about using the tools.
fr: Voir les fichiers _F1123_ dans les sous-répertoires _F304_ pour des informations et des instructions sur l'utilisation des outils.

source: This installs the _F305_ file, required if you use the _L532_ voices.
fr: Ceci installe le fichier _F305_ , exigé si vous utilisez les voix de _L532_.

source: This installs the sources and documentation for the demonstration programs.
fr: Ceci installe les sources et la documentation des programmes de démonstration.

source: For additional information and documentation about the _A547_ project, visit the main web page at _L533_ .
fr: Pour des informations et de la documentation supplémentaires sur le projet _A547_ , visitez la page Internet principale du projet sur _L533_.

source: Testing the Installation
fr: Tester l'installation

source: Test the installation using the following command:
fr: Testez l'installation en utilisant la commande suivante :

source: Depending on the setup of your audio drivers and software, you may have to add the _O136_ switch to the command as shown below:
fr: Selon le paramétrage de votre pilote et de votre logiciel son, il se peut que vous deviez ajouter l'option _O136_ à la commande comme indiqué ci-dessous :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: contains the class libraries which make up the _A547_ speech synthesis system.
fr: contient les bibliothèques de classes qui font fonctionner le système _A547_ de synthèse vocale.
