Repository: espindula/br-lfs
Catalog: po/chapter01/how.po
Languages: pt_br

source: How to Build an LFS System
pt_br: Como Construir um Sistema LFS

source: The LFS system will be built by using an already installed Linux distribution (such as Debian, OpenMandriva, Fedora, or openSUSE). This existing Linux system (the host) will be used as a starting point to provide necessary programs, including a compiler, linker, and shell, to build the new system. Select the <quote>development</quote> option during the distribution installation to include these tools.
pt_br: O sistema LFS será construído usando uma distribuição Linux já instalada (tal como Debian; o OpenMandriva; Fedora ou openSUSE). Esse sistema Linux existente (o anfitrião) será usado como um ponto de partida para fornecer os aplicativos necessários, incluindo um compilador, um vinculador e um shell para construir o novo sistema. Selecione a opção <quote>desenvolvimento</quote> durante a instalação da distribuição para incluir essas ferramentas.

source: As an alternative to installing a separate distribution on your machine, you may wish to use a LiveCD from a commercial distribution.
pt_br: Como uma alternativa a instalar uma distribuição separada em sua máquina, você possivelmente deseje usar um LiveCD de uma distribuição comercial.

source: <xref linkend="chapter-partitioning"/> of this book describes how to create a new Linux native partition and file system, where the new LFS system will be compiled and installed. <xref linkend="chapter-getting-materials"/> explains which packages and patches must be downloaded to build an LFS system, and how to store them on the new file system. <xref linkend="chapter-final-preps"/> discusses the setup of an appropriate working environment. Please read <xref linkend="chapter-final-preps"/> carefully as it explains several important issues you should be aware of before you begin to work your way through <xref linkend="chapter-cross-tools"/> and beyond.
pt_br: O <xref linkend="chapter-partitioning"/> deste livro descreve como criar uma nova partição Linux nativa e sistema de arquivos, onde o novo sistema LFS será compilado e instalado. O <xref linkend="chapter-getting-materials"/> explica quais pacotes e patches precisam ser baixados para construir um sistema LFS e como armazená-los no novo sistema de arquivos. O <xref linkend="chapter-final-preps"/> discute a configuração de um ambiente de trabalho apropriado. Por favor, leia o <xref linkend="chapter-final-preps"/> cuidadosamente, uma vez que ele explica vários assuntos importantes a respeito dos quais você deveria estar ciente antes de começar seu trabalho ao longo do <xref linkend="chapter-cross-tools"/> e além.

source: <xref linkend="chapter-cross-tools"/> explains the installation of the initial tool chain, (binutils, gcc, and glibc) using cross-compilation techniques to isolate the new tools from the host system.
pt_br: O <xref linkend="chapter-cross-tools"/>, explica a instalação do conjunto inicial de ferramentas, (binutils, gcc e glibc) usando técnicas de compilação cruzada para isolar as novas ferramentas das do sistema anfitrião.

source: <xref linkend="chapter-temporary-tools"/> shows you how to cross-compile basic utilities using the just built cross-toolchain.
pt_br: O <xref linkend="chapter-temporary-tools"/> te mostra como compilar cruzadamente utilitários básicos usando o recém construído conjunto cruzado de ferramentas.

source: <xref linkend="chapter-chroot-temporary-tools"/> then enters a "chroot" environment, where we use the new tools to build all the rest of the tools needed to create the LFS system.
pt_br: O <xref linkend="chapter-chroot-temporary-tools"/> então entra em um ambiente "chroot" onde nós usamos as novas ferramentas para construir todos o restante das ferramentas necessárias para criar o sistema LFS.

source: This effort to isolate the new system from the host distribution may seem excessive. A full technical explanation as to why this is done is provided in <xref linkend="ch-tools-toolchaintechnotes"/>.
pt_br: Esse esforço para isolar o sistema novo do sistema anfitrião possivelmente pareça excessivo. Uma explicação técnica completa do porquê isso é feito é fornecida em <xref linkend="ch-tools-toolchaintechnotes"/>.

source: In <xref linkend="chapter-building-system"/> the full-blown LFS system is built. Another advantage provided by the chroot environment is that it allows you to continue using the host system while LFS is being built. While waiting for package compilations to complete, you can continue using your computer as usual.
pt_br: Em <xref linkend="chapter-building-system"/>, o sistema LFS completo é construído. Outra vantagem fornecida pelo ambiente chroot é a de que ele te permite continuar usando o sistema anfitrião enquanto o LFS está sendo construído. Enquanto espera por compilações de pacotes completarem, você pode continuar usando seu computador normalmente.

source: To finish the installation, the basic system configuration is set up in <xref linkend="chapter-config"/>, and the kernel and boot loader are created in <xref linkend="chapter-bootable"/>. <xref linkend="chapter-finalizing"/> contains information on continuing the LFS experience beyond this book. After the steps in this chapter have been implemented, the computer is ready to boot into the new LFS system.
pt_br: Para finalizar a instalação, a configuração básica do sistema é concluída em <xref linkend="chapter-config"/>, e o kernel e carregador de inicialização são criados em <xref linkend="chapter-bootable"/>. O <xref linkend="chapter-finalizing"/> contém informação sobre como continuar a experiência LFS além deste livro. Após os passos neste capítulo terem sido implementados, o computador estará pronto para reinicializar no novo sistema LFS.

source: This is the process in a nutshell. Detailed information on each step is presented in the following chapters. Items that seem complicated now will be clarified, and everything will fall into place as you commence your LFS adventure.
pt_br: Esse é o processo em poucas palavras. Informação detalhada sobre cada passo é apresentada nos capítulos seguintes. Itens que pareçam complicados agora serão esclarecidos e tudo ficará em seu devido lugar conforme você embarcar na aventura do LFS.
