Repository: espindula/br-lfs
Catalog: po/chapter01/resources.po
Languages: pt_br

source: Resources
pt_br: Recursos

source: FAQ
pt_br: Perguntas Frequentes

source: If during the building of the LFS system you encounter any errors, have any questions, or think there is a typo in the book, please start by consulting the list of Frequently Asked Questions (FAQ), located at <ulink url="&faq-root;"/>.
pt_br: Se durante a construção do sistema LFS você encontrar quaisquer erros, tiver quaisquer perguntas, ou entender que há um erro de digitação no livro, [então], por favor, comece consultando as Perguntas Feitas Frequentemente (FAQ) que estão localizadas em <ulink url="&faq-root;"/>.

source: Chapter&nbsp;1 - Mailing Lists
pt_br: Capítulo&nbsp;1 - Listas de Discussão

source: Mailing Lists
pt_br: Listas de Correio Eletrônico

source: The <systemitem class='domainname'>linuxfromscratch.org</systemitem> server hosts a number of mailing lists used for the development of the LFS project. These lists include the main development and support lists, among others. If you cannot find an answer to your problem on the FAQ page, the next step would be to search the mailing lists at <ulink url="&lfs-root;search.html"/>.
pt_br: O servidor <systemitem class='domainname'>linuxfromscratch.org</systemitem> hospeda um número de listas de discussão usadas para o desenvolvimento do projeto LFS. Essas listas incluem as principais listas de desenvolvimento e suporte, dentre outras. Se você não conseguir encontrar uma resposta para o seu problema na página do FAQ, [então] o próximo passo seria procurar nas listas de discussão em <ulink url="&lfs-root;search.html"/>.

source: For information on the different lists, how to subscribe, archive locations, and additional information, visit <ulink url="&lfs-root;mail.html"/>.
pt_br: Para informação sobre as diversas listas, como se inscrever, localização de arquivos e informações adicionais, visite <ulink url="&lfs-root;mail.html"/>.

source: Several members of the LFS community offer assistance via Internet Relay Chat (IRC). Before using this support, please make sure your question is not already answered in the LFS FAQ or the mailing list archives. You can find the IRC network at <systemitem class='domainname'>irc.libera.chat</systemitem>. The support channel is named #lfs-support.
pt_br: Vários membros da comunidade LFS oferecem assistência via Internet Relay Chat (IRC). Antes de usar esse suporte, por favor certifique-se de que sua pergunta já não foi respondida no FAQ do LFS ou nos arquivos das listas de discussão. Você pode encontrar a rede de comunicação IRC em <systemitem class='domainname'>irc.libera.chat</systemitem>. O canal de suporte é chamado de #lfs-support.

source: Chapter&nbsp;1 - Mirror sites
pt_br: Chapter&nbsp;1 - Sítios espelho

source: Mirror Sites
pt_br: Sítios Espelho

source: The LFS project has a number of world-wide mirrors to make accessing the website and downloading the required packages more convenient. Please visit the LFS website at <ulink url="&lfs-root;mirrors.html"/> for a list of current mirrors.
pt_br: O projeto LFS tem um número de espelhos mundo afora para tornar o acesso ao sítio do projeto e o download dos pacotes exigidos mais conveniente. Por favor visite o sítio web do LFS em <ulink url="&lfs-root;mirrors.html"/> para uma lista dos espelhos atuais.

source: Contact Information
pt_br: Informação de Contato

source: Please direct all your questions and comments to one of the LFS mailing lists (see above).
pt_br: Por favor, direcione todas as suas perguntas e comentários para uma das listas de discussão do LFS (veja acima).
