Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/lib/gtk+3.xml.1.chaine.po
Languages: fr

source: 17 MB
fr: 17 Mo

source: 502 MB (with tests)
fr: 502 Mo (avec les tests)

source: 6.6 SBU (with tests)
fr: 6.6 SBU (avec les tests)

source: Introduction to GTK+ 3
fr: Introduction à GTK+ 3

source: The _A2127_ package contains libraries used for creating graphical user interfaces for applications.
fr: Le paquet _A2127_ contient les bibliothèques utilisées pour les interfaces graphiques des applications.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: GTK+ 3 Dependencies
fr: Dépendances de GTK+ 3

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Recommended (Required if building GNOME)
fr: Recommandées (nécessaires si vous construisez GNOME)

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of GTK+ 3
fr: Installation de GTK+ 3

source: There is nothing wrong about that assuming that both programs provide same functionality.
fr: Il n"est pas faux de considérer que les deux programmes fournissent les mêmes fonctions.

source: If you wish to keep one from _A2129_ you can add _O80_ to the _C101_ command.
fr: Si vous souhaitez en garder celui de _A2129_ , vous pouvez ajouter _O80_ à la commande _C101_.

source: Install _A2130_ by running the following commands:
fr: Installez _A2130_ en lançant les commandes suivantes :

source: Some tests fail if _F985_ is not found.
fr: Quelques tests échouent si _F985_ n"est pas trouvé.

source: If you wish to run the test suite, create (or update) the file using the following command as the _U2_ user:
fr: Si vous souhaitez lancer la suite de tests, créez (ou mettez à jour) le fichier en utilisant la commande suivante en tant qu"utilisateur _U2_ :

source: If _F986_ test fails, remove with _C596_ .
fr: Si le test _F986_ échoue, supprimez le avec _C596_.

source: To test the results you need a graphical session, then issue _C6_ .
fr: Pour tester les résultats vous avez besoin d"une session graphique, ensuite tapez _C6_.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: If you installed the package on to your system using a
fr: Si vous installé le paquet sur votre système en utilisant une méthode

source: Generate it using the following command as the _U2_ user:
fr: Les générer en utilisant la commande suivante en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: switch enables the HTML5 GTK backend.
fr: paramètre qui active le moteur HTML5 de gdk.

source: switch enables the X11 GDK backend.
fr: paramètre qui active le moteur GDK de X11.

source: switch disables the Wayland GDK backend because Wayland isn"t available in BLFS.
fr: paramètre pour désactiver les tests pour Wayland qui n"est pas disponible dans BLFS.

source: Configuring GTK+ 3
fr: Configurer GTK+ 3

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: An icon theme can be used to change the icons that appear on the application"s toolbar.
fr: Un thème d"icône peut être utilisé pour modifier les icônes apparaissant sur la barre d"outils de l"application.

source: If you have installed a _A2133_ theme (eg _X224_ ), an icon theme (such as _X351_ ) and/or a font (such as _L123_ ), you can set your prefences in _F987_ or the default system wide configuration file (as the _U2_ user), in _F988_ .
fr: Si vous avez installé un thème _A2133_ (comme _X224_) (_X351_) comme _X_ (tel que _L123_)et/ou une police (en tant qu'utilisatekr _U2_), vous pouvez initialiser vous préférences dans _F988_ ou le fichier de configuration système par défaut.

source: For the local user an example is:
fr: Pour l'utilisateur local, un exemple est :

source: There are many settings keys, some with default values.
fr: Il y a beaucoup de paramètres, certains avec des valeurs par défaut.

source: You can find them at _L3978_ .
fr: Vous pouvez les trouver à l'adresse _L3978_.

source: There are many more themes available at _L125_ and other places.
fr: Il y a plus de thèmes disponible sur _L125_ et ailleurs.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: broadwayd, gtk3-demo, gtk3-demo-application, gtk3-icon-browser, gtk3-widget-factory, gtk-builder-tool, gtk-encode-symbolic-svg, gtk-launch, gtk-query-immodules-3.0, and gtk-update-icon-cache
fr: broadwayd, gtk3-demo, gtk3-demo-application, gtk3-icon-browser, gtk3-widget-factory, gtk-builder-tool, gtk-encode-symbolic-svg, gtk-launch, gtk-query-immodules-3.0, et gtk-update-icon-cache

source: /etc/gtk-3.0, /usr/include/{gail, gtk}-3.0, /usr/{lib, share}/gtk-3.0, /usr/share/gtk-doc/html/{gail-libgail-util, gdk, gtk}3, and /usr/share/themes/{Default, Emacs}/gtk-3.0
fr: /etc/gtk-3.0, /usr/include/{gail, gtk}-3.0, /usr/{lib, share}/gtk-3.0, gdk2, gdk, gtk}3, Emacs, Emacs}/gtk-3.0

source: Short Descriptions
fr: Descriptions courtes

source: provides support for displaying _A2134_ applications in a web browser, using HTML5 and web sockets.
fr: fournit le support pour l"affichage des applications _A2134_ dans un navigateur web utilisant HTML5 et les sockets web.

source: is a simple program that demonstrates some of the things that can be done with _A2135_
fr: convertit des icônes svg symboliques dans un fichier spécialement préparé png

source: is a simple _A2136_ application.
fr: _C2136_.

source: is a utility to explore the icons in the current icon theme.
fr: _Q_.

source: It shows icons in various sizes, their symbolic variants where available, as well as a description of the icon and its context.
fr: _C_.

source: is a program to view _A2137_ themes and widgets.
fr: _C2137_.

source: can perform various operations on GtkBuilder .ui files.
fr: _C_.

source: converts symbolic svg icons into specially prepared png files.
fr: _C_.

source: launches an application using the given name.
fr: est un utilitaire pour explorer les icônes dans le thême d"icône courante.

source: The name should match application desktop file name, as residing in _F202_ , with or without the ".desktop" suffix.
fr: Il montre les icônes dans des tailles différentes, leurs différences symboliques quand elles sont disponibles, aussi bien que la description des icônes et leur contexte.

source: collects information about loadable input method modules for _A2139_ and writes it to the default cache file location, or to standard output.
fr: est un programme pour voir les thèmes et les gadgets _A2139_.

source: is an icon theme caching utility that creates mmap ()able cache files for icon themes.
fr: peut réaliser différentes opérations sur les fichiers GtkBuilder .ui ()able pour des thèmes d'icône.

source: contains functions that implements the accessibility interfaces defined by the _A58_ Accessibility Toolkit.
fr: contient les fonctions qui implémentent les interfaces d"accessibilité définies par le _A58_ Accessibility Toolkit.

source: contains functions that act as a wrapper around the low-level drawing and windowing functions provided by the underlying graphics system.
fr: contient des fonctions de composition qui agissent comme une enveloppe sur des fonctions graphiques sous-jacentes.

source: contains functions that provide an API to implement graphical user interfaces.
fr: contient des fonctions fournissant un API pour implémenter les interfaces graphiques utilisateur.
