Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/lib/qt4.xml.1.chaine.po
Languages: fr

source: 230 MB
fr: 230 Mo

source: 2.3 GB
fr: 2.3 Go

source: 50 MB
fr: 50 Mo

source: Introduction to Qt4
fr: Introduction à Qt

source: One of the major users of _A105_ is _A400_ .
fr: Un des utilisateurs majeurs de _A105_ est _A400_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Recommended package:
fr: Paquet recommandé :

source: Recommended patch:
fr: Correctif recommandé :

source: Qt Dependencies
fr: Dépendances de Qt

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Setting the installation prefix
fr: Initialisation du préfixe d'installation

source: Installing in /opt/qt4
fr: Installation dans /opt/qt4

source: The BLFS editors recommend installing _A399_ in a directory other than _F153_ , ie _F227_ .
fr: Les éditeurs de BLFS recommandent d'installer _A399_ dans un répertoire autre que _F153_ , par exemple _F227_.

source: To do this, set the following environment variable:
fr: Pour cela initialisez la variable d'environnement suivante :

source: Sometimes, the installation paths are hardcoded into installed files.
fr: Parfois, les chemins d'installation sont codés en durs dans les fichiers installés.

source: This is the reason why _F227_ is used as installation prefix instead of _F557_ .
fr: C'est la raison pourquoi _F227_ est utilisé comme préfx d'installation au lieu de _F557_.

source: To create a versioned _A399_ directory, you may rename the directory and create a symlink:
fr: Pour créer un répertoire versionné de _A399_ , vous devez renommer le répertoire et créez un lien symbolique :

source: Later on, you may want to install other versions of _A399_ .
fr: Plus tard, vous pouvez vouloir installer d'autres versions de _A399_.

source: To do that, just remove the symlink and use _F227_ as the prefix again.
fr: Pour faire cela, supprimez juste le lien symbolique et utilisez _F227_ de nouveau comme préfix.

source: Which version of _A399_ you use depends only on where the symlink points.
fr: La version de _A399_ que vous utilisez dépend seulement d'où pointe le lien symbolique.

source: Installation of Qt4
fr: Installation de Qt4

source: If _A399_ is being reinstalled into the same directory as an existing instance, run the commands done by _U2_, such as _C649_ , from a console or non-Qt4 based window manager.
fr: Si _A399_ doit être réinstallé dans le même répertoire qu'une précédente installation, lancez les commandes fait par _U2_, comme _C649_ , depuis une console ou un gestionnaire de fenêtres non Qt4.

source: It overwrites _A399_ libraries that should not be in use during the install process.
fr: Elle écrase les bibliothèques _A399_ qui ne devraient pas être utilisées pendant le processus d'installation.

source: If you did not install some of the recommended dependencies, examine _C320_ output to check how to disable them or use internal versions bundled in the source tarball.
fr: Si vous n'installez pas quelques unes des dépendances recommandées, examinez la sortie de _C320_ pour vérifier comment les désactiver ou utiliser les versions internes livrées avec l'archive des sources.

source: The build time and space required for the full _A399_ is quite long.
fr: Le temps et l'espace de construction requis pour tout _A399_ est considérable.

source: The instructions below do not build the tutorials and examples.
fr: Les instructions ci-dessous ne construisent pas les tutoriels et les exemples.

source: Removing the _P98_ lines will create a complete build.
fr: La suppression des lignes _P98_ créera une construction complète.

source: The BLFS editors do not recommend installing _A399_ into the /usr hierarchy because it becomes difficult to find components and to update to a new version.
fr: Les éditeurs de BLFS ne reocmmandent pas d'installer _A399_ dans la hiérarchie /usr car il devient difficile de trouver des composants et de mettre à jour vers une nouvelle version.

source: If you do want to install _A399_ in /usr, the directories need to be specified explicitly.
fr: Si vous voulez installer _A399_ dans /usr, les répertoires ont besoin d'être spécifiés explicitement.

source: In this case, set QT4PREFIX=/usr and add the following to the configure arguments below:
fr: Dans ce cas, initialisez QT4PREFIX=/usr et ajoutez la suite aux arguments de configuration :

source: Install _A399_ by running the following commands:
fr: Installez _A399_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now as the _U2_ user:
fr: Maintenant en tant qu'utilisateur _U2_ :

source: Remove references to the build directory from the installed _F228_ files by running the following command as the _U2_ user:
fr: Enlevez les références au répertoire de construction dans les fichiers _F228_ en lançant la commande suivante en tant qu'utilisateur _U2_ :

source: Remove references to the build directory in the installed library dependency (prl) files by running the following command as the _U2_ user:
fr: Effacez les références au répertoire d'installation dans les fichiers de dépendances de bibliothèques installées (prl) en lançant les commandes suivantes en tant qu'utilisateur _U2_ :

source: Building Qtwebkit
fr: Construction de Qtwebkit

source: The bundled version of qtwebkit in the main package requires an obsolete version of the _A401_ package.
fr: La version embarquée de qtwebkit dans le paquet principal requiert une version obsolète du paquet _A401_.

source: To overcome this, we use a more recent version available separately.
fr: Pour contrer cela, nous utilisons une version plus récente disponible séparement.

source: To start, the upstream package is unusual in that it does not come in a directory, so we have to create one before unpacking the tarball.
fr: Pour commencer, le paquet des développeurs est inutilisable car il n'est pas dans un répertoire, donc nous en créons un avant de déballer l'archive.

source: After that, we need to make the package compatible with the latest version of gcc and use an included script to actually complete the build.
fr: Après cela, nous devons rendre le paquet compatible avec la dernière version de gcc et utilisez un script inclus pour actuellement terminer la construction.

source: To do this, run the following instructions:
fr: Pour faire cela, lancez les instructions suivantes :

source: If desired, the build process can use parallel processors by adding the option _O87_ to the _C650_ instruction above.
fr: Si vous le souhaitez, le processus de construction utilise les processeurs en parallèle en ajoutant l'option _O87_ aux instructions suivantes _C650_.

source: To install the package, as the _U2_ user:
fr: Pour installer le paquet, en tant qu'utilisateur _U2_ :

source: Installing Auxillary Files
fr: Installation de fichiers auxiliaires

source: The following instructions assume that your working directory is the top of the _A399_ source tree:
fr: Les instructions suivantes considèrent que votre répertoire de travail est le sommet de l'arborescence des sources de _A399_ :

source: Install images and create the menu entries for installed applications.
fr: Installez les images et créez les entrées de menu pour les applications installées.

source: The _E19_ variable is used here to point to the directory for the executable programs.
fr: La variable _E19_ est utilisée ici pour pointer le répertoire des programmes exécutables.

source: If you have changed the bindir above, _E19_ will need to be adjusted below.
fr: Si vous avez modifiez le bindir, _E19_ devra être modifié.

source: Be sure that the _E19_ variable is defined in root's environment and as the _U2_ user:
fr: Soyez certain que la variable _E19_ est définie dans l'environnement root et en tant qu'utilisateur _U2_ :

source: Some packages such as _X713_ look for certain executables with a -qt4 suffix.
fr: Certains paquets comme _X254_ cherche certains exécutables avec le suffix -qt4.

source: Run the following command as the _U2_ user to create the necessary symlinks:
fr: Lancez la commande suivant en tant qu'utilisateur _U2_ pour créer les liens symboliques nécessaires :

source: Command Explanations
fr: Explications des commandes

source: Accept license without prompting user during configuration.
fr: Accepte la licence sans le demander à l'utilisateur pendant la configuration.

source: Install the opensource version of _A105_ .
fr: Installe la version libre de _A105_.

source: This switch disables building with debugging symbols.
fr: Ce paramètre désactive la construction avec les symboles de débogage.

source: These switches disable building programs that are only of interest to a developer using _A105_ .
fr: Ces paramètres désactivent la construction de programmes qui n'ont d'intérêt que pour un développeur utilisant _A105_.

source: This switch enables use the system version of _A383_ .
fr: Ce paramètre active l'utilisation de la version du système de _A383_.

source: This switch disables support for Network Information Service (NIS) which has been deprecated in recent versions of _A20_ .
fr: Ce paramètre désactive le support de _fpo_Network Information Service_fpf_ (NIS, service d'informations réseau) qui a été déprécié dans la version récente de _A20_.

source: These switches disable building of the bundled _A402_ library.
fr: Ces paramètres désactivent la construction de la bibliothèque _A402_ fournie.

source: Better version is provided by _X253_ package.
fr: Une meilleure version est fournie par le paquet _X253_.

source: These switches enable explicit linking of the _A16_ and _A393_ libraries into _A105_ libraries instead of _C651_ -ing them.
fr: Ces paramètres activent la liaison explicites des bibliothèques _A16_ et _A393_ dans les biblothèques _A105_ au lieu de les _C651_ -nés.

source: This switch disables _A403_ support in _A105_ .
fr: Ce paramètre désactive le support de _A403_ dans _A105_.

source: This switch enables building of the optimized _C652_ program.
fr: Ce paramètre active la construction du programme optimisé _C652_.

source: Use this switch if you don't have _A16_ installed.
fr: Utilisez ce paramètre si vous n'avez pas installé _A16_.

source: Configuring Qt
fr: Configuration de Qt

source: Configuration Information
fr: Informations de configuration

source: If you installed _A105_ in /usr, create an environment variable needed by certain packages.
fr: Si vous avez installé _A105_ dans /usr, créez une variable d'environnement nécessaire pour certain paquets.

source: As the _U2_ user:
fr: En tant qu'utilisateur _U2_ :

source: If you installed _A399_ in a location other than /usr, you need to update the following configuration files so that _A105_ is correctly found by other packages and system processes.
fr: Si vous avez installé _A399_ dans un endroit autre que /usr, vous devez mettre à jour les fichiers de configuration suivant pour que _A105_ soit correctement trouvé par les autres paquets et les processus du système.

source: As the _U2_ user, update the _F1015_ file and the dynamic linker's run-time cache file:
fr: En tant qu'utilisateur _U2_, mettez à jour le fichier _F1015_ et le fichier de cache du lieur dynamique d'exécution :

source: As the _U2_ user, create the _F1016_ file:
fr: En tant qu'utilisateur _U2_, créez le fichier _F1016_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: assistant, designer, lconvert, linguist, lrelease, lupdate, moc, pixeltool, qcollectiongenerator, qdbuscpp2xml, qdbus, qdbusviewer, qdbusxml2cpp, qdoc3, qhelpconverter, qhelpgenerator, qmake, qmlplugindump, qmlviewer, qt3to4, qtconfig, qttracereplay, rcc, uic3, uic, xmlpatterns, and xmlpatternsvalidator
fr: assistant, designer, lconvert, linguist, lrelease, lupdate, moc, pixeltool, qcollectiongenerator, qdbuscpp2xml, qdbus, qdbusviewer, qdbusxml2cpp, qdoc3, qhelpconverter, qhelpgenerator, qmake, qmlplugindump, qmlviewer, qt3to4, qtconfig, qttracereplay, rcc, uic3, uic, xmlpatterns, et xmlpatternsvalidator

source: Short Descriptions
fr: Descriptions courtes

source: is a tool for presenting on-line documentation.
fr: est un outil pour présenter de la documentation en ligne.

source: is a full-fledged GUI builder.
fr: est un constructeur GUI complètement mûr.

source: It includes powerful features such as preview mode, automatic widget layout, support for custom widgets, and an advanced property editor.
fr: Il inclut des fonctionnalités puissantes telles qu'un mode de prévisualisation, l'aménagement automatique des widgets, le support des widgets personnalisés et un éditeur avancé de propriétés.

source: is part of Qt4's Linguist tool chain.
fr: est une partie de la chaine d'outils linguistique de Qt4.

source: It can be used as a standalone tool to convert and filter translation data files.
fr: Il peut être utilisé comme un outil seul pour convertir et filtrez les fichiers de données de traduction.

source: provides support for translating applications into local languages.
fr: fournit un support de traduction d'applications en langues locales.

source: is a simple command line tool.
fr: est un outil simple en ligne de commande.

source: It reads a Qt project file and produces message files used by the application.
fr: Il lit un fichier de projet Qt et produit des fichiers de message utilisés par l'application.

source: reads a Qt project file, finds the translatable strings in the specified source, header and Qt Designer interface files, and produces or updates the translation files listed in the project file.
fr: lit un fichier de projet Qt, cherche les chaînes traduisibles dans les sources spécifiées, l'en-tête et les fichiers du designer Qt, et produit ou met à jour les fichiers de traduction listés dans le fichier du projet.

source: generates Qt meta object support code.
fr: génère le support du code des méta-objets Qt.

source: is a desktop magnifier and as you move your mouse around the screen it will show the magnified contents in its window.
fr: est une loupe de bureau et, quand vous déplacez votre souris sur l'écran, elle vous montrera le contenu agrandi dans sa fenêtre.

source: is a tool used to create a Qt Help Collection.
fr: est un outil utilisé pour créer une "Qt Help Collection".

source: takes a C++ source file and generates a D-Bus XML definition of the interface.
fr: prend un fichier source C++ et génère une définition D-Bus XML de cette interface.

source: lists available services, object paths, methods, signals, and properties of objects on a bus.
fr: liste les services disponibles, les chemins des objets, les méthodes, les signaux, et les propriétées des objets sur un bus.

source: is a graphical D-Bus browser.
fr: est un navigateur graphique D-Bus.

source: is a tool that can be used to parse interface descriptions and produce static code representing those interfaces,
fr: est un outil qui peut être utilisé pour analyser les descriptions de l'interface et produire du code statique représentant ces interfaces

source: is a tool used by _A105_ Developers to generate documentation for software projects.
fr: est un outil utilisé par les développeurs de _A105_ pour générer de la documentation pour les projets logiciels.

source: is a tool used to convert files to _A105_ help format.
fr: est un outil utilisé pour convertir des fichiers au format d'aide de _A105_.

source: is a tool used to generate a _A105_ compressed help file.
fr: est un outil utilisé pour généret un fichier d'aide compressé de _A105_.

source: uses information stored in project files to determine what should go in the makefiles it generates.
fr: utilise des informations stockées dans des fichiers de projet pour déterminer ce qui devrait aller dans les makefiles qu'il génère.

source: is a tool to create a qmltypes file.
fr: est un outil pour créer un fichier qmltypes.

source: is a tool for loading QML documents that makes it easy to quickly develop and debug QML applications.
fr: est un outil pour charger des documents QML qui font qu'il est facile de rapidement développer et déboguer des applications QML.

source: qt3to4 is a tool to help update Qt3 code to Qt4.
fr: qt3to4 est un outil pour aider à mettre à jour du code Qt3 vers Qt4.

source: is used to customize the appearance of Qt applications.
fr: est utilisé pour personnaliser l'apparence des applications Qt.

source: is a tool to replay all drawing operations recording with _C674_ into a trace buffer.
fr: est un outil pour rejouer toutes les opérations de dessin enregistrées avec _C674_ dans un buffer.

source: is a resource compiler used in conjunction with designer.
fr: est un compilateur de ressources utilisé avec le designer.

source: is a Qt user interface compiler.
fr: est un compilateur d'interface utilisateur Qt.

source: is a tool to generate Qt4 code out of user interface files generated by the Qt3 version of designer.
fr: est un outil pour générer du code Qt4 hors des fichiers de l'interface utilisateur générés par la version Qt3 de designer.

source: provides support for XPath, XQuery, XSLT, and XML Schema validation.
fr: fournit le support pour XPath, XQuery, XSLT, et les schémas de validation XML.

source: is a tool used to validate XML documents.
fr: est un outil utilisé pour valider des documents XML.
