Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/lib/webkitgtk.xml.1.chaine.po
Languages: fr

source: 11 MB
fr: 11 Mo

source: 1016 MB (105 MB installed)
fr: 1016 Mo (105 Mo installé)

source: Introduction to WebKitGTK+
fr: Introduction à WebKitGTK+

source: The _A2020_ is the port of the portable web rendering engine _A682_ to the _A2021_ and _A2022_ platforms.
fr: _A2025_ est le portage du moteur de rendu web portable _A682_ sur les plateformes _A2026_ et _A2027_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: WebKitGTK+ Dependencies
fr: Dépendances de WebKitGTK+

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of WebKitGTK+
fr: Installation de WebKitGTK+

source: Installation of _A2023_
fr: Installation de _A2028_

source: Install _A2024_ by running the following commands:
fr: Installez _A2024_ en lançant les commandes suivantes :

source: This package does not have a working testsuite.
fr: Ce paquet n'a pas une suite de tests valide.

source: However, there is a useable basic graphical web browser in the build directory, _A1147_ .
fr: Cependant, il y a un navigateur web graphique basique utilisable dans le répertoire de construction, _A1147_.

source: If launching it fails, there is a problem with the build.
fr: Si son lancement échoue, il y a un problème avec la construction.

source: When installing, the Makefile does some additional compiling and linking.
fr: Pendant l'installation, le Makefile fait des compilations et édition de liens supplémentaires.

source: If you do not have Xorg in /usr, the LIBRARY_PATH and PKG_CONFIG_PATH variables need to be defined for the root user.
fr: SI vous n'avez pas Xorg dans /usr, les variables LIBRARY_PATH et PKG_CONFIG_PATH doivent être définie pour l'utilisateur root.

source: If using sudo to assume root, use the -E option to pass your current environment variables for the install process.
fr: Si vous utilisez sudo pour être root, utilisez l'option -E pour passer vos variables d'environnement actuelles aux processus d'installation.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: Fixes typos in two source code files.
fr: Corriges des typos dans deux fichiers sources.

source: This switch disables default automatic hyphenation implementation.
fr: Ce paramètre désactive l'implémentation par défaut de la césure automatique.

source: You need to install _L1690_ , if you wish to enable it (replacing OFF with ON or just removing the switch).
fr: Vous devez installer _L1690_ , si vous souhaitez l'activer (en remplaçant OFF avec ON ou en supprimant le paramètre).

source: This switch enables the _A1148_ compilation and install.
fr: Ce paramètre active la compilation de _A1148_.

source: This switch enables building against the system installed _A1149_ .
fr: Ce paramètre active la construction contre la version installée de _A1149_.

source: Use this switch if you don't want to install _X440_ or _L1316_ .
fr: Utilisez ce paramètre si vous ne voulez pas installer _X440_ ou _L1316_.

source: Use this switch if _X20_ is installed and you wish to rebuild and install the API documentation.
fr: Utilisez ce paramètre si _X20_ est installé et que vous souhaitiez reconstruire et installer la documentation de l'API.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: jsc and MiniBrowser
fr: jsc

source: libjavascriptcoregtk-4.0.so and libwebkit2gtk-4.0.so
fr: libjavascriptcoregtk-4.0.so et libwebkit2gtk-4.0.so

source: /usr/include/webkitgtk-4.0, /usr/lib{, exec}/webkit2gtk-4.0 and /usr/share/gtk-doc/html/webkit{2, dom}gtk-4.0
fr: /usr/include/webkitgtk-4.0, /usr/lib{, exec}/webkit2gtk-4.0 et /usr/share/gtk-doc/html/webkit{2, dom}gtk-4.0

source: Short Descriptions
fr: Descriptions courtes

source: is a command-line utility that allows you to run JavaScript programs outside of the context of a web browser.
fr: est un utilitaire en ligne de commande qui vous permet de lancer des programmes JavaScript en dehors du contexte d'un navigateur web.

source: is a very simple graphical browser.
fr: est un navigateur graphique très simple.

source: contains core JavaScript API functions used by _C2378_ and _F1490_ .
fr: contient les fonctions de l'API du coeur de JavaScript utilisées par _C2378_ et _F1490_.

source: contains the _A148_ API functions.
fr: contient les fonctions de l'API de _A148_.
