Repository: espindula/br-lfs
Catalog: blfs/*/lxde/apps/lxtask.po
Languages: fr

source: 136 KB
fr: 136 Ko

source: 3.5 MB
fr: 3.5&nbsp;Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to LXTask
fr: Introduction à LXTask

source: The <application>LXTask</application> package contains a lightweight and desktop-independent task manager.
fr: Le paquet <application>LXTask</application> contient un gestionnaire de tâches léger indépendant du bureau.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&lxtask-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&lxtask-download-http;"/>

source: Download (FTP): <ulink url="&lxtask-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&lxtask-download-ftp;"/>

source: Download MD5 sum: &lxtask-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &lxtask-md5sum;

source: Download size: &lxtask-size;
fr: Taille du téléchargement&nbsp;: &lxtask-size;

source: Estimated disk space required: &lxtask-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &lxtask-buildsize;

source: Estimated build time: &lxtask-time;
fr: Estimation du temps de construction&nbsp;: &lxtask-time;

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch: <ulink url="&patch-root;/lxtask-&lxtask-version;-gcc10_fix-1.patch"/>
fr: Correctif requis&nbsp;: <ulink url="&patch-root;/lxtask-&lxtask-version;-gcc10_fix-1.patch"/>

source: LXTask Dependencies
fr: Dépendances de LXTask

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/lxtask"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/lxtask"/>

source: Installation of LXTask
fr: Installation de LXTask

source: First, fix some <quote>multiple definition</quote> issues exposed by GCC-10:
fr: Tout d'abord, corrigez quelques problèmes de <quote>définitions multiples</quote> trouvés par GCC-10&nbsp;:

source: Install <application>LXTask</application> by running the following commands:
fr: Installez <application>LXTask</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucune

source: Short Descriptions
fr: Descriptions courtes

source: is a lightweight and desktop-independent task manager.
fr: est un gestionnaire de tâches léger indépendant du bureau.
