Repository: espindula/br-lfs
Catalog: lfs/*/chapter05/adjusting.po
Languages: fr

source: Adjusting the Toolchain
fr: Ajuster l'ensemble d'outils

source: Now that the temporary C libraries have been installed, all tools compiled in the rest of this chapter should be linked against these libraries. In order to accomplish this, the cross-compiler's specs file needs to be adjusted to point to the new dynamic linker in <filename class="directory">/tools</filename>.
fr: Maintenant qu'on a installé les bibliothèques C temporaires, tous les outils qui seront compilés dans le reste de ce chapitre devraient s'y lier. Pour cela, il faut ajuster le fichier specs des compilateurs croisés pour pointer vers le nouvel éditeur de liens dynamiques dans <filename class="directory">/tools</filename>.

source: This is done by dumping the compiler's <quote>specs</quote> file to a location where it will look for it by default. A simple <command>sed</command> substitution then alters the dynamic linker that GCC will use. The principle here is to find all references to the dynamic linker file in <filename class="directory">/lib</filename> or possibly <filename class="directory">/lib64</filename> if the host system is 64-bit capable, and adjust them to point to the new location in <filename class="directory">/tools</filename>.
fr: Cela se fait en envoyant le fichier <quote>specs</quote> du compilateur croisé à un endroit où il sera cherché par défaut. Une simple substitution <command>sed</command> modifie l'écjteur de liens dynamiques qu'utilisera GCC. Le principe, ici, consiste à trouver toutes les références au fichier de l'éditeur de liens dynamiques dans <filename class="directory">/lib</filename>, ou éventuellement <filename class="directory">/lib64</filename> si le système hôte est 64 bits, et à les ajuster pour pointer vers le nouvel endroit dans <filename class="directory">/tools</filename>.

source: For the sake of accuracy, it is recommended to use a copy-and-paste method when issuing the following command. Be sure to visually inspect the specs file to verify that it has properly adjusted all references to the dynamic linker location. Refer to <xref linkend="ch-tools-toolchaintechnotes" role=","/> for the default name of the dynamic linker, if necessary.
fr: Pour être soigneux, il est recommandé d'utiliser une méthode copier/coller en lançant la commande suivante. Assurez-vous d'examiner visuellement le fichier specs pour vérifier qu'il a ajusté correctement toutes les références à l'emplacement de l'éditeur de liens. Reportez-vous à <xref linkend="ch-tools-toolchaintechnotes" role=","/> pour le nom par défaut de l'éditeur de liens dynamiques si besoin.

source: At this point, it is imperative to stop and ensure that the basic functions (compiling and linking) of the new toolchain are working as expected. To perform a sanity check, run the following commands:
fr: À ce stade, il est impératif de vous arrêter et de vous assurer que les fonctions de base (compiler et éditer les liens) du nouvel ensemble d'outils fonctionnent comme prévu. Pour effectuer un test de propreté, lancez les commandes suivantes&nbsp;:

source: If everything is working correctly, there should be no errors, and the output of the last command will be of the form:
fr: Si tout fonctionne correctement, il ne devrait pas y avoir d'erreur et la sortie de la dernière commande aura la forme&nbsp;:

source: Note that <filename class="directory">/tools/lib</filename>, or <filename class="directory">/tools/lib64</filename> for 64-bit machines appears as the prefix of the dynamic linker.
fr: Remarquez que <filename class="directory">/tools/lib</filename>, ou <filename class="directory">/tools/lib64</filename>, sur des machines 64 bits, apparaît comme le préfixe de l'éditeur de liens dynamiques.

source: If the output is not shown as above or there was no output at all, then something is wrong. Investigate and retrace the steps to find out where the problem is and correct it. This issue must be resolved before continuing on. Something may have gone wrong with the specs file amendment above. In this case, redo the specs file amendment, being careful to copy-and-paste the commands.
fr: Si la sortie n'apparaît pas comme ci-dessus ou s'il n'y a pas de sortie, quelque chose ne va pas. Enquêtez et refaites les étapes pour trouver la source du problème et corrigez-le. Vous devez résoudre ce problème avant de continuer. Il se peut que quelque chose ne soit pas allé avec la modification du fichier specs ci-dessus. Dans ce cas refaites la modification du fichier specs, en faisant attention de copier/coller les commandes.

source: Once all is well, clean up the test files:
fr: Une fois que tout va bien, nettoyez les fichiers de test&nbsp;::

source: Building Binutils in the next section will serve as an additional check that the toolchain has been built properly. If Binutils fails to build, it is an indication that something has gone wrong with the previous Binutils, GCC, or Glibc installations.
fr: Construire Binutils dans la prochaine section servira comme vérification supplémentaire de la bonne mise en place de l'outil de construction. Si Binutils échoue à la construction, c'est une indication d'un problème avec les installations précédentes de Binutils, GCC ou Glibc.
