Repository: espindula/br-lfs
Catalog: blfs/*/archive/add/kdeplasma-addons.po
Languages: fr

source: 1.7 MB
fr: 1.7 Mio

source: 91 MB
fr: 91 Mio

source: Introduction to Kdeplasma-addons
fr: Introduction à Kdeplasma-addons

source: This package provides extra Plasma applets and engines like lancelot, calculator, wallpapers etc.
fr: Ce paquet fournit des applets Plasma supplémentaires et des moteurs comme lancelot, calculator, wallpapers etc.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kdeplasma-addons-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kdeplasma-addons-download-http;"/>

source: Download (FTP): <ulink url="&kdeplasma-addons-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kdeplasma-addons-download-ftp;"/>

source: Download MD5 sum: &kdeplasma-addons-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kdeplasma-addons-md5sum;

source: Download size: &kdeplasma-addons-size;
fr: Taille du téléchargement&nbsp;: &kdeplasma-addons-size;

source: Estimated disk space required: &kdeplasma-addons-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kdeplasma-addons-buildsize;

source: Estimated build time: &kdeplasma-addons-time;
fr: Estimation du temps de construction&nbsp;: &kdeplasma-addons-time;

source: Kdeplasma-addons Dependencies
fr: Dépendances de Kdeplasma-addons

source: Required
fr: Requises

source: <xref linkend="kde-workspace"/> and <xref linkend="kdepimlibs"/>
fr: <xref linkend="kde-workspace"/> et <xref linkend="kdepimlibs"/>

source: Optional
fr: Facultatives

source: <xref linkend="libkexiv2"/>, <xref linkend="qjson"/>, <ulink url="http://eigen.tuxfamily.org/">Eigen</ulink> (for the Mandelbrot wallpaper plugin), <ulink url="https://github.com/ibus/ibus/wiki">ibus</ulink>, <ulink url="&kde-download-http;&kde-version;/src/">Nepomuk</ulink>, <ulink url="http://edu.kde.org/marble/">Marble</ulink> (for the desktop globe wallpaper),and <ulink url="https://github.com/ayoy/qoauth">QOAuth</ulink> (needed for the Plasma microblog dataengine)
fr: <xref linkend="libkexiv2"/>, <xref linkend="qjson"/>, <ulink url="http://eigen.tuxfamily.org/">Eigen</ulink> (pour le greffon de fond d'écran Mandelbrot), <ulink url="https://github.com/ibus/ibus/wiki">ibus</ulink>, <ulink url="&kde-download-http;&kde-version;/src/">Nepomuk</ulink>, <ulink url="http://edu.kde.org/marble/">Marble</ulink> (pour le fond d'écran globe) et <ulink url="https://github.com/ayoy/qoauth">QOAuth</ulink> (requis pour le moteur de données microblog Plasma)

source: User Notes: <ulink url="&blfs-wiki;/kdeplasma-addons"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kdeplasma-addons"/>

source: Installation of Kdeplasma-addons
fr: Installation de Kdeplasma-addons

source: Install <application>Kdeplasma-addons</application> by running the following commands:
fr: Installez <application>Kdeplasma-addons</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: liblancelot-datamodels.so, liblancelot.so, libplasma_groupingcontainment.so, libplasmacomicprovidercore.so, libplasmapotdprovidercore.so, libplasmaweather.so, librtm.so and several in &kde-dir;/lib/kde4
fr: liblancelot-datamodels.so, liblancelot.so, libplasma_groupingcontainment.so, libplasmacomicprovidercore.so, libplasmapotdprovidercore.so, libplasmaweather.so, librtm.so et plusieurs dans &kde-dir;/lib/kde4

source: several in &kde-dir;/include and &kde-dir;/share
fr: plusieurs dans &kde-dir;/include et &kde-dir;/share
