Repository: espindula/br-lfs
Catalog: blfs/*/archive/add/kdepim-runtime.po
Languages: fr

source: 1.1 MB
fr: 1.1 Mio

source: 126 MB
fr: 126 Mio

source: Introduction to Kdepim-runtime
fr: Introduction à Kdepim-runtime

source: This package provides additional resources for <application>Akonadi</application>.
fr: Ce paquet fournit des ressources supplémentaires pour <application>Akonadi</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kdepim-runtime-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kdepim-runtime-download-http;"/>

source: Download (FTP): <ulink url="&kdepim-runtime-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kdepim-runtime-download-ftp;"/>

source: Download MD5 sum: &kdepim-runtime-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kdepim-runtime-md5sum;

source: Download size: &kdepim-runtime-size;
fr: Taille du téléchargement&nbsp;: &kdepim-runtime-size;

source: Estimated disk space required: &kdepim-runtime-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kdepim-runtime-buildsize;

source: Estimated build time: &kdepim-runtime-time;
fr: Estimation du temps de construction&nbsp;: &kdepim-runtime-time;

source: Kdepim-runtime Dependencies
fr: Dépendances de Kdepim-runtime

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: <ulink url="http://git.kolab.org">KolabLibraries</ulink> (for Kolab Groupware Resource), <ulink url="http://projects.kde.org/libkgapi">libKGAPI</ulink> (to access Google services), and <ulink url="http://projects.kde.org/libkfbapi">libKFbAPI</ulink> (to access Facebook services)
fr: <ulink url="http://git.kolab.org">KolabLibraries</ulink> (pour Kolab Groupware Resource), <ulink url="http://projects.kde.org/libkgapi">libKGAPI</ulink> (pour accéder aux services Google), et <ulink url="http://projects.kde.org/libkfbapi">libKFbAPI</ulink> (pour accéder aux services Facebook)

source: User Notes: <ulink url="&blfs-wiki;/kdepim-runtime"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kdepim-runtime"/>

source: Installation of Kdepim-runtime
fr: Installation de Kdepim-runtime

source: Install <application>Kdepim-runtime</application> by running the following commands:
fr: Installez <application>Kdepim-runtime</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: accountwizard, akonadi_nepomuk_feeder, akonadi_*_agent, akonadi_*_resource, akonaditray, gidmigrator, kaddressbookmigrator, kjotsmigrator, kmail-migrator, knotes-migrator, and kres-migrator
fr: accountwizard, akonadi_nepomuk_feeder, akonadi_*_agent, akonadi_*_resource, akonaditray, gidmigrator, kaddressbookmigrator, kjotsmigrator, kmail-migrator, knotes-migrator, et kres-migrator

source: libakonadi-xml.so, libkdepim-copy.so, libkmindexreader.so, libmaildir.so, and several in &kde-dir;/lib/kde4
fr: libakonadi-xml.so, libkdepim-copy.so, libkmindexreader.so, libmaildir.so, et plusieurs dans &kde-dir;/lib/kde4

source: several in &kde-dir;/share
fr: plusieurs dans &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: is a tool to create an email account.
fr: est un outil pour créer un compte courriel.

source: launch the account wizard to configure PIM accounts.
fr: lancez l'assistant pour configurer les comptes PIM

source: is a migration tool for the KDE address book.
fr: est un outil de migration pour le carnet d'adresses de KDE.

source: is a migration tool for KJots, the KDE note taker.
fr: est un outil de migration pour KJots, un preneur de notes.

source: is a migration tool for kmail.
fr: est un outil de migration pour kmail.

source: is a migration tool for knotes.
fr: est un outil de migration pour knotes.
