Repository: espindula/br-lfs
Catalog: blfs/*/archive/add/konsole.po
Languages: fr

source: 448 KB
fr: 448 Kio

source: 18 MB
fr: 18 Mio

source: Introduction to Konsole
fr: Introduction à Konsole

source: This package provides a terminal emulator for KDE.
fr: Ce paquet fournit un émulateur de terminal pour KDE.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&konsole-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&konsole-download-http;"/>

source: Download (FTP): <ulink url="&konsole-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&konsole-download-ftp;"/>

source: Download MD5 sum: &konsole-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &konsole-md5sum;

source: Download size: &konsole-size;
fr: Taille du téléchargement&nbsp;: &konsole-size;

source: Estimated disk space required: &konsole-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &konsole-buildsize;

source: Estimated build time: &konsole-time;
fr: Estimation du temps de construction&nbsp;: &konsole-time;

source: Konsole Dependencies
fr: Dépendances de Konsole

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: User Notes: <ulink url="&blfs-wiki;/konsole"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/konsole"/>

source: Installation of Konsole
fr: Installation de Konsole

source: Install <application>Konsole</application> by running the following commands:
fr: Installez <application>Konsole</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: konsole and konsoleprofile
fr: konsole et konsoleprofile

source: libkdeinit4_konsole.so, libkonsolepart.so and libkonsoleprivate.so
fr: libkdeinit4_konsole.so, libkonsolepart.so et libkonsoleprivate.so

source: &kde-dir;/share/apps/konsole and &kde-dir;/share/doc/HTML/en/konsole
fr: &kde-dir;/share/apps/konsole et &kde-dir;/share/doc/HTML/en/konsole

source: Short Descriptions
fr: Descriptions courtes

source: is the KDE terminal emulator.
fr: est l'émulateur de terminal de KDE.

source: is a command-line tool to change the current tab's profile options.
fr: est un outil en ligne de commandes pour modifier les options de l'onglet courant.
