Repository: espindula/br-lfs
Catalog: blfs/*/archive/add/okular.po
Languages: fr

source: 1.7 MB
fr: 1.7 Mio

source: 32 MB
fr: 32 Mio

source: Introduction to Okular
fr: Introduction à Okular

source: Okular is a document viewer for KDE. It can view documents of many types including PDF, PostScript, TIFF, Microsoft CHM, DjVu, DVI, XPS and ePub.
fr: Okular est un visualiseur de documents pour KDE. Il peut afficher des documents de nombreux types, tels que les PDF, PostScript, TIFF, Microsoft CHM, DjVu, DVI, XPS et ePub.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&okular-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&okular-download-http;"/>

source: Download (FTP): <ulink url="&okular-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&okular-download-ftp;"/>

source: Download MD5 sum: &okular-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &okular-md5sum;

source: Download size: &okular-size;
fr: Taille du téléchargement&nbsp;: &okular-size;

source: Estimated disk space required: &okular-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &okular-buildsize;

source: Estimated build time: &okular-time;
fr: Estimation du temps de construction&nbsp;: &okular-time;

source: Okular Dependencies
fr: Dépendances de Okular

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: <xref linkend="kactivities"/>, <xref linkend="freetype2"/>, <xref linkend="qimageblitz"/>, <xref linkend="libtiff"/>, <xref linkend="libjpeg"/>, and <xref linkend="poppler"/> (required for PDF support)
fr: <xref linkend="kactivities"/>, <xref linkend="freetype2"/>, <xref linkend="qimageblitz"/>, <xref linkend="libtiff"/>, <xref linkend="libjpeg"/> et <xref linkend="poppler"/> (requis pour le support du PDF)

source: For PDF support in <application>Okular</application> you need to configure <application>Poppler</application> using <option>--enable-xpdf-headers </option>.
fr: Pour le support PDF dans <application>Okular</application> vous devez configurer <application>Poppler</application> en utilisant <option>--enable-xpdf-headers</option>.

source: Optional
fr: Facultatives

source: <xref linkend="libkexiv2"/>, <ulink url="https://projects.kde.org/projects/extragear/base/plasma-mobile">ActiveApp</ulink> (for developing applications for Plasma Active), <ulink url="http://libspectre.freedesktop.org/">libspectre</ulink> (for PostScript support), <ulink url="http://www.jedrea.com/chmlib">libchm</ulink>, <ulink url="http://djvu.org/">DjVuLibre</ulink>, <ulink url="http://sourceforge.net/projects/ebook-tools">libepub</ulink>, and <ulink url="https://projects.kde.org/projects/kde/kdegraphics/kdegraphics-mobipocket">Mobipocket</ulink>
fr: <xref linkend="libkexiv2"/>, <ulink url="https://projects.kde.org/projects/extragear/base/plasma-mobile">ActiveApp</ulink> (pour développer des applications pour Plasma Active), <ulink url="http://libspectre.freedesktop.org/">libspectre</ulink> (pour le support du PostScript), <ulink url="http://www.jedrea.com/chmlib">libchm</ulink>, <ulink url="http://djvu.org/">DjVuLibre</ulink>, <ulink url="http://sourceforge.net/projects/ebook-tools">libepub</ulink> et <ulink url="https://projects.kde.org/projects/kde/kdegraphics/kdegraphics-mobipocket">Mobipocket</ulink>

source: User Notes: <ulink url="&blfs-wiki;/okular"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/okular"/>

source: Installation of Okular
fr: Installation de Okular

source: Install <application>Okular</application> by running the following commands:
fr: Installez <application>Okular</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libokularcore.so and several in &kde-dir;/lib/kde4
fr: libokularcore.so et plusieurs dans &kde-dir;/lib/kde4

source: &kde-dir;/include/okular and several in &kde-dir;/lib and &kde-dir;/share
fr: &kde-dir;/include/okular et plusieurs dans &kde-dir;/lib and &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: is the KDE document viewer.
fr: est le lecteur de document de KDE.
