Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/*/a2ps.xml.1.chaine.po
Languages: ps

source: 2.6 MB
ps: 2.6 Mo

source: 22 MB
ps: 22 Mo

source: Package Information
ps: Informations sur le paquet

source: Download (HTTP):
ps: Téléchargement (HTTP) :

source: Download (FTP):
ps: Téléchargement (FTP) :

source: Download MD5 sum:
ps: Somme de contrôle MD5 du téléchargement :

source: Download size:
ps: Taille du téléchargement :

source: Estimated disk space required:
ps: Estimation de l'espace disque requis :

source: Estimated build time:
ps: Estimation du temps de construction :

source: Additional Downloads
ps: Téléchargements supplémentaires

source: Recommended
ps: Recommandées

source: Optional
ps: Optionnelles

source: User Notes:
ps: Notes utilisateur :

source: Installation of a2ps
ps: Installation d'a2ps

source: Install _A420_ by running the following commands:
ps: Installez _A420_ en lançant les commandes suivantes :

source: To test the results, issue:
ps: Pour tester les résultats, lancez :

source: The _F1022_ test will fail, as there is no default test printer.
ps: Le test _F1022_ échouera, vu qu'il n'y a pas de d'imprimante de test par défaut.

source: The _F1023_ may also fail, as the tests report some inconsistencies between the generated postscript and the reference sets.
ps: Il se peut que _F1023_ échoue vu que tests signalent certaines incohérences entre le postscript généré et les paramètres de référence.

source: This is caused by version number differences between the postscript test files and those generated by the tests &mdash; these do not affect the operation of the program and can be ignored.
ps: Ceci est dû à des différences de numéros de versions entre les fichiers de test postscript et ceux générés par les tests &mdash; cela ne touche pas le déooulement du programme et cela peut être ignoré.

source: Now, as the _U2_ user:
ps: Maintenant, en tant qu'utilisateur _U2_ :

source: If desired, install the downloaded i18n-fonts by running the following commands as the _U2_ user:
ps: Si vous le désirez, installez les polices internationales en lançant les commandes suivantes en tant qu'utilisateur _U2_ :

source: Command Explanations
ps: Explications des commandes

source: This command is used to recreate the _C101_ script.
ps: Cette commande est utilisée pour recréer un script _C101_.

source: This is required because there is an issue in the mktime test which causes the _C101_ script to hang for 60 seconds and then report that there is no working mktime function.
ps: C'est nécessaire car il y a un problème dans le test mktime qui aboutit à ce que le script _C101_ se bloque pendant 60 secondes puis signale signale qu'il n'a trouvé aucun mktime.

source: This fixes a bug in the handling of the version output of _C716_ .
ps: Ceci corrige un bogue dans la gestion de la sortie de la version de _C716_.

source: This command modifies the _C101_ script to search for _A219_ fonts at the location where they were installed by the BLFS instructions.
ps: Cette commande modifie le script _C101_ pour chercher des polices _A219_ à l'endroit où ils sont installés par les instructions de BLFS.

source: Configuration data is installed in _F238_ instead of _F239_ .
ps: Les données de configuration sont installées dans _F238_ et non dans _F239_.

source: This switch enables building the dynamic _F240_ library.
ps: Ce paramètre active la construction de la bibliothèque dynamique _F240_.

source: This switch changes the default paper format to US letter.
ps: Ce paramètre modifie le format du papier par défaut en lettre américaine.

source: It can either be given here or set in _F1024_ after installation.
ps: On peut soit le donner ici soit le paramétrer dans _F1024_ après l'installation.

source: The default is A4, but there are several other options, in particular:
ps: Par défaut, il est en A4, mais il existe plusieurs autres options, en particulier :

source: A4dj or letterdj are good settings for HP Deskjet and other printers that need wider paper-handling margins.
ps: A4dj ou letterdj sont de bons réglages pour les HP Deskjet et d'autres imprimantes exigeant des marges de papier plus larges.

source: See _F1025_ after installation.
ps: Voir _F1025_ après l'installation.

source: This command avoids trying to regenerate the info files.
ps: Cette commande évite d'essayer de régénérer les fichiers info.

source: This is an older package and the current .texi files will produce errors preventing _C649_ from working properly.
ps: C'est un ancien paquet et les fichiers .texi actuels produiront des erreurs empéchant _C649_ de travailler correctement.

source: Configuring a2ps
ps: Configuration d'a2ps

source: Config Files
ps: Fichiers de configuration

source: Configuration Information
ps: Informations de configuration

source: Information about configuring _A420_ can be found in the comments contained in the above files, and also by running _C718_ .
ps: Vous pouvez trouver des informations sur la configuration d'_A420_ dans les commentaires contenus dans dans les fichiers ci-dessous et en lançant _C718_.

source: Contents
ps: Contenu

source: Installed Programs
ps: Programmes installés

source: Installed Libraries
ps: Bibliothèques installées

source: Installed Directories
ps: Répertoires installés

source: a2ps, card, composeglyphs, fixnt, fixps, ogonkify, pdiff, psmandup, psset, and texi2dvi4a2ps
ps: a2ps, card, composeglyphs, fixnt, fixps, ogonkify, pdiff, psmandup, psset, et texi2dvi4a2ps

source: liba2ps.{so, a} and filter data
ps: liba2ps.{so, a} et filter data

source: /etc/a2ps and /usr/share/a2ps
ps: /etc/a2ps et /usr/share/a2ps

source: Short Descriptions
ps: Descriptions courtes

source: is a filter, utilized primarily by printing scripts, that converts standard input or supported files to PostScript.
ps: est un filtre, utilisé d'abord par des scripts d'impression, qui convertit l'entrée standard or des fichiers supportés en PostScript.

source: prints a reference card of a given program's options.
ps: imprime une carte de référence des options d'un programme donné.

source: creates a composite font program.
ps: crée un programme de polices composites.

source: is supposed to fix the problems in the PostScript files generated by the Microsoft PostScript driver under Windows NT (3.5 and 4.0).
ps: est supposé corriger les problèmes dans les fichiers PostScript généré par le pilote Microsoft PostScript sous Windows NT (3.5 et 4.0).

source: tries to fix common PostScript problems that break postprocessing.
ps: essaie de corriger des problèmes habituels PostScript qui casse le traitement a posteriori.

source: provides international support for Postscript by performing various munging of PostScript files related to printing in different languages.
ps: offre le support international pour Postscript en effectuant divers munging de fichiers PostScript liés à l'impression dans différentes langues.

source: produces a pretty comparison between files.
ps: offre une bonne comparaison entre des fichiers.

source: tries to produce a version of a given PostScript file to print in manual duplex.
ps: essaie de produire une version d'un fichier PostScript donné pour une impression en duplex manuel.

source: produces a version of a given PostScript file with a protected call to the PostScript operator 'setpagedevice'.
ps: produit une version d'un fichier PostScript avec un appel protégé à l'opérateur PostScript 'setpagedevice'.

source: Typical use is making a file print duplex, or on the manual tray, etc.
ps: L'utilisation classique est de faire une impression de fichiers en duplex, ou sur le plateau manuel, etc.

source: compiles Texinfo and LaTeX files to DVI or PDF
ps: compile des fichiers Texinfo et LaTeX en DVI ou PDF
