Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/*/fop.xml.1.chaine.po
Languages: ps

source: 23 MB
ps: 23 Mo

source: 342 MB
ps: 342 Mo

source: 3.4 MB
ps: 3.4 Mo

source: Package Information
ps: Informations sur le paquet

source: Download (HTTP):
ps: Téléchargement (HTTP) :

source: Download (FTP):
ps: Téléchargement (FTP) :

source: Download MD5 sum:
ps: Somme de contrôle MD5 du téléchargement :

source: Download size:
ps: Taille du téléchargement :

source: Estimated disk space required:
ps: Estimation de l'espace disque requis :

source: Estimated build time:
ps: Estimation du temps de construction :

source: Additional Downloads
ps: Téléchargements supplémentaires

source: or
ps: ou

source: Required patch
ps: Correctif requis

source: Required
ps: Requises

source: Optional
ps: Optionnelles

source: User Notes:
ps: Notes utilisateur :

source: Installation of fop
ps: Installation de fop

source: Ensure _E310_ is set correctly before beginning the build.
ps: Assurez-vous que _E312_ est correctement paramétré avant de commencer la construction.

source: To build the _A772_ and/or _A773_ extension classes, ensure the corresponding _F393_ files can be found via the _E40_ environment variable.
ps: Pour construire les classes d'extension _A772_ et/u _A773_ , assurez-vous que les fichiers _F393_ correspondant peuvent être trouvés par la variable d'environnement _E40_.

source: Install the JAI API components.
ps: Installez les composants de l'API de JAI.

source: As the _U2_ user:
ps: En tant qu'utilisateur _U2_ :

source: Installing fop Components
ps: Installer les composants fop

source: The _C1439_ command coming with OpenJDK 8 has become much stricter than before regarding the conformance of the Javadoc comments in source code to HTML.
ps: La commande _C1439_ venant avec OpenJDK 8 est devenu plus strict qu'avant à propos de la conformité des commentaires javadoc dans le code source vers l'HTML.

source: The FOP documentation does not meet those standard, so the conformance checks have to be disabled.
ps: La documentation de FOP ne respecte pas ces stantards, aussi les tests de conformité ont été désactivés.

source: This can be done with the following command:
ps: Cela peut être fait avec la commande suivante :

source: Then, compile _A774_ by running the following commands:
ps: Ensuite, compilez _A774_ en lançant les commandes suivantes :

source: To test the application, run _C1440_ .
ps: Pour tester l'application, lancez _C1440_.

source: The hyphenation tests will fail.
ps: Les tests de césure échoueront.

source: To see a list of other test targets, use _C1441_ .
ps: Pour voir une liste des autres cibles de test, utilisez _C1441_.

source: You must run the tests from an X-window using a GL-aware _A261_ server or some of the _A372_ tests will hang.
ps: Vous devez lancer les tests depuis un X-window utilisant un serveur GL-aware de _A261_ ou certains des tests de _A372_ planteront.

source: Now, as the _U2_ user:
ps: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
ps: Explications des commandes

source: This reads the file _F1220_ and builds the target files.
ps: Cela lit le fichier _F1220_ et construit les fichiers cibles.

source: This is optional and creates a convenience symlink so that _E311_ doesn't have to be changed each time there's a package version change.
ps: C'est facultatif et cela crée un lien symbolique commode pour qu'on n'ait pas besoin de modifier _E313_ à chaque fois qu'il y a un changement de version de paquet.

source: Configuring fop
ps: Configuration de fop

source: Config Files
ps: Fichiers de configuration

source: Configuration Information
ps: Informations de configuration

source: Using _A774_ to process some large FO's (including the FO derived from the BLFS XML sources), can lead to memory errors.
ps: L'utilisationn de _A774_ pour traiter certains gros FO's (y compris les FO dérivés des sources XML de BLFS), peut conduire à des erreurs de mémoire.

source: Unless you add a parameter to the _C1444_ command used in the _C1445_ script you may receive messages similar to the one shown below:
ps: Sauf si vous ajoutez un paramètre à la commande _C1444_ , utilisé dans le script _C1445_ , il se peut que vous receviez des messages similaires à celui décrit ci-dessous :

source: To avoid errors like this, you need to pass an extra parameter to the _C1444_ command used in the _C1445_ script.
ps: Pour éviter des erreurs comme ça, vous avez besoin de passer un paramètre supplémentaire à la commande _C1444_ utilisé dans le script _C1445_.

source: This can be accomplished by creating a _F1221_ (which is sourced by the _C1445_ script) and adding the parameter to the _E42_ environment variable.
ps: On peut faire cela en créant un _F1221_ (dont la soupee est dans le script _C1445_) et en ajoutant le paramètre à la variable d'environnement _E42_.

source: The _C1445_ script looks for a _E43_ environment variable to locate the _A774_ class libraries.
ps: Le script _C1445_ cherche une variable d'environement _E43_ pour localiser les bibliothèques de la classe _A774_.

source: You can create this variable using the _F1221_ file as well.
ps: Vous pouvez créer cette variable en utilisant aussi le fichier _F1221_.

source: Create a _F1221_ file using the following commands:
ps: Créez un fichier _F1221_ en utilisant les commandes suivantes :

source: Replace
ps: Remplacez

source: with a number representing the amount of RAM installed in your computer (in megabytes).
ps: par un nombre représentant la quantité de RAM installée sur votre ordinateur (en mégaoctets).

source: An example would be
ps: Un exemple serait

source: To include the _C1445_ script in your path, update your personal or system-wide profile with the following:
ps: Pour inclure le script _C1445_ dans votre path, mettez à jour votre profil personnel ou pour tout le système avec ce qui suit :

source: Running _C1445_ can be somewhat verbose.
ps: L'exécution de _C1445_ peut être un peu verbeuse.

source: The default logging level can be changed from INFO to any of FINEST, FINER, FINE, CONFIG, INFO, WARNING, SEVERE, ALL, or OFF.
ps: Le niveau de journalisation par défaut peut être changé à INFO pour toutes les varibales FINEST, FINER, FINE, CONFIG, INFO, WARNING, SEVERE, ALL, ou OFF.

source: To do this, edit _F1222_ and change the entries for _O198_ and _O199_ to the desired value.
ps: Pour faire cela, éditez _F1223_ et changez les entrées pour _O198_ et _O199_ à la valeur désirée.

source: Contents
ps: Contenu

source: Installed Programs
ps: Programmes installés

source: Installed Libraries
ps: Bibliothèques installées

source: Installed Directory
ps: Répertoire installé

source: fop.jar and numerous support library classes located in _F394_ ; JAI components include libmlib_jai.so, jai_codec.jar, jai_core.jar, and mlibwrapper_jai.jar
ps: fop.jar et numerous support library classes located in _F394_ ; JAI components include libmlib_jai.so, jai_codec.jar, jai_core.jar, et mlibwrapper_jai.jar

source: Short Descriptions
ps: Descriptions courtes

source: is a wrapper script to the _C1444_ command which sets up the _A774_ environment and passes the required parameters.
ps: est un script enveloppe pour la commande _C1444_ qui paramètre l'environnement _A774_ et passe les paramètres requis.

source: contains all the _A774_ _A370_ classes.
ps: contient toutes les classes _A370_ de _A774_.
