Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome-obsolete/gnome-vfs-monikers.po
Languages: fr

source: 254 KB
fr: 254 Kio

source: 4 MB
fr: 4 Mio

source: Introduction to GNOME VFS Monikers
fr: Introduction à GNOME VFS Monikers

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-vfs-monikers-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-vfs-monikers-download-http;"/>

source: Download (FTP): <ulink url="&gnome-vfs-monikers-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-vfs-monikers-download-ftp;"/>

source: Download MD5 sum: &gnome-vfs-monikers-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-vfs-monikers-md5sum;

source: Download size: &gnome-vfs-monikers-size;
fr: Taille du téléchargement&nbsp;: &gnome-vfs-monikers-size;

source: Estimated disk space required: &gnome-vfs-monikers-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-vfs-monikers-buildsize;

source: Estimated build time: &gnome-vfs-monikers-time;
fr: Estimation du temps de construction&nbsp;: &gnome-vfs-monikers-time;

source: GNOME VFS Monikers Dependencies
fr: Dépendances de GNOME VFS Monikers

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/gnome-vfs-monikers"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-vfs-monikers"/>

source: Installation of GNOME VFS Monikers
fr: Installation de GNOME VFS Monikers

source: Install <application>GNOME VFS Monikers</application> by running the following commands:
fr: Installez <application>GNOME VFS Monikers</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés
