Repository: espindula/br-lfs
Catalog: blfs/*/archive/gnome-obsolete/liboobs.po
Languages: fr

source: 361 KB
fr: 361 Kio

source: 9 MB
fr: 9 Mio

source: Introduction to liboobs
fr: Introduction à liboobs

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&liboobs-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&liboobs-download-http;"/>

source: Download (FTP): <ulink url="&liboobs-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&liboobs-download-ftp;"/>

source: Download MD5 sum: &liboobs-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &liboobs-md5sum;

source: Download size: &liboobs-size;
fr: Taille du téléchargement&nbsp;: &liboobs-size;

source: Estimated disk space required: &liboobs-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &liboobs-buildsize;

source: Estimated build time: &liboobs-time;
fr: Estimation du temps de construction&nbsp;: &liboobs-time;

source: liboobs Dependencies
fr: Dépendances de liboobs

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/liboobs"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/liboobs"/>

source: Installation of liboobs
fr: Installation de liboobs

source: Install <application>liboobs</application> by running the following commands:
fr: Installez <application>liboobs</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directory
fr: Répertoire installé

source: Short Descriptions
fr: Descriptions courtes

source: contains the <application>liboobs</application> API functions.
fr: Contient les fonctions de l'API de <application>liboobs</application>
