Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/shells/tcsh.xml.1.chaine.po
Languages: fr

source: 928 KB
fr: 928 Ko

source: 15 MB (with tests)
fr: 15 Mo (avec les tests)

source: 0.2 SBU (with tests)
fr: 0.2 SBU (avec les tests)

source: Introduction to Tcsh
fr: Introduction à Tcsh

source: The _A625_ package contains
fr: Le paquet _A625_ contient

source: an enhanced but completely compatible version of the Berkeley Unix C shell (_C1535_ )
fr: une version améliorée mais pleinement compatible du shell Berkeley Unix C (_C1535_)

source: This is useful as an alternative shell for those who prefer C syntax to that of the _C1427_ shell, and also because some programs require the C shell in order to perform installation tasks.
fr: Il est utile en tant que shell alternatif pour ceux qui préfèrent la syntaxe C à celle du shell _C1427_ , et ausssi car certains programmes ont besoin d'un shell C pour effectuer des tâches d'installation.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: User Notes:
fr: Notes utilisateur :

source: Installation of Tcsh
fr: Installation de Tcsh

source: First, fix the package for gcc5 optimizations:
fr: Pour commencer, corrigez le paquet pour les optimisations de gcc5 :

source: Install _A625_ by running the following commands:
fr: Installez _A625_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This updates some deprecated Perl code.
fr: Cela met à jour du code Perl obsolète.

source: This installs the _C1537_ program in _F654_ instead of _F655_ .
fr: Ceci installe le programme _C1537_ dans _F654_ et non dans _F655_.

source: This creates HTML documentation from the formatted man page.
fr: Ceci crée la documentation HTML à partir de la page de man formatée.

source: The FHS states that if there is a _A130_ shell installed, there should be a symlink from _F656_ to it.
fr: Le FHS pose que si un shell _A130_ est installé, il devrait y avoir un lien symbolique de _F656_ vers lui.

source: This creates that symlink.
fr: Ceci crée ce lien symbolique.

source: Configuring Tcsh
fr: Configuration de Tcsh

source: Config Files
fr: Fichiers de configuration

source: There are numerous configuration files for the C shell.
fr: Il y a beaucoup de fichiers de configuration pour le shell C.

source: Examples of these are _F657_ , _F658_ , _F659_ , _F660_ , _F661_ , _F662_ , _F663_ , _F664_ , and _F665_ .
fr: Des exemples de ces derniers sont constitués par _F657_ , _F658_ , _F659_ , _F660_ , _F661_ , _F662_ , _F663_ , _F664_ et _F665_.

source: More information on these files can be found in the _F666_ man page.
fr: Vous pouvez trouver plus d'informations sur ces fichiers sur la page _F666_.

source: Configuration Information
fr: Informations de configuration

source: Update _F502_ to include the C shell program names (as the _U1_ user):
fr: Mettez à jour _F502_ pour inclure les noms de programme de shell C (en tant qu'utilisatekr _U1_) :

source: The following _F661_ provides two alternative colour prompts and coloured _C1540_ output.
fr: Le _F661_ suivant fournit deux alternatives de couleur pour l'invite et pour la sortie colorisée de _C1540_.

source: If you prefer a global modification, issue the command as the _U1_ user, replacing _F661_ by _F657_ .
fr: SI vous préférez une modification globale, tapez la commande en tant qu'utilisateur _U1_, en remplacant _F661_ par _F657_.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is an enhanced but completely compatible version of the Berkeley Unix C shell, _C1535_ .
fr: est une version améliorée mais complètement compatible du shell Berkeley Unix C, _C1535_.

source: It is usable as both an interactive shell and a script processor.
fr: On peut l'utiliser aussi bien en tant que shell interactif qu'en tant que manipulateur de scripts.
