Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/shells/zsh.xml.1.chaine.po
Languages: fr

source: 2.7 MB
fr: 2.7 Mo

source: 64 MB (includes documentation and tests)
fr: 124 Mo (includes documentation and tests)

source: 3.0 MB
fr: 3.0 Mo

source: Introduction to zsh
fr: Introduction à ZSH

source: The _A626_ package contains a command interpreter (shell) usable as an interactive login shell and as a shell script command processor.
fr: Le paquet _A626_ contient un interpréteur de commandes (shell) utilisable en tant que shell de connexion interactif et en tant que manipulateur de commandes de shell script.

source: Of the standard shells, _A626_ most closely resembles _A627_ but includes many enhancements.
fr: Parmi les shells standards, _A626_ est l'un des plus ressemblant à _A627_ mais il comprend beaucoup d'améliorations.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Optional Documentation:
fr: Documentation facultative :

source: Documentation MD5 sum:
fr: Somme de contrôle MD5 de la documentation :

source: Documentation download size:
fr: Taille de téléchargement de la documentation :

source: When there is a new _A626_ release, the old files shown above are moved to a new server directory:
fr: Quand il y a une nouvelle publication de _A626_ , les anciens fichiers montrés précédement sont déplacés dans un nouveau répertoire du serveur :

source: zsh Dependencies
fr: Dépendances de ZSH

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of zsh
fr: Installation de ZSH

source: If you downloaded the optional documentation, unpack it with the following command:
fr: Si vous avez téléchargé la documentation facultative, déballez-la avec la commande suivante :

source: Install _A626_ by running the following commands:
fr: Installez _A626_ en lançant les commandes suivantes :

source: If you have _X99_ installed, you can build PDF format of the documentation by issuing the following command:
fr: Si vous avez installé _X99_ , vous pouvez construire des formats supplémentaires de la documentation en exécutant tout ou partie des commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you downloaded the optional documentation, install it by issuing the following commands as the _U1_ user:
fr: Si vous avez téléchargé la documentation facultative, installez-la en exécutant les commandes suivantes en tant qu'utilisateur _U1_ :

source: If you built the PDF format of the documentation, install it by issuing the following command as the _U1_ user:
fr: Si vous avez construit la documentation au format PDF , installez-le en exécutant la commande suivante en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: These parameters are used so that all the _A626_ configuration files are consolidated into the _F667_ directory.
fr: Ces paramètres sont utilisés pour que tous les fichiers de configuration _A626_ soient regroupés dans le répertoire _F667_.

source: Omit these parameters if you wish to retain historical compatibility by having all the files located in the _F133_ directory.
fr: Ne mettez pas ces paramètres si vous souhaitez assurer une compatibilité historique en mettant tous les fichiers dans le répertoire _F133_.

source: This parameter places the _C1541_ binaries into the root filesystem.
fr: Ce paramètre met les binaires _C1541_ dans le système de fichiers racine.

source: This option enables POSIX capabilities.
fr: Ce paramètre active les possibilités POSIX.

source: This option disables the use of the _A336_ library.
fr: Ce paramètre désactive l'utilisation de la bibliothèque _A336_.

source: This option allows zsh to use the _A60_ regular expression library in shell builtins.
fr: Ce paramètre permet à zsh d'utiliser la bibliothèque d'expression régulière _A60_ dans les intégrations du shell.

source: Multiple partitions
fr: Plusieurs partitions

source: Linking _A626_ dynamically against _A628_ and/or _A629_ produces runtime dependencies on _F668_ and/or _F669_ respectively, which both reside in _F190_ hierarchy.
fr: Lier dynamiquement _A626_ à _A628_ et/ou à _A629_ donne des dépendances, au moment de l'exécution, respectivement de _F668_ et/ou de _F669_ , qui se trouvent tous dans la hiérarchie _F190_.

source: If _F190_ is a separate mount point and _A626_ needs to be available in boot time, then its supporting libraries should be in _F670_ too.
fr: Si _F190_ est un point de montage séparé et si _A626_ doit être disponible au moment du démarrage, ses bibliothèques de support devraient se trouver aussi dans _F670_.

source: You can move the libraries as follows:
fr: Vous pouvez déplacer les bibliothèques comme suit :

source: Alternatively you can statically link _A626_ against _A628_ and _A629_ if you modify the _F671_ file (you need first to run configure to generate it).
fr: Vous pouvez aussi lier statiquement _A626_ à _A628_ et à _A629_ si vous modifiez le fichier _F671_ (vous devez d'abord lancer configure pour le générer).

source: Configuring zsh
fr: Configuration de ZSH

source: Config Files
fr: Fichiers de configuration

source: There are a whole host of configuration files for _A626_ including _F672_ , _F673_ , _F674_ , _F675_ and _F676_ .
fr: Il y a tout un tas de fichiers de configuration pour _A626_ , incluant _F672_ , _F673_ , _F674_ , _F675_ et _F676_.

source: You can find more information on these in the _F677_ and related manual pages.
fr: Vous pouvez trouver plus d'informations à leur sujet dans _F677_ et les pages de manuel qui s'y rapportent.

source: The first time zsh is executed, you will be prompted by messages asking several questions.
fr: La première fois que zsh est lancé, vous devrez répondre à quelques questions.

source: The answers will be used to create a _F678_ file.
fr: Les réponses seront utilisées pour créer un fichier _F678_.

source: If you wish to run these questions again, run _C1542_ .
fr: Si vous souhaitez lancer ces questions de nouveau , lancez _C1542_.

source: There are several built-in advanced prompts.
fr: Il y a plusieurs prompts avancés de construits.

source: In the _C1541_ shell, start advanced prompt support with _C1543_ , then _C1544_ .
fr: Dans le shell _C1541_ , démarrez le support des prompts avancés avec _C1543_ , ensuite _C1544_.

source: Available prompt names are listed with _C1545_ .
fr: Les noms des prompts disponible sont listés avec _C1545_.

source: Select a particular one with _C1546_ .
fr: Selectionnez en un en particulier avec _C1546_.

source: Display all available prompts with _C1547_ .
fr: Affichez tous les prompts disponibles avec _C1547_.

source: Except for the list and display commands above, you can insert the other ones in _F678_ to be automatically executed at shell start, with the prompt you chose.
fr: Sauf pour la liste et les commandes d'affichages , vous pouvez insérer les autres dans _F678_ pour être automatiquement exécutées au démarrage du shell, avec le prompt de votre choix.

source: Configuration Information
fr: Informations de configuration

source: Update _F502_ to include the _A626_ shell program names (as the _U1_ user):
fr: Mettez à jour _F502_ pour inclure les noms de programme shell _A626_ (en tant qu'utilisatekr _U1_) :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: zsh and zsh-&zsh-version; (hardlinked to each other)
fr: zsh et zsh-&zsh-version; (lié en dur à chacun des autres)

source: Numerous plugin helper modules under /usr/lib/zsh/&zsh-version;/
fr: Plusieurs greffons de modules d'aide sous /usr/lib/zsh/&zsh-version;/

source: is a shell which has command-line editing, built-in spelling correction, programmable command completion, shell functions (with autoloading), a history mechanism, and a host of other features.
fr: est un shell pour éditer la ligne de commande, qui a une fonction de vérification d'orthographe, de complétion programmable des commandes, des fonctions shell (avec autochargement), un mécanisme d'historique et un tas d'autres fonctionnalités.
