Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/editors/emacs.xml.1.chaine.po
Languages: fr

source: 38 MB
fr: 38 Mo

source: 474 MB
fr: 474 Mo

source: Introduction to Emacs
fr: Introduction à Emacs

source: The _A599_ package contains an extensible, customizable, self-documenting real-time display editor.
fr: Le paquet _A599_ contient un éditeur extensible, personnalisable et dont l'affichage assure une autodocumentation.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Emacs Dependencies
fr: Dépendances d'Emacs

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Emacs
fr: Installation de Emacs

source: Install _A599_ by running the following commands:
fr: Installez _A599_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: If make succeeds, you can test the result by running _C1391_ , which is the program that will be installed, with its auxiliary files.
fr: si make réussi, vous pouvez tester le résultat en lançant _C1391_ , qui est le programme qui sera installé, avec ses fichiers auxiliaires.

source: This should start and display the application opening screen.
fr: Cela doit démarrer et afficher l'écran d'acceuil de l'application.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: This package installs icon files into the _F564_ hierarchy and desktop files into the _F565_ hierarchy.
fr: Ce paquet installe des fichiers d'icones dans la hiérarchie _F564_ et des fichiers de bureau dans la hiérarchie _F565_.

source: You can improve system performance and memory usage by updating _F566_ and _F157_ .
fr: vous pouvez améliorer la performance du système et l'utilisation de la mémoire en mettant à jour _F566_ et _F157_.

source: installed (for the icon cache) and
fr: installé (pour le cache des icones) et

source: (for the desktop cache) and issue the following commands as the _U1_ user:
fr: (pour le cache bureau) et tapez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Create game score files in _F567_ instead of _F568_ .
fr: Crée des fichiers de score de jeu dans _F567_ et non dans _F568_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: creates cross-reference tagfile database files for source code.
fr: crée des fichiers de base de données de tagfiles à références croisées pour du code source.

source: permits browsing of C++ class hierarchies from within _C1394_ .
fr: permet de naviguer dans des hiérarchies de classe C++ depuis l'intérieur d'_C1394_.

source: is an editor.
fr: est un éditeur.

source: attaches an _C1394_ session to an already running _C1396_ instance.
fr: attache une session _C1394_ à une session _C1396_ déjà en cours d'exécution.

source: is another program to generate source code cross-reference tagfiles.
fr: est un autre programme pour générer des tagfiles de références croisées de code source.

source: prints entries in Change Logs matching various criteria.
fr: écrit des entrées dans des historiques des changements en fonction de divers critères.
