Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/editors/vim.xml.1.chaine.po
Languages: fr

source: 9.4 MB
fr: 9.4 Mo

source: 90 MB
fr: 90 Mo

source: Introduction to Vim
fr: Introduction à Vim

source: The _A563_ package, which is an abbreviation for VI IMproved, contains a _C536_ clone with extra features as compared to the original _C536_ .
fr: Le paquet _A563_ , qui est l'abréviation de VI IMproved.

source: The default LFS instructions install _A594_ as a part of the base system.
fr: &lfs78_checked; .

source: If you would prefer to link _A594_ against _A595_ , you should recompile _A594_ to enable GUI mode.
fr: Les instructions par défaut de LFS installent _A595_ comme composant du système de base.

source: There is no need for special instructions since _A595_ support is automatically detected.
fr: Si vous préférez lier _A595_ à _A_ , vous devriez recompiler _A_ pour activer le mode GUI.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Vim Dependencies
fr: Dépendances de Vim

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Vim
fr: Installation de Vim

source: If you recompile _A563_ to link against _A595_ and your _A595_ libraries are not on the root partition, you will no longer have an editor for use in emergencies.
fr: Si vous recompilez _A563_ pour le lier à _A595_ et si vos bibliothèques _A595_ ne sont pas sur la partition racine, vous n'aurez plus d'éditeur en cas d'utilisation en urgence.

source: You may choose to install an additional editor, not link _A563_ against _A595_ , or move the current _C350_ executable to the _F222_ directory under a different name such as _F550_ .
fr: Vous pouvez choisir d'installer un éditeur supplémentaire, de ne pas lier _A563_ à _A595_ , ou de déplacer l'exécutable _C350_ actuel vers le répertoire _F222_ sous un nom différent tels que _F550_.

source: Install _A563_ by running the following commands:
fr: Installez _A563_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: The _A594_ test suite outputs a lot of binary data to the screen, which can cause issues with the settings of the current terminal.
fr: La suite de tests de _A594_ sort beaucoup de données binaires à l'écran, ce qui peut poser problème avec les paramètres du terminal actuel.

source: This can be resolved by redirecting the output to a log file.
fr: On peut résoudre cela en redirigeant la sortie vers un fichier journal.

source: Even if one of the tests fails to produce the file _F551_ in _F552_ , the remaining tests will still be executed.
fr: Même si un des tests ne parvient pas à produire le fichier _F551_ dans _F552_ , le reste des tests sera quand même exécuté.

source: If all goes well,the final message in the log file will be
fr: Si tout se passe bien, le message final du fichier journal sera

source: Note
fr: Remarque

source: Some color tests expect to be executed under the _C678_ terminal emulator.
fr: Des tests en couleurs s'attendent à s'exécuter sous l'émulateur de terminal _C678_.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: The following symlink allows the documentation to be accessed via _F554_ , making it consistent with the location of documentation for other packages:
fr: Le lien symbolique suivant permet un accès à la documentation via _F554_ , devenant cohérent avec l'emplacement de la documentation d'autres paquets :

source: If you wish to update the runtime files, issue the following command (requires _X347_ ):
fr: Si vous souhaitez mettre à jour les fichiers au moment de l'exécution, lancez la commande suivante (requiert _X347_) :

source: To install the runtime files and regenerate the _F555_ file, as the _U1_ user issue:
fr: Pour installer les fichiers au moment du lancement et régénérer le fichier _F555_ , en tant qu'utilisateur _U1_, lancez :

source: Command Explanations
fr: Explications des commandes

source: This sed fixes compilation with _A596_ 5.3.
fr: Cette commande corrige la construction avec _A596_ 5.3.

source: This switch enables all the additional features available in _A563_ , including support for multibyte characters.
fr: Ce correctif active toutes les fonctionnalités supplémentaires disponibles dans _A563_ , incluant le support pour les caractères mmulti-octets.

source: This switch forces Vim to link against the _F556_ library.
fr: Ce paramètre force vim à se lier contre la bibliothèque _F556_.

source: This will prevent compilation of the GUI.
fr: Cela empêchera la compilation de la GUI.

source: If you prefer not to link _A563_ against _A595_ , use this switch.
fr: Si vous préférez ne pas lier _A563_ à _A595_ , utilisez ce paramètre.

source: These options include the Perl, Python, Tcl, or Ruby interpreters that allow using other application code in _A594_ scripts.
fr: Ces options incluent les interpréteurs Perl, Python, Tcl, ou Ruby qui permettent d'utiliser un autre code d'application dans des scripts _A594_.

source: Configuring Vim
fr: Configuration de Vim

source: Config Files
fr: Fichiers de configuration

source: If desired, create a menu entry for graphical vim, _F559_ , as the _U1_ user
fr: si vous le souhaitez, créez une entrée de menu pour vim graphique, _F559_ , en tant qu'utilisateur _U1_

source: Configuration Information
fr: Informations de configuration

source: This setting will enable spell checking for the Russian language for the current session.
fr: Ce paramètre activera la vérification de l'orthographe pour le russe pour la session actuelle.

source: By default, _A563_ only installs spell files for the English language.
fr: Par défaut, _A563_ n'installe que des dictionnaires pour l'anglais.

source: Contents
fr: Contenu

source: A list of the reinstalled files, along with their short descriptions can be found in the _L1854_
fr: Vous pouvez trouver une liste des fichiers réinstallés et de leurs descriptions courtes dans les _L1854_

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: gview, gvim, gvimdiff, rgview, and rgvim
fr: gview, gvim, gvimdiff, rgview, et rgvim

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: starts _C349_ in read-only mode.
fr: lance _C349_ en mode lecture seule.

source: is the editor that runs under _A595_ and includes a GUI.
fr: est l'éditeur fonctionnant sous _A595_ et incluant une GUI.

source: edits two or three versions of a file with _C349_ and shows the differences.
fr: édite deux ou trois versions d'un fichier avec _C349_ et affiche les différences.

source: is a restricted version of _C1386_ .
fr: est une version restreinte de _C1386_.

source: is a restricted version of _C349_ .
fr: est une version restreinte de _C349_.
