Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/plasma5/plasma-all.xml.1.chaine.po
Languages: fr

source: 1.2 GB
fr: 1.2 Go

source: Building Plasma 5
fr: Construction de Plasma 5

source: KDE Plasma 5 is a collection of packages based on top of KDE Frameworks 5 and QML.
fr: KDE Plasma 5 est une collection de paquets basés sur KDE Frameworks 5 et QML.

source: It has been derived from the monolithic KDE 4 desktop.
fr: Il est dérivé du bureau monolithique KDE 4.

source: They implement the KDE Display Environment (Plasma 5).
fr: Ils implémentent l'environnement d'affichage KDE (Plasma 5).

source: The instructions below build all of the Plasma 5 packages in one step by using a bash script.
fr: Les instructions suivantes construisent tous les paquets Plasma 5 en une étape en utilisant un script bash.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Plasma 5 Dependencies
fr: Dépendances de Plasma 5

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Downloading KDE Plasma5
fr: Téléchargement de KDE Plasma5

source: The easiest way to get the KDE Plasma5 packages is to use a single _C1618_ to fetch them all at once:
fr: La meilleure façon d'avoir les paquets de KDE Plasma5 est d'utiliser un seul _C1618_ pour les avoir tous en meme temps :

source: Setting Package Order
fr: Initialisation de l'ordre des paquets

source: The order of building files is important due to internal dependencies.
fr: L'ordre de constructions des fichiers est importants à cause de dépendances internes.

source: Create the list of files in the proper order as follows:
fr: Créez la liste des fichiers dans le bon ordre comme suivant :

source: First, start a subshell that will exit on error:
fr: Tout d'abord, démarrez un sous-shell d'où on sortira en cas d'erreur :

source: Install all of the packages by running the following commands:
fr: Installez toutes les paquets en lançant les commandes suivantes :

source: Command Explanations
fr: Explications des commandes

source: Create symbolic links so qml files can find needed javascript modules.
fr: Crée des liens symboliques pour que les fichiers qml puissent trouver les modules javascript nécéssaire.

source: Starting Plasma5
fr: Démarrage de Plasma5

source: If you have KDE4 installed as well as Plasma 5, make sure the PATH environment setting has the Plasma 5 binaries before the KDE4 entry.
fr: Si vous avez installé KDE4 et Plasma 5, soyez certain de l'initialisation de la variable d'environnement PATH sur les binaires Plasma5 avant l'entrée pour KDE4.

source: You can ensure this by running:
fr: Vous pouveza vous assurer de cela en lançant :

source: before running startx.
fr: avant de lancer startx.

source: You can start _A680_ from runlevel 3, using _X50_ , or from runlevel 5, using a Display Manager, such as _X51_ .
fr: Vous pouvez démarrer _A680_ depuis le runlevel 3, en utilisant _X50_ , ou depuis le runlevel 5, en utilisant un gestionnaire d'affichage, comme _X51_.

source: To start _A681_ using _X50_ , run the following commands:
fr: Pour démarrer _A681_ en utilisant _X50_ , lancez les commandes suivantes :

source: The X session starts on the first unused virtual terminal, normally vt7.
fr: La session X démarrer dans le premier terminal virtuel inutilisé, normallement vt7.

source: You can switch to another vt
fr: VOus pouvez passer à un autre vt

source: simultaneously pressing the keys Ctrl-Alt-F
fr: en appuyant simultanément les touches Ctrl-Alt-F

source: To switch back to the X session, normally started at vt7, use Ctrl-Alt-F7.
fr: Pour aller sur la session X, normallement démarrée sur vt7, utilisez Ctrl-Alt-F7.

source: The vt where the command _C40_ was executed will display many messages, including X starting messages, applications automatically started with the session, and eventually, some warning and error messages.
fr: Le vt ou la commande _C40_ est exacuté affichera beaucoup de messages, incluant les messages de demarrage de X, les applications automatiquement démarrées avec la session, et eventuellement, quelques avertissements et messages d'erreur.

source: You may prefer to redirect those messages to a log file, which not only will keep the initial vt uncluttered, but can also be used for debugging purposes.
fr: Vous pouvez préférer rediriger ces messages dans un fichier de log, qui non seulement laissera le vt initial propre, mais pourra aussi être utilisé pour des questions de deboguage.

source: This can be done starting X with:
fr: Cela peut être fait en démarrant X avec :

source: You may wish to drop consolekit and/or dbus-launch, e.g., just using startkde in ~/.xinitrc.
fr: Vous pouvez souhaiter éviter consolekit et/ou dbus-launch, e.g., en utilisant juste startkde dans ~/.xinitrc.

source: However some capabilities such as mounting or umounting file systems from a file manager will not be possible, or the reboot option may be absent or inoperative, among other problems.
fr: Cependant quelques fonctionnalités comme le montage ou le démontage des systèmes de fichiers depuis un gestionnaire de fichiers ne seront pas possible, ou l'option de redémarrage peut être absente ou inopérant, en plus d'autres problèmes.

source: When shutting down or rebooting, the shutdown messages appear on the vt where X was running.
fr: Au redémarrage ou à l'arret, les messages d'arrêt apparaissent sur le vt ou X était lancé.

source: If you wish to see those messages, simultaneously press keys Alt-F7 (assuming that X was running on vt7).
fr: si vous voulez voir ces messages, appuyez simultanément sur Alt-F7 (en considérant que X était lancé sur vt7).

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: There are too many plasma programs (50 in /opt/kf5/bin) to list separately here.
fr: Il y a trop de programmes plasma (50 dans /opt/kf5/bin) pour les lister séparément ici.

source: There are too many plasma libraries (39 in /opt/kf5/lib) to list separately here.
fr: Il y a trop de bibliothèques plasma (39 dans /opt/kf5/lib) pour les lister séparément ici.

source: There are too many plasma directories (over 1000 in /opt/kf5) to list separately here.
fr: Il y a trop de répertoires plasma (plus de 1000 dans /opt/kf5) pour les lister séparément ici.
