Repository: espindula/br-lfs
Catalog: clfs/*/system-config/common/clock.po
Languages: fr

source: Configuring the system clock
fr: Configurer l'horloge système

source: configuring
fr: configuration

source: This section discusses how to configure the <command>systemd-timedated</command> system service, which configures system clock and timezone.
fr: Cette section explique comment configurer le service système <command>systemd-timedated</command>, qui configure l'horloge système et le fuseau horaire.

source: Systemd provides a <command>timedatectl</command> utility which is used to communicate with <command>systemd-timedated</command>. It can be used to set the system clock in local time or UTC time, depending on the hardware clock setting. By default, <command>systemd-timedated</command> will assume that clock is set to UTC time.
fr: Systemd fournit un utilitaire <command>timedatectl</command> utilisé pour communiquer avec <command>systemd-timedated</command>. On peut l'utiliser pour ajuster l'heure local ou l'heure UTC selon les réglages de votre horloge matérielle. Par défaut, <command>systemd-timedated</command> suppose que votre horloge est réglée sur UTC.

source: If you cannot remember whether or not the hardware clock is set to UTC, find out by running the <userinput>hwclock --localtime --show</userinput> command. This will display what the current time is according to the hardware clock. If this time matches whatever your watch says, then the hardware clock is set to local time. If the output from <command>hwclock</command> is not local time, chances are it is set to UTC time. Verify this by adding or subtracting the proper amount of hours for the timezone to the time shown by <command>hwclock</command>. For example, if you are currently in the MST timezone, which is also known as GMT -0700, add seven hours to the local time.
fr: Si vous ne vous souvenez pas si votre horloge matérielle est réglée en UTC, exécutez <userinput>hwclock --localtime --show</userinput>. Cette commande va afficher l'heure de votre horloge matérielle. Si cela correspond, votre horloge matérielle est à l'heure locale. Si la sortie de <command>hwclock</command> n'est pas l'heure locale, il y a de fortes chances que l'horloge matérielle soit en UTC. Pour vérifier cela, ajoutez ou soustrayez le nombre d'heure correspondant à votre fuseau horaire à l'heure affichée par <command>hwclock</command>. Par exemple si vous êtes dans le fuseau de Paris, qui est à GMT +02 en heure d'été ou +01 en heure d'hiver, soustrayez deux ou une heure à l'heure locale.

source: <command>systemd-timedated</command> reads <filename>/etc/adjtime</filename>, and depending on the contents of the file, it sets the clock to either UTC or local time.
fr: <command>systemd-timedated</command> lit <filename>/etc/adjtime</filename>, et ajuste en fonction de celui-ci l'horloge sur UTC ou l'heure locale.

source: Create the <filename>/etc/adjtime</filename> file with the following contents if your hardware clock is set to local time:
fr: Si votre horloge est à l'heure locale, créez le fichier <filename>/etc/adjtime</filename> avec le contenu suivant&nbsp;:

source: If <filename>/etc/adjtime</filename> isn't present at first boot, <command>systemd-timedated</command> will assume that hardware clock is set to UTC and adjust the file according to that.
fr: Si <filename>/etc/adjtime</filename> n'est pas présent au premier démarrage, <command>systemd-timedated</command> suppose que l'horloge matérielle est réglée sur UTC et ajuste le fichier en fonction.

source: If your clock is set to local time, tell <command>systemd-timedated</command> about it by running the following command:
fr: Si votre horloge est à l'heure locale, appelez <command>systemd-timedated</command> en exécutant la commande suivante&nbsp;:

source: <command>timedatectl</command> can also be used to change system time and time zone.
fr: <command>timedatectl</command> peut également être utilisé pour changer l'heure du système et le fuseau horaire.

source: To change your current system time, issue:
fr: Pour changer l'heure de votre système, tapez&nbsp;:

source: Hardware clock will also be updated accordingly.
fr: L'horloge matérielle sera également mise à jour.

source: To change your current time zone, issue:
fr: Pour changer votre fuseau horaire, tapez&nbsp;:

source: You can get list of available time zones by running:
fr: Vous pouvez obtenir la liste des fuseaux horaires disponibles en tapant&nbsp;:

source: Please note that <command>timedatectl</command> command can be used only on a system booted with systemd.
fr: N'oubliez pas que la commande <command>timedatectl</command> ne peut être utilisée qu'avec un système démarré avec systemd.
