Repository: espindula/br-lfs
Catalog: clfs/*/system-config/common/locale.po
Languages: fr

source: Setting Up Locale Information
fr: Configuration des informations pour la locale

source: The <filename>/etc/locale.conf</filename> below sets some environment variables necessary for native language support. Setting them properly results in:
fr: Le fichier <filename>/etc/locale.conf</filename> ci-dessous définit certaines variables d'environnement nécessaires au support de la langue. En les réglant correctement, on obtient que&nbsp;:

source: The output of programs translated into the native language
fr: La sortie des programmes traduit en une autre langue

source: Correct classification of characters into letters, digits and other classes. This is necessary for <command>bash</command> to properly accept non-ASCII characters in command lines in non-English locales
fr: Corrige la classification des caractères en lettres, nombres et autres classes. Cela est nécessaire pour que <command>bash</command> accepte des caractères non-ASCII dans la ligne de commande dans les locales non anglaises

source: The correct alphabetical sorting order for the country
fr: L'ordre alphabétique correct pour le pays

source: Appropriate default paper size
fr: Taille appropriée du papier par défaut

source: Correct formatting of monetary, time, and date values
fr: Formatage correct des valeurs monétaires, temporelles et des dates

source: Replace <replaceable>[ll]</replaceable> below with the two-letter code for the desired language (e.g., <quote>en</quote>) and <replaceable>[CC]</replaceable> with the two-letter code for the appropriate country (e.g., <quote>GB</quote> or <quote>US</quote>). <replaceable>[charmap]</replaceable> should be replaced with the canonical charmap for your chosen locale. Optional modifiers such as <quote>@euro</quote> may also be present.
fr: Remplacez <replaceable>[II]</replaceable> ci-dessous avec le code à deux lettres de la langue souhaitée (par exemple <quote>fr</quote>) et <replaceable>[CC]</replaceable> par le code à deux lettres pour le pays approprié (par exemple <quote>FR</quote> ou <quote>CA</quote>). <replaceable>[charmap]</replaceable> devrait être remplacé par la table de caractères canonique pour la locale choisie. Des modificateurs facultatifs comme <quote>@euro</quote> peuvent aussi être présents.

source: The list of all locales supported by Glibc can be obtained by running the following command:
fr: La liste des locales supportées par Glibc peut être obtenue en lançant la commande suivante&nbsp;:

source: Locales can have a number of synonyms, e.g. <quote>ISO-8859-1</quote> is also referred to as <quote>iso8859-1</quote> and <quote>iso88591</quote>. Some applications cannot handle the various synonyms correctly, so it is safest to choose the canonical name for a particular locale. To determine the canonical name, run the following command, where <replaceable>[locale name]</replaceable> is the output given by <command>locale -a</command> for your preferred locale (<quote>en_US.utf8</quote> in our example).
fr: Les locales peuvent avoir un certain nombre de synonymes, par exemple <quote>ISO-8859-1</quote> est aussi appelé <quote>ios8859-1</quote> et <quote>iso88591</quote>. Certaines applications ne peuvent gérer les divers synonymes correctement, donc il est plus sûr de choisir le nom canonique pour une locale particulière. Pour déterminer le nom canonique, lancez la commande suivante, où <replaceable>[local name]</replaceable> est la sortie donnée par <command>locale -a</command> pour votre locale préférée (<quote>fr_FR.utf8</quote> par exemple).

source: For the <quote>en_US.utf8</quote> locale, the above command will print:
fr: Pour la locale <quote>fr_FR.utf8</quote>, la commande ci-dessus affichera&nbsp;:

source: This results in a final locale setting of <quote>en_US.UTF-8</quote>. It is important that the locale found using the heuristic above is tested prior to it being added to <filename>/etc/locale.conf</filename>:
fr: Cela résulte en un paramètre de local final de <quote>fr_FR.UTF-8</quote>. Il est important que la locale trouvée en utilisant l'heuristique ci-dessus soit testée avant d'être ajoutée à <filename>/etc/locale.conf</filename>&nbsp;:

source: The above commands should print the language name, the character encoding used by the locale, the local currency, and the prefix to dial before the telephone number in order to get into the country. If any of the commands above fail with a message similar to the one shown below, this means that your locale was either not installed in Chapter 10 or is not supported by the default installation of Glibc.
fr: Les commandes ci-dessus devraient afficher le nom du langage, l'encodage des caractères utilisées, la monnaie locale et le préfixe à ajouter avant le numéro de téléphone pour appeler le pays. Si l'une de ces commandes échoue avec un message similaire à celui ci-dessous, cela signifie que votre locale n'a soit pas été installée au chapitre 10 ou n'est pas supportée par l'installation par défaut de Glibc.

source: If this happens, you should either install the desired locale using the <command>localedef</command> command, or consider choosing a different locale. Further instructions assume that there are no such error messages from Glibc.
fr: Si cela arrive, vous devriez soit installer la locale désirée avec la commande <command>localedef</command> ou considérer de choisir une locale différente. Les instructions supposent maintenant qu'il n'y a plus de message d'erreur de la part de Glibc.

source: Some packages beyond CLFS may also lack support for your chosen locale. One example is the X library (part of the X Window System), which outputs the following error message:
fr: Certains paquets au delà de CLFS peuvent aussi manquer un support pour votre locale. Un exemple est la bibliohèque X (qui fait partie du système de fenêtrage X) qui sort le message d'erreur suivant&nbsp;:

source: Sometimes it is possible to fix this by removing the charmap part of the locale specification, as long as that does not change the character map that Glibc associates with the locale (this can be checked by running the <command>locale charmap</command> command in both locales). For example, one would have to change &quot;de_DE.ISO-8859-15@euro&quot; to &quot;de_DE@euro&quot; in order to get this locale recognized by Xlib.
fr: Parfois il est possible de corriger cela en supprimant la partie du jeu de caractères dans la spécification de la locale, tant que cela ne change pas le jeu de caractères que Glibc asoscie à la locale (cela peut être vérifié en lançant la commande <command>locale charmap</command> dans les deux locales). Par exemple, on devrait changer «&nbsp;de_DE.ISO-8859-15@euro&nbsp;» en «&nbsp;de_DE@euro&nbsp;» pour que cette locale soit reconnue par Xlib.

source: Other packages can also function incorrectly (but may not necessarily display any error messages) if the locale name does not meet their expectations. In those cases, investigating how other Linux distributions support your locale might provide some useful information.
fr: D'autres paquets peuvent aussi fonctionner incorrectement (mais peuvent ne pas afficher de message d'erreur) si le nom de la locale ne correspond pas à leur attente. Dans ce cas, regardez commentles autres distributions Linux supportent votre locale pour avoir des informations utiles.

source: Once the proper locale settings have been determined, create the <filename>/etc/locale.conf</filename> file:
fr: Une fois que les paramètres de locale appropriés ont été déterminés, créez le fichier <filename>/etc/locale.conf</filename>&nbsp;:

source: Note that you can modify <filename>/etc/locale.conf</filename> with systemd's <command>localectl</command> utility. To use <command>localectl</command> for the example above, run:
fr: Remarquez que vous pouvez modifier <filename>/etc/locale.conf</filename> avec l'utilitaire systemd <command>localctl</command>. Pour utiliser <command>localectl</command> pour l'exemple ci-dessus, lancez&nbsp;:

source: You can also specify other language specific environment variables such as <envar>LANG</envar>, <envar>LC_CTYPE</envar>, <envar>LC_NUMERIC</envar> or any other environment variable from <command>locale</command> output. Just separate them with a space. An example where <envar>LANG</envar> is set as en_US.UTF-8 but <envar>LC_CTYPE</envar> is set as just en_US is:
fr: Vous pouvez aussi spécifier d'autres variables d'environnement spécifiques à la langue comme <envar>LANG</envar>, <envar>LC_CTYPE</envar>, <envar>LC_NUMERIC</envar> ou toute autre variable d'environnement de la sortie de <command>locale</command>. Séparez-les simplement avec un espace. Un exemple où <envar>LANG</envar> est défini comme en_US.UTF-8 mais <envar>LC_CTYPE</envar> est définie comme en_US est&nbsp;:

source: Please note that <command>localectl</command> command can be used only on a system booted with systemd.
fr: Veuillez remarquer que la commande <command>localectl</command> peut être utilisée uniquement sur un système démarré avec systemd.

source: Setting the keyboard layout, screen font, and locale-related environment variables are the only internationalization steps needed to support locales that use ordinary single-byte encodings and left-to-right writing direction. UTF-8 has been tested on the English, French, German, Italian, and Spanish locales. All other locales are untested. If you discover issues with any other locale please open a ticket in our Trac system.
fr: Les paramètres pour le clavier, la police et les variables d'environment liées à la locale sont les seules étapes de régionalisation requises pour supporter les locales qui utilisent un encodage simple sur un octet et écrites de gauche à droite. l'UTF-8 a été testé sur les locales anglaises, françaises, allemandes, italiennes et espagnoles. Les autres locales n'ont pas été testées. Si vous trouvez un problème avec une autre locale, merci d'ouvrir un ticket sur le système Trac.

source: Some locales need additional programs and support. CLFS will not be supporting these locales in the book. We welcome the support for these other locales via <ulink url="&cblfs-root;"/>.
fr: Certaines locales requièrent des programmes supplémentaires. CLFS ne supportera pas ces locales dans le livre. Nous parlons du support de ces locales dans <ulink url="&cblfs-root;"/>.
