Repository: espindula/br-lfs
Catalog: clfs/*/system-config/common/symlinks.po
Languages: fr

source: Creating custom symlinks to devices
fr: Création de liens symboliques personnalisés vers les appareils

source: CD-ROM symlinks
fr: Liens symboliques pour les CD-ROM

source: Some software that you may want to install later (e.g., various media players) expect the /dev/cdrom and /dev/dvd symlinks to exist. Also, it may be convenient to put references to those symlinks into <filename>/etc/fstab</filename>. For each of your CD-ROM devices, find the corresponding directory under <filename class="directory">/sys</filename> (e.g., this can be <filename class="directory">/sys/block/hdd</filename>) and run a command similar to the following:
fr: Certains logiciels que vous voudriez installer plus tard (par exemple divers lecteurs multimédia) s'attendent à ce que les liens /dev/cdrom et /dev/dvd existent. Aussi, il peut être intéressant d'ajouter des références à ces liens dans <filename>/etc/fstab</filename>. Pour chaqun de vos lecteurs CD-ROM, trouvez le répertoire correspondant dans <filename class="directory">/sys</filename> (par exemple cela peut être <filename class="directory">/sys/block/hdd</filename>) et lancez la commande suivante&nbsp;:

source: Look at the lines containing the output of various *_id programs.
fr: Regardez les lignes contenant la sortie de divers programmes *_id.

source: There are two approaches to creating symlinks. The first one is to use the model name and the serial number, the second one is based on the location of the device on the bus. If you are going to use the first approach, create a file similar to the following:
fr: Il y a deux approches pour créer les liens symboliques. La première est d'utiliser le nom du modèle et numéro de série, la deuxième est basée sur l'emplacement du périphérique sur le bus. Si vous allez utiliser la première approche, créez un fichier similaire à ce qui suit&nbsp;:

source: Although the examples in this book work properly, be aware that Udev does not recognize the backslash for line continuation. If modifying Udev rules with an editor, be sure to leave each rule on one physical line.
fr: Bien que les exemples du livre fonctionnent correctement, soyez avertit que Udev ne reconnait pas l'anti-slash comme caractère pour continuer une ligne. Si vous modifiez les règles Udev avec un éditeur, assurez-vous de laisser chaque règle sur une seule ligne physique.

source: This way, the symlinks will stay correct even if you move the drives to different positions on the IDE bus, but the <filename>/dev/cdrom</filename> symlink won't be created if you replace the old SAMSUNG CD-ROM with a new drive.
fr: De cette manière, les liens symboliques resteront corrects même si vous déplacez les périphériques à des positions différentes sur le bus IDE, mais le lien symbolique <filename>/dev/cdrom</filename> ne sera pas remplace si le vieux lecteur est remplacé par un nouveau.

source: The SUBSYSTEM==&quot;block&quot; key is needed in order to avoid matching SCSI generic devices. Without it, in the case with SCSI CD-ROMs, the symlinks will sometimes point to the correct <filename>/dev/srX</filename> devices, and sometimes to <filename>/dev/sgX</filename>, which is wrong.
fr: La clef SUBSYSTEM==&quot;block&quot; est requise pour éviter de correspondre aux périphériques SCSI génériques. Sans cela, dans le cas des lecteurs CD-ROM SCSI, les liens symboliques pointeront parfois vers <filename>/dev/srX</filename> (correct) et parfois vers <filename>/dev/sgX</filename>, ce qui est incorrect.

source: The second approach yields:
fr: La seconde approche fonctionne ainsi&nbsp;:

source: This way, the symlinks will stay correct even if you replace drives with different models, but place them to the old positions on the IDE bus. The ENV{ID_TYPE}==&quot;cd&quot; key makes sure that the symlink disappears if you put something other than a CD-ROM in that position on the bus.
fr: De cette manière, les liens symboliques resteront correctes même si vous remplacez les périphériques avec d'autres modèles, mais que vous gardez la position sur le bus IDE. La clef ENV{ID_TYPE}==&quot;cd&quot; s'assure que le lien symbolique disparraisse après que vous mettez autre chose qu'un lecteur CD-ROM à cette position sur le bus.

source: Of course, it is possible to mix the two approaches.
fr: Bien sûr il est possible de mélanger les deux approches.

source: Dealing with duplicate devices
fr: Gérer les périphériques multiples

source: As explained in <xref linkend="ch-config-udev"/>, the order in which devices with the same function appear in <filename class="directory">/dev</filename> is essentially random. E.g., if you have a USB web camera and a TV tuner, sometimes <filename>/dev/video0</filename> refers to the camera and <filename>/dev/video1</filename> refers to the tuner, and sometimes after a reboot the order changes to the opposite one. For all classes of hardware except sound cards and network cards, this is fixable by creating udev rules for custom persistent symlinks. The case of network cards is covered separately in <xref linkend="chapter-network"/>, and sound card configuration can be found in <ulink url="&cblfs-root;">CBLFS</ulink>.
fr: Comme expliqué dans <xref linkend="ch-config-udev"/>, l'ordre dans lequel les périphériques avec les mêmes fonctions apparaissent dans <filename class="directory">/dev</filename> est surtout aléatoire. Par exemple si vous avez un webcam USB et un tuner TV, parfois <filename>/dev/video0</filename> sera la caméra et <filename>/dev/video1</filename> le tunner, et parfois après un redémarrage l'ordre est inversé. Pour toutes les classes de matériels sauf les cartes sons et les les cartes réseau, cela est correctible en créant des règles udev pour des liens persistants. Le cas des cartes réseau est couvert séparément dans <xref linkend="chapter-network"/> et la configuration des cartes sons peut être trouvée dans <ulink url="&cblfs-root;">CBLFS</ulink>.

source: For each of your devices that is likely to have this problem (even if the problem doesn't exist in your current Linux distribution), find the corresponding directory under <filename class="directory">/sys/class</filename> or <filename class="directory">/sys/block</filename>. For video devices, this may be <filename class="directory">/sys/class/video4linux/video<replaceable>X</replaceable></filename>. Figure out the attributes that identify the device uniquely (usually, vendor and product IDs and/or serial numbers work):
fr: Pour chaque périphérique qui pourrait avoir ce problème, (même si le problème n'existe pas dans votre distribution Linux actuelle), trouvez le répertoire correspondant dans <filename class="directory">/sys/class</filename> ou <filename class="directory">/sys/block</filename>. Pour les périphériques vidéo, cela peut être <filename class="directory">/sys/class/video4linux/video<replaceable>X</replaceable></filename>. Toruvez les attributs qui identifient ces périphériques uniquement (typiquement, les ID du fabriquant et du produit ou le numéro de série)&nbsp;:

source: Then write rules that create the symlinks, e.g.:
fr: Ensuite écrivez des règles qui créent les liens symboliques, par exemple&nbsp;:

source: The result is that <filename>/dev/video0</filename> and <filename>/dev/video1</filename> devices still refer randomly to the tuner and the web camera (and thus should never be used directly), but there are symlinks <filename>/dev/tvtuner</filename> and <filename>/dev/webcam</filename> that always point to the correct device.
fr: Le résultat est que <filename>/dev/video0</filename> et <filename>/dev/video1</filename> réfèrent toujours soit au tuner soit à la webcam de manière aléatoire (et donc ne devraient pas être utilisés directement), mais les liens symboliques <filename>/dev/tvtuner</filename> et <filename>/dev/webcam</filename> pointent toujours vers le bon périphérique.
