Repository: espindula/br-lfs
Catalog: clfs/*/system-config/common/udev.po
Languages: fr

source: Device and Module Handling on a CLFS System
fr: Manipulation des périphériques et modules

source: In <xref linkend="chapter-building-system"/>, we installed Udev, as one of the components of systemd. Before we go into the details regarding how this works, a brief history of previous methods of handling devices is in order.
fr: Dans <xref linkend="chapter-building-system"/>, nous avons installé le paquet Udev comme composant de systemd. Avant d'entrer dans les détails concernant son fonctionnement, un bref historique des méthodes précédentes de gestion des périphériques est nécessaire.

source: Static Device Nodes
fr: Nœuds de périphériques statiques

source: Linux systems in general traditionally use a static device creation method, whereby a great many device nodes are created under <filename class="directory">/dev</filename> (sometimes literally thousands of nodes), regardless of whether the corresponding hardware devices actually exist. This is typically done via a <command>MAKEDEV</command> script, which contains a number of calls to the <command>mknod</command> program with the relevant major and minor device numbers for every possible device that might exist in the world.
fr: Traditionnellement, les systèmes Linux utilisaient une méthode de création de périphériques statiques avec laquelle un grand nombre de nœuds de périphériques étaient créés sous <filename class="directory">/dev</filename> (quelques fois littéralement des milliers de nœuds), que le matériel correspondant existait ou non. Ceci était fait le plus souvent avec un script <command>MAKEDEV</command>, qui contient des appels au programme <command>mknod</command> avec les numéros de périphériques majeurs et mineurs pour chaque périphérique possible qui pourrait exister dans le monde.

source: In February 2000, a new filesystem called <systemitem class="filesystem">devfs</systemitem>, which dynamically created device nodes as devices were found by the kernel, was merged into the 2.3.46 kernel and was made available during the 2.4 series of stable kernels. Although it was present in the kernel source itself, this method of creating devices dynamically never received overwhelming support from the core kernel developers.
fr: En février 2000, un nouveau système de fichiers appelé <systemitem class="filesystem">devfs</systemitem>, qui créait dynamiquement des nœuds de périphérique lorsque des périphériques étaient trouvés par le noyau, a été intégré au noyau 2.3.46 et rendu disponible pour la série 2.4 des noyaux stables. Bien qu'il soit présent dans les sources du noyau, cette méthode de création dynamique des périphériques n'a jamais reçu un support inconditionnel des développeurs du noyau.

source: The main problem with the approach adopted by <systemitem class="filesystem">devfs</systemitem> was the way it handled device detection, creation, and naming. The latter issue, that of device node naming, was perhaps the most critical. It is generally accepted that if device names are allowed to be configurable, then the device naming policy should be up to a system administrator, not imposed on them by any particular developer(s). The <systemitem class="filesystem">devfs</systemitem> file system also suffered from race conditions that were inherent in its design and could not be fixed without a substantial revision to the kernel. It was marked deprecated with the release of the 2.6 kernel series, and was removed entirely as of version 2.6.18.
fr: Le principal problème de l'approche adopté par <systemitem class="filesystem">devfs</systemitem> était la façon dont il gérait la détection, la création et le nommage des périphériques. Ce dernier problème, le nommage des périphériques, était peut-être le plus critique. Il est généralement accepté que s'il est possible de configurer les noms des périphériques, alors la politique de nommage des périphériques revient à l'administrateur du système, et non imposée par quelque développeur. Le système de fichiers <systemitem class="filesystem">devfs</systemitem> souffrait aussi de restrictions particulières inhérentes à sa conception et qui ne pouvaient être corrigées sans une revue importante du noyau. Il a aussi été marqué comme obsolète avec la publication de la série 2.6 et supprimé complètement avec la version 2.6.18.

source: With the development of the unstable 2.5 kernel tree, later released as the 2.6 series of stable kernels, a new virtual filesystem called <systemitem class="filesystem">sysfs</systemitem> came to be. The job of <systemitem class="filesystem">sysfs</systemitem> is to export a view of the system's hardware configuration to userspace processes. Drivers that have been compiled into the kernel directly register their objects with <systemitem class="filesystem">sysfs</systemitem> as they are detected by the kernel. For drivers compiled as modules, this registration will happen when the module is loaded. Once the <systemitem class="filesystem">sysfs</systemitem> filesystem is mounted (on <filename class="directory">/sys</filename>), data which the built-in drivers registered with <systemitem class="filesystem">sysfs</systemitem> are available to userspace processes. With this userspace-visible representation, the possibility of seeing a userspace replacement for <systemitem class="filesystem">devfs</systemitem> became much more realistic.
fr: Avec le développement de la branche instable 2.5 du noyau, sortie ensuite avec la série 2.6 des noyaux stables, un nouveau système de fichiers virtuel appelé <systemitem class="filesystem">sysfs</systemitem> est arrivé. Le rôle de <systemitem class="filesystem">sysfs</systemitem> est d'exporter une vue de la configuration matérielle du système pour les processus en espace utilisateur. Les pilotes qui sont compilés dans le noyau enregistrent directement leurs objets avec <systemitem class="filesystem">sysfs</systemitem> lorsqu'ils sont détectés par le noyau. Pour les pilotes compilés en modules, cette enregistrement a lieu au chargement du module. Une fois que le système de fichiers <systemitem class="filesystem">sysfs</systemitem> est monté (sur <filename class="directory">/sys</filename>), les données enregistrés par les pilotes avec <systemitem class="filesystem">sysfs</systemitem> sont visibles pour les processus en espace utilisateur. Avec cette représentation visible en espace utilisateur, la possibilité de développer un remplacement en espace utilisateur de <systemitem class="filesystem">devfs</systemitem> est devenu beaucoup plus réaliste.

source: Udev Implementation
fr: Implémentation d'Udev

source: Shortly after the introduction of <systemitem class="filesystem">sysfs</systemitem>, work began on a program called Udev to advantage of it. The <command>udev</command> daemon made calls to <function>mknod()</function> to create device nodes in <filename class="directory">/dev</filename> dynamically, based on the information from <systemitem class="filesystem">sysfs</systemitem>, in <filename class="directory">/sys</filename>. For example, <filename>/sys/class/tty/vcs/dev</filename> contains the string <quote>7:0</quote>. This string was used by <command>udev</command> to create a device node with major number <emphasis>7</emphasis> and minor number <emphasis>0</emphasis>.
fr: Peu de temps après l'introduction de <systemitem class="filesystem">sysfs</systemitem>, le travail a commencé sur un programme appelé Udev pour en profiter. Le démon <command>udev</command> appelait <function>mknod()</function> pour créer des nœuds de périphériques dans <filename class="directory">/dev</filename> dynamiquement, en fonction des informations de <systemitem class="filesystem">sysfs</systemitem> dans <filename class="directory">/sys</filename>. Par exemple, <filename>/sys/class/tty/vcs/dev</filename> contient la chaîne <quote>7:0</quote>. Cette chaîne était utilisée par <command>udev</command> pour créer un nœud de périphérique avec le nombre majeur <emphasis>7</emphasis> et mineur <emphasis>0</emphasis>.

source: Linux kernel version 2.6.32 introduced a new virtual file system called <systemitem class="filesystem">devtmpfs</systemitem>, an improved replacement for <systemitem class="filesystem">devfs</systemitem>. This allows device nodes to once again be dynamically created by the kernel, without many of the problems of <systemitem class="filesystem">devfs</systemitem>. As of version 176, Udev no longer creates device nodes itself, instead relying on <systemitem class="filesystem">devtmpfs</systemitem> to do so.
fr: Le noyau 2.6.32 a introduit un nouveau système de fichiers virtuel nommé <systemitem class="filesystem">devtmpfs</systemitem>, une version améliorée de <systemitem class="filesystem">devfs</systemitem>. Cela permet aux nœuds de périphériques une fois de plus d'être créés dynamiquement par le noyau, sans les nombreux problèmes de <systemitem class="filesystem">devfs</systemitem>. Dans sa version 176, Udev ne crée plus lui-même les nœuds de périphériques, et délègue plutôt la tâche à <systemitem class="filesystem">devtmpfs</systemitem>.

source: Systemd and Eudev
fr: Systemd et Eudev

source: In 2010, development began on systemd, an alternate <command>init</command> implementation. Starting with Udev 183, Udev's source tree was merged with systemd. Several Gentoo developers who disagreed with this merge announced a project fork called Eudev in December 2012, created by extracting the Udev code from systemd. One of the goals of Eudev is to allow for easier installation and usage of <command>udevd</command> without the need for the rest of systemd.
fr: En 2010, le développement de systemd a démarré, une implémentation alternative d'<command>init</command>. À partir d'Udev 183, l'arborescence des sources d'Udev a été fusionnée avec celle de systemd. Plusieurs développeurs de Gentoo qui n'étaient pas d'accord avec cette fusion ont annoncés un fork du projet appelé Eudev en décembre 2012, créé en extrayant le code d'Udev de systemd. Un des but d'Eudev est de permettre une meilleure installation et utilisation de <command>udevd</command> sans avoir besoin du reste de systemd.

source: Device Node Creation
fr: Création de nœuds de périphérique

source: By default, device nodes created by the kernel in a <systemitem class="filesystem">devtmpfs</systemitem> are owned by <emphasis>root:root</emphasis> and have <emphasis>600</emphasis> permissions. <command>udevd</command> can modify ownership and permissions of the nodes under the <filename class="directory">/dev</filename> directory, and can also create additional symlinks, based on rules specified in the files within the <filename class="directory">/etc/udev/rules.d</filename>, <filename class="directory">/lib/udev/rules.d</filename>, and <filename class="directory">/run/udev/rules.d</filename> directories. The names for these files start with a number, to indicate the order in which they are run, and they have a <filename>.rules</filename> extension (<command>udevd</command> will ignore files with any other extension). All of the rules files from these directories are combined into a single list, sorted by filename, and run in that order. In the event of a conflict, where a rules file with the same name exists in two or more of these directories, the rules in <filename class="directory">/etc</filename> take the highest priority, followed by rules files in <filename class="directory">/run</filename>, and finally <filename class="directory">/lib</filename>. Any device for which a rule cannot be found will just be ignored by <command>udevd</command> and be left at the defaults defined by the kernel, as described above. For more details about writing Udev rules, see <filename><ulink url="/usr/share/doc/systemd-&systemd-version;/udev.html"/></filename>.
fr: Par défaut, les nœuds de périphériques créés par le noyau dans un <systemitem class="filesystem">devtmpfs</systemitem> appartiennent à <emphasis>root:root</emphasis> et ont les permissions <emphasis>600</emphasis>. <command>udevd</command> peut modifier l'appartenance et les permissions des nœuds dans le répertoire <filename class="directory">/dev</filename> et peut aussi créer des liens supplémentaires, en fonction de règles spécifiées dans les fichiers de <filename class="directory">/etc/udev/rules.d</filename>, <filename class="directory">/lib/udev/rules.d</filename> et <filename class="directory">/run/udev/rules.d</filename>. Les noms de ces fichiers commencent par un nombre, pour indiquer l'ordre dans lequel ils doivent être lancés, et ils ont une extension <filename>.rules</filename> (<command>udevd</command> ignorera les fichiers avec une autre extension). Tous ces fichiers de règles de ces répertoires sont combinés en une liste unique, triés par nom de fichiers, et lancés dans cette ordre. En cas de conflit, où un fichier de règle avec le même nom existe dans deux ou plus de ces répertoires, les règles dans <filename class="directory">/etc</filename> sont prioritaires, puis les fichiers de règles dans <filename class="directory">/run</filename> et enfin <filename class="directory">/lib</filename>. Tout périphérique pour qui une règle est introuvable sera simplement ignoré par <command>udevd</command> et laissé avec les valeurs par défaut définies par le noyau, comme décrit ci-dessus. Pour plus de détails sur l'écriture de règles Udev, voir <filename><ulink url="/usr/share/doc/systemd-&systemd-version;/udev.html"/></filename>.

source: Module Loading
fr: Chargement d'un module

source: Device drivers compiled as modules may have aliases built into them. Aliases are visible in the output of the <command>modinfo</command> program and are usually related to the bus-specific identifiers of devices supported by a module. For example, the <emphasis>snd-fm801</emphasis> driver supports PCI devices with vendor ID 0x1319 and device ID 0x0801, and has an alias of <quote>pci:v00001319d00000801sv*sd*bc04sc01i*</quote>. For most devices, the bus driver exports the alias of the driver that would handle the device via <systemitem class="filesystem">sysfs</systemitem>. E.g., the <filename>/sys/bus/pci/devices/0000:00:0d.0/modalias</filename> file might contain the string <quote>pci:v00001319d00000801sv00001319sd00001319bc04sc01i00</quote>. The default rules provided by Udev will cause <command>udevd</command> to call out to <command>/sbin/modprobe</command> with the contents of the <envar>MODALIAS</envar> uevent environment variable (that should be the same as the contents of the <filename>modalias</filename> file in sysfs), thus loading all modules whose aliases match this string after wildcard expansion.
fr: Les pilotes de périphériques compilés en tant que modules peuvent avoir des alias. Les alias sont visibles dans la sortie du programme <command>modinfo</command> et sont souvent liés aux identifiants de bus des périphériques supportés par un module. Par exemple, le pilote <emphasis>snd-fm801</emphasis> supporte les périphériques PCI avec l'ID de fabricant 0x1319 et l'ID de matériel 0x0801, et a un alias de <quote>pci:v00001319d00000801sv*sd*bc05sc01i*</quote>. Pour la plupart des périphériques, le pilote de bus exporte l'alias d'un pilote que pourrait gérer le périphérique via <systemitem class="filesystem">sysfs</systemitem>. Par exemple, le fichier <filename>/sys/bus/pci/devices/0000:00:0d.0/modalias</filename> contient la chaîne <quote>pci:v00001319d00000801sv00001319sd00001319bc04sc01i00</quote>. Les règles par défaut fournies par Udev font qu'<command>udevd</command> appellera <command>/sbin/modprobe</command> avec le contenu de la variable d'environnemnt <envar>MODALIAS</envar> d'uevent (qui devrait contenir la même chose que le fichier <filename>modalias</filename> dans sysfs), ce qui fait qu'il chargera les modules dont les alias correspondent à cette chaîne après l'expansion de l'astérisque.

source: In this example, this means that, in addition to <emphasis>snd-fm801</emphasis>, the obsolete (and unwanted) <emphasis>forte</emphasis> driver will be loaded if it is available. See below for ways in which the loading of unwanted drivers can be prevented.
fr: Dans cet exemple, cela signifie que, en plus de <emphasis>snd-fm801</emphasis>, le pilote obsolète (et indésirable) <emphasis>forte</emphasis> sera chargé s'il est disponible. Voyez plus bas pour des manières d'éviter le chargement de modules indésirables.

source: The kernel itself is also able to load modules for network protocols, filesystems and NLS support on demand.
fr: Le noyau lui-même peut charger des modules pour les protocoles réseau, les systèmes de fichiers et le support NLS à la demande.

source: Problems with Loading Modules and Creating Devices
fr: Problèmes avec le chargement de modules et la création de périphériques

source: There are a few possible problems when it comes to automatically creating device nodes.
fr: Il y peut y avoir quelques problèmes concernant la création de périphériques automatique.

source: A kernel module is not loaded automatically
fr: Un module du noyau n'est pas chargé automatiquement

source: Udev will only load a module if it has a bus-specific alias and the bus driver properly exports the necessary aliases to <systemitem class="filesystem">sysfs</systemitem>. In other cases, one should arrange module loading by other means. With Linux-&linux-version2;, Udev is known to load properly-written drivers for INPUT, IDE, PCI, USB, SCSI, SERIO and FireWire devices.
fr: Udev ne chargera un module que s'il a un alias spécifique au bus et que le pilote de bus exporte correctement les alias nécessaires dans <systemitem class="filesystem">sysfs</systemitem>. Si ce n'est pas le cas, on peut charger les modules autrement. Avec Linux-&linux-version2;, Udev est connu pour charger les pilotes bien écrits pour les périphériques INPUT, IDE, PCI, SCSI, SERIO et FireWire.

source: To determine if the device driver you require has the necessary support for Udev, run <command>modinfo</command> with the module name as the argument. Now try locating the device directory under <filename class="directory">/sys/bus</filename> and check whether there is a <filename>modalias</filename> file there.
fr: Pour déterminer si un pilote de périphérique dont vous avez besoin a le support nécessaire pour Udev, lancez <command>modinfo</command> avec le nom du module en argument. Maintenant essayez de trouver le répertoire du périphérique dans <filename class="directory">/sys/bus</filename> et vérifiez s'il y a un fichier <filename>modalias</filename>.

source: If the <filename>modalias</filename> file exists in <systemitem class="filesystem">sysfs</systemitem>, the driver supports the device and can talk to it directly, but doesn't have the alias, it is a bug in the driver. Load the driver without the help from Udev and expect the issue to be fixed later.
fr: Si le fichier <filename>modalias</filename> existe dans <systemitem class="filesystem">sysfs</systemitem>, que le pilote support le périphérique et peut lui parler directement, mais n'a pas l'alias, c'est un bogue du pilote. Chargez le pilote sans l'aide d'Udev et attendez que le problème soit corrigé.

source: If there is no <filename>modalias</filename> file in the relevant directory under <filename class="directory">/sys/bus</filename>, this means that the kernel developers have not yet added modalias support to this bus type. With Linux-&linux-version2;, this is the case with ISA busses. Expect this issue to be fixed in later kernel versions.
fr: S'il n'y a pas de fichier <filename>modalias</filename> dans le répertoire pertinent de <filename class="directory">/sys/bus</filename>, cela signifie que les développeurs du noyau n'ont pas encore ajouté le support de modalias dans ce type de bus. Avec Linux-&linux-version2;, cela est le cas pour les bus ISA. Attendez que le problème soit corrigé dans une future version du noyau.

source: Udev is not intended to load <quote>wrapper</quote> drivers such as <emphasis>snd-pcm-oss</emphasis> and non-hardware drivers such as <emphasis>loop</emphasis> at all.
fr: Udev n'est pas prévu pour charger des pilotes <quote>enveloppes</quote> comme <emphasis>snd-pcm-oss</emphasis> et les pilotes pour des périphériques virtuels comme <emphasis>loop</emphasis>.

source: A kernel module is not loaded automatically, and Udev is not intended to load it
fr: Un module du noyau n'est pas chargé automatiquement et Udev n'est pas prévu pour le charger

source: If the <quote>wrapper</quote> module only enhances the functionality provided by some other module (e.g., <emphasis>snd-pcm-oss</emphasis> enhances the functionality of <emphasis>snd-pcm</emphasis> by making the sound cards available to OSS applications), configure <command>modprobe</command> to load the wrapper after Udev loads the wrapped module. To do this, add an <quote>install</quote> line to a file in <filename>/etc/modprobe.d</filename>. For example:
fr: Si le module <quote>enveloppe</quote> ne fait qu'améliorer les fonctionnalités fournies par d'autres modules (par exemple <emphasis>snd-pcm-oss</emphasis> améliore les fonctionnalités de <emphasis>snd-pcm</emphasis> en rendant les cartes sons compatibles avec les applications OSS), configurez <command>modprobe</command> pour charger l'enveloppe après qu'Udev charge le module enveloppé. Pour cela, ajoutez une ligne <quote>install</quote> dans un fichier dans <filename>/etc/modprobe.d</filename>. Par exemple&nbsp;:

source: If the module in question is not a wrapper and is useful by itself, configure the <command>S05modules</command> bootscript to load this module on system boot. To do this, add the module name to the <filename>/etc/sysconfig/modules</filename> file on a separate line. This works for wrapper modules too, but is suboptimal in that case.
fr: Si le module en question n'est pas une enveloppe et est utilisé seul, configurez le script de démarrage <command>S05modules</command> pour charger ce module au démarrage du système. Pour cela, ajoutez le nom du module dans le fichier <filename>/etc/sysconfig/modules</filename> sur une ligne séparée. Cela fonctionne pour les modules enveloppes aussi, mais est sous-optimal pour ce cas.

source: Udev loads some unwanted module
fr: Udev charge certains modules indésirables

source: Either don't build the module, or blacklist it in <filename>/etc/modprobe.d</filename> file as done with the <emphasis>forte</emphasis> module in the example below:
fr: La solution est soit de ne pas construire le module, soit de le blacklister dans <filename>/etc/modprobe.d</filename> comme pour le module <emphasis>forte</emphasis> dans l'exemple suivant&nbsp;:

source: Blacklisted modules can still be loaded manually with the explicit <command>modprobe</command> command.
fr: Les modules blacklistés peuvent toujours être chargés manuellement avec la commande <command>modprobe</command> explicite.

source: Udev makes a wrong symlink
fr: Udev crée un mauvais lien symbolique

source: This usually happens if a rule unexpectedly matches a device. For example, a poorly-written rule can match both a SCSI disk (as desired) and the corresponding SCSI generic device (incorrectly) by vendor. Find the offending rule and make it more specific, with the help of <command>udevadm info</command>.
fr: Cela arrive en général si une règle correspond à un appareil inattendu. Par exemple, une règle mal écrite peut correspondre à un disque SCSI (comme voulu) et au périphérique SCSI générique correspondant (incorrectement) par fabriquant. Trouvez la règle incriminée et rendez-la plus spécifique, à l'aide de <command>udevadm info</command>.

source: Udev rule works unreliably
fr: Les règles Udev marchent de manière peu fiable
