Repository: espindula/br-lfs
Catalog: clfs/*/system-config/common/udev.po
Languages: fr

source: This may be another manifestation of the previous problem. If not, and your rule uses <systemitem class="filesystem">sysfs</systemitem> attributes, it may be a kernel timing issue, to be fixed in later kernels. For now, you can work around it by creating a rule that waits for the used <systemitem class="filesystem">sysfs</systemitem> attribute and appending it to the <filename>/etc/udev/rules.d/10-wait_for_sysfs.rules</filename> file. Please notify the CLFS Development list if you do so and it helps.
fr: Cela peut être une autre manifestation du problème précédent. Sinon, si vos règles utilisent les attributs <systemitem class="filesystem">sysfs</systemitem>, cela peut venir d'un problème de timing dans le noyau, qui sera corrigé plus tard. Pour l'instant, vous pouvez contourner le problème en créant une règle qui attend l'attribut <systemitem class="filesystem">sysfs</systemitem> utilisé et l'ajouter au fichier <filename>/etc/udev/rules.d/10-wait_for_sysfs.rules</filename>. Veuillez notifier la liste de développement CLFS si cela vous a aidé.

source: Device naming order changes randomly after rebooting
fr: L'ordre des noms des périphérique est choisi aléatoirement au démarrage

source: This is due to the fact that Udev, by design, handles uevents and loads modules in parallel, and thus in an unpredictable order. This will never be <quote>fixed</quote>. You should not rely upon the kernel device names being stable. Instead, create your own rules that make symlinks with stable names based on some stable attributes of the device, such as a serial number or the output of various *_id utilities installed by Udev. See <xref linkend="ch-config-symlinks"/> and <xref linkend="chapter-network"/> for examples.
fr: Cela est dû au fait que Udev, par conception, gère les uevents et charge les modules en parallèle, et donc dans un ordre imprédictible. Cela ne sera jamais <quote>corrigé</quote>. Vous ne devriez pas vous fier à la stabilité des noms des périphériques du noyau. Créez plutôt vos propres règles qui créent des liens symboliques avec des noms stables basés sur des attributs stable du périphérique, comme un numéro de série ou la sortie des divers utilitaires *_id installés par Udev. Voyez <xref linkend="ch-config-symlinks"/> et <xref linkend="chapter-network"/> pour des exemples.

source: Useful Reading
fr: Lecture utile

source: Additional helpful documentation is available at the following sites:
fr: De la documentation utile supplémentaire est disponible sur les sites suivants&nbsp;:

source: A Userspace Implementation of <systemitem class="filesystem">devfs</systemitem> <ulink url="http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf"/>
fr: Une implémentation en espace utilisateur de <systemitem class="filesystem">devfs</systemitem> <ulink url="http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf"/>

source: The <systemitem class="filesystem">sysfs</systemitem> Filesystem <ulink url="http://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf"/>
fr: Le système de fichier <systemitem class="filesystem">sysfs</systemitem> <ulink url="http://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf"/>
