Repository: espindula/br-lfs
Catalog: clfs/*/system-config/common/usage.po
Languages: fr

source: How does Systemd work?
fr: Comment fonctionne Systemd&nbsp;?

source: Please disregard this page until it is complete and verified.
fr: Merci de ne pas tenir compte de cette page jusqu'à ce qu'elle soit complète et vérifiée.

source: Introduction to Systemd
fr: Introduction à Systemd

source: Systemd is a system management daemon designed exclusively for the Linux kernel API. In the Linux startup process, it is the first process to execute in user land; therefore, it is also the parent process of all child processes in user land.
fr: Systemd est un démon de gestion du système conçu exclusivement pour l'API du noyau Linux. Dans le processus de démarrage de Linux, il est le premier processus à être exécuté en espace utilisateur&nbsp;; c'est pourquoi il est aussi le processus parent de tous les processus fils en espace utilisateur.

source: Systemd's initialization instructions for each daemon are recorded in a declarative configuration file rather than a shell script. For inter-process communication, systemd makes Unix domain sockets and D-Bus available to the running daemons. Because systemd tracks processes using Linux cgroups instead of process identifiers (PIDs), daemons cannot "escape" systemd; not even by double-forking. Systemd is also capable of aggressive parallelization.
fr: Les instructions d'initialisation de Systemd pour chaque démon sont enregistrés dans un fichier de configuration déclaratif plutôt qu'un script shell. Pour la communication inter-processus, systemd rend des sockets du domain Unix et D-Bus disponibles aux démons lancés. Comme systemd piste les processus avec les cgroups de Linux plutôt que leur identifiant (PID), les démons ne peuvent pas «&nbsp;échapper&nbsp;» à systemd&nbsp;; pas même avec un double-fork. Systemd est aussi capable de parallélisation agressive.

source: Among systemd's auxiliary features are a cron-like job scheduler called systemd Calendar Timers, and an event logging subsystem called journal. The system administrator may choose whether to log system events with systemd or syslog. Systemd's logfile is a binary file. The state of systemd itself can be preserved in a snapshot for future recall.
fr: Parmi les fonctionnalités auxiliaires de systemd se trouvent un gestionnaire d'événement comme cron appelé Calendar Timers, et un sous-système de collection d'événements appelé le journal. L'administrateur système peut choisir de faire l'enregistrement des événements par systemd ou syslog. Le fichier d'événements de systemd est un fichier binaire. L'état de systemd lui-même peut être préservé dans un instantané pour être rappelé plus tard.

source: Systemd provides a replacement for sysvinit, pm-utils, inetd, acpid, syslog, watchdog, cron and atd, and obsoletes ConsoleKit.
fr: Systemd fournit un remplaçant pour sysvinit, pm-utils, inetd, acpid, syslog, watchdog, cron et atd, et rend ConsoleKit obsolète.

source: <command>systemctl</command> is the main command used to introspect and control systemd.
fr: <command>systemctl</command> est la commande principale utilisée pour introspecter et contrôler systemd.

source: List running units:
fr: Liste les unités lancées&nbsp;:

source: List failed units:
fr: Liste les unités échouées&nbsp;:

source: List available unit files:
fr: Liste les fichiers d'unités disponibles&nbsp;:

source: Activate a unit immediately:
fr: Active une unité immédiatement&nbsp;:

source: <command>systemctl start</command> <replaceable>unit</replaceable>
fr: <command>systemctl start</command> <replaceable>unité</replaceable>

source: Stop a unit immediately:
fr: Arrête une unité immédiatement&nbsp;:

source: <command>systemctl stop </command><replaceable>unit</replaceable>
fr: <command>systemctl stop </command><replaceable>unité</replaceable>

source: Restart a unit:
fr: Redémarre une unité&nbsp;:

source: <command>systemctl restart </command><replaceable>unit</replaceable>
fr: <command>systemctl restart </command><replaceable>unité</replaceable>

source: Reload unit configuration:
fr: Recharge la configuration d'une unité&nbsp;:

source: <command>systemctl reload </command><replaceable>unit</replaceable>
fr: <command>systemctl reload </command><replaceable>unité</replaceable>

source: Show status of a unit:
fr: Montre le statut d'une unité&nbsp;:

source: <command>systemctl status </command><replaceable>unit</replaceable>
fr: <command>systemctl status </command><replaceable>unité</replaceable>

source: Check if a unit is enabled or disabled:
fr: Vérifie si une unité est activée ou désactivée&nbsp;:

source: <command>systemctl is-enabled </command><replaceable>unit</replaceable>
fr: <command>systemctl is-enabled </command><replaceable>unité</replaceable>

source: Enable a unit to start during boot:
fr: Active une unité au démarrage&nbsp;:

source: <command>systemctl enable </command><replaceable>unit</replaceable>
fr: <command>systemctl enable </command><replaceable>unité</replaceable>

source: Disable a unit to not start during boot:
fr: Désactive une unité au démarrage&nbsp;:

source: <command>systemctl disable </command><replaceable>unit</replaceable>
fr: <command>systemctl disable </command><replaceable>unité</replaceable>

source: Reload systemd and scan for new or changed units:
fr: Recharge systemd et cherche des unités nouvelles ou modifiées&nbsp;:

source: For more information regarding systemd, please refer to the systemd and related man-pages and <ulink url="https://fedoraproject.org/wiki/Systemd">Systemd at FedoraProject</ulink> for documentation, examples, features, and other information.
fr: Pour plus d'inforamtion à propos de systemd, merci de vous référer aux pages de manuels liés à systemd et à <ulink url="https://fedoraproject.org/wiki/Systemd">Systemd sur FedoraProject</ulink> pour la documentation, des exemples, des fonctions et d'autres informations.
