Repository: espindula/br-lfs
Catalog: blfs/traduc/po/general/genlib/apr-util.po
Languages: fr

source: 680 KB
fr: 680 Ko

source: 8.7 MB (additional 1 MB for the tests)
fr: 8.7 Mo (additional 1 Mo for the tests)

source: Introduction to Apr Util
fr: Introduction à Apr-Util

source: The Apache Portable Runtime Utility Library provides a predictable and consistent interface to underlying client library interfaces.
fr: La bibliothèque _fp_Apache Portable Runtime Utility_fp_ fournit une interface prévisible et cohérente avec des interfaces de bibliothèques clients sous-jacentes.

source: This application programming interface assures predictable if not identical behaviour regardless of which libraries are available on a given platform.
fr: Cette interface de programmation d'application assure la prévisibilité d'un comportement s'il n'est pas identique en fonction des bibliothèques disponibles sur une plate-forme donnée.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum: &apr-util-md5sum;
fr: Somme de contrôle MD5 du téléchargement : &apr-util-md5sum;

source: Download size: &apr-util-size;
fr: Taille du téléchargement : &apr-util-size;

source: Estimated disk space required: &apr-util-buildsize;
fr: Estimation de l'espace disque requis : &apr-util-buildsize;

source: Estimated build time: &apr-util-time;
fr: Estimation du temps de construction : &apr-util-time;

source: Apr Util Dependencies
fr: Dépendances d'Apr-Util

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Facultatives

source: or
fr: ou

source: and
fr: et

source: User Notes:
fr: Notes utilisateur :

source: Installation of Apr Util
fr: Installation de Apr-Util

source: Install
fr: Installez

source: by running the following commands:
fr: en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the root user:
fr: Maintenant, en tant qu'utilisateur root :

source: Command Explanations
fr: Explications des commandes

source: : This switch enables the apr_dbm_gdbm-1.so plugin.
fr: : Cette option entraîne la compilation du greffon apr_dbm_gdbm-1.so.

source: : These switches enable the apr_crypto_openssl-1.so plugin.
fr: : Ces paramètres active le greffon apr_crypto_openssl-1.so.

source: Remove them if you have not installed
fr: Enlevez le si vous n'avez pas installé

source: : If you have installed
fr: : Si vous avez installé

source: , use this switch to compile the apr_dbm_db-1.so plugin.
fr: , utilisez cette option pour compiler le greffon apr_dbm_db-1.so.

source: , use this switch to compile the apr_ldap.so plugin.
fr: , utilisez ce paramètre pour compiler l'ajout apr_ldap.so.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Library
fr: Bibliothèque installée

source: Installed Directory
fr: Répertoire installé

source: Short Descriptions
fr: Descriptions courtes

source: is an APR-util script designed to allow easy command line access to APR-util configuration parameters.
fr: est un script APR-util conçu pour permettre un accès facile en ligne de commandes aux paramètres de configuration de APR-util.

source: contains functions that provide a predictable and consistent interface to underlying client library interfaces.
fr: contient les fonctions pour offrir une interface prévisible et cohérente avec les interfaces de bibliothèque clientes sous-jacentes.
