Repository: espindula/br-lfs
Catalog: blfs/traduc/po/general/genlib/aspell.xml.1.chaine.po
Languages: fr

source: 1.8 MB
fr: 1.8 Mo

source: 58 MB (Additional 8 MB for EN dictionary)
fr: 58 Mo (8 Mo supplémentaires pour le dictionnaire EN)

source: Introduction to Aspell
fr: Introduction à Aspell

source: The _A9_ package contains an interactive spell checking program and the _A9_ libraries.
fr: Le paquet _A9_ contient un programme interactif de vérification d'orthographe et les bibliothèques _A9_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: You'll need to download at least one dictionary.
fr: Vous aurez besoin de télécharger au moins un dictionnaire.

source: The link below will take you to a page containing links to dictionaries in many languages.
fr: Le lien ci-dessous vous amènera sur une page contenant des liens vers des dictionnaires en plusieurs langues.

source: Aspell dictionaries:
fr: Dictionnaires Aspell :

source: Aspell Dependencies
fr: Dépendances d'Aspell

source: Required
fr: Requises

source: User Notes:
fr: Notes utilisateur :

source: Installation of Aspell
fr: Installation d'Aspell

source: Install _A9_ by running the following commands:
fr: Installez _A9_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: If you do not plan to install _A10_ , then copy the wrapper script _C15_ :
fr: Si vous n'envisagez pas d'installer _A10_ , copiez le script enveloppe _C15_ :

source: If you do not plan to install _A11_ , then copy the wrapper script _C16_ :
fr: Si vous n'envisagez pas d'installer _A11_ , copiez le script enveloppe _C16_ :

source: Command Explanations
fr: Explications des commandes

source: This command is useful for configuration of other applications, such as _X13_ .
fr: Cette commande est utile pour la configuration des autres applications, comme _X13_.

source: Configuring Aspell
fr: Configuration d'Aspell

source: Configuration Information
fr: Informations de configuration

source: After _A9_ is installed, you must set up at least one dictionary.
fr: Après avoir installé _A9_ , vous devez paramétrer au moins un dictionnaire.

source: Install one or more dictionaries by running the following commands:
fr: Installez un ou plusieurs dictionnaires en lançant les commandes suivantes :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: aspell, aspell-import, precat, preunzip, prezip, prezip-bin, pspell-config, run-with-aspell, word-list-compress and optionally, ispell and spell.
fr: aspell, aspell-import, precat, preunzip, prezip, prezip-bin, pspell-config, run-with-aspell, word-list-compress and optionally, ispell et spell.

source: libaspell.so and libpspell.so
fr: libaspell.so et libpspell.so

source: /usr/include/pspell and /usr/lib/aspell-0.60
fr: /usr/include/pspell et /usr/lib/aspell-0.60

source: Short Descriptions
fr: Descriptions courtes

source: is a utility that can function as an _C20_ replacement, as an independent spell checker, as a test utility to test out _A9_ features, and as a utility for managing dictionaries.
fr: est un outil qui peut fonctionner en remplacement de _C20_ , comme vérificateur d'orthographe indépendant, comme outil de test pour tester des fonctionnalités d'_A9_ et comme outil pour la gestion de dictionnaires.

source: is a wrapper around _C19_ to invoke it in _C15_ compatible mode.
fr: est une enveloppe d'_C19_ pour l'appeler en mode _C15_ compatible.

source: is a wrapper around _C19_ to invoke it in _C16_ compatible mode.
fr: est une enveloppe d'_C19_ pour l'appeler en mode _C16_ compatible.

source: imports old personal dictionaries into _A9_ .
fr: importe de vieux dictionnaires personnels dans _A9_.

source: decompresses a _C23_ ped file to stdout.
fr: décompresse un fichier _C23_ sur la sortie standard.

source: decompresses a _C23_ ped file.
fr: décompresse un fichier _C23_.

source: is a prefix delta compressor, used to compress sorted word lists or other similar text files.
fr: est un compresseur delta de préfixe, utilisé pour compresser des listes organisées de mots ou d'autres fichiers textes semblables.

source: is called by the various wrapper scripts to perform the actual compressing and decompressing.
fr: est appelé par les scripts enveloppes pour effectuer la compression et la décompression finales.

source: displays information about the _F10_ installation, mostly for use in build scripts.
fr: affiche des informations sur l'installation _F10_ , souvent utilisé dans des scripts de construction.

source: is a script to help use _A9_ as an _C15_ replacement.
fr: est un script pour aider à utiliser _A9_ en remplacement d'_C15_.

source: compresses or decompresses sorted word lists for use with the _A9_ spell checker.
fr: compresse ou décompresse des listes de mots classées pour une utilisation avec le vérificateur d'orthographe _A9_.

source: contains spell checking API functions.
fr: contient des fonctions API de vérification d'orthographe.

source: is an interface to the _F13_ library.
fr: est une interface avec la bibliothèque _F13_.

source: All the spell checking functionality is now in _F13_ but this library is included for backward compatibility.
fr: Toutes les fonctionnalités de vérification d'orthographe se trouvent maintenant dans _F13_ mais cette bibliothèque est incluse pour une compatibilité rétroactive.
