Repository: espindula/br-lfs
Catalog: blfs/traduc/po/general/genlib/boost.xml.tmp.chaine.po
Languages: fr

source: 74 MB
fr: 74 Mo

source: 899 MB (with Boost.Build's regression test)
fr: 899 Mo (with Boost.Build's regression test)

source: Introduction to Boost
fr: Introduction à Boost

source: Boost provides a set of free peer-reviewed portable C++ source libraries.
fr: Boost offre un ensemble de bibliothèques sources libres, lues par les autres et portables en C++.

source: It includes libraries for linear algebra, pseudorandom number generation, multithreading, image processing, regular expressions and unit testing.
fr: Il inclut des bibliothèques d'algèbre linéaire, de génération de nombres pseudo-aléatoires, de multithreading, de traitement d'images, d'expressions régulières et de tests d'unités.

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum: &boost-md5sum;
fr: Somme de contrôle MD5 du téléchargement : &boost-md5sum;

source: Download size: &boost-size;
fr: Taille du téléchargement : &boost-size;

source: Estimated disk space required: &boost-buildsize;
fr: Estimation de l'espace disque requis : &boost-buildsize;

source: Estimated build time: &boost-time;
fr: Estimation du temps de construction : &boost-time;

source: Boost Dependencies
fr: Dépendances de boost

source: Optional
fr: Facultatives

source: or
fr: ou

source: , and
fr: , et

source: User Notes:
fr: Notes utilisateurs :

source: Installation of Boost
fr: Installation de Boost

source: First, fix a bug with the header files path, when Python3 is used:
fr: Pour commencer, corrigez un bogue avec le chemin des fichiers d'entête, quand Python3 est utilisé :

source: Install Boost by running the following commands:
fr: Installez boost en lançant les commandes suivantes :

source: To run the Boost.Build's regression test (
fr: Pour lancer les tests de regression de la construction de Boost (

source: required), issue
fr: requis), tapez

source: One test out of 130 fails.
fr: Un test sur les 130 échoue.

source: To run every library's regression tests, issue
fr: Pour lancer tous les tests de regression de chaque bibliothèque, tapez

source: A few tests may fail.
fr: Quelques tests peuvent échouer.

source: They take very long (over 120/50 SBU, one/four cores) and use a very large disk space (up to 40 GB).
fr: Ils prennent beaucoup de temps (plus de 120/50 SBU sur un/quatre coeurs) et utilisent un espace disque volumineux (plus de 40Go).

source: You can use the
fr: Vous pouvez utiliser le paramètre

source: switch to speed them up.
fr: pour les accélérer.

source: Now, as the root user:
fr: Maintenant en tant qu'utilisateur root :

source: Command Explanations
fr: Explications des commandes

source: It is necessary for building some KDE packages.
fr: C'est nécessaire pour construire quelques paquets de KDE.

source: : This parameter ensures that Boost is built with multithreading support.
fr: : ce paramètre fait que Boost est construit avec le support multithread.

source: : This parameter ensures that only shared libraries are created, except for libboost_exception and libboost_test_exec_monitor which are created as static.
fr: : Ce paramètre fait que seulement les bibliothèques partagées sont créées, excepté pour libboost_exception et libboost_test_exec_monitor qui sont créés statiquement.

source: Most people will not need the static libraries.
fr: La plupart des personnes n'auront pas besoin des bibliothèques statiques.

source: Indeed most programs using Boost only use the headers.
fr: En effet la plupart des programmes utilisant Boost se servent uniquement des en-têtes, vous pouvez omettre ce paramètre si vous n'en n'avez pas besoin.

source: : This switch may be added to the
fr: : CE paramètre peut être utilisé dans la ligne de commande

source: command lines, to run up to N processes in parallel.
fr: , pour lancez N processus en parallèle.

source: : Add this switch if you want Boost to use Python3 instead of Python2.
fr: : Ajoutez ce paramètre si vous voulez que Boost utilise Python3 au lieu de Python2.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: None
fr: Aucun

source: libboost_atomic.so, libboost_chrono.a, libboost_chrono.so, libboost_container.so, libboost_context.so, libboost_coroutine.so, libboost_date_time.so, libboost_exception.a, libboost_filesystem.so, libboost_graph.so, libboost_iostreams.so, libboost_locale.so, libboost_log_setup.so, libboost_log.so, libboost_math_c99.so, libboost_math_c99f.so, libboost_math_c99l.so, libboost_math_tr1.so, libboost_math_tr1f.so, libboost_math_tr1l.so, libboost_prg_exec_monitor.so, libboost_program_options.so, libboost_python.so, libboost_python3.so, libboost_random.so, libboost_regex.so, libboost_serialization.so, libboost_signals.so, libboost_system.a, libboost_system.so, libboost_test_exec_monitor.a, libboost_thread.so, libboost_timer.a, libboost_timer.so, libboost_type_erasure.so, libboost_unit_test_framework.so, libboost_wave.so, and libboost_wserialization.so
fr: libboost_atomic.so, libboost_chrono.a, libboost_chrono.so, libboost_container.so, libboost_context.so, libboost_coroutine.so, libboost_date_time.so, libboost_exception.a, libboost_filesystem.so, libboost_graph.so, libboost_iostreams.so, libboost_locale.so, libboost_log_setup.so, libboost_log.so, libboost_math_c99.so, libboost_math_c99f.so, libboost_math_c99l.so, libboost_math_tr1.so, libboost_math_tr1f.so, libboost_math_tr1l.so, libboost_prg_exec_monitor.so, libboost_program_options.so, libboost_python.so, libboost_python3.so, libboost_random.so, libboost_regex.so, libboost_serialization.so, libboost_signals.so, libboost_system.a, libboost_system.so, libboost_test_exec_monitor.a, libboost_thread.so, libboost_timer.a, libboost_timer.so, libboost_type_erasure.so, libboost_unit_test_framework.so, libboost_wave.so, et libboost_wserialization.so
