Repository: espindula/br-lfs
Catalog: blfs/traduc/po/general/genlib/genlib.xml.1.chaine.po
Languages: fr

source: General Libraries
fr: Bibliothèques générales

source: Libraries contain code which is often required by more than one program.
fr: Les bibliothèques contiennent du code qui est souvent exigé par un ou plusieurs programmes.

source: The most obvious example of a set of libraries is _A67_ which is installed during the LFS book.
fr: L'exemple le plus parlant d'un ensemble de bibliothèques est _A67_ qui est installée dans le livre LFS.

source: This contains all of the _A130_ library functions which programs use.
fr: Elle contient toutes les fonctions de la bibliothèque _A130_ utilisées par les programmes.

source: There are two types of libraries:
fr: Il y a deux types de bibliothèques :

source: static and shared.
fr: celles statiques et celles partagées.

source: Shared libraries (usually _F116_ ) are loaded into memory from the shared copy at runtime (hence the name).
fr: Les bibliothèques partagées (en général _F116_) sont chargées en mémoire à partir d'une copie partagée au moment de l'exécution (d'où leur nom).

source: Static libraries (_F117_ ) are actually linked into the program executable file itself, thus making the program file larger.
fr: Les bibliothèques statiques (_F117_) sont liées en définitive au fichier exécutable du programme lui-même, rendant ainsi le fichier du programme plus gros.

source: Quite often, you will find both static and shared copies of the same library on your system.
fr: Le plus souvent, vous trouverez à la fois des copies statiques et partagées de la même bibliothèque sur votre système.

source: Generally, you only need to install libraries when you are installing software that needs the functionality they supply.
fr: En général, vous n'avez besoin d'installer des bibliothèques que lorsque vous installez un logiciel qui a besoin de la fonctionnalité qu'elle fournit.

source: Thus, you can figure out which libraries you need to have before installing that program.
fr: Ainsi, vous pouvez savoir de quelles bibliothèques vous avez besoin d'avoir avant l'installation de tel programme.

source: There are certain libraries which nearly
fr: Il y a des bibliothèques dont presque

source: everyone
fr: tout le monde

source: will need at some point.
fr: aura besoin à un moment ou un autre.

source: In this chapter these and some others are listed and it is explained why you may want to install them.
fr: Dans ce chapitre, celles-ci ainsi que d'autres sont listés et il est expliqué pourquoi il se peut que vous vouliez les installer.
