Repository: espindula/br-lfs
Catalog: blfs/traduc/po/general/genlib/glib2.xml.1.chaine.po
Languages: fr

source: 7.1 MB
fr: 7.1 Mo

source: 187 MB (additional 74 MB for tests)
fr: 187 Mo (additional 74 Mo for tests)

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Install _A15_ by running the following commands:
fr: Installez _A15_ en lançant les commandes suivantes :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This switch causes the build to use a system-provided version of the _A4_ library instead of an internal version.
fr: Il résulte de ce paramètre que la construction utilise une version de la bibliothèque _A4_ fournie par le système à la place d'une version interne.

source: Add this switch if you want GLib to use Python3 instead of Python2.
fr: Ajoutez ce paramètre si vous voulez que GLib utilise Python3 au lieu de Python2.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libgio-2.0.so, libglib-2.0.so, libgmodule-2.0.so, libgobject-2.0.so, and libgthread-2.0.so
fr: libgio-2.0.so, libglib-2.0.so, libgmodule-2.0.so, libgobject-2.0.so, et libgthread-2.0.so

source: /usr/include/gio-unix-2.0, /usr/{include, lib, share}/glib-2.0, /usr/lib/gio, and /usr/share/gtk-doc/html/g{io, lib, object}
fr: /usr/include/gio-unix-2.0, /usr/{include, lib, share}/glib-2.0, /usr/lib/gio, et /usr/share/gtk-doc/html/g{io, lib, object}

source: Short Descriptions
fr: Descriptions courtes

source: can be used to start applications and can be used to send messages to already-running instances of other applications.
fr: peut être utilisé pour démarrer des applications et peut être utilisé pour envoyer des messages aux instances déjà lancées d'autres applications.

source: is a simple tool used for working with _A16_ objects.
fr: est un outil simple utilisé pour fonctionner avec des objets _A16_.

source: is used to generate code and/or documentation for one or more _A16_ interfaces.
fr: est utilisé pour générer du code et/ou de la documentation pour une ou plusieurs interfaces _A16_.

source: is used to create a giomodule.cache file in the listed directories.
fr: est utilisé pour créer un fichier giomodule.cache dans les répertoires listés.

source: This file lists the implemented extension points for each module that has been found.
fr: Ce fichier liste les points d'extension implémentés pour chaque module trouvé.

source: is used to read the resource description from file and the files that it references to create a binary resource bundle that is suitable for use with the GResource API.
fr: est utilisé pour lire la description des ressources à partir d'un fichier et des fichiers référencés pour créer un catalogue de ressources binaire adapté à une utilisation avec l'API GResource.

source: is used to compile all the GSettings XML schema files in directory into a binary file with the name gschemas.compiled that can be used by GSettings.
fr: est utilisé pour compiler tous les fichiers-schémas XML de GSettings du répertoire dans un fichier binaire nommé gschemas.compiled utilisable par GSettings.

source: is a C code marshaller generation utility for GLib closures.
fr: est un outil de génération marshaller de code C pour les closures GLib.

source: is a variant of the _A23_ internationalization utility.
fr: est une variante de l'outil d'internationalisation _A23_.

source: is a C language enum description generation utility.
fr: est un outil de génération de description enum du langage C.

source: is a small utility that draws a tree of types.
fr: est un outil qui dessine une arborescence de types.

source: offers a simple commandline interface to GResource.
fr: offre une interface simple en ligne de commande avec GResource.

source: offers a simple commandline interface to GSettings.
fr: offre une interface simple en ligne de commande avec GSettings.

source: is a test running utility.
fr: est un outil d'exécution de tests.

source: is a test report formatting utility.
fr: est un outil de formatage de rapports de test.

source: GLib libraries
fr: Bibliothèques GLib

source: contain low-level core libraries for the _A24_ Toolkit.
fr: contient une bibliothèque c&oelig;ur de bas niveau pour le Toolkit _A24_.
