Repository: espindula/br-lfs
Catalog: blfs/traduc/po/general/genlib/libxml2.xml.1.chaine.po
Languages: fr

source: 95 MB (additional 20 MB for tests)
fr: 95 Mo (additional 20 Mo for tests)

source: Introduction to libxml2
fr: Introduction à libxml2

source: The _A123_ package contains libraries and utilities used for parsing XML files.
fr: Le paquet _A123_ contient des bibliothèques et des utilitaires utilisés pour analyser des fichiers XML.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Optional Testsuite:
fr: Suite de tests facultative :

source: libxml2 Dependencies
fr: Dépendances de libxml2

source: Recommended
fr: Recommandées

source: Some packages which utilize _A123_ (such as _A124_ ) need the _A82_ module installed to function properly and some packages will not build properly if the _A82_ module is not available.
fr: Certains paquets qui utilisent _A123_ (tels que _A124_) ont besoin que le module _A82_ soit installé pour fonctionner correctement et certains paquets ne se construiront pas correctement si le module _A82_ n'est pas disponible.

source: User Notes:
fr: Notes utilisateur :

source: Installation of libxml2
fr: Installation de libxml2

source: Install _A123_ by running the following commands:
fr: Installez _A123_ en lançant les commandes suivantes :

source: If you downloaded the testsuite, issue the following command:
fr: Si vous avez téléchargé la suite de tests, exécutez la commande suivante :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: A summary of the results can be obtained with _C193_ .
fr: Un résumé des résultats peut être obtenu avec _C193_.

source: If _X103_ is installed and you want to check memory leaks, replace _C194_ with _C195_ .
fr: Si _X103_ est installé et que vous voulez tester l'empreinte mémoire, remplacez _C194_ par _C195_.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch enables _A109_ support when running _C196_ or _C197_ in shell mode.
fr: Ce paramètre active le support de _A109_ quand _C196_ ou _C197_ sont lancés en mode shell.

source: Add this switch if you want libxml2 to use Python3 instead of Python2.
fr: Ajoutez ce paramètre si vous voulez que libxml2 utilise Python3 au lieu de Python2.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: xml2-config, xmlcatalog and xmllint
fr: xml2-config, xmlcatalog et xmllint

source: Short Descriptions
fr: Descriptions courtes

source: determines the compile and linker flags that should be used to compile and link programs that use _F110_ .
fr: détermine les drapeaux du compilateur et de véditeur de liens qui devraient être utilisés pour compiler et lier les programpes utilisant _F110_.

source: is used to monitor and manipulate XML and SGML catalogs.
fr: est utilisé pour gérer et manipuler des catalogues XML et SGML.

source: parses XML files and outputs reports (based upon options) to detect errors in XML coding.
fr: analyse des fichiers XML et affiche les rapports (basés sur les options ci-dessus) pour détecter les erreurs dans le code XML.

source: provides functions for programs to parse files that use the XML format.
fr: fournit des fonctions aux programmes pour analyser des fichiers qui utilisent le format XML.
