Repository: espindula/br-lfs
Catalog: blfs/traduc/po/general/genlib/xapian.xml.1.chaine.po
Languages: fr

source: 3.1 MB
fr: 3.1 Mo

source: 189 MB (additional 128 MB for tests)
fr: 189 Mo (additional 128 Mo for tests)

source: Introduction to xapian
fr: Introduction à xapian

source: Xapian is an open source search engine library.
fr: Xapian est une bibliothèque libre de moteur de recherche.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Xapian Dependencies
fr: Dépendances de Xapian

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Xapian
fr: Installation de Xapian

source: Install _A112_ by running the following commands:
fr: Installez _A112_ en lançant les commandes suivantes :

source: To run the test suite, issue:
fr: Pour lancer la suite de tests, tapez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: copydatabase, delve, quest, simpleexpand, simpleindex, simplesearch, xapian-check, xapian-chert-update, xapian-compact, xapian-config, xapian-inspect, xapian-metadata, xapian-progsrv, xapian-replicate, xapian-replicate-server and xapian-tcpsrv
fr: copydatabase, delve, quest, simpleexpand, simpleindex, simplesearch, xapian-check, xapian-chert-update, xapian-compact, xapian-config, xapian-inspect, xapian-metadata, xapian-progsrv, xapian-replicate, xapian-replicate-server et xapian-tcpsrv

source: Short Descriptions
fr: Descriptions courtes

source: perform a document-by-document copy of one or more _A112_ databases.
fr: réalise un copie document par document d'une ou plusieurs bases de données _A112_.

source: inspect the contents of a _A112_ database.
fr: inspecte le contenu d'une base de données _A112_.

source: is a search command line tool.
fr: est un outil de recherche en ligne de commande.

source: is a simple example program demonstrating query expansion.
fr: est un exemple de programmes simples montrant les extensions de questionnement.

source: index each paragraph of a text file as a _A112_ document.
fr: indexe chaque paragraphe d'un fichier texte comme un document _A112_.

source: is a simple command line search utility.
fr: est un utilitaire de recherche simple en ligne de commande.

source: check the consistency of a database or table.
fr: vérifie la concordance d'une base de données ou d'une table.

source: update a chert database to the new format keys.
fr: mets à jour une base de données chert vers le nouveau format de clés.

source: compact a database, or merge and compact several.
fr: compacte une base de données, ou en assemble et compacte plusieurs.

source: report information about the installed xapian.
fr: affiche les informations sur la version de xapian d'installée.

source: inspect the contents of a flint table for development or debugging.
fr: inspecte le contenu d'une table flint pour le developpement ou le déboguage.

source: read and write user metadata.
fr: lit et écrit les métadonnées utilisateur.

source: remote server for use with _A113_ .
fr: serveur distant uitlisable avec _A113_.

source: replicate a database from a master server to a local copy.
fr: duplique localement une base de données depuis un serveur maitre.

source: service database replication requests from clients.
fr: service de duplication de bases de données pour des demandes clients.

source: is the TCP daemon for use with _A112_ 's remote backend.
fr: est le démon TCP pour utiliser avec le serveur _A112_.
