Repository: espindula/br-lfs
Catalog: blfs/*/general/sysutils/elogind.po
Languages: fr

source: 1.8 MB
fr: 1,8&nbsp;Mo

source: 45 MB (with tests)
fr: 45&nbsp;Mo (avec les tests)

source: 0.3 SBU (with parallelism=4)
fr: 0,3&nbsp;SBU (avec parallélisme = 4)

source: Introduction to elogind
fr: Introduction elogind

source: <application>elogind</application> is the <application>systemd</application> project's "logind", extracted to be a standalone daemon. It integrates with <xref linkend="linux-pam"/> to track all the users logged in to a system, and whether they are logged in graphically, on the console, or remotely. <application>Elogind</application> exposes this information via the standard org.freedesktop.login1 <application>D-Bus</application> interface, and also through the file system using systemd's standard <filename class="directory">/run/systemd</filename> layout.
fr: <application>elogind</application> est le «&nbsp;logind&nbsp;» du projet <application>systemd</application> extrait pour en faire un démon autonome. Il s'intègre avec <xref linkend="linux-pam"/> pour connaître l'ensemble des utilisateurs qui sont connectés sur un système et s'ils sont connectés graphiquement, sur la console ou à distance. <application>Elogind</application> expose ces informations via l'interface <application>D-Bus</application> org.freedesktop.login1 standard, ainsi qu'à travers le système de fichiers dans la hiérarchie standard de systemd dans <filename class="directory">/run/systemd</filename>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&elogind-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&elogind-download-http;"/>

source: Download (FTP): <ulink url="&elogind-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&elogind-download-ftp;"/>

source: Download MD5 sum: &elogind-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &elogind-md5sum;

source: Download size: &elogind-size;
fr: Taille du téléchargement&nbsp;: &elogind-size;

source: Estimated disk space required: &elogind-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &elogind-buildsize;

source: Estimated build time: &elogind-time;
fr: Estimation du temps de construction&nbsp;: &elogind-time;

source: elogind Dependencies
fr: Dépendances de elogind

source: Recommended
fr: Recommandées

source: <xref role="runtime" linkend="dbus"/> (runtime), <xref linkend="linux-pam"/> (required for Xorg), <xref role="runtime" linkend="polkit"/> (runtime), <xref linkend="DocBook"/>, <xref linkend="docbook-xsl"/>, and <xref linkend="libxslt"/> (all three to build the man pages)
fr: <xref role="runtime" linkend="dbus"/> (à l'exécution), <xref linkend="linux-pam"/> (requis pour Xorg), <xref role="runtime" linkend="polkit"/> (à l'exécution), <xref linkend="DocBook"/> et <xref linkend="docbook-xsl"/> et <xref linkend="libxslt"/> (tous trois pour construire les pages de manuel)

source: Optional
fr: Facultatives

source: <xref linkend="lxml"/>, <xref linkend="zsh"/>, <xref linkend="valgrind"/> (needed for tests), <ulink url="https://github.com/linux-audit/audit-userspace"> audit-userspace</ulink>, <ulink url="https://github.com/scop/bash-completion"> bash-completion</ulink>, <ulink url="https://mirrors.edge.kernel.org/pub/linux/utils/kernel/kexec/"> kexec</ulink>, and <ulink url="https://selinuxproject.org/page/Main_Page"> SELinux</ulink>
fr: <xref linkend="lxml"/>, <xref linkend="zsh"/>, <xref linkend="valgrind"/> (requis pour les tests), <ulink url="https://github.com/linux-audit/audit-userspace"> audit-userspace</ulink>, <ulink url="https://github.com/scop/bash-completion"> bash-completion</ulink>, <ulink url="https://mirrors.edge.kernel.org/pub/linux/utils/kernel/kexec/"> kexec</ulink> et <ulink url="https://selinuxproject.org/page/Main_Page"> SELinux</ulink>

source: Kernel Configuration
fr: Configuration du noyau

source: Enable the following options in the kernel configuration and recompile the kernel if necessary:
fr: Activez les options suivantes dans la configuration du noyau et recompilez le noyau si nécessaire&nbsp;:

source: In addition, some tests need the userspace cryptographic kernel API, which is enabled with:
fr: En plus, certains tests ont besoin de l'API noyau de cryptographie en espace utilisateur qui s'active avec&nbsp;:

source: Installation of elogind
fr: Installation de elogind

source: Install <application>elogind</application> by running the following commands:
fr: Installez <application>elogind</application> en lanant les commandes suivantes&nbsp;:

source: To test the results, issue: <command>ninja test</command>. A few tests are skipped if not run with <systemitem class="username">root</systemitem> privileges. Two tests named <filename>test-fs-util</filename> and <filename>test-id128</filename> require the <filename>/etc/machine-id</filename> symlink, so they will fail if this symlink is not created following the instruction in <xref linkend='dbus'/> yet.
fr: Pour tester les résultats, exécutez&nbsp;: <command>ninja test</command>. Quelques tests sont sautés si vous n'exécutez pas avec les privilèges <systemitem class="username">root</systemitem>. Deux tests nommés <filename>test-fs-util</filename> et <filename>test-id128</filename> ont besoin du lien symbolique <filename>/etc/machine-id</filename>, et ils échoueront si ce lien symbolique n'est pas encore créé suivant les instructions de <xref linkend='dbus'/>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <parameter>-Ddocdir=/usr/share/doc/elogind-&elogind-version;</parameter>: This is needed to install documentation in a versioned directory.
fr: <parameter>-Ddocdir=/usr/share/doc/elogind-&elogind-version;</parameter>&nbsp;: cela est requis pour installer la documentation dans un répertoire versionné.

source: <parameter>-Dcgroup-controller=elogind</parameter>: This switch is necessary to build this package when the kernel is not built with <option>CONFIG_CGROUPS</option> enabled. Note that <application>elogind</application> strictly needs a kernel with <option>CONFIG_CGROUPS</option> enabled at runtime, but this switch will allow building the package first.
fr: <parameter>-Dcgroup-controller=elogind</parameter>&nbsp;: ce paramètre est nécessaire pour construire ce paquet lorsque le noyau n'est pas construit avec <option>CONFIG_CGROUPS</option>. Remarquez que <application>elogind</application> nécessite vraiment <option>CONFIG_CGROUPS</option> à l'exécution, mais ce paramètre permettra de commencer par construire le paquet.

source: <parameter>-Ddbuspolicydir=/etc/dbus-1/system.d</parameter>: This switch sets the location of the <application>D-Bus</application> policy directory.
fr: <parameter>-Ddbuspolicydir=/etc/dbus-1/system.d</parameter>&nbsp;: ce paramètre choisi l'emplacement du répertoire de politique <application>D-Bus</application>.

source: <parameter>-Dman=auto</parameter>: The default value of this switch is <emphasis>false</emphasis>. Setting it to <emphasis>auto</emphasis> allows building and installing the man pages if the recommended dependencies are installed.
fr: <parameter>-Dman=auto</parameter>&nbsp;: la valeur par défaut de ce paramètre est <emphasis>false</emphasis>. Le mettre à <emphasis>auto</emphasis> permet de construire et d'installer les pages de manuel si les dépendances recommandées sont installées.

source: <option>-Dhtml=auto</option>: The default value of this switch is <emphasis>false</emphasis>. Setting it to <emphasis>auto</emphasis> allows building and installing the html documentation if the recommended dependencies are installed.
fr: <option>-Dhtml=auto</option>&nbsp;: la valeur par défaut de ce paramètre est <emphasis>false</emphasis>. Le mettre à <emphasis>auto</emphasis> permet de construire et d'installer la documentation HTML si les dépendances recommandées sont installées.

source: <option>-Ddefault-kill-user-processes=false</option>: Determines whether the processes of a user should be killed when the user logs out. The default is <emphasis>true</emphasis>, but this defeats the traditional use of <command>screen</command> or <command>tmux</command>. This can also be changed in the configuration file (see below).
fr: <option>-Ddefault-kill-user-processes=false</option>&nbsp;: indique si les processus d'un utilisateurs devraient être tués lorsqu'il se déconnecte. La valeur par défaut est <emphasis>true</emphasis>, mais cela contredit l'utilisation traditionnelle de <command>screen</command> ou <command>tmux</command>. Cela peut aussi se changer dans le fichier de configuration (voir plus bas).

source: <command>ln -s ...</command>: These commands install symlinks so that software packages can find the systemd-compatible library and headers.
fr: <command>ln -s …</command>&nbsp;: ces commandes installent les liens symboliques pour que les paquets logiciels trouvent des bibliothèques et des en-têtes compatibles avec systemd.

source: Configuring elogind
fr: Configuration de elogind

source: Config File
fr: Fichier de configuration

source: Configuration Information
fr: Informations sur la configuration

source: The installed file <filename>/etc/elogind/logind.conf</filename> contains all the possible options with their defaults, commented out. You may wish to disable automatically killing user processes when the user logs out, by running, as the <systemitem class="username">root</systemitem> user:
fr: Le fichier <filename>/etc/elogind/logind.conf</filename> installé contient toutes les options possibles avec leurs valeurs par défaut, commentées. Vous pourriez vouloir désactiver le fait de tuer les processus utilisateurs à la déconnexion, en exécutant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Each user will need to register a user session using <application>Linux-PAM</application> at login. The <filename>/etc/pam.d/system-session</filename> file needs to be modified and a new file must be created in order for <command>elogind</command> to work correctly. Run the following commands as the <systemitem class="username">root</systemitem> user:
fr: Chaque utilisateur devra enregistrer une session utilisateur avec <application>Linux-PAM</application> à la connexion. Le fichier <filename>/etc/pam.d/system-session</filename> doit être modifié et un nouveau fichier doit être créé pour qu'<command>elogind</command> fonctionne correctement. Lancez les commandes suivante en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Installed Programs
fr: Programmes installs

source: Installed Library
fr: Bibliothèque installe

source: Installed Directories
fr: Répertoires installs

source: busctl, elogind-inhibit, and loginctl
fr: busctl, elogind-inhibit et loginctl

source: /usr/lib/elogind, /etc/elogind, /usr/include/elogind, and /usr/share/doc/elogind-&elogind-version;
fr: /usr/lib/elogind, /etc/elogind, /usr/include/elogind et /usr/share/doc/elogind-&elogind-version;

source: Short Descriptions
fr: Descriptions courtes

source: is used to introspect and monitor the D-Bus bus
fr: est utilisé pour inspecter et surveiller le bus D-Bus

source: is used to execute a program with a shutdown, sleep or idle inhibitor lock taken
fr: est utilisé pour exécuter un programme avec un verrou contre l'extinction, la veille ou l'hibernation

source: is used to introspect and control the state of the elogind Login Manager
fr: est utilisé pour inspecter et contrôler l'état du gestionnaire de connexion elogind

source: is the main elogind utility library
fr: est la bibliothèque d'utilitaires principale d'elogind
