Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/kde-intro.xml.1.chaine.po
Languages: fr

source: KDE Preliminaries
fr: Préliminaires à KDE

source: It is based on the _A105_ framework.
fr: Il est basé sur la boite à outils _A105_.

source: There are two versions of _A225_ .
fr: Il y a deux versions de _A225_.

source: KDE4 is a mature version that combines libraries and the desktop environment into one set of packages and has numerous appplications that can be built on that base.
fr: KDE4 est une version mature qui combine les bibliothèques et l'environnement de bureau dans un ensemble de paquets et de nombreuses applications peuvent être construites sur cette base.

source: For KDE5, the libraries, now called KDE Frameworks 5 or KF5, are separate from the desktop environment called KDE Plasma 5.
fr: Pour KDE5, les bibliothèques, maintenant appelées KDE Frameworks 5 ou KF5, sont séparées de l'environnement du bureau appelé KDE Plasma 5.

source: Both envionments can be installed, but Plasma is not yet considered stable.
fr: Les deux environnements peuvent être installés, mais plasma n'est pas encore considéré comme stable.

source: For more information visit the official KDE project site at _L2307_ .
fr: Pour plus d'information visitez le site du projet officiel de KDE à _L2307_.

source: Common Packages
fr: Paquets communs

source: There are several packages that are common to both versions of KDE.
fr: Il y a plusieurs paquets qui sont communs aux deux versions de KDE.

source: These packages are presented in the following sections of this chapter.
fr: Ces paquets sont présentés dans la section suivante de ce chapitre.
