Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/phonon.xml.1.chaine.po
Languages: fr

source: 316 KB
fr: 316 Ko

source: Introduction to Phonon
fr: Introduction à Phonon

source: It replaces the old _A1070_ package.
fr: Il remplace le vieux _A1070_ , qui n'est plus supporté par KDE.

source: Phonon needs either the GStreamer or VLC backend.
fr: Phonon nécessite également le backend GStreamer ou VLC.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Phonon Dependencies
fr: Dépendances de Phonon

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Phonon
fr: Installation de Phonon

source: The _A402_ libraries are used by both KDE4 and KF5, but they must be linked to _X38_ and _X76_ respectively.
fr: Les bibliothèques de _A402_ sont utilisées par KDE4 et KF5, mais elles doivent être liées respectivement à _X38_ et _X76_.

source: The two versions do not conflict with each other.
fr: Les deux versions ne sont pas en conflit l'une avec l'autre.

source: If building for KDE4, make sure _X38_ has been built without the bundled _A402_ library.
fr: Si la construction est pour KDE4, soyez certain que _X38_ à été construit sans la bibliothèque _A402_ embarquées.

source: This package provides a better implementation.
fr: Ce paquet fournit une meilleure implémentation.

source: Install the qt4 based version of _A402_ by running the following commands:
fr: Installez la version basée sur qt4 de _A402_ en lançant les commandes suivantes :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Install qt5 based version of_A402_ by running the following commands:
fr: Installez la version basée sur qt5 de _A402_ en lançant les commandes suivantes :

source: If the extracted files of the package are still present from a qt4 version of the build, be sure to remove it and extract a fresh copy of the source files.
fr: Si les fichiers extraits du paquet sont restés depuis la construction d'une version qt4, soyez certain de les effacer et d'extraire une nouvelle copie des fichiers source.

source: Command Explanations
fr: Explications des commandes

source: Silence a lot of warnings caused by the latest toolchain.
fr: Tais un grand nombre d'avertissement causé par la dernière chaîne d'outils.

source: This switch is used to apply higher level of the compiler optimizations.
fr: Ce paramètre est utilisé pour appliquer le niveau le plus haut d'optimisation du compilateur.

source: This switch ensures that the plugins and mkspecs files get installed in the correct location.
fr: Cette option garantit que le greffon et les fichiers mkspecs s'installent au bon endroit.

source: This switch sets the correct installation path for the _A16_ interfaces file.
fr: Cette option initialise le bon chemin d'installation pour le fichier des interfaces _A16_.

source: This switch is used to ensure that Qt5 version of the library is built even if Qt4 is present.
fr: Ce paramètre est utilisé pour s'assurer que la version Qt5 de la bibliothèque est construite même si Qt4 est présent.

source: This switch is used to disable a check that would cause cmake to fail when using Qt-5.4.2 and later.
fr: Ce paramètre est utilisé pour désactiver une vérification qui pourrait faire que cmake échoue en utilisant Qt-5.4.2 ou supérieur.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: libphonon.so, libphonon4qt5.so libphononexperimental.so, and libphonon4qt5experimental.so
fr: libphonon.so, libphonon4qt5.so libphononexperimental.so, et libphonon4qt5experimental.so

source: amd /usr/share/phonon4qt5
fr: et /usr/share/phonon4qt5
