Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/installing/mesa.xml.1.chaine.po
Languages: fr

source: 7.3 MB
fr: 7.3 Mo

source: 317 MB (with tests and docs)
fr: 317 Mo (avec les tests and docs)

source: 2.9 SBU (with tests and docs - all with parallelism = 4)
fr: 2.9 SBU (avec les tests and docs - all with parallelism = 4)

source: Introduction to Mesa
fr: Introduction à Mesa

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Recommended patch:
fr: Correctif recommandé :

source: Mesa Dependencies
fr: Dépendances de Mesa

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: The instructions below assume that _A1103_ and _A1104_ with the r600/amdgpu backend are installed.
fr: Les instructions considères que _A1103_ et _A1104_ avec le moteur r600/amdgpu backend sont installés.

source: You will need to modify the instructions if you choose not to install them.
fr: Vous devrez modifier les instructions si vous choisissez de ne pas les installer.

source: Please note that _A1103_ and _A1104_ are
fr: Merci de noter que _A1103_ et _A1104_ sont

source: required
fr: OBLIGATOIRE

source: for Gallium3D r300, r600 and radeonsi drivers.
fr: pour les pilotes Gallium3D r300, r600 et radeonsi.

source: For an explanation of Gallium3D please see _L2702_ .
fr: Pour une explication de Gallium3D merci de regarder _L2704_.

source: User Notes:
fr: Notes utilisateur :

source: Installation of Mesa
fr: Installation de Mesa

source: If you have downloaded the xdemos patch (needed if testing the Xorg installation per BLFS instructions), apply it by running the following command:
fr: Si vous avez téléchargé le correctif xdemos (nécéssaire pour tester l'installation de Xorg par les instructions de BLFS), appliquez le en lançant la commande suivante :

source: Install _A552_ by running the following commands:
fr: Installez _A552_ en lançant les commandes suivantes :

source: Add wayland to the _O310_ option below if you plan on building _X744_ .
fr: Ajoutez wayland à l'option _O310_ si vous prévoyez de construire _X323_.

source: If you have applied the xdemos patch, build the demo programs by running the following command:
fr: Si vous avez appliqué le correctif Xdemos, construisez les programmes de démo en lançant la commande suivante :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: If you have built the demo programs, install them by running the following command as the _U2_ user:
fr: Si vosu avez construit les programmes de démi, installez les en lançant la commande suivante en tant qu'utilisateur _U2_ :

source: If desired, install the optional documentation by running the following commands as the _U2_ user:
fr: SI vous le désirez, installez la documentation facultative en lançant les commandes suivantes en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: glxgears and glxinfo
fr: glxgears et glxinfo

source: libEGL.so, libgbm.so, libglapi.so, libGLESv1_CM.so, libGLESv2.so, libGL.so, libOSMesa.so, libxatracker.so, libXvMCnouveau.so, and libXvMCr600.so
fr: libEGL.so, libgbm.so, libglapi.so, libGLESv1_CM.so, libGLESv2.so, libGL.so, libOSMesa.so, libxatracker.so, libXvMCnouveau.so, et libXvMCr600.so

source: GL, GLES, GLES2, GLES3, KHR}, lib/{dri, vdpau}} and /usr/share/doc/mesa-&mesa-version; (optional)
fr: GL, GLES, GLES2, GLES3, KHR}, lib/{dri, vdpau}} et /usr/share/doc/mesa-&mesa-version; (facultatif)

source: Short Descriptions
fr: Descriptions courtes

source: is a GL demo useful for troubleshooting graphics problems.
fr: est une démo GL utile pour dépanner des problèmes graphiques.

source: is a diagnostic program that displays information about the graphics hardware and installed GL libraries.
fr: est un programme de diagnostique affichant des informations sur le matériel graphique et les bibliothèques GL installées.

source: provides a native platform graphics interface as defined by the EGL-1.4 specification.
fr: fournit nativement un interface de plate-forme graphique qui est définie avec les spécifications EGL-1.4.

source: is the _A552_ Graphics Buffer Manager library.
fr: est la bibliothèque de gestion du tampon graphique de _A552_.

source: is the _A552_ OpenGL ES 1.1 library.
fr: est la bibliothèque OpenGL ES 1.1 de _A552_.

source: is the _A552_ OpenGL ES 2.0 library.
fr: est la bibliothèque OpenGL ES 2.0 de _A552_.

source: is the main _A552_ OpenGL library.
fr: est la bibliothèque principale OpenGL de _A552_.

source: is the _A552_ Off-screen Rendering library.
fr: est la bibliothèque de rendu hors-ligne de _A552_.

source: is the Xorg Gallium3D acceleration library.
fr: est la bibliothèque d'accélération de Xorg Gallium3D.
