Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/installing/x7driver-ati.xml.1.chaine.po
Languages: fr

source: 804 KB
fr: 804 Ko

source: 10 MB
fr: 10 Mo

source: Introduction to Xorg ATI Driver
fr: Introduction à Xorg ATI Driver

source: The _A1725_ package contains the X.Org Video Driver for ATI Radeon video cards including all chipsets ranging from R100 to R900 and the newer RAxx chipsets.
fr: Le paquet _A1725_ contient le pilote vidéo X.Org pour les cartes graphiques ATI Radeon incluant tous les chipsets de R100 à R900 et les nouveaux Radeon HD.

source: For Direct Rendering to work with newer Radeon Cards (R300 and later chipsets), you need to enable the r300, r600 and radeonsi Gallium drivers at _X250_ build time.
fr: Pour un rendu direct fonctionnel avec les nouvelles cartes (chipsets r300 et au-delà), vous devrez activer la construction des pilotes Gallium radeonsi r300 et r600 dans les instructions _X250_.

source: Also, some cards require Firmware to be available when the kernel driver is loaded.
fr: Egalement, quelques cartes demanderont qu'un Firmware soit disponible quand le pilote du noyau est chargé.

source: Firmware can be obtained from _L2734_ .
fr: Le Firmware peut être obtenu depuis _L2734_.

source: See _X679_ below for additional firmware.
fr: Voir _X679_ dessous pour des firmwares supplémentaires.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Xorg ATI Driver Dependencies
fr: Dépendances de Xorg ATI Driver

source: Required
fr: Requises

source: Glamor is
fr: Glamor est

source: required for "Southern Islands" and later GPUs
fr: requis pour les GPU "Southern Islands"

source: but optional for R300 to R700, Evergreen and "Northern Islands" GPUs - see the link in _X680_ below.
fr: mais facultatifs pour les GPU R300 à R700, Evergreen et "Northern Islands" - voir le lien dans _X680_ dessous.

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: Enable the following options in the kernel configuration and recompile the kernel if necessary:
fr: Activez les options suivantes dans la configuration du noyau et recompilez le noyau si nécessaire :

source: Kernel Configuration for additional firmware
fr: Configuration du noyau pour des firmwares supplémentaires

source: If you need to add firmware, install the file (s) and then point to them in the kernel configuration and recompile the kernel if necessary.
fr: Si vous devez installer un firmware, installez le (x) fichier.

source: To find out which firmware you need, consult the _L3638_ .
fr: Pour trouver les firmware dont vous avez besoin, consultez le décodeur _L3638_.

source: Download any firmware for your card which is named like:
fr: Téléchargez les firmwares pour votre carte qui sont nommés en :

source: Note that for R600 and R700 family, generic _F1652_ and _F1653_ are necessary in adition to the model specific firmware, while for later generations (Evergreen, "Northern Islands" and probably "Southern Islands") you need the _F1654_ in adition to the model specific firmware.
fr: Notez que pour les familles R600 et R700, les firmwares génériques _F1652_ et _F1653_ sont nécessaires en supplément du firmware spécifique au modèle, alors que pour les dernières générations (Evergreen, "Northern Islands" et probablement "Southern Islands") vous aurez besoin de _F1654_ en supplément du firmware spécifique au modèle.

source: Below is an example for Radeon HD6470, which is "Northern Islands" GPU with a network card that also requires the firmware:
fr: Après, il y a un exemple pour une Radeon HD6470, qui est basée sur un GPU "Northern Islands" avec une carte réseau qui demande aussi le firmware :

source: CONFIG_EXTRA_FIRMWARE should all be on one line.
fr: CONFIG_EXTRA_FIRMWARE doit être en une seule ligne.

source: It is shown above as two lines for presentation only.
fr: Il est montré sur deux lignes pour la présentation seulement.

source: You can check _C3219_ output after boot to see which firmware is missing.
fr: Vous pouvez vérifier la sortie de _C3219_ après le démarrage pour voir les firmwares qui sont manquants.

source: Alternatively, if you change CONFIG_DRM_RADEON to '=m' in your .config the firmware can be loaded automatically from /lib/firmware/radeon when it installs the module.
fr: Alternativement, si vous changez CONFIG_DRM_RADEON à '=m' dans votre .config le firmware peut être chargé automatiquement depuis /lib/firmware/radeon quand il installe le module.

source: This offers a tiny space saving, but also means that the screen will be blank for a longer time before the framebuffer appears.
fr: Cela offre un petit espace de libéré, mais aussi signifie que l'écran sera blanc pour un plus long moment avant que le framebuffer apparaisse.

source: Distros take this approach because it is not practical to specify every possible firmware and the kernel would be excessively big.
fr: Les distributions prennent cette approche car il n'est pas pratique de spécifier tous les firmware possible et le noyaux serait excessivmement gros.

source: Installation of Xorg ATI Driver
fr: Installation de Xorg ATI Driver

source: Install _A1725_ by running the following commands:
fr: Installez _A1725_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Glamor Acceleration
fr: Accélération Glamor

source: Glamor is an acceleration library which uses cards' 3D capabilities to accelerate 2D rendering.
fr: Glamor est une bibliothèque d'accélération qui utilise les capacités des cartes 3D pour accéléré le rendu 2D.

source: Glamor acceleration is required for Radeon "Southern Islands" GPUs which use "radeonsi" Gallium3D driver from _X250_ .
fr: L'accélération de Glamor est requise pour les GPU Radéon "Southern Islands" qui utilisent le pilote "radeonsi" Gallium3D de _X250_.

source: To see which cards fall under "Southern Islands" category, read the _L3638_ .
fr: Pour voir quelles cartes fonctionne avec "Southern Islands" , lisez _L3638_.

source: Please note that Glamor acceleration can be used with other chips as well, from the R300 onwards.
fr: Merci de noter que l'accélération Glamor peut être utilisée aussi bien avec d'autres chips, depuis R300.

source: On at least some Northern Islands chips it is beneficial.
fr: Sur au moins certaine puce Northern Islands, c'est bénéficiaire.

source: Glamor acceleration is not enabled by default for chipsets that don't use "radeonsi" Gallium3D driver.
fr: L'accélération Glamor n'est pas active par défaut pour les chipsets qui n'utilise pas le pilote "radeonsi" de Gallium3D.

source: You have to use an _F1655_ file to enable it.
fr: Vous devez utiliser un fichier _F1655_ pour l'activer.

source: To enable Glamor for cards other than "Southern Islands" and later, create the following file in _F1656_ as the _U2_ user:
fr: Pour activer Glamor pour les autres cartes que "Southern Islands" et plus, créez le _F1657_ suivant en tant qu'utilisateur _U2_ :

source: Contents
fr: Contenu

source: ati_drv.so and radeon_drv.so
fr: ati_drv.so et radeon_drv.so

source: Short Descriptions
fr: Descriptions courtes

source: is a wrapper driver for ATI video cards that autodetects ATI video hardware and loads radeon, mach64 or r128 driver.
fr: est un pilote enveloppe pour les cartes video ATI qui détecte le matériel vidéo ATI et charge le pilote radeon, mach64 ou r128.

source: is an Xorg video driver for ATI Radeon based video cards.
fr: est un pilote vidéo Xorg pour les cartes basées sur une ATI Radeon.
