Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/installing/x7driver-intel.xml.1.chaine.po
Languages: fr

source: 14 MB
fr: 14 Mo

source: 86 MB
fr: 86 Mo

source: Introduction to Xorg Intel Driver
fr: Introduction à Xorg Intel Driver

source: The _A734_ package contains the X.Org Video Driver for Intel integrated video cards including 8xx, 9xx, Gxx, Qxx and HD graphics processors (SandyBridge, IvyBridge and Haswell).
fr: Le paquet _A734_ contient le pilote vidéo X.Org pour les cartes graphiques Intel incluant les processeurs graphiques 8xx, 9xx, Gxx, Qxx et HD (SandyBridge, IvyBridge et Haswell).

source: This is a development version of the Intel driver which is needed to work properly with the latest hardware.
fr: C'est une version de développement du pilote Intel qui est nécessaire pour fonctionner correctement avec du matériel récent.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Xorg Intel Driver Dependencies
fr: Dépendances de Xorg Intel Driver

source: Required
fr: Requises

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: Enable the following options in the kernel configuration.
fr: Activer les options suivantes dans la configuration du noyau.

source: Only one of the lines
fr: Seulement une des lignes

source: or
fr: ou

source: needs to be selected.
fr: doit être séléctionnée.

source: If you select the latter,
fr: Si vous sélectionnez la dernière,

source: is needed too.
fr: est nécessaire également.

source: Recompile the kernel if necessary:
fr: recompilez le noyau si nécessaire :

source: Installation of Xorg Intel Driver
fr: Installation de Xorg Intel Driver

source: Install _A734_ by running the following commands:
fr: Installez _A734_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Working around problems with the Intel driver
fr: Contournement des problèmes avec le pilote Intel

source: The SandyBridge New Acceleration (SNA) code is intended to replace the old UXA (UMA Acceleration Architecture), but it is a large body of code and sometimes causes problems.
fr: Le code de la nouvelle accélération SandyBridge (SNA) est prévu pour remplacer l'ancien UXA (UMA Acceleration Architecture), mais c'est une grosse partie de code et parfois il cause des problèmes.

source: In particular, when a system is built with gcc-5 and kernel headers from linux-4.0, trying to run this driver using SNA has been known to segfault on some of the supported chips.
fr: En particulier, quand un système est construit avec gcc-5 et les entêtes du noyaux de linux-4.0, lancer ce pilote en utilisant SNA causera une erreur de segmentation sur certaines des puces supportées.

source: However, the version of the code in the version control system listed above has been tested successfully with both SNA and UXA capabilities.
fr: Cependant, la version du code dans le système de contrôle de version listé plus haut a été testé avec succès avec les fonctions SNA et UXA.

source: To work around this problem, as well as enabling support for UXA, it is necessary to force UXA to be used by creating a configuration file.
fr: Pour contourner ce problème, aussi bien pour que pour l'activation du support UXA il est nécessaire de forcer UXA à être utilisé en créant un fichier de configuration.

source: If this problem applies to you, create the following file as the _U2_ user:
fr: Si vous avez ce problème, créez le fichier suivant en tant qu'utilisteur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This switch allows the old UXA code to be compiled in addition to the default SNA.
fr: Ce paramètre permet que l'ancien code UXA soit compilé en supplément du code SNA par défaut.

source: Contents
fr: Contenu

source: Installed Library
fr: Bibliothèque installée

source: Installed Xorg Driver
fr: Pilote Xorg installé

source: Short Descriptions
fr: Descriptions courtes

source: is an Xorg video driver for Intel integrated graphics chipsets.
fr: est un pilote vidéo Xorg pour les chipsets graphiques Intel.
