Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/installing/x7driver.xml.1.chaine.po
Languages: fr

source: Xorg Drivers
fr: Pilotes Xorg

source: Introduction to Xorg Drivers
fr: Introduction aux pilotes Xorg

source: The _A1715_ page contains the instructions for building Xorg drivers that are necessary in order for Xorg Server to take advantage of the hardware that it is running on.
fr: La page des _A1717_ contient les instructions pour construire les pilotes xorg qui sont nécessaires au serveur Xorg pour exploiter les avantages du matériel qui est en fonctionnement.

source: At least one input and one video driver are required for Xorg Server to start.
fr: Au moins une entrée et un pilote vidéo sont requis pour que le serveur Xorg démarre.

source: On machines using KMS, the modesetting driver is provided by _A1716_ and can be used instead of the video driver for the specific hardware, but with reduced performance.
fr: sur les machines utilisant KMS, le pilote modesetting est fourni par _A1716_ et peut être utilisé à la place du pilote vidéo pour des matériels spécifiques, mais avec une réduction des performances.

source: It can also be used (without hardware acceleration) in virtual machines running under _A832_ .
fr: Il peut être également utilisé (sans l'accélération matérielle) dans les machines virtuelles fonctionnant sous _A832_.

source: If you are unsure which video hardware you have, you can use _C1970_ from _X352_ to find out which video hardware you have and then look at the descriptions of the packages in order to find out which driver you need.
fr: Si vous connaissez le matériel vidéo que vous avez, vous pouvez utiliser _C1970_ de _X352_ pour trouver le matériel vidéo que vous avez et ensuite regarder la description des paquets pour trouver le pilote dont vous avez besoin.

source: In addition to the drivers listed below, there are several other drivers for very old hardware that may still be relevant.
fr: En supplément des pilotes listés, il y a plusieurs autres pilotes pour des matériels très anciens qui peuvent rester utiles.

source: Instructions for building these now unmaintained drivers may be found in a prior version of BLFS:
fr: Les instructions pour construire ces pilotes non-maintenu peuvent être trouvé dans une version précédente de BLFS :

source: Xorg Input Drivers
fr: Pilotes d'entrée Xorg

source: Xorg Video Drivers
fr: Pilotes vidéo Xorg

source: Hardware Video Acceleration
fr: Accélération vidéo matériel
