Repository: espindula/br-lfs
Catalog: blfs/traduc/po/x/installing/xorg-config.xml.1.chaine.po
Languages: fr

source: Xorg-&xorg-version; Testing and Configuration
fr: Xorg-&xorg-version; Test et configuration

source: Testing Xorg
fr: Test de Xorg

source: Before starting Xorg for the first time, is is useful to rebuild the library cache by running
fr: Avant de démarrer Xorg pour la première fois, il est utile de reconstruire le cache des bibliothèques en lançant

source: as the _U2_ user.
fr: en tant qu'utilisatekr _U2_.

source: To test the _A261_ installation, issue
fr: Pour tester l'installation de _A261_ , tapez

source: This command brings up a rudimentary window manager called
fr: Cette commande lance un gestionnaire de fenêtres très rudimentaire appelé

source: with three xterm windows and one xclock window.
fr: avec trois terminaux X.

source: The xterm window in the upper left is a login terminal and running
fr: Le terminal X dans le coin supérieur gauche est un terminal de login et lance

source: from this terminal will exit the _A950_ session.
fr: dans le terminal quand l'on quittera la session _A950_.

source: The third xterm window may be obscured on your system by the other two xterms.
fr: Le troisième terminal X peut être recouvert sur votre système par les deux autres terminaux X.

source: Generally, there is no specific configuration required for _A261_ , but customization is possible.
fr: Généralement, il n'y a pas de configuration spécifique requise pour _A261_ , mais une personnalisation est possible.

source: For details see _X728_ below.
fr: Pour plus de détails voir _X519_ en dessous.

source: or
fr: ou

source: Hybrid Graphics is still in experimental state for Linux.
fr: Hybrid Graphics est expérimental dans Linux.

source: Xorg Developers have developed a technology called PRIME that can be used for switching between integrated and muxless discrete GPU at will.
fr: Les développeurs de Xorg ont mis au point une technologie appelé PRIME qui peut être utilisé pour commuter entre le GPU intégré et le "muxless" à souhait.

source: Automatic switching is not possible at the moment.
fr: La commutation automatique n'est pas possible pour le moment.

source: In order to use PRIME for GPU switching, make sure that you are using Linux Kernel 3.4 or later (recommended).
fr: Pour utiliser PRIME pour la commutation de GPU, soyez certain d'utiliser le noyau Linux 3.4 ou plus (recommandé).

source: You will need latest DRI and DDX drivers for your hardware and _A951_ 1.13 or later with an optional patch applied.
fr: Vous devez avoir les pilotes DRI et DDX pour votre matériel et avoir _A951_ 1.13 ou plus avec un correctif facultatif appliqué.

source: In order to run a GLX application on a discrete GPU, you will need to export the _E98_ environment variable.
fr: Pour lancer une application GLX sur un GPU, vous devez exporter la variable d'environnement _E98_.

source: For example,
fr: Si un test rapide échoue, il peut être désactivé

source: will show OpenGL vendor, renderer and version for the discrete GPU.
fr: affichera le fournisseur OpenGL, le rendu et la version du GPU.

source: If the last command reports same OpenGL renderer with and without _E98_, you will need to check your installation.
fr: Si la dernière commande affiche le même rendu OpenGL avec ou sans _E98_, vous devez vérifier votre installation.

source: Xft Font Protocol
fr: Protocole Xft Font

source: Xft provides antialiased font rendering through _A368_ , and fonts are controlled from the client side using _A263_ .
fr: Xft fournit le rendu des polices anti-crénelage à travers _A368_ , et les polices sont contrôlés par le côté client à l'aide de _A263_.

source: The default search path is _F527_ and _F528_ .
fr: Le chemin de recherche par défaut est _F527_ et _F528_.

source: If the cache appears to be out of date, it is ignored, and information is (slowly) fetched from the fonts themselves.
fr: Si le cache ne semble pas être à jour, il est ignoré, et l'information est (lentement) extraite de la police elles-même.

source: This cache can be regenerated using the _C446_ command at any time.
fr: Ce cache peut être régénéré en utilisant _C1840_ à tout moment.

source: You can see the list of fonts known by _A263_ by running the command _C448_ .
fr: Vous pouvez voir la liste des polices connues par _A263_ en exécutant la commande _C448_.

source: If you've installed _A261_ in any prefix other than _F153_ , the _A502_ fonts were not installed in a location known to _A263_ .
fr: si vous avez installé _A261_ dans n'importe quel préfixe autre que _F153_ , Les polices _A502_ ne seront pas installées dans un emplacement connu par _A263_.

source: This prevents _A263_ from using the poorly rendered Type 1 fonts or the non-scalable bitmapped fonts.
fr: Cela empêche _A263_ d'utiliser le faible rendu des polices Type 1 ou les polices non-évolutive bitmap.

source: Symlinks were created from the _F529_ and _F1348_ _A502_ font directories to _F530_ .
fr: Les liens symboliques sont créés depuis _F529_ et _F1348_ les répertoires de polices _A502_ vers _F530_.

source: This allows _A263_ to use the OpenType and TrueType fonts provided by _A502_ (which are scalable and of higher quality).
fr: Cela autorise _A263_ à utiliser les polices OpenType et TrueType fournies par _A502_ (qui sont évolutives et de qualité supérieure).

source: Applications generally use generic font names such as "Monospace", "Sans" and "Serif".
fr: Les applications utilisent généralement les noms de polices génériques telles que "Monospace", "Sans" et "Serif".

source: Knowledge of these font names is included in _F1279_ .
fr: La connaissance de ces noms de polices est inclus dans _F1279_.

source: Fonts that are not listed in this file are still usable by _A263_ , but they will not be accessible by the generic family names.
fr: Les polices qui ne sont pas répertoriés dans ce fichier restent utilisables par _A263_ , mais elles ne seront pas accessibles par les noms de familles génériques.

source: Standard scalable fonts that come with _A502_ provide very poor Unicode coverage.
fr: Les polices standards évolutives qui accompagnent _A502_ fournissent une très mauvaise couverture d'Unicode.

source: You may notice in applications that use _A952_ that some characters appear as a box with four binary digits inside.
fr: Vous remarquerez peut-être dans les applications qui utilisent _A953_ que certains caractères apparaissent comme une boîte avec quatre chiffres binaires à l'intérieur.

source: In this case, a font set with the available glyphs has not been found.
fr: Dans ce cas, un jeu de polices avec les glyphes disponibles n'a pas été trouvé.

source: Other times, applications that don't use other font families by default and don't accept substitutions from _A263_ will display blank lines when the default font doesn't cover the orthography of the user's language.
fr: D'autres fois, les applications qui n'utilisent pas d'autres familles de polices par défaut et n'ont pas accepté les substitutions de l'_A954_ affichent des lignes vides lorsque la police par défaut ne couvre pas l'orthographe de la langue de l'utilisateur.

source: This happens, e.g., with _A582_ in the ru_RU.KOI8-R locale.
fr: Cela arrive, par exemple avec _A955_ dans la localisation ru_RU.KOI8-R.

source: In order to provide greater Unicode coverage, it is recommended that you install these fonts:
fr: Afin d'offrir une plus grande couverture d'Unicode, il est recommandé que vous installiez ces polices :

source: Be sure to read the license before using them.
fr: Soyez sûr de lire la licence avant de les utiliser.

source: These fonts are listed in the aliases in the _F156_ directory by default.
fr: Ces polices sont énumérés dans les alias du répertoire _F156_ par défaut.

source: This font is listed in the aliases in the the _F156_ directory by default.
fr: Ces polices sont énumérés dans les alias du répertoire _F156_ par défaut.

source: It is particularly optimised for legibility at small sizes and is the preferred font family for the _A229_ user interface.
fr: Elle est particulièrement optimisée pour être lisible dans les petites tailles et est la famille de polices préférée pour l'interface utilisateur de _A229_.

source: The list above will not provide complete Unicode coverage.
fr: La liste ci-dessus ne donnera pas une couverture complète d'Unicode.

source: For more information, please visit the _L2049_ .
fr: Pour plus d'informations, vous pouvez consulter le _L2049_.

source: Rendered examples of many of the above fonts can be found at this _L2050_ site.
fr: Des exemples de rendu de beaucoup des polices peuvent être trouvés sur ce site _L2050_.

source: As a font installation example, consider the installation of the DejaVu fonts.
fr: Par exemple, considérons l'installation des polices DejaVu.

source: From the unpacked source directory, run the following commands as the _U2_ user:
fr: A partir du répertoire source décompressé, exécuter les commandes suivantes en tant que _U2_ :

source: Setting up Xorg Devices
fr: Configuration des périphériques Xorg

source: For most hardware configurations, modern Xorg will automatically get the server configuration correct without any user intervention.
fr: Pour la plupart des configurations matérielles, Xorg va automatiquement obtenir la configuration correcte du serveur sans aucune intervention de l'utilisateur.

source: There are, however, some cases where auto-configuration will be incorrect.
fr: Il existe, cependant, certains cas où l'auto-configuration sera incorrecte.

source: Following are some example manual configuration items that may be of use in these instances.
fr: Voici quelques exemples de la configuration manuelle qui peuvent être utile dans ces cas la.

source: Setting up X Input Devices
fr: Configuration des périphériques X d'entrée

source: For most input devices, no additional configuration will be necessary.
fr: Pour la plupart des appareils d'entrée, aucune configuration supplémentaire sera nécessaires.

source: This section is provided for informational purposes only.
fr: Cette section est fourni à titre informatif seulement.

source: A sample default XKB setup could look like the following (executed as the _U2_ user):
fr: Un exemple de configuration XKB par défaut peut être comme le suivant (exécuté en tant que _U2_) :

source: Fine Tuning Display Settings
fr: Réglage fin des paramètres d'affichage

source: Again, with modern Xorg, little or no additional configuration is necessary.
fr: Encore une fois, avec Xorg, peu ou aucune configuration supplémentaire n'est nécessaires.

source: If you should need extra options passed to your video driver, for instance, you could use something like the following (again, executed as the _U2_ user):
fr: Si vous avez besoin d'options supplémentaires à passer à votre pilote vidéo, par exemple, vous pouvez utiliser ce qui suit (de nouveau, executé en tant que _U2_) :

source: Another common setup is having multiple server layouts for use in different environments.
fr: Une autre configuration courante est d'avoir des configurations multi-serveurs pour une utilisation dans des environnements différents.

source: Though the server will automatically detect the presence of another monitor, it may get the order incorrect:
fr: Bien que le serveur détecte automatiquement la présence d'un autre moniteur, il peut obtenir un ordre incorrect :
