Repository: espindula/br-lfs
Catalog: blfs/*/gnome/platform/gnome-shell-extensions.po
Languages: fr

source: 204 KB
fr: 204&nbsp;Ko

source: 4.3 MB
fr: 4.3 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to GNOME Shell Extensions
fr: Introduction à GNOME Shell Extensions

source: The <application>GNOME Shell Extensions</application> package contains a collection of extensions providing additional and optional functionality to the <application>GNOME Shell</application>.
fr: Le paquet <application>GNOME Shell Extensions</application> contient une collection de greffons fournissant des fonctionnalités supplémentaires et facultatives à <application>GNOME Shell</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-shell-extensions-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-shell-extensions-download-http;"/>

source: Download (FTP): <ulink url="&gnome-shell-extensions-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-shell-extensions-download-ftp;"/>

source: Download MD5 sum: &gnome-shell-extensions-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-shell-extensions-md5sum;

source: Download size: &gnome-shell-extensions-size;
fr: Taille du téléchargement&nbsp;: &gnome-shell-extensions-size;

source: Estimated disk space required: &gnome-shell-extensions-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-shell-extensions-buildsize;

source: Estimated build time: &gnome-shell-extensions-time;
fr: Estimation du temps de construction&nbsp;: &gnome-shell-extensions-time;

source: GNOME Shell Extensions Dependencies
fr: Dépendances de GNOME Shell Extensions

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/gnome-shell-extensions"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-shell-extensions"/>

source: Installation of GNOME Shell Extensions
fr: Installation de GNOME Shell Extensions

source: Install <application>GNOME Shell Extensions</application> by running the following commands:
fr: Installez <application>GNOME Shell Extensions</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun #-# Aucune
