Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/sgml/docbook-utils.xml.1.chaine.po
Languages: fr

source: 124 KB
fr: 124 Ko

source: 1.44 MB
fr: 1.44 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to DocBook-utils
fr: Introduction à DocBook-utils

source: The _A848_ package is a collection of utility scripts used to convert and analyze SGML documents in general, and DocBook files in particular.
fr: Le paquet _A848_ est un ensemble d'outils scriptés utilisés pour convertir et analyser des documents SGML en général, et des fichiers DocBook en particulier.

source: The scripts are used to convert from DocBook or other SGML formats into
fr: Les scripts sont utilisés pour convertir à partir de DocBook ou d'autres formats SGML en formats de fichier

source: classical
fr: classiques

source: file formats like HTML, man, info, RTF and many more.
fr: comme HTML, man, info, RTF et bien davantage.

source: There's also a utility to compare two SGML files and only display the differences in markup.
fr: Il existe aussi un outil pour comparer deux fichiers SGML et n'affiche que les différences entre les balises.

source: This is useful for comparing documents prepared for different languages.
fr: C'est utile pour comparer des documents préparés pour différents langages.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: DocBook-utils Dependencies
fr: Dépendances de DocBook-utils

source: Required
fr: Requises

source: Optional (Runtime Dependencies Only)
fr: Optionnelles (au moment de l'exécution seulement)

source: User Notes:
fr: Notes utilisateur :

source: Installation of DocBook-utils
fr: Installation de DocBook-utils

source: Install _A848_ by running the following commands:
fr: Installez _A848_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Many packages use an alternate name for the _A848_ scripts.
fr: De nombreux paquets utilisent nom différent pour les scripts _A848_.

source: If you wish to create these alternate names, use the following command as the _U2_ user:
fr: Si vous souhaitez créer ces noms alternatifs, utilisez la commande suivante en tant qu'utilisateur _U2_ :

source: The _C2274_ script uses the _C2275_ command to locate required utilities.
fr: Le script _C2274_ utilise la commande _C2275_ pour localiser les outils requis.

source: You must install _X12_ before attempting to use any of the _A848_ programs.
fr: Vous devez installer _X12_ avant d'essayer d'utiliser un des programmes _A848_.

source: Command Explanations
fr: Explications des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: docbook2dvi, docbook2html, docbook2man, docbook2pdf, docbook2ps, docbook2rtf, docbook2tex, docbook2texi, docbook2txt, jw, and sgmldiff
fr: docbook2dvi, docbook2html, docbook2man, docbook2pdf, docbook2ps, docbook2rtf, docbook2tex, docbook2texi, docbook2txt, jw, et sgmldiff

source: None
fr: Aucun

source: /usr/share/doc/docbook-utils-&docbook-utils-version; and /usr/share/sgml/docbook/utils-&docbook-utils-version;
fr: /usr/share/doc/docbook-utils-&docbook-utils-version; et /usr/share/sgml/docbook/utils-&docbook-utils-version;

source: db2dvi, db2html, db2man, db2pdf, db2ps, db2rtf, db2tex, db2texi, and db2txt
fr: db2dvi, db2html, db2man, db2pdf, db2ps, db2rtf, db2tex, db2texi, et db2txt

source: Short Descriptions
fr: Descriptions courtes

source: are simple one-line wrapper scripts to _C2274_ .
fr: sont de simples scripts enveloppes d'une ligne vers _C2274_.

source: They are provided as easy-to-remember names used to convert DocBook or other SGML files to the respective format.
fr: Ils sont fournis pour donner des noms faciles à mémoriser utilisés pour convertir des fichiers DocBook ou SGML ou autres dans leurs formats respectifs.

source: are symlinks pointing at the respectively named _C3551_ commands, created to satisfy some program's use of these names.
fr: sont des liens symboliques pointant vers des commandes _C3554_ respectivement nommés, créés pour satisfaire certaines utilisations par le programme de ces tests.

source: is a script used to convert DocBook or other SGML files to various output formats.
fr: est un script utilisé pour convertir des fichiers DocBook ou autres SGML en divers formats de sortie.

source: It hides most of _A1092_ 's complexity and adds comfortable features.
fr: Il cache la plupart de la complexité de _A1092_ et ajoute des fonctionnalités comfortables.

source: is used to compare two SGML files and only return the differences in the markup.
fr: est utilisé pour comparer deux fichiers SGML et ne retourner que les différences dans les balises.

source: This is especially useful to compare files that should be identical except for language differences in the content.
fr: C'est surtout utile pour comparer des fichiers qui devraient être identiques, sauf pour les différences de langue dans le contenu.
