Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/sgml/opensp.xml.1.chaine.po
Languages: fr

source: 1.5 MB
fr: 1.5 Mo

source: 32 MB
fr: 32 Mo

source: Introduction to OpenSP
fr: Introduction à OpenSP

source: The _A794_ package contains a _A21_ library for using SGML/XML files.
fr: Le paquet _A794_ contient une bibliothèque _A21_ pour utiliser des fichiers SGML/XML.

source: This is useful for validating, parsing and manipulating SGML and XML documents.
fr: C'est utile pour valider, analyser et manipuler des documents SGML et XML.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: OpenSP Dependencies
fr: Dépendances d'OpenSP

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of OpenSP
fr: Installation d'OpenSP

source: Install _A794_ by running the following commands:
fr: Installez _A794_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: As many as nine of the 23 tests may fail.
fr: Il se peut que près de neuf tests sur 23 échouent.

source: Do not be alarmed.
fr: Ne vous en alarmez pas.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: These seds prevent some annoying messages that may otherwise appear while running _C1460_ .
fr: seds empêchent des messages ennuyeux qui pourraient apparaître pendant l'exécution d'_C1460_.

source: This switch prevents the building of the static library.
fr: Ce paramètre empêche la construction d'une bibliothèque statique.

source: This switch adds support for HTTP.
fr: Ce paramètre ajoute le support de HTTP.

source: This switch sets the path to the centralized catalog.
fr: Ce paramètre règle le chemin vers le catalogue centralisé.

source: This switch sets the default value of _E80_.
fr: Ce paramètre règle la valeur par défaut de _E80_.

source: This switch adds support for XML Formatted Messages.
fr: Ce paramètre ajoute le support pour les messages formatés en XML.

source: This switch prevents the _C101_ script checking if you have _A288_ installed.
fr: Ce paramètre empêche le script _C101_ de vérifier si vous avez installé _A288_.

source: If you have _A288_ , you can remove this option.
fr: Si vous avez _A288_ , vous pouvez supprimer cette option.

source: This sets the pkgdatadir variable in the _F1028_ from _F444_ to _F1228_ .
fr: Ceci paramètre la variable pkgdatadir dens le _F1028_ de _F444_ en _F1228_.

source: These commands create the _A795_ equivalents of _A794_ executables and libraries.
fr: Ces commandes créent les équivalents _A795_ des exécutables et des bibliothèques d'_A794_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: onsgmls, osgmlnorm, ospam, ospcat, ospent, osx, and the _A795_ equivalent symlinks:
fr: onsgmls, osgmlnorm, ospam, ospcat, ospent, osx, et the _A795_ equivalent symlinks :

source: nsgmls, sgml2xml, sgmlnorm, spam, spcat, spent, and sx
fr: nsgmls, sgml2xml, sgmlnorm, spam, spcat, spent, et sx

source: libosp.so and the _A795_ equivalent symlink:
fr: libosp.so et the _A795_ equivalent symlink :

source: /usr/include/OpenSP, /usr/share/doc/OpenSP, and /usr/share/sgml/OpenSP-&opensp-version;
fr: /usr/include/OpenSP, /usr/share/doc/OpenSP, et /usr/share/sgml/OpenSP-&opensp-version;

source: Short Descriptions
fr: Descriptions courtes

source: is used to process SGML files.
fr: est utiliser pour traiter des fichiers SGML.

source: prints on the standard output a normalized document instance for the SGML document contained in the concatenation of the entities with system identifiers .nf and .fi.
fr: affiche sur la sortie standard une instance de document normalisé pour le document SGML contenu dans la concaténation des entités avec des identifiants systèmes .nf et .fi.

source: is a markup stream editor.
fr: est un éditeur de flux de balises.

source: prints effective system identifiers found in the catalogs.
fr: affiche des identifiants systèmes effectifs trouvés dans les catalogues.

source: provides access to _A794_ 's entity manager.
fr: offre l'accès au gestionnaire d'entités d'_A794_.

source: is an SGML normalizer or used to convert SGML files to XML files.
fr: est un normaliseur utilisé pour convertir des fichiers SGML en fichiers XML.

source: is a symlink to _C1463_ .
fr: est un lien symbolique vers _C1463_.

source: is a symlink to _C1468_ .
fr: est un lien symbolique vers _C1468_.

source: is a symlink to _C1464_ .
fr: est un lien symbolique vers _C1464_.

source: is a symlink to _C1465_ .
fr: est un lien symbolique vers _C1465_.

source: is a symlink to _C1466_ .
fr: est un lien symbolique vers _C1466_.

source: is a symlink to _C1467_ .
fr: est un lien symbolique vers _C1467_.

source: contains functions required by the _A794_ programs to parse, validate and manipulate SGML and XML files.
fr: contient des fonctions requises par le programmes _A794_ pour analyser, valider et manipuler des fichiers SGML et XML.

source: is a symlink to _F445_ .
fr: est un lien symbolique vers _F445_.
