Repository: espindula/br-lfs
Catalog: blfs/*/archive/lxqt/desktop/liblxqt-mount.po
Languages: fr

source: 20 KB
fr: 20 Kio

source: 1.1 MB
fr: 1.1 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to liblxqt-mount
fr: Introduction à liblxqt-mount

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&liblxqt-mount-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&liblxqt-mount-download-http;"/>

source: Download (FTP): <ulink url="&liblxqt-mount-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&liblxqt-mount-download-ftp;"/>

source: Download MD5 sum: &liblxqt-mount-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &liblxqt-mount-md5sum;

source: Download size: &liblxqt-mount-size;
fr: Taille du téléchargement&nbsp;: &liblxqt-mount-size;

source: Estimated disk space required: &liblxqt-mount-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &liblxqt-mount-buildsize;

source: Estimated build time: &liblxqt-mount-time;
fr: Estimation du temps de construction&nbsp;: &liblxqt-mount-time;

source: liblxqt-mount Dependencies
fr: Dépendances de liblxqt-mount

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/liblxqt-mount"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/liblxqt-mount"/>

source: Installation of liblxqt-mount
fr: Installation de liblxqt-mount

source: Install <application>liblxqt-mount</application> by running the following commands:
fr: Installez <application>liblxqt-mount</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: contains the <application>liblxqt-mount</application> API functions.
fr: Contient les fonctions de l'API de <application>liblxqt-mount</application>
