Repository: espindula/br-lfs
Catalog: po/chapter02/creatingpartition.po
Languages: pt_br

source: Creating a New Partition
pt_br: Criando uma Nova Partição

source: Like most other operating systems, LFS is usually installed on a dedicated partition. The recommended approach to building an LFS system is to use an available empty partition or, if you have enough unpartitioned space, to create one.
pt_br: Como a maior parte dos outros sistemas operacionais, o LFS geralmente é instalado em uma partição dedicada. A abordagem recomendada para construir um sistema LFS é a de usar uma partição disponível vazia ou, se você tiver espaço suficiente não particionado, criar uma.

source: A minimal system requires a partition of around 10 gigabytes (GB). This is enough to store all the source tarballs and compile the packages. However, if the LFS system is intended to be the primary Linux system, additional software will probably be installed which will require additional space. A 30 GB partition is a reasonable size to provide for growth. The LFS system itself will not take up this much room. A large portion of this requirement is to provide sufficient free temporary storage as well as for adding additional capabilities after LFS is complete. Additionally, compiling packages can require a lot of disk space which will be reclaimed after the package is installed.
pt_br: Um sistema mínimo exige uma partição com cerca de dez (10) gigabytes (GB). Isso é suficiente para armazenar todos os tarballs dos fontes e compilar os pacotes. Entretanto, se o sistema LFS for concebido para ser o sistema Linux principal, [então] aplicativos adicionais provavelmente serão instalados os quais exigirão espaço adicional. Uma partição de trinta (30) GB é um tamanho razoável para permitir o crescimento. O sistema LFS em si não ocupará esse espaço todo. Uma boa parte dessa exigência é para fornecer armazenamento temporário livre suficiente. Adicionalmente, a compilação de pacotes pode exigir um monte de espaço de disco que será recuperado após o pacote ser instalado.

source: Because there is not always enough Random Access Memory (RAM) available for compilation processes, it is a good idea to use a small disk partition as <systemitem class="filesystem">swap</systemitem> space. This is used by the kernel to store seldom-used data and leave more memory available for active processes. The <systemitem class="filesystem">swap</systemitem> partition for an LFS system can be the same as the one used by the host system, in which case it is not necessary to create another one.
pt_br: Como nem sempre existe Memória de Acesso Aleatório (RAM) suficiente disponível para processos de compilação, é uma boa ideia usar uma pequena partição de disco como espaço de <systemitem class="filesystem">swap</systemitem>. Ele é usado pelo kernel para armazenar dados raramente usados e deixa mais memória disponível para processos ativos. A partição de <systemitem class="filesystem">swap</systemitem> para um sistema LFS pode ser a mesma que aquela usada pelo sistema anfitrião, caso no qual não é necessário criar outra.

source: Start a disk partitioning program such as <command>cfdisk</command> or <command>fdisk</command> with a command line option naming the hard disk on which the new partition will be created&mdash;for example <filename class="devicefile">/dev/sda</filename> for the primary disk drive. Create a Linux native partition and a <systemitem class="filesystem">swap</systemitem> partition, if needed. Please refer to <filename>cfdisk(8)</filename> or <filename>fdisk(8)</filename> if you do not yet know how to use the programs.
pt_br: Inicie um aplicativo de particionamento de disco como o <command>cfdisk</command> ou o <command>fdisk</command> com uma opção de linha de comando indicando o disco rígido no qual a nova partição será criada&mdash;por exemplo <filename class="devicefile">/dev/sda</filename> para a unidade primária de disco. Crie uma partição nativa Linux e uma partição <systemitem class="filesystem">swap</systemitem>, se necessária. Por favor, recorra a <filename>cfdisk(8)</filename> ou a <filename>fdisk(8)</filename> se você ainda não sabe como usar os aplicativos.

source: For experienced users, other partitioning schemes are possible. The new LFS system can be on a software <ulink url="&blfs-book;postlfs/raid.html">RAID</ulink> array or an <ulink url="&blfs-book;postlfs/aboutlvm.html">LVM</ulink> logical volume. However, some of these options require an <ulink url="&blfs-book;postlfs/initramfs.html">initramfs</ulink>, which is an advanced topic. These partitioning methodologies are not recommended for first time LFS users.
pt_br: Para usuários experientes, outros esquemas de partição são possíveis. O novo sistema LFS pode estar em um vetor de software <ulink url="&blfs-book;postlfs/raid.html">RAID</ulink> ou em um volume lógico <ulink url="&blfs-book;postlfs/aboutlvm.html">LVM</ulink>. Entretanto, algumas dessas opções exigem um <ulink url="&blfs-book;postlfs/initramfs.html">initramfs</ulink>, o que é um tópico avançado. Essas metodologias de particionamento não são recomendadas para usuárias(os) do LFS pela primeira vez.

source: Remember the designation of the new partition (e.g., <filename class="devicefile">sda5</filename>). This book will refer to this as the LFS partition. Also remember the designation of the <systemitem class="filesystem">swap</systemitem> partition. These names will be needed later for the <filename>/etc/fstab</filename> file.
pt_br: Lembre-se da designação da nova partição (por exemplo, <filename class="devicefile">sda5</filename>). Este livro se referirá a essa como a partição do LFS. Lembre-se também da designação da partição <systemitem class="filesystem">swap</systemitem>. Esses nomes serão necessários posteriormente para o arquivo <filename>/etc/fstab</filename>.

source: Other Partition Issues
pt_br: Outros Problemas de Partição

source: Requests for advice on system partitioning are often posted on the LFS mailing lists. This is a highly subjective topic. The default for most distributions is to use the entire drive with the exception of one small swap partition. This is not optimal for LFS for several reasons. It reduces flexibility, makes sharing of data across multiple distributions or LFS builds more difficult, makes backups more time consuming, and can waste disk space through inefficient allocation of file system structures.
pt_br: Solicitações de conselhos a respeito de particionamento do sistema frequentemente são postados nas listas de discussão do LFS. Esse é um tópico altamente subjetivo. O padrão para a maioria das distribuições é o de usar a unidade inteira com a exceção de uma pequena partição de swap. Isso não é ideal para o LFS por várias razões. Isso reduz flexibilidade; torna o compartilhamento de dados entre múltiplas distribuições ou construções do LFS mais difícil; torna as cópias de segurança mais demoradas; e podem desperdiçar espaço de disco devido à alocação ineficiente de estruturas do sistema de arquivos.

source: The Root Partition
pt_br: A Partição Raiz

source: A root LFS partition (not to be confused with the <filename class="directory">/root</filename> directory) of twenty gigabytes is a good compromise for most systems. It provides enough space to build LFS and most of BLFS, but is small enough so that multiple partitions can be easily created for experimentation.
pt_br: Uma partição raiz do LFS (não confundir com o diretório <filename class="directory">/root</filename>) de vinte (20) gigabytes é uma boa escolha para a maior parte dos sistemas. Ela fornece espaço suficiente para construir o LFS e a maior parte do BLFS, mas é pequena o suficiente de forma que múltiplas partições podem ser criadas facilmente para experimentação.

source: The Swap Partition
pt_br: A Partição Swap

source: Most distributions automatically create a swap partition. Generally the recommended size of the swap partition is about twice the amount of physical RAM, however this is rarely needed. If disk space is limited, hold the swap partition to two gigabytes and monitor the amount of disk swapping.
pt_br: A maioria das distribuições automaticamente cria uma partição swap. Geralmente o tamanho recomendado da partição swap é o de cerca de o dobro da quantidade de RAM física, entretanto isso raramente é necessário. Se o espaço de disco for limitado, [então] mantenha a partição swap com dois (2) gigabytes e monitore a quantidade de troca de disco.

source: If you want to use the hibernation feature (suspend-to-disk) of Linux, it writes out the contents of RAM to the swap partition before turning off the machine. In this case the size of the swap partition should be at least as large as the system's installed RAM.
pt_br: Se você quiser usar o recurso da hibernação do Linux (suspend-to-disk), copia o conteúdo da RAM para a partição swap antes de desligar a máquina. Nesse caso o tamanho da partição swap deveria ser pelo menos tão grande quanto a RAM instalada do sistema.

source: Swapping is never good. For mechanical hard drives you can generally tell if a system is swapping by just listening to disk activity and observing how the system reacts to commands. With an SSD you will not be able to hear swapping, but you can tell how much swap space is being used by running the <command>top</command> or <command>free</command> programs. Use of an SSD for a swap partition should be avoided if possible. The first reaction to swapping should be to check for an unreasonable command such as trying to edit a five gigabyte file. If swapping becomes a normal occurrence, the best solution is to purchase more RAM for your system.
pt_br: O uso de swap nunca é bom. Para unidades rígidas mecânicas você geralmente pode dizer se um sistema está usando swap simplesmente monitorando a atividade do disco e observando como o sistema reage a comandos. Com um SSD você não estará apta(o) a monitorar swap, porém você consegue dizer quanto espaço de swap está sendo usado executando os aplicativos <command>top</command> ou <command>free</command>. O uso de um SSD para uma partição swap deveria ser evitado se possível. A primeira reação em caso de uso de swap deveria ser verificar se existe um comando irracional como tentar editar um arquivo de cinco gigabytes. Se o uso de swap se tornar uma ocorrência recorrente, [então] a melhor solução é a de comprar mais RAM para seu sistema.

source: The Grub Bios Partition
pt_br: A Partição de Bios Grub

source: If the <emphasis>boot disk</emphasis> has been partitioned with a GUID Partition Table (GPT), then a small, typically 1 MB, partition must be created if it does not already exist. This partition is not formatted, but must be available for GRUB to use during installation of the boot loader. This partition will normally be labeled 'BIOS Boot' if using <command>fdisk</command> or have a code of <emphasis>EF02</emphasis> if using the <command>gdisk</command> command.
pt_br: Se o <emphasis>disco de inicialização</emphasis> tiver sido particionado com a Tabela de Partição GUID (GPT), então uma partição pequena, tipicamente um (1) MB, precisa ser criada se ela já não existir. Essa partição não é formatada, porém precisa estar disponível para o GRUB usar durante a instalação do carregador de inicialização. Essa partição normalmente será rotulada de 'BIOS Boot' se usar o <command>fdisk</command> ou terá um código de <emphasis>EF02</emphasis> se usar o comando <command>gdisk</command>.

source: The Grub Bios partition must be on the drive that the BIOS uses to boot the system. This is not necessarily the drive that holds the LFS root partition. The disks on a system may use different partition table types. The necessity of the Grub Bios partition depends only on the partition table type of the boot disk.
pt_br: A Partição de Bios Grub precisa estar na unidade que o BIOS usa para inicializar o sistema. Essa não é necessariamente a unidade que mantém a partição raiz do LFS. Os discos em um sistema possivelmente usem tipos diferentes de tabela de partição. A necessidade da partição de Bios Grub depende apenas do tipo de tabela de partição do disco de inicialização.

source: Convenience Partitions
pt_br: Partições de Conveniência

source: There are several other partitions that are not required, but should be considered when designing a disk layout. The following list is not comprehensive, but is meant as a guide.
pt_br: Existem várias outras partições que não são exigidas, porém deveriam ser consideradas ao se projetar um layout de disco. A lista seguinte não é abrangente, mas é entendida como um guia.

source: /boot &ndash; Highly recommended. Use this partition to store kernels and other booting information. To minimize potential boot problems with larger disks, make this the first physical partition on your first disk drive. A partition size of 200 megabytes is adequate.
pt_br: /boot &ndash; Altamente recomendada. Use essa partição para armazenar os kerneis e outras informações de inicialização. Para minimizar potenciais problemas de inicialização com discos maiores, torne essa a primeira partição física na sua primeira unidade de disco. Um tamanho de partição de duzentos (200) megabytes é adequado.

source: /boot/efi &ndash; The EFI System Partition, which is needed for booting the system with UEFI. Read <ulink url="&blfs-book;postlfs/grub-setup.html">the BLFS page</ulink> for details.
pt_br: /boot/efi &ndash; A Partição do Sistema EFI, a qual é necessária para inicializar o sistema com UEFI. Leia-se <ulink url="&blfs-book;postlfs/grub-setup.html">a página do BLFS</ulink> para detalhes.

source: /home &ndash; Highly recommended. Share your home directory and user customization across multiple distributions or LFS builds. The size is generally fairly large and depends on available disk space.
pt_br: /home &ndash; Altamente recomendada. Compartilhe seu diretório home e personalizações de usuário(a) entre múltiplas distribuições ou construções do LFS. O tamanho geralmente é bastante grande e depende do espaço de disco disponível.

source: /usr &ndash; In LFS, <filename class="directory">/bin</filename>, <filename class="directory">/lib</filename>, and <filename class="directory">/sbin</filename> are symlinks to their counterparts in <filename class="directory">/usr</filename>. So <filename class="directory">/usr</filename> contains all the binaries needed for the system to run. For LFS a separate partition for <filename class="directory">/usr</filename> is normally not needed. If you create it anyway, you should make a partition large enough to fit all the programs and libraries in the system. The root partition can be very small (maybe just one gigabyte) in this configuration, so it's suitable for a thin client or diskless workstation (where <filename class="directory">/usr</filename> is mounted from a remote server). However, you should be aware that an initramfs (not covered by LFS) will be needed to boot a system with a separate <filename class="directory">/usr</filename> partition.
pt_br: /usr &ndash; No LFS, <filename class="directory">/bin</filename>, <filename class="directory">/lib</filename> e <filename class="directory">/sbin</filename> são links simbólicos para seus homólogos em <filename class="directory">/usr</filename>. Assim <filename class="directory">/usr</filename> contém todos os binários necessários para o sistema executar. Para o LFS, uma partição separada para <filename class="directory">/usr</filename> normalmente não é necessária. Se, de qualquer maneira, você criá-la, [então] você deveria tornar uma partição grande o suficiente para acomodar todos os aplicativos e bibliotecas no sistema. A partição raiz pode ser bem pequena (talvez apenas um gigabyte) nessa configuração, de forma que ela seja adequada para um "thin client" ou estação de trabalho sem disco (onde <filename class="directory">/usr</filename> é montado a partir de um servidor remoto). Entretanto, você deveria estar ciente de que um initramfs (não coberto pelo LFS) será necessário para inicializar um sistema com partição <filename class="directory">/usr</filename> separada.

source: /opt &ndash; This directory is most useful for BLFS, where multiple large packages like KDE or Texlive can be installed without embedding the files in the /usr hierarchy. If used, 5 to 10 gigabytes is generally adequate.
pt_br: /opt &ndash; Esse diretório é mais útil para o BLFS onde múltiplos pacotes grandes como o KDE ou o Texlive podem ser instalados sem embutir os arquivos na hierarquia /usr. Se usado, 5 a 10 gigabytes geralmente é adequado.

source: /tmp &ndash; A separate /tmp directory is rare, but useful if configuring a thin client. This partition, if used, will usually not need to exceed a couple of gigabytes. If you have enough RAM, you can mount a <systemitem class='filesystem'>tmpfs</systemitem> on /tmp to make access to temporary files faster.
pt_br: /tmp &ndash; Um diretório /tmp separado é raro, mas útil ao se configurar um "thin client". Essa partição, se usada, geralmente não precisará exceder um par de gigabytes.Se você tiver RAM suficiente, você consegue montar um <systemitem class='filesystem'>tmpfs</systemitem> no /tmp para tornar o acesso a arquivos temporários mais rápido.

source: /tmp &ndash; By default, systemd mounts a <systemitem class='filesystem'>tmpfs</systemitem> here. If you want to override that behavior, follow <xref linkend='systemd-no-tmpfs'/> when configuring the LFS system.
pt_br: /tmp &ndash; Por padrão, o systemd monta um <systemitem class='filesystem'>tmpfs</systemitem> aqui. Se você quiser substituir esse comportamento, siga <xref linkend='systemd-no-tmpfs'/> quando configurar o sistema LFS.

source: /usr/src &ndash; This partition is very useful for providing a location to store BLFS source files and share them across LFS builds. It can also be used as a location for building BLFS packages. A reasonably large partition of 30-50 gigabytes provides plenty of room.
pt_br: /usr/src &ndash; Essa partição é muito útil para disponibilizar um local para armazenar os arquivos fonte do BLFS e compartilhá-los entre construções do LFS. Ela também pode ser usada como um local para construir pacotes do BLFS. Uma partição razoavelmente grande de 30 a 50 gigabytes fornece abundância de espaço.

source: Any separate partition that you want automatically mounted when the system starts must be specified in the <filename>/etc/fstab</filename> file. Details about how to specify partitions will be discussed in <xref linkend="ch-bootable-fstab"/>.
pt_br: Qualquer partição separada que você queira montada automaticamente quando o sistema iniciar precisa ser especificada no arquivo <filename>/etc/fstab</filename>. Detalhes a respeito do como especificar partições serão discutidos em <xref linkend="ch-bootable-fstab"/>.
