Repository: espindula/br-lfs
Catalog: po/chapter02/creatingfilesystem.po
Languages: pt_br

source: Creating a File System on the Partition
pt_br: Criando um Sistema de Arquivos na Partição

source: A partition is just a range of sectors on a disk drive, delimited by boundaries set in a partition table. Before the operating system can use a partition to store any files, the partition must be formatted to contain a file system, typically consisting of a label, directory blocks, data blocks, and an indexing scheme to locate a particular file on demand. The file system also helps the OS keep track of free space on the partition, reserve the needed sectors when a new file is created or an existing file is extended, and recycle the free data segments created when files are deleted. It may also provide support for data redundancy, and for error recovery.
pt_br: Uma partição é apenas um intervalo de setores em uma unidade de disco, delimitados por fronteiras configuradas em uma tabela de partição. Antes do sistema operacional conseguir usar uma partição para armazenar quaisquer arquivos, a partição precisa estar formatada para conter um sistema de arquivos, tipicamente consistindo de um rótulo, blocos de diretório, blocos de dados e um esquema de indexação para localizar um arquivo em particular mediante demanda. O sistema de arquivos também auxilia o SO a manter rastreio do espaço livre na partição; reservar os setores necessários quando um arquivo novo for criado ou um arquivo existente for estendido; e reciclar os segmentos de dados livres criados quando arquivos são deletados. Possivelmente também forneça suporte para redundância de dados e para recuperação dos erros.

source: LFS can use any file system recognized by the Linux kernel, but the most common types are ext3 and ext4. The choice of the right file system can be complex; it depends on the characteristics of the files and the size of the partition. For example:
pt_br: O LFS consegue usar qualquer sistema de arquivos reconhecido pelo kernel Linux, mas os tipos mais comuns são ext3 e ext4. A escolha do sistema de arquivos certo pode ser complexa; depende das características dos arquivos e do tamanho da partição. Por exemplo:

source: is suitable for small partitions that are updated infrequently such as /boot.
pt_br: é adequado para partições pequenas que são atualizadas com pouca frequência tais como /boot.

source: is an upgrade to ext2 that includes a journal to help recover the partition's status in the case of an unclean shutdown. It is commonly used as a general purpose file system.
pt_br: é uma atualização do ext2 que inclui um diário para ajudar a recuperar a situação da partição no caso de desligamento inadequado. É comumente usada como sistema de arquivos de propósito geral.

source: is the latest version of the ext family of file systems. It provides several new capabilities including nano-second timestamps, creation and use of very large files (up to 16 TB), and speed improvements.
pt_br: é a versão mais recente da família ext de sistemas de arquivos. Ela fornece várias capacidades novas incluindo carimbos de tempo em nano segundos; criação e uso de arquivos muito grandes (até 16 TB); e melhoramentos de velocidade.

source: Other file systems, including FAT32, NTFS, ReiserFS, JFS, and XFS are useful for specialized purposes. More information about these file systems, and many others, can be found at <ulink url="https://en.wikipedia.org/wiki/Comparison_of_file_systems"/>.
pt_br: Outros sistemas de arquivos, incluindo FAT32, NTFS, ReiserFS, JFS, e XFS são úteis para propósitos especializados. Mais informação a respeito desses sistemas de arquivos, e de muitos outros, pode ser encontrada em <ulink url="http://en.wikipedia.org/wiki/Comparison_of_file_systems"/>.

source: LFS assumes that the root file system (/) is of type ext4. To create an <systemitem class="filesystem">ext4</systemitem> file system on the LFS partition, issue the following command:
pt_br: O LFS assume que o sistema de arquivos raiz (/) é do tipo ext4. Para criar um sistema de arquivos <systemitem class="filesystem">ext4</systemitem> na partição do LFS, emita o seguinte comando:

source: Replace <replaceable>&lt;xxx&gt;</replaceable> with the name of the LFS partition.
pt_br: Substitua <replaceable>&lt;xxx&gt;</replaceable> pelo nome da partição do LFS.

source: If you are using an existing <systemitem class="filesystem">swap </systemitem> partition, there is no need to format it. If a new <systemitem class="filesystem"> swap</systemitem> partition was created, it will need to be initialized with this command:
pt_br: Se você estiver usando uma partição <systemitem class="filesystem">swap</systemitem> existente, [então] não há necessidade de formatá-la. Se uma nova partição <systemitem class="filesystem">swap</systemitem> foi criada, [então] ela precisará ser inicializada com este comando:

source: Replace <replaceable>&lt;yyy&gt;</replaceable> with the name of the <systemitem class="filesystem">swap</systemitem> partition.
pt_br: Substitua <replaceable>&lt;yyy&gt;</replaceable> pelo nome da partição <systemitem class="filesystem">swap</systemitem>.
