Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/add/add-pkgs.xml.1.chaine.po
Languages: fr

source: Further KDE4 packages
fr: Paquets KDE4 supplémentaires

source: This section did not provide instructions for all of the available packages in the KDE4 Software Compilation.
fr: Cette section ne vous a pas fourni les instructions pour l'ensemble des paquets de la _fpo_KDE4 Software Compilation_fpf_.

source: The included packages were selected based on what most people would want to use on a standard desktop computer.
fr: Les paquets inclus ont été sélectionnés sur la base de ce que les gens veulent utiliser sur un ordinateur standard de bureau.

source: For a full list of available packages, have a look on the KDE4 servers at _L1841_ or _L1842_ .
fr: Pour une liste complète des paquets disponibles, jetez un &oelig;il sur _L1841_ ou _L1842_.

source: Some packages, such as konsole, kate, and gwenview listed in the links above are only for the new KDE Frameworks 5 and cannot be used with KDE4.
fr: Certains paquets, comme konsole, kate, et gwenview listés dans le lien sont seulement pour le nouveau KDE 5 et ne peuvent pas être utilisé avec KDE4.

source: Some additional packages worth mentioning are:
fr: Certains paquets supplémentaires valent le coup d'être indiqués :

source: Collection of wallpapers, icon themes, screensavers, widget styles etc.
fr: Ensemble de fonds d'écran, thèmes d'icones, économiseurs d'écran, styles de widget etc.

source: A lightweight music player.
fr: Un lecteur de musique léger.

source: A video player.
fr: Un lecteur vidéo.

source: A scientific calculator.
fr: Une calculatrice scientifique.

source: Python bindings.
fr: Des liaisons Python.

source: Accessibility utilities.
fr: Outils d'accessibilité.

source: Credentials management application.
fr: Application de gestion des autorisations.

source: A global map program.
fr: Programme global de cartes.

source: A library to access CD-ROM audio files.
fr: Une bliothèque pour accéder aux fichiers audio CDROM.

source: A library to control CD-ROM drives.
fr: Une bibliothèque pour contrôler les lecteurs CD-ROM.

source: Most of these packages can be built with the standard KDE4 instructions:
fr: Vous pouvez construire la plupart de ces paquets avec les instructions standards pour KDE4 :

source: And as the _U2_ user:
fr: Et en tant qu'utilisateur _U2_ :
