Repository: espindula/br-lfs
Catalog: blfs/traduc/po/kde/add/kdepim.xml.1.chaine.po
Languages: fr

source: 13.9 MB
fr: 13.9 Mo

source: 493 MB
fr: 493 Mo

source: Introduction to Kdepim
fr: Introduction à Kdepim

source: This package provides several KDE programs for managing personal information.
fr: Ce paquet fournit plusieurs programmes KDE pour gérer les informations personnelles.

source: Programs include a contact manager, calendar, mail client, newsreader, X.509 certificate manager and sticky notes.
fr: Les programmes inclus un gestionnaire de contacts, un calendrier, des utilitaires de mails, un newsreader, un gestionnaire de certificat X.509 et sticky notes.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Kdepim Dependencies
fr: Dependances de Kdepim

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Kdepim
fr: Installation de Kdepim

source: Install _A636_ by running the following commands:
fr: Installez _A636_ en lançant les commandes suivantes :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: akonadi_archivemail_agent, akonadi_followupreminder_agent, akonadi_mailfilter_agent, akonadi_notes_agent, akonadi_sendlater_agent, akonadiconsole, akregator, akregatorstorageexporter, calendarjanitor, contactthemeeditor, headerthemeeditor, ical2vcal, importwizard, kabc2mutt, kabcclient, kaddressbook, kaddressbook-mobile, kalarm, kalarmautostart, karm, kgpgconf, kincidenceeditor, kjotes, kleopatra, kmail, kmail-mobile, kmail_antivir.sh, kmail_clamav.sh, kmail_fprot.sh, kmail_sav.sh, kmailcvt, knode, knotes, konsolekalendar, kontact, korgac, korganizer, korganizer-mobile, ksendemail, ktimetracker, ktnef, kwatchgnupg, mboximporter, notes-mobile, pimsettingexporter, sieveeditor, storageservicemanger, and tasks-mobile
fr: akonadi_archivemail_agent, akonadi_followupreminder_agent, akonadi_mailfilter_agent, akonadi_notes_agent, akonadi_sendlater_agent, akonadiconsole, akregator, akregatorstorageexporter, backupmail, calendarjanitor, contactthemeeditor, headerthemeeditor, ical2vcal, importwizard, kabc2mutt, kabcclient, kaddressbook, kaddressbook-mobile, kalarm, kalarmautostart, karm, kgpgconf, kincidenceeditor, kjotes, kleopatra, kmail, kmail-mobile, kmail_antivir.sh, kmail_clamav.sh, kmail_fprot.sh, kmail_sav.sh, kmailcvt, knode, knotes, konsolekalendar, kontact, korgac, korganizer, korganizer-mobile, ksendemail, ktimetracker, ktnef, kwatchgnupg, mboximporter, notes-mobile, pimsettingexporter, sieveeditor, storageservicemanger,

source: several in &kde-dir;/lib
fr: plusieurs dans &kde-dir;/lib

source: several in &kde-dir;/share
fr: plusieurs dans &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: is an Akonadi agent which allows to archive mail folders automatically.
fr: est un agent Akonadi qui permet d"archiver les dossiers de mails automatiquement.

source: is an akonadi agent which follow up reminder mail.
fr: est un agent akonadi qui suit les rappels de mails.

source: is an Akonadi agent which allows to filter mails.
fr: est un agent Akonadi qui permet de filtrer les mails.

source: is an Akonadi agent which allows to manage notes.
fr: est un agent Akonadi qui permet de gérer les notes.

source: is an Akonadi agent which allows to send mails later.
fr: est un agent Akonadi qui permet de différer l"envoi des mails.

source: is a feed reader.
fr: est un lecteur de flux.

source: is a contact theme editor for KAddressBook.
fr: est un éditeur de thème de contact pour KAddressBook.

source: is an editor for KMail headers.
fr: est un éditeur pour les entêtes de KMail.

source: is a tool to convert calendars from iCal to Versit vCal format
fr: est un outil pour convertir les calendriers du format iCal vers Versit vCal

source: allows to import emails, settings, addressbook and calendar data in your user account from others mailers.
fr: permet d"importer des mails, des préférences, des carnets d"adresses et des données de calendrier dans votre compte utilisateur depuis d"autres clients mails.

source: allows commandline access to the KDE addressbook.
fr: permet un accès en ligne de commandes au carnet d"adresses de KDE.

source: keeps your addresses on file.
fr: laisse vos adresses dans un fichier.

source: is the address book and contact data manager mobile version.
fr: est la version mobile du gestionnaire de carnet d"adresses et de contacts.

source: is a personal alarm message, command and email scheduler.
fr: est un programmateur de messages d"alarme personalisés, de commandes et de mails.

source: is a little helper program whose function is to autostart KAlarm at login.
fr: est un petit programme d"aide dont la fonction est de démarrer KAlarm à la connexion.

source: tracks time spent on various tasks.
fr: enregitre les temps passés sur différentes taches.

source: is a note taker.
fr: est un preneur de notes.

source: is a KDE key manager.
fr: est le gestionnaires de clés de KDE.

source: is a fully featured emails client.
fr: est un client mails complet.

source: is the mobile version of KMail.
fr: est la version mobile de KMail.

source: provides a frontend to import mail folders into kmail.
fr: fournit une interface pour importer les dossiers de mails dans kmail.

source: is a program that lets you write the computer equivalent of sticky notes.
fr: est un programme qui vous permet d"écrire des notes sur l"ordinateur équivalents aux post"it.

source: is a command line interface to KDE calendars.
fr: est une interface en ligne de commandes du calendrier de KDE.

source: brings together all the KDE PIM applications under one roof.
fr: regroupe toutes les applications de KDE PIM en une seule.

source: is the reminder daemon for korganizer.
fr: est le démon de rappel de korganizer.

source: is the KDE Calendar and scheduling.
fr: est le calendrier et le programmateur de KDE.

source: is the mobile version of korganizer.
fr: est la version mobile de korganizer.

source: is a time tracker.
fr: est un suiveur de temps.

source: is a viewer for mail attachments using TNEF format.
fr: est un visualisateur des pièces jointes de mails utilisant le format TNEF.

source: is a simple GnuPG log viewer.
fr: est un visualisateur simple de log de GnuPG.

source: is a tool that allow to import files using mbox format. .
fr: est un outil qui permet d"importer des fichiers en utilisant le format mbox. .

source: is the notes application for mobile environments.
fr: est l"application de notes pour les environnements mobile.

source: allows to export and import pim settings and local mail.
fr: permet d"exporter et d"importer les paramètres de pim.

source: is an sieve script editor.
fr: est un éditeur de scripts sieve.

source: is the task managment for mobile devices.
fr: est le gestionnaire de taches pour les périphériques mobiles.
