Repository: espindula/br-lfs
Catalog: po/chapter03/introduction.po
Languages: pt_br

source: Introduction
pt_br: Introdução

source: This chapter includes a list of packages that need to be downloaded in order to build a basic Linux system. The listed version numbers correspond to versions of the software that are known to work, and this book is based on their use. We highly recommend against using different versions, because the build commands for one version may not work with a different version, unless the different version is specified by an LFS erratum or security advisory. The newest package versions may also have problems that require work-arounds. These work-arounds will be developed and stabilized in the development version of the book.
pt_br: Este capítulo inclui uma lista de pacotes que precisam ser baixados para a finalidade de construir um sistema Linux básico. Os números de versão listados correspondem a versões dos aplicativos que são conhecidos por funcionar e este livro é baseado no uso deles. Nós recomendamos veementemente contra o uso de versões diferentes, pois os comandos de construção para uma versão possivelmente não funcionem com uma versão diferente, a menos que a versão diferente seja especificada por uma errata do LFS ou conselho de segurança. As versões mais novas de pacote possivelmente também tenham problemas que exijam contornos. Esses contornos serão desenvolvidos e estabilizados na versão de desenvolvimento do livro.

source: For some packages, the release tarball and the (Git or SVN) repository snapshot tarball for that release may be published with similar file names. A release tarball contains generated files (for example, a <command>configure</command> script generated by <command>autoconf</command>), in addition to the contents of the corresponding repository snapshot. The book uses release tarballs whenever possible. Using a repository snapshot instead of a release tarball specified by the book will cause problems.
pt_br: Para alguns pacotes, o tarball de lançamento e o tarball instantâneo de repositório (Git ou SVN) para aquele lançamento possivelmente seja publicado com nomes de arquivo semelhantes. Um tarball de lançamento contém arquivos generalizados (por exemplo, um script <command>configure</command> gerado pelo <command>autoconf</command>), em adição ao conteúdo do correspondente instantâneo de repositório. O livro usa tarballs de lançamento sempre que possível. Usar um instantâneo de repositório em vez de um tarball de lançamento especificado pelo livro causará problemas.

source: Download locations may not always be accessible. If a download location has changed since this book was published, Google (<ulink url="https://www.google.com/"/>) provides a useful search engine for most packages. If this search is unsuccessful, try one of the alternative means of downloading at <ulink url="&lfs-root;lfs/mirrors.html#files"/>.
pt_br: Os locais das transferências possivelmente não estejam sempre acessíveis. Se um local de transferência tiver mudado desde quando este livro foi publicado, [então] o Google (<ulink url="http://www.google.com/"/>) fornece um motor de busca útil para a maioria dos pacotes. Se essa busca for mal sucedida, [então] tente um dos meios alternativos de transferência em <ulink url="&lfs-root;lfs/mirrors.html#files"/>.

source: Downloaded packages and patches will need to be stored somewhere that is conveniently available throughout the entire build. A working directory is also required to unpack the sources and build them. <filename class="directory">$LFS/sources</filename> can be used both as the place to store the tarballs and patches and as a working directory. By using this directory, the required elements will be located on the LFS partition and will be available during all stages of the building process.
pt_br: Os pacotes e os remendos baixados precisarão ser armazenados em algum lugar que esteja convenientemente disponível durante a construção inteira. Um diretório de trabalho também é exigido para desempacotar os fontes e construí-los. <filename class="directory">$LFS/sources</filename> pode ser usado, tanto como o lugar para armazenar os tarballs e os remendos, quanto como um diretório de trabalho. Usando esse diretório, os elementos exigidos estarão localizados na partição do LFS e estarão disponíveis durante todos os estágios do processo de construção.

source: To create this directory, execute the following command, as user <systemitem class="username">root</systemitem>, before starting the download session:
pt_br: Para criar esse diretório, execute o seguinte comando, como usuária(o) <systemitem class="username">root</systemitem>, antes de começar a sessão de transferência:

source: Make this directory writable and sticky. <quote>Sticky</quote> means that even if multiple users have write permission on a directory, only the owner of a file can delete the file within a sticky directory. The following command will enable the write and sticky modes:
pt_br: Torne esse diretório gravável e "sticky". <quote>Sticky</quote> significa que, mesmo se múltiplas(os) usuárias(os) tenham permissão de escrita, só a(o) dona(o) de um arquivo pode deletar o arquivo dentro de um diretório sticky. O seguinte comando habilitará os modos escrita e sticky:

source: There are several ways to obtain all the necessary packages and patches to build LFS:
pt_br: Existem muitas maneiras para obter todos os pacotes e remendos necessários para construir o LFS:

source: The files can be downloaded individually as described in the next two sections.
pt_br: Os arquivos podem ser transferidos individualmente conforme descrito nas próximas duas seções.

source: For stable versions of the book, a tarball of all the needed files can be downloaded from one of the mirror sites listed at <ulink url="https://www.linuxfromscratch.org/mirrors.html#files"/>.
pt_br: Para versões estáveis do livro, um tarball de todos os arquivos necessários pode ser transferido a partir de um dos sítios espelhos listados em <ulink url="https://www.linuxfromscratch.org/mirrors.html#files"/>.

source: The files can be downloaded using <command>wget</command> and a wget-list as described below.
pt_br: Os arquivos podem ser transferidos usando o <command>wget</command> e uma lista wget conforme descrito abaixo.

source: To download all of the packages and patches by using <ulink url="../&wget-list;">&wget-list;</ulink> as an input to the <command>wget</command> command, use:
pt_br: Para transferir todos os pacotes e os remendos usando a <ulink url="../&wget-list;">&wget-list;</ulink> como uma entrada gerada para o comando <command>wget</command>, use:

source: Additionally, starting with LFS-7.0, there is a separate file, <ulink url="../md5sums">md5sums</ulink>, which can be used to verify that all the correct packages are available before proceeding. Place that file in <filename class="directory">$LFS/sources</filename> and run:
pt_br: Adicionalmente, começando com o LFS-7.0, existe um arquivo separado, <ulink url="../md5sums">md5sums</ulink>, que pode ser usado para verificar se todos os pacotes corretos estão disponíveis antes de prosseguir. Coloque aquele arquivo em <filename class="directory">$LFS/sources</filename> e execute:

source: This check can be used after retrieving the needed files with any of the methods listed above.
pt_br: Essa verificação pode ser usada após recuperar os arquivos necessários com qualquer dos métodos listados acima.

source: If the packages and patches are downloaded as a non-&root; user, these files will be owned by the user. The file system records the owner by its UID, and the UID of a normal user in the host distro is not assigned in LFS. So the files will be left owned by an unnamed UID in the final LFS system. If you won't assign the same UID for your user in the LFS system, change the owners of these files to &root; now to avoid this issue:
pt_br: Se os pacotes e os remendos forem transferidos como um(a) usuário(a) não &root;, [então] esses arquivos serão de propriedade do(a) usuário(a). O sistema de arquivos registra o(a) proprietário(a) pelo UID dele(a) e o UID de um(a) usuário(a) normal na distribuição anfitriã não é atribuído no LFS. Assim, os arquivos serão deixados de propriedade de um UID sem nome no sistema LFS final. Se você não atribuirá o mesmo UID para o(a) seu(ua) usuário(a) no sistema LFS, [então] mude os proprietários(as) desses arquivos para &root; agora para evitar esse problema:
