Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/mail/dovecot.xml.1.chaine.po
Languages: fr

source: 4.8 MB
fr: 4.8 Mo

source: 286 MB (with tests)
fr: 286 Mo (avec les tests)

source: 2.1 SBU (with tests)
fr: 2.1 SBU (avec les tests)

source: Introduction to Dovecot
fr: Introduction à Dovecot

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Dovecot Dependencies
fr: Dépendances de Dovecot

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Dovecot
fr: Installation de Dovecot

source: There should be dedicated users and groups for unprivileged Dovecot processes and for processing users' logins.
fr: Il doit y avoir des utilisateurs et des groupes dédiés pour les processus Dovecot sans droit et pour les logins des utilisateurs du processus.

source: Issue the following commands as the _U2_ user:
fr: Tapez les commandes suivantes en tant qu'utilisateur _U2_ :

source: Install _A1190_ by running the following commands:
fr: Installez _A1190_ en lançant les commandes suivantes :

source: To test the results, issue _C35_ .
fr: Pour tester les résultats, tapez _C35_.

source: One test fails for unknown reason
fr: Un test échoue pour une raison inconnue

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This switch enables _A390_ authentication support.
fr: Ce paramètre active le support d'identification _A390_.

source: This switch enables _A385_ authentication support.
fr: Ce paramètre active le support d'identification _A385_.

source: This switch enables _A384_ authentication support.
fr: Ce paramètre active le support d'identification _A384_.

source: This switch enables _A383_ authentication support.
fr: Ce paramètre active le support d'identification _A383_.

source: This switch enables _A13_ full text search support.
fr: Ce paramètre active le support de recherche de texte _A13_.

source: This switch enables GSSAPI authentication support.
fr: Ce paramètre active le support d'identificaiton GSSAPI.

source: Configuring Dovecot
fr: Configuration de Dovecot

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Copy an example configuration, which you can use as a starting point:
fr: Copiez un exemple de configuration, que vous pouvez utiliser comme point de départ :

source: The following configuration is a simple proof of concept with IMAP service using local users for authentication and mailbox location.
fr: La configuration suivante est un simple exemple avec le service IMAP utilisant les utilisateurs locaux pour l'identification et l'emplacement des boîtes à lettres.

source: Reading files from the _F701_ directory is commented out since the included example configuration requires _A393_ and _A404_ .
fr: La lecture des fichiers dans le répertoire _F701_ est commenté tant que les fichiers d'exemples inclus demandent _A393_ et _A404_.

source: You will definitely want to read the official documentation at _L2918_ if you plan to use _A1190_ in production environment.
fr: Vous devez prévoir de lire la documentation officiel à l'adresse _L2918_ si vous planifiez d'utiliser _A1190_ dans un environnement de production.

source: Boot Script
fr: Script de démarrage

source: If you want the _A1190_ server to start automatically when the system is booted, install the _F1531_ init script included in the _X194_ package.
fr: Si vous voulez que le serveur _A1190_ démarre automatiquement quand le système est démarré, installez le script d'initialisation _F1531_ inclu dans le paquet _X194_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: doveadm, doveconf, dovecot, dsync (symbolic link), and various internal programs
fr: doveadm, doveconf, dovecot, dsync (lien symbolique), et différents programmes internes

source: various internal plugins
fr: de nombreux greffons internes

source: /etc/dovecot, /usr/{include, lib, libexec, share}/dovecot and /usr/share/doc/dovecot-&dovecot-version;
fr: /etc/dovecot, /usr/{include, lib, libexec, share}/dovecot et /usr/share/doc/dovecot-&dovecot-version;

source: Short Descriptions
fr: Descriptions courtes

source: is the _A1190_ administration tool.
fr: est l'outil d'administration de _A1190_.

source: is _A1190_ 's configuration dumping utility.
fr: est l'utilitaire de configuration bon marché de _A1190_.

source: is the IMAP and POP server.
fr: est le serveur IMAP et POP.

source: is _A1190_ 's mailbox synchronization utility.
fr: est l'utilitaire de synchronisation des boîtes mails de _A1190_.
