Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/mail/exim.xml.1.chaine.po
Languages: fr

source: 1.7 MB
fr: 1.7 Mo

source: 17 MB
fr: 17 Mo

source: Introduction to Exim
fr: Introduction à Exim

source: The _A752_ package contains a Mail Transport Agent written by the University of Cambridge, released under the GNU Public License.
fr: Le paquet _A752_ contient un _fpo_Mail Transport Agent_fpf_ écrit par l'université de Cambridge, publié sous la GNU Public License.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Additional formats of the documentation (text-based docs are shipped with the sources) can be downloaded by following the links shown at _L3795_ .
fr: On peut télécharger des formats supplémentaires de la documentation (docs basés sur le texte sont fournis dans les sources) en suivant les liens décrits dans _L3795_.

source: Exim Dependencies
fr: Dépendances d'Exim

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Exim
fr: Installation d'Exim

source: Before building _A752_ , as the _U1_ user you should create the group and user _U14_ which will run the _C1944_ daemon:
fr: Avant de construire _A752_ , en tant qu'utilisateur _U1_, vous devriez créer le groupe et l'utilisateur _U14_ qui exécuteront le démon _C1944_ :

source: Install _A752_ with the following commands:
fr: Installez _A752_ avec les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Adding Additional Functionality
fr: Ajouter des fonctionnalités supplémentaires

source: Listed below is additional information to help you link these dependency packages or add additional functionality.
fr: Voici la liste d'informations supplémentaires pour vous aider à lier ces paquets de dépendance ou ajouter des fonctionnalités supplémentaires.

source: If you wish to build and install the _F791_ documentation, refer to _L3799_ .
fr: Si vous souhaitez construire et installer la documentation _F791_ , reportez-vous à _L3799_.

source: To use a backend database other than _A320_ , see the instructions at _L3801_ .
fr: Pour utiliser une base de données de fond différente de _A320_ , voir les instructions sur _L3801_.

source: For SSL functionality, see the instructions at _L3802_ and _L3803_ .
fr: Pour la fonctionnalité SSL, voir les instructions sur _L3802_ et _L3803_.

source: For _A754_ functionality, see the instructions at _L3804_ .
fr: Pour la fonctionnalité _A754_ voir les instructions sur _L3804_.

source: For information about adding authentication mechanisms to the build, see chapters 33-37 of _L3805_ .
fr: Pour des informations sur l'ajout de mécanismes d'authentication à la construction, voir les chapitres 33 à 37 de _L3805_.

source: For information about linking _A256_ , refer to the instructions _L3806_ .
fr: Pour des informations pour le lien avec _A256_ , reportez-vous aux instructions sur _L3806_.

source: For information about linking database engine libraries used for _A752_ name lookups, see the instructions at _L3807_ .
fr: Pour des informations sur le lien avec des bibliothèques du moteur de base de données utilisées pour les recherches de noms _A752_ , voir les instructions sur _L3807_.

source: If you wish to add _A109_ support to _A752_ when invoked in
fr: Si vous souhaitez ajouter le support _A109_ à _A752_ quand on l'appelle en mode

source: You may wish to modify the default configuration and send log files to syslog instead of the default _F792_ directory.
fr: Il se peut que vous souhaitiez modifier la configuration par défaut et envoyer des fichiers journaux à syslog plutôt qu'au répertoire _F792_.

source: See the information at _L3809_ .
fr: Voir les informations sur _L3809_.

source: Configuring Exim
fr: Configuration d'Exim

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: A default (nothing but comments) _F763_ file is installed during the package installation if this file did not exist on your system.
fr: Un fichier _F_ par défaut (qui ne fait rien car tout est en commentaire) est installé pendant l'installation du paquet si ce fichier n'existait pas sur votre système.

source: Create the necessary aliases and start the _A752_ daemon using the following commands:
fr: Créez les aliases nécessaires et démarrez le démon _A752_ en utilisant les commandes suivantes :

source: To protect an existing _F763_ file, the command above appends these aliases to it.
fr: Pour protéger un fichier _F763_ existant, la commande ci-dessus y envoie ces aliases.

source: This file should be checked and duplicate aliases removed, if present.
fr: Vous devriez vérifier ce fichier et recopier les aliases supprimés s'il y en a.

source: The _C1950_ command starts the _A752_ daemon with a 15 minute interval in processing the mail queue.
fr: La commande _C1950_ démarre le démon _A752_ avec un intervalle de 15 minute dans le traitement de la file d'attente de courriers.

source: Adjust this parameter to suit your desires.
fr: Ajustez ce paramètre pour l'adapter à vos souhaits.

source: Boot Script
fr: Script de démarrage

source: To automate the running of _C1944_ at startup, install the _F794_ init script included in the _X203_ package.
fr: Pour automatiser le lancement d'_C1944_ au démarrage, installez le script de démarrage _F794_ fourni dans le paquet _X203_.

source: The bootscript also starts the _A752_ daemon and dispatches a queue runner process every 15 minutes.
fr: Le script de démarrage démarre aussi le démon _A752_ et envoie un processus de lanceur de file d'attente de courriers toutes les 15 minutes.

source: Modify the _O269_ parameter in _F794_ , if necessary for your installation.
fr: Modifiez le paramètre _O269_ dans _F794_ , si nécessaire pour votre installation.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: exicyclog, exigrep, exim, exim-&exim-daemon-version;, exim_checkaccess, exim_dbmbuild, exim_dumpdb, exim_fixdb, exim_lock, exim_tidydb, eximstats, exinext, exipick, exiqgrep, exiqsumm, exiwhat, and optionally, eximon, eximon.bin, and sendmail (symlink)
fr: exicyclog, exigrep, exim, exim-&exim-daemon-version;, exim_checkaccess, exim_dbmbuild, exim_dumpdb, exim_fixdb, exim_lock, exim_tidydb, eximstats, exinext, exipick, exiqgrep, exiqsumm, exiwhat, et optionally, eximon, eximon.bin, et sendmail (lien symbolique)

source: None
fr: Aucun

source: /usr/share/doc/exim-&exim-version; and /var/spool/exim
fr: /usr/share/doc/exim-&exim-version; et /var/spool/exim

source: Short Descriptions
fr: Descriptions courtes

source: cycles _A752_ log files.
fr: parcourt les fichiers journaux d'_A752_.

source: searches _A752_ log files.
fr: recherche les fichiers journaux d'_A752_.

source: is a symlink to the _C1953_ MTA daemon.
fr: est un lien symbolique vers le démon MTA _C1953_.

source: is the _A752_ mail transport agent daemon.
fr: est le démon d'agent de transport de courrier _A752_.

source: states whether a given recipient address from a given host is acceptable or not.
fr: établit si une adresse de destinataire donnée sur un hôte est acceptable ou pas.

source: creates and rebuilds _A752_ databases.
fr: crée et reconstruit des bases de données _A752_.

source: writes the contents of _A752_ databases to the standard output.
fr: écrit le contenu des bases de données _A752_ sur la sortie standard.

source: modifies data in _A752_ databases.
fr: modifie des données dans les bases de données _A752_.

source: locks a mailbox file.
fr: verrouille un fichier de boîte aux lettres.

source: removes old records from _A752_ databases.
fr: supprime les vieux enregistrements des bases de données _A752_.

source: generates mail statistics from _A752_ log files.
fr: génère des statistiques de courrier à partir des fichiers journaux _A752_.

source: queries remote host retry times.
fr: demande le délai entre les essais sur l'hôte distant.

source: selects messages based on various criteria.
fr: sélectionne des messages basés sur divers critères.

source: is a utility for selective queue listing.
fr: est un outil de listage sélectif de la file d'attente.

source: produces a summary of the messages in the mail queue.
fr: produit un résumé des messages dans la file d'attente du courrier.

source: queries running _A752_ processes.
fr: cherche les processus _A752_ en cours.

source: is a start-up shell script for _C1967_ used to set the required environment variables before running the program.
fr: est un script shell de démarrage pour _C1967_ utilisé pour paramétrer les variables d'environnement nécessaires avant de lancer le programme.
