Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/mail/postfix.xml.1.chaine.po
Languages: fr

source: 4.2 MB
fr: 4.2 Mo

source: 195 MB
fr: 195 Mo

source: Introduction to Postfix
fr: Introduction à Postfix

source: The _A741_ package contains a Mail Transport Agent (MTA).
fr: Le paquet _A741_ contient un _fpo_Mail Transport Agent_fpf_ (MTA, agent de transport de courriers électroniques).

source: This is useful for sending email to other users of your host machine.
fr: C'est utile pour envoyer des courriers électroniques à d'autres utilisateurs dde votre machine hôte.

source: It can also be configured to be a central mail server for your domain, a mail relay agent or simply a mail delivery agent to your local Internet Service Provider.
fr: On peut aussi le configurer pour être un serveur central de messagerie électronique pour votre domaine ou un agent de relai de courriers électroniques avec votre fournisseur d'accès à Internet.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Postfix Dependencies
fr: Dépendances de Postfix

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: Note that _A713_ , _A738_ , _A732_ and _A742_ are only useful if there is a known need for them.
fr: Remarquez que _A713_ , _A738_ , _A732_ et _A742_ ne servent que s'il y en a un besoin connu.

source: User Notes:
fr: Notes utilisateur :

source: Installation of Postfix
fr: Installation de Postfix

source: Adding Users and Groups
fr: Ajout des utilisateurs et des groupes

source: Before you compile the program, you need to create users and groups that will be expected to be in place during the installation.
fr: Avant de compiler le programme, vous devez créer des utilisateurs et des groupes qui doivent être opérationnels pendant l'installation.

source: Add the users and groups with the following commands issued by the _U1_ user:
fr: Ajoutez les utilisateurs et les groupes avec les commandes suivantes lancées depuis l'utilisateur _U1_ :

source: Configuring the Build
fr: Configuration de la construction

source: The README files are formatted to be read with a pager like _A743_ or _A744_ .
fr: Les fichiers README sont formatés pour être lus avec un pageur comme _A743_ ou _A744_.

source: If you want to use a text editor, make them legible with the following sed:
fr: Si vous voulez les lire dans un éditeur de texte, rendez-les lisibles avec le sed suivant :

source: The _A741_ source tree does not contain a _F243_ script, rather the makefile in the top-level directory contains a _O259_ target that regenerates all the other makefiles in the build tree.
fr: L'arborescence des sources de _A741_ ne contient pas de script _F243_ , mais le makefile du répertoire tout en haut de la hiérarchie contient une cible _O259_ qui régénère tous les autres makefiles d'une arborescence de construction.

source: If you wish to use additional software such as a database back-end for virtual users, or TLS/SSL authentication, you will need to regenerate the makefiles using one or more of the appropriate _E35_ and _E36_ settings listed below.
fr: Si vous souhaitez utiliser des logiciels supplémentaires tels qu'un fondement de base de données pour des utilisateurs virtuels ou une authentification TLS/SSL, vous devrez régénérer les makefiles en utilisant un ou plusieurs paramètres _E35_ et _E36_ adéquats listés ci-dessous.

source: For more details read the readme files.
fr: Pour plus de détails lisez les fichiers readme.

source: To use _A745_ with _A741_ , use the following arguments:
fr: Pour utiliser _A745_ avec _A741_ , utilisez les arguments suivants :

source: To use _A578_ with _A741_ , use the following arguments:
fr: Pour utiliser _A578_ avec _A741_ , utilisez les arguments suivants :

source: To use _A746_ with _A741_ , use the following arguments:
fr: Pour utiliser _A746_ avec _A741_ , utilisez les arguments suivants :

source: To use _A738_ with _A741_ , use the following arguments:
fr: Pour utiliser _A738_ avec _A741_ , utilisez les arguments suivants :

source: To use _A732_ with _A741_ , use the following arguments:
fr: Pour utiliser _A732_ avec _A741_ , utilisez les arguments suivants :

source: To use _A742_ or _A747_ with _A741_ , use the following arguments:
fr: Pour utiliser _A742_ ou _A747_ avec _A741_ , utilisez les arguments suivants :

source: StartTLS Authentication
fr: Authentification StartTLS

source: To use _A587_ with _A741_ , use the following arguments:
fr: Pour utiliser _A587_ avec _A741_ , utilisez les arguments suivants :

source: Installing Postfix
fr: Installer Postfix

source: If you have _A590_ and _A587_ installed, install _A741_ by running the following commands:
fr: Si vous avez installé _A590_ et _A587_ , installez _A741_ en lançant les commandes suivantes :

source: This package does not come with a useful test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This keeps the install script from asking any questions, thereby accepting default destination directories in all but the few cases.
fr: Ceci empêche le script d'installation de poser des questions, acceptant les répertoires de destination par défaut dans quelques cas.

source: this will turn off SMTPUTF8 support, for example if the rest of your email address infrastructure cannot handle UTF-8 email addresses and message header values.
fr: cela désactivera le support SMTPUTF8 , par exemple si le reste de votre infrastructure d'adresse mail ne gère pas les adresses email en UTF8 et les valeurs d'entête de message.

source: Configuring Postfix
fr: Configuration de Postfix

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Create (or append to an existing) _F763_ with the following command.
fr: Créez (ou envoyez vers un fichier existant) _F763_ avec la commande suivante.

source: Change
fr: Modifiez

source: for your non-root login identity so mail addressed to _U1_ can be forwarded to you.
fr: par votre identifiant non root pour que les messages envoyés à _U1_ vous soient transférés.

source: As the _U1_ user:
fr: En tant qu'utilisateur _U1_ :

source: To protect an existing _F763_ file, the above command appends these aliases to it if it exists.
fr: Pour protéger un fichier _F763_ existant, la commande ci-dessus y envoie ces aliases.

source: This file should be checked and duplicate aliases removed, if present.
fr: Vous devriez vérifier ce fichier et recopier les aliases supprimés s'il y en a.

source: The _F764_ and _F765_ files must be personalized for your system.
fr: Le fichier _F764_ et _F765_ doivent être personnalisés selon votre système.

source: The _F766_ file needs your fully qualified hostname.
fr: Le fichier _F766_ a besoin de votre nom d'hôte pleinement qualifié.

source: You will find that _F766_ is self documenting, so load it into your editor to make the changes you need for your situation.
fr: Vous trouverez que le fichier _F766_ est auto-documenté donc chargez-le dans votre éditeur pour effectuez les modifications dont vous avez besoin dans votre situation.

source: See the file in the source _F767_ for details.
fr: Voir le fichier dans les sources _F767_ pour les détails.

source: If you have an existing configuration, you can run the _C1912_ utility to add any necessary definitions to your existing files.
fr: Si vous avez une configuration existante,, vous pouvez lancer l'outil _C1912_ pour ajouter les définitions nécessaires à vos fichiers existants.

source: Before starting _A741_ , you should check that your configuration and file permissions will work properly.
fr: Avant de démarrer _A741_ , vous devriez vérifier que votre configuration et les droits de votre fichier fonctionneront correctement.

source: Run the following commands as the _U1_ user to check and start your _A741_ server:
fr: Lancez les commandes suivantes en tant qu'utilisateur _U1_ pour vérifier et démarrer votre servekr _A741_ :

source: Boot Script
fr: Script de démarrage

source: To automate the running of Postfix at startup, install the _F768_ init script included in the _X203_ package.
fr: Pour automatiser le lancement de Postfix au démarrage, installez le script de démarrage _F768_ inclu dans le paquet _X203_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: mailq (symlink), newaliases (symlink), postalias, postcat, postconf, postdrop, postfix, postkick, postlock, postlog, postmap, postmulti, postqueue, postsuper, and sendmail
fr: mailq (lien symbolique), newaliases (lien symbolique), postalias, postcat, postconf, postdrop, postfix, postkick, postlock, postlog, postmap, postmulti, postqueue, postsuper, et sendmail

source: None
fr: Aucun

source: /{etc, usr/lib}/postfix, /usr/share/doc/postfix-&postfix-version; and /var/{lib, spool}/postfix
fr: /{etc, usr/lib}/postfix, /usr/share/doc/postfix-&postfix-version; et /var/{lib, spool}/postfix

source: Short Descriptions
fr: Descriptions courtes

source: A symlink to _F769_ .
fr: Un lien symbolique vers _F769_.

source: is a utility for _A741_ alias database maintenance
fr: est un outil _A741_ de maintenance de bases de données d'alias

source: Prints the contents of files from the _A741_ queue in human readable format.
fr: Affiche le contenu de fichiers de la queue _A741_ sous une forme lisible par un humain.

source: Displays or changes the value of _A741_ configuration parameters.
fr: Affiche ou modifie la valeur des paramètres de configuration de _A741_.

source: Creates a file in the maildrop directory and copies its standard input to the file.
fr: Crée un fichier et un répertoire maildrop et copie son entrée standard dans le fichier.

source: is the _A741_ control program.
fr: est le programme de contrôle de_A741_.

source: Sends requests to the specified service over a local transport channel.
fr: Envoie des requêtes au service spécifié via le canal local de transport.

source: Locks a mail folder for exclusive use, and executes commands passed to it.
fr: Verrouille un dossier de messages pour un usage exclusif et il exécute des commandes qui lui sont passées.

source: A _A741_ -compatible logging interface for use in, for example, shell scripts.
fr: Une interface de journalisation compatible avec _A741_ qui peut être utilisée, par exemple, dans des scripts shell.

source: Creates or queries one or more Postfix lookup tables, or updates an existing one.
fr: Crée ou interroge une ou plusieurs tables de recherche Postfix ou met à jour une existante.

source: is the _A741_ multi-instance manager.
fr: est le gestionnaire multi-instances _A741_.

source: It allows a system administrator to manage multiple _A741_ instances on a single host.
fr: Il permet à un administrateur système de gérer plusieurs sessions _A741_ sur un seul hôte.

source: The _A741_ user interface for queue management.
fr: L'interface utilisateur _A741_ pour gérer la queue.

source: The _A741_ user interface for superuser queue management.
fr: L'interface utilisateur _A741_ pour gérer la queue du super-utilisateur.

source: is the _A741_ to _A748_ compatibility interface.
fr: est l'interface de compatibilité _A741_ avec _A748_.
