Repository: espindula/br-lfs
Catalog: blfs/traduc/po/server/mail/sendmail.xml.1.chaine.po
Languages: fr

source: 2.1 MB
fr: 2.1 Mo

source: 14 MB
fr: 14 Mo

source: Introduction to sendmail
fr: Introduction à sendmail

source: The _A749_ package contains a Mail Transport Agent (MTA).
fr: Le paquet _A749_ contient un _fpo_Mail Transport Agent_fpf_ (MTA, agent de transport de courriers électroniques).

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: sendmail Dependencies
fr: Dépendances de sendmail

source: Required
fr: Requises

source: Recommanded
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of sendmail
fr: Installation de sendmail

source: Before building _A749_ , create the required user, group and directory with the following commands issued as the _U1_ user:
fr: Avant de construire _A749_ , créez l'utilisateur, le groupe et le répertoire requis en effectuant les commandes suivantes en tant qu'utilisateur _U1_ :

source: See the source tree _F770_ file for information on linking optional packages into the build.
fr: Voir le fichier _F770_ de l'arborescence des sources pour des informations sur l'édition de liens avec des paquets facultatifs dans la construction.

source: Use the example below, which adds support for SASL, StartTLS (_A587_ ) and _A578_ , as a starting point.
fr: Utilisez l'exemple ci-dessous qui ajoute le support de SASL, StartTLS (_A587_) et _A578_ , comme point de départ.

source: Of course, modify it to suit your particular needs.
fr: Modifiez-le bien entendu pour l'adapter à vos besoins particuliers.

source: Install _A749_ with the following commands:
fr: Installez _A749_ avec les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Install the _A749_ Installation and Operations Guide with the following commands:
fr: Installez le _fpo__A749_ Installation and Operations Guide_fpf_ :

source: Command Explanations
fr: Explications des commandes

source: This creates a configuration file changing some of the default settings.
fr: Ceci crée un fichier de configuration en modifiant certains des réglages par défaut.

source: The site.config.m4 does not honor a change to the man directory, so fix it in the OS definitions.
fr: site.config.m4 n'effectue pas une modification dans le répertoire man, donc corrigez cela dans la définition de l'OS.

source: These commands build and install the package.
fr: Ces commandes construisent et installent le paquet.

source: The man pages are installed already formatted and _C239_ displays them somewhat garbled.
fr: Les pages de man sont installées déjà formattées et _C239_ les affiche un peu déformées.

source: These commands replace the formatted pages with pages _C239_ can display properly.
fr: Ces commandes remplacent les pages formattées par des pages que _C239_ peut afficher correctement.

source: Configuring sendmail
fr: Configuration de sendmail

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Ensure you have a fully qualified domain name defined in _F773_ for your system before proceeding.
fr: Asusrez vous d'avoir un nom pleinement qualifié défini dans _F773_ pour votre système avant de procéder.

source: Create the _F774_ and _F775_ files using the following commands as the _U1_ user:
fr: Créez les fichiers _F774_ et _F775_ en utilisant les commandes suivantes en tant qu'utilisateur _U1_ :

source: The recommended method for changing it is to modify _F777_ and various _A750_ files, then run the _C1931_ macro processor from within _F778_ as follows:
fr: La méthode recommandée pour le modifier est de modifier _F777_ et divers fichiers _A750_ , puis lancez le traiteur de macro _C1931_ depuis l'intérieur de _F778_ comme suit :

source: A full explanation of the files to modify, and the available parameters can be found in _F779_ .
fr: Vous pouvez trouver une explication complète des fichiers à modifier, et des paramètres disponibles dans _F779_.

source: Boot Script
fr: Script de démarrage

source: To automate the running of _A749_ at startup, install the _F780_ init script included in the _X203_ package.
fr: Pour automatiser le lancement de _A749_ au démarrage, installer le script de démarrage _F780_ inclu dans le paquet _X203_.

source: The -qNm option to _C540_ , where N is number of minutes, controls how often _A749_ will process the mail queue.
fr: L'option -qNm pour _C540_ , où N est le nombre de minutes, contrôle la fréquence de traitement de la file d'attente du courrier par _A749_.

source: A default of 5 minutes is used in the init script.
fr: On utilise 5 minutes par défaut dans le script de démarrage.

source: Individual workstation users may want to set this as low as 1 minute, large installations handling more mail may want to set it higher.
fr: Il se peut que les utilisateurs de stations de travail individuelles souhaitent diminuer cette fréquence à 1 minute, il se peut que les grosses installations gérant plus de courrier souhaitent la régler à un niveau supérieur.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: editmap, mailstats, makemap, praliases, sendmail, smrsh, and vacation; symlinks to /usr/sbin/sendmail:
fr: editmap, mailstats, makemap, praliases, sendmail, smrsh, et vacation; lien symbolique à /usr/sbin/sendmail :

source: hoststat, mailq, newaliases, and purgestat
fr: hoststat, mailq, newaliases, et purgestat

source: None
fr: Aucun

source: /etc/mail, /usr/share/doc/sendmail-&sendmail-version;, /var/spool/mqueue, and /var/spool/clientmqueue
fr: /etc/mail, /usr/share/doc/sendmail-&sendmail-version;, /var/spool/mqueue, et /var/spool/clientmqueue

source: Short Descriptions
fr: Descriptions courtes

source: queries and edits _A749_ map files.
fr: interroge et édite les fichiers de plan _A749_.

source: displays _A749_ statistics.
fr: affiche les statistiques de _A749_.

source: prints a summary of outbound mail messages waiting for delivery.
fr: affiche un résumé du courrier outbound attendant d'être envoyés.

source: creates _A749_ map files.
fr: crée des fichiers de plan _A749_.

source: rebuilds _F781_ from the contents of _F775_ .
fr: reconstruit _F781_ à partir du contenu de _F775_.

source: displays current _A749_ aliases.
fr: affiche les aliases _A749_ actuels.

source: causes _A749_ to clear (purge) all its host-status information.
fr: pousse _A749_ à vider (purger) toutes ces informations de statut des hôtes.

source: is the _A749_ mail transport agent.
fr: est l'agent de transport de courrier _A749_.

source: is a restricted shell for _A749_ .
fr: est un shell restreint pour _A749_.

source: is an email auto responder.
fr: est un répondeur aux courriers.
