Repository: espindula/br-lfs
Catalog: blfs/*/general/prog/php.po
Languages: fr

source: 9.8 MB
fr: 9.8&nbsp;Mo

source: 514 MB (add 2 MB for tests, add 112 MB for documentation)
fr: 514 Mo (plus 2 Mo pour les tests, plus 112 Mo pour la documentation)

source: 1.6 SBU (with parallelism=4; add 1.9 SBU for tests)
fr: 1.6 SBU (avec parallélisme = 4, plus 1.9 SBU pour les tests)

source: Introduction to PHP
fr: Introduction à PHP

source: <application>PHP</application> is the PHP Hypertext Preprocessor. Primarily used in dynamic web sites, it allows for programming code to be directly embedded into the HTML markup. It is also useful as a general purpose scripting language.
fr: <application>PHP</application> est le <foreignphrase>PHP Hypertext Preprocessor</foreignphrase>. Utilisé à l'origine sur des sites Internet dynamiques, il permet au code d'être directement embarqué dans la balise HTML. Il sert aussi de langage de script généraliste.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&php-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&php-download-http;"/>

source: Download (FTP): <ulink url="&php-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&php-download-ftp;"/>

source: Download MD5 sum: &php-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &php-md5sum;

source: Download size: &php-size;
fr: Taille du téléchargement&nbsp;: &php-size;

source: Estimated disk space required: &php-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &php-buildsize;

source: Estimated build time: &php-time;
fr: Estimation du temps de construction&nbsp;: &php-time;

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Optional pre-built documentation (single file html): <ulink url="https://www.php.net/distributions/manual/php_manual_en.html.gz"/>
fr: Documentation pré-construite facultative (fichier html unique)&nbsp;: <ulink url="https://www.php.net/distributions/manual/php_manual_en.html.gz"/>

source: Optional pre-built documentation (chunked html): <ulink url="https://www.php.net/distributions/manual/php_manual_en.tar.gz"/>. Note that the documentation can be found in languages other than English at <ulink url="http://www.php.net/download-docs.php"/>
fr: Documentation pré-construite facultative (html morcelé)&nbsp;: <ulink url="https://www.php.net/distributions/manual/php_manual_en.tar.gz"/>. Remarquez que la documentation se trouve dans d'autres langues que l'anglais sur <ulink url="http://www.php.net/download-docs.php"/>.

source: PHP Dependencies
fr: Dépendances de PHP

source: Recommended
fr: Recommandées

source: <xref linkend="apache"/> and <xref linkend="libxml2"/>
fr: <xref linkend="apache"/> et <xref linkend="libxml2"/>

source: Optional System Utilities and Libraries
fr: Outils et bibliothèques systèmes facultatifs

source: <xref linkend="aspell"/>, <xref linkend="enchant"/>, <xref linkend="libxslt"/>, an <xref linkend="server-mail"/> (that provides a <command>sendmail</command> command), <xref linkend="pcre"/>, <xref linkend="pth"/>, <ulink url="https://wiki.ubuntu.com/AppArmor">AppArmor</ulink>, <ulink url="http://dmalloc.com/">Dmalloc</ulink>, <ulink url="http://www.net-snmp.org/">Net-SNMP</ulink>, <ulink url="https://github.com/kkos/oniguruma">oniguruma</ulink>, <ulink url="http://www.ossp.org/pkg/lib/mm/">OSSP mm</ulink>, <ulink url="http://re2c.org/">re2c</ulink>, and <ulink url="http://xmlrpc-epi.sourceforge.net/main.php?t=php_about">XMLRPC-EPI</ulink>
fr: <xref linkend="aspell"/>, <xref linkend="enchant"/>, <xref linkend="libxslt"/>, un <xref linkend="server-mail"/> (qui fournit la commande <command>sendmail</command>), <xref linkend="pcre"/>, <xref linkend="pth"/>, <ulink url="https://wiki.ubuntu.com/AppArmor">AppArmor</ulink>, <ulink url="http://dmalloc.com/">Dmalloc</ulink>, <ulink url="http://www.net-snmp.org/">Net-SNMP</ulink>, <ulink url="https://github.com/kkos/oniguruma">oniguruma</ulink>, <ulink url="http://www.ossp.org/pkg/lib/mm/">OSSP mm</ulink>, <ulink url="http://re2c.org/">re2c</ulink> et <ulink url="http://xmlrpc-epi.sourceforge.net/main.php?t=php_about">XMLRPC-EPI</ulink>

source: Optional Graphics Utilities and Libraries
fr: Outils et bibliothèques graphiques facultatifs

source: <xref linkend="freetype2"/>, <xref linkend="libexif"/>, <xref linkend="libjpeg"/>, <xref linkend="libpng"/>, <xref linkend="libtiff"/>, <xref linkend="x-window-system"/>, <ulink url="http://www.adobe.com/devnet/acrobat/fdftoolkit.html">FDF Toolkit</ulink>, <ulink url="https://github.com/libgd/libgd">GD</ulink>, and <ulink url="http://fossies.org/linux/misc/old/t1lib-5.1.2.tar.gz/">t1lib</ulink>
fr: <xref linkend="freetype2"/>, <xref linkend="libexif"/>, <xref linkend="libjpeg"/>, <xref linkend="libpng"/>, <xref linkend="libtiff"/>, <xref linkend="x-window-system"/>, <ulink url="http://www.adobe.com/devnet/acrobat/fdftoolkit.html">FDF Toolkit</ulink>, <ulink url="https://github.com/libgd/libgd">GD</ulink> et <ulink url="http://fossies.org/linux/misc/old/t1lib-5.1.2.tar.gz/">t1lib</ulink>

source: Optional Web Utilities
fr: Outils Internet facultatifs

source: <xref linkend="curl"/>, <xref linkend="tidy-html5"/>, <ulink url="http://sourceforge.net/projects/caudium/">Caudium</ulink>, <ulink url="https://www.hyperwave.com/en/">Hyperwave</ulink>, <ulink url="http://www.mnogosearch.org/">mnoGoSearch</ulink>, <ulink url="http://download.roxen.com/6.1/">Roxen WebServer</ulink>, and <ulink url="https://wddxnet.codeplex.com/">WDDX</ulink>
fr: <xref linkend="curl"/>, <xref linkend="tidy-html5"/>, <ulink url="http://sourceforge.net/projects/caudium/">Caudium</ulink>, <ulink url="https://www.hyperwave.com/en/">Hyperwave</ulink>, <ulink url="http://www.mnogosearch.org/">mnoGoSearch</ulink>, <ulink url="http://download.roxen.com/6.1/">Roxen WebServer</ulink> et <ulink url="https://wddxnet.codeplex.com/">WDDX</ulink>

source: Optional Data Management Utilities and Libraries
fr: Outils et bibliothèques de gestion de données facultatifs

source: <xref linkend="db"/> (Note that PHP does not officially support versions above 5.3), <xref linkend="libiodbc"/>, <xref linkend="lmdb"/>, <xref linkend="mariadb"/> or <ulink url="http://www.mysql.com/">MySQL</ulink>, <xref linkend="openldap"/>, <xref linkend="postgresql"/>, <xref linkend="sqlite"/>, <xref linkend="unixodbc"/>, <ulink url="http://www.softwareag.com/">Adabas</ulink>, <ulink url="http://www.birdstep.com/">Birdstep</ulink>, <ulink url="http://cr.yp.to/cdb.html">cdb</ulink>, <ulink url="http://www.dbmaker.com/">DBMaker</ulink>, <ulink url="http://www.empress.com/">Empress</ulink>, <ulink url="http://www.frontbase.com/cgi-bin/WebObjects/FBWebSite">FrontBase</ulink>, <ulink url="https://www.ibm.com/analytics/us/en/db2/">IBM DB2</ulink>, <ulink url="http://www.hughes.com.au/products/msql/">Mini SQL</ulink>, <ulink url="http://www.monetra.com/">Monetra</ulink>, and <ulink url="http://sourceforge.net/projects/qdbm">QDBM</ulink>
fr: <xref linkend="db"/> (Remarquez que PHP ne supporte pas officiellement les versions supérieures à 5.3), <xref linkend="libiodbc"/>, <xref linkend="lmdb"/>, <xref linkend="mariadb"/> ou <ulink url="http://www.mysql.com/">MySQL</ulink>, <xref linkend="openldap"/>, <xref linkend="postgresql"/>, <xref linkend="sqlite"/>, <xref linkend="unixodbc"/>, <ulink url="http://www.softwareag.com/">Adabas</ulink>, <ulink url="http://www.birdstep.com/">Birdstep</ulink>, <ulink url="http://cr.yp.to/cdb.html">cdb</ulink>, <ulink url="http://www.dbmaker.com/">DBMaker</ulink>, <ulink url="http://www.empress.com/">Empress</ulink>, <ulink url="http://www.frontbase.com/cgi-bin/WebObjects/FBWebSite">FrontBase</ulink>, <ulink url="https://www.ibm.com/analytics/us/en/db2/">IBM DB2</ulink>, <ulink url="http://www.hughes.com.au/products/msql/">Mini SQL</ulink>, <ulink url="http://www.monetra.com/">Monetra</ulink> et <ulink url="http://sourceforge.net/projects/qdbm">QDBM</ulink>

source: <application>PHP</application> also provides support for many commercial database tools such as <application>Oracle</application>, <application>SAP</application> and <application>ODBC Router</application>.
fr: <application>PHP</application> fournit aussi un support pour de nombreux outils commerciaux de base de données tels que <application>Oracle</application>, <application>SAP</application> et <application>ODBC Router</application>.

source: Optional Security/Encryption Utilities and Libraries
fr: Outils et bibliothèques de sécurité/chiffrement Facultatifs

source: <xref linkend="cyrus-sasl"/>, <xref linkend="mitkrb"/>, <ulink url="http://mcrypt.sourceforge.net/">libmcrypt</ulink>, and <ulink url="http://mhash.sourceforge.net/">mhash</ulink>
fr: <xref linkend="cyrus-sasl"/>, <xref linkend="mitkrb"/>, <ulink url="http://mcrypt.sourceforge.net/">libmcrypt</ulink> et <ulink url="http://mhash.sourceforge.net/">mhash</ulink>

source: User Notes: <ulink url="&blfs-wiki;/php"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/php"/>

source: Installation of PHP
fr: Installation de PHP

source: You can use <application>PHP</application> for server-side scripting, command-line scripting or client-side GUI applications. This book provides instructions for setting up <application>PHP</application> for server-side scripting as it is the most common form.
fr: Vous pouvez utiliser <application>PHP</application> pour faire des scripts côté serveur, des scripts en ligne de commande ou des applications graphiques côté client. Ce livre fournit des instructions pour paramétrer <application>PHP</application> pour faire des scripts côté serveur car c'est sa forme la plus courante

source: <application>PHP</application> has many more <command>configure</command> options that will enable support for various things. You can use <command>./configure --help</command> to see a full list of the available options. Also, use of the <ulink url="http://www.php.net/">PHP web site</ulink> is highly recommended, as their online docs are very good. An example of a <command>configure</command> command that utilizes many of the most common dependencies can be found at <ulink url="&sources-anduin-http;/files/php_configure.txt"/>.
fr: <application>PHP</application> dispose de beaucoup plus d'options <command>configure</command> qui activeront le support de divers éléments. Vous pouvez utiliser <command>./configure --help</command> pour voir une liste complète des options disponibles. En outre, l'utilisation du <ulink url="http://www.php.net/">site Internet de PHP</ulink> est fortement recommandée vu que leur documentation en ligne sont très bonnes. Vous pouvez trouver un exemple d'une commande <command>configure</command> qui utilise beaucoup d'éléments parmi les dépendances les plus courantes sur <ulink url="&sources-anduin-http;/files/php_configure.txt"/>.

source: If, for whatever reason, you don't have <xref linkend="libxml2"/> installed, you need to add <option>--disable-libxml</option> to the <command>configure</command> command in the instructions below. Note that this will prevent the <command>pear</command> command from being built.
fr: Si, pour une raison quelconque, vous n'avez pas installé <xref linkend="libxml2"/>, vous devez ajouter <option>--disable-libxml</option> à la commande <command>configure</command> dans les instructions ci-dessous. Remarquez que cela empêchera la commande <command>pear</command> d'être construite.

source: Install <application>PHP</application> by running the following commands:
fr: Installez <application>PHP</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue: <command>make test</command>. Several tests (out of over 11900) may fail, in which case you are asked whether you want to send the report to the PHP developers. If you want to automate the test, you may prefix the command with <command>yes "n" | </command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make test</command>. Several tests (out of over 11900) may fail, in which case you are asked whether you want to send the report to the PHP developers. If you want to automate the test, you may prefix the command with <command>yes "n" | </command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: The default configuration files for the fastCGI process manager are installed only if they do not already exist on the system. If this is the first installation, they should be renamed, as the <systemitem class='username'>root</systemitem> user:
fr: Les fichiers de configurations par défaut pour le gestionnaire de processus fastCGI sont installés seulement s'ils n'existaient pas déjà sur le système. Si c'est la première installation, ils doivent être renommés, en tant qu'utilisateur <systemitem class='username'>root</systemitem>&nbsp;:

source: The pre-built HTML documentation is packaged in two forms: a tarball containing many individual files, useful for quick loading into your browser, and one large individual file, which is useful for using the search utility of your browser. If you downloaded either, or both, of the documentation files, issue the following commands as the <systemitem class='username'>root</systemitem> user to install them (note these instructions assume English docs, modify the tarball names below if necessary).
fr: La documentation HTML pré-compilée est emballée sous deux formes&nbsp;: une archive tar contenant beaucoup de fichiers individuels, utiles pour être chargés rapidement dans votre navigateur, et un gros fichier individuel, qui est utile pour une utilisation de l'outil de recherche de votre navigateur. Si vous avez téléchargé un des deux ou les deux fichiers de documentation, exécutez les commandes suivantes en tant qu'utilisateur <systemitem class='username'>root</systemitem> pour les installer (remarquez que ces instructions supposent des docs en anglais, modifiez le nom des archives tar ci-dessous si nécessaire).

source: For the <quote>Single HTML</quote> file:
fr: Pour le fichier <quote>HTML unique</quote>&nbsp;:

source: For the <quote>Many HTML files</quote> tarball:
fr: Pour les fichiers <quote>HTML multiples</quote>&nbsp;:

source: The bundled pear is not installed because of a bug which might pollute the filesystem with several hidden files and directories. If pear is needed, execute the following commands to install it:
fr: L'exécutable pear inclus n'est pas installé à cause d'un bogue qui peut polluer le système de fichier avec plusieurs fichiers et répertoires cachés. Si vous avez besoin de pear, exécutez les commandes suivantes pour l'installer&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <parameter>--datadir=/usr/share/php</parameter>: This works around a bug in the build machinery, which installs some data to a wrong location.
fr: <parameter>--datadir=/usr/share/php</parameter>&nbsp;: Ceci contourne un bogue dans le processus de construction qui installe quelques données au mauvais endroit.

source: <parameter>--enable-fpm</parameter>: This parameter allows building the fastCGI Process Manager.
fr: <parameter>--enable-fpm</parameter>&nbsp;: Ce paramètre permet de construire le gestionnaire de processus fastCGI.

source: <parameter>--with-fpm-systemd</parameter>: This parameter allows the FastCGI Process Manager to integrate with systemd.
fr: <parameter>--with-fpm-systemd</parameter>&nbsp;: Ce paramètre permet au gestionnaire de processus fastCGI de s'intégrer avec systemd.

source: <parameter>--without-pear</parameter>: This switch disables installation of bundled pear software.
fr: <parameter>--without-pear</parameter>&nbsp;: Ce paramètre désactive l'installation du logiciel pear inclus.

source: <parameter>--with-config-file-path=/etc</parameter>: This parameter makes <application>PHP</application> look for the <filename>php.ini</filename> configuration file in <filename class='directory'>/etc</filename>.
fr: <parameter>--with-config-file-path=/etc</parameter>&nbsp;: Ce paramètre amène <application>PHP</application> à chercher le fichier de configuration <filename>php.ini</filename> dans <filename class='directory'>/etc</filename>.

source: <parameter>--with-zlib</parameter>: This parameter adds support for <application>Zlib</application> compression.
fr: <parameter>--with-zlib</parameter>&nbsp;: Ce paramètre ajoute le support pour la compression <application>Zlib</application>.

source: <parameter>--enable-bcmath</parameter>: Enables <command>bc</command> style precision math functions.
fr: <parameter>--enable-bcmath</parameter>&nbsp;: Active les fonctions mathématiques précises dans le style de <command>bc</command>.

source: <parameter>--with-bz2</parameter>: Adds support for <application>Bzip2</application> compression functions.
fr: <parameter>--with-bz2</parameter>&nbsp;: Ajoute le support pour les fonctions de compression de <application>Bzip2</application>.

source: <parameter>--enable-calendar</parameter>: This parameter provides support for calendar conversion.
fr: <parameter>--enable-calendar</parameter>&nbsp;: Ce paramètre offre un support pour la conversion de calendrier.

source: <parameter>--enable-dba=shared</parameter>: This parameter enables support for database (dbm-style) abstraction layer functions.
fr: <parameter>--enable-dba=shared</parameter>&nbsp;: Ce paramètre active le support pour les fonctions de la couche d'abstraction de base de données dans le style dbm.

source: <parameter>--enable-ftp</parameter>: This parameter enables FTP functions.
fr: <parameter>--enable-ftp</parameter>&nbsp;: Ce paramètre active les fonctions FTP.

source: <parameter>--with-gettext</parameter>: Enables functions that use <application>Gettext</application> text translation.
fr: <parameter>--with-gettext</parameter>&nbsp;: Active les fonctions qui utilisent la traduction de texte <application>Gettext</application>.

source: <parameter>--enable-mbstring</parameter>: This parameter enables multibyte string support.
fr: <parameter>--enable-mbstring</parameter>&nbsp;: Ce paramètre active le support des chaînes multi-octets.

source: <parameter>--with-readline</parameter>: This parameter enables command line <application>Readline</application> support.
fr: <parameter>--with-readline</parameter>&nbsp;: Ce paramètre active le support <application>Readline</application> en ligne de commande.

source: <option>--disable-libxml</option>: This option allows building PHP without <application>libxml2</application> installed.
fr: <option>--disable-libxml</option>&nbsp;: Cette option permet de construire PHP sans que <application>libxml2</application> ne soit installé.

source: <option>--with-apxs2</option>: Instead of building the fastCGI process manager, it is possible to build an <application>apache</application> module. This has some performance penalty for heavy loaded servers, but may be easier to set up. This switch is incompatible with the <parameter>--enable-fpm</parameter> and <parameter>--with-fpm-...</parameter> switches.
fr: <option>--with-apxs2</option>&nbsp;: au lieu de construire le gestionnaire de processus fastCGI, il est possible de construire un module <application>apache</application>. Cela pénalise un peu les performances pour des serveurs fortement chargés, mais peut être plus facile à initialiser. Ce paramètre est incompatible avec <parameter>--enable-fpm</parameter> et <parameter>--with-fpm-...</parameter>.

source: <option>--with-mysqli=shared</option>: This option includes MySQLi support.
fr: <option>--with-mysqli=shared</option>&nbsp;: Cette option inclut le support de MySQLi.

source: <option>--with-mysql-sock=/run/mysqld/mysqld.sock</option>: Location of the MySQL unix socket pointer.
fr: <option>--with-mysql-sock=/run/mysqld/mysqld.sock</option>&nbsp;: Localisation du pointeur de socket unix de MySQL.

source: <option>--with-pdo-mysql=shared</option>: This option includes PDO: MySQL support.
fr: <option>--with-pdo-mysql=shared</option>&nbsp;: Cette option active le support de PDO: MySQL.

source: <option>--with-tidy=shared</option>: This option includes tidy library support.
fr: <option>--with-tidy=shared</option>&nbsp;: Cette option inclut le support de la bibliothèque tidy.

source: Configuring PHP
fr: Configuration de PHP

source: Config Files
fr: Fichiers de configuration

source: <filename>/etc/php.ini</filename>, <filename>/etc/pear.conf</filename>, <filename>/etc/php-fpm.conf</filename>, and <filename>/etc/php-fpm.d/www.conf</filename>
fr: <filename>/etc/php.ini</filename>, <filename>/etc/pear.conf</filename>, <filename>/etc/php-fpm.conf</filename> et <filename>/etc/php-fpm.d/www.conf</filename>

source: Configuration Information
fr: Informations sur la configuration

source: The file used as the default <filename>/etc/php.ini</filename> configuration file is recommended by the <application>PHP</application> development team. This file modifies the default behavior of <application>PHP</application>. If no <filename>/etc/php.ini</filename> is used, all configuration settings fall to the defaults. You should review the comments in this file and ensure the changes are acceptable in your particular environment.
fr: Le fichier utilisé en tant que fichier de configuration <filename>/etc/php.ini</filename> par défaut est recommandé par l'équipe de développement de <application>PHP</application>. Ce fichier modifie le comportement par défaut de <application>PHP</application>. Si vous n'utilisez pas <filename>/etc/php.ini</filename>, tous les paramètres de configuration retombent sur ceux par défaut. Vous devriez observer les commentaires dans ce fichier et vous assurer que les modifications sont acceptables pour votre environnement particulier.

source: The fastCGI process manager uses the configuration file <filename>/etc/php-fpm.conf</filename>. The default file shipped with PHP includes all the <filename>/etc/php-fpm.d/*.conf</filename> in turn. There is a shipped <filename>/etc/php-fpm.d/www.conf</filename> file, that contains the parameters related to the interaction with the Apache Web server.
fr: Le gestionnaire de taches fastCGI utilise le fichier de configuration <filename>/etc/php-fpm.conf</filename>. Le fichier par défaut fourni avec PHP inclus tous les <filename>/etc/php-fpm.d/*.conf</filename>. Il y a de fourni le fichier <filename>/etc/php-fpm.d/www.conf</filename>, qui contient les paramètres pour l'interaction avec le serveur web Apache.

source: You may have noticed the following from the output of the <command>make install</command> command:
fr: Il se peut que vous ayez noté ceci dans la sortie de la commande <command>make install</command>&nbsp;:

source: If desired, add the entry using the following command as the <systemitem class="username">root</systemitem> user:
fr: Si désiré, ajoutez l'entrée en utilisant la commande suivante en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: To enable fastCGI support in the <application>Apache</application> web server, two LoadModule directives must be added to the <filename>httpd.conf</filename> file. They are commented out, so just issue the following command as <systemitem class="username">root</systemitem> user:
fr: Pour activer le support fastCGI dans un serveur web <application>Apache</application>, deux directives de chargement LoadModule doivent être ajoutées dans le fichier <filename>httpd.conf</filename>. Elles sont commentées, donc il suffit de taper la commande suivante en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Those modules accept various <command>ProxyPass</command> directives. One possibility is (as the <systemitem class="username">root</systemitem> user):
fr: Ces modules acceptent différentes directives <command>ProxyPass</command>. Une possibilité est (en tant qu'utilisateur <systemitem class="username">root</systemitem>)&nbsp;:
