Repository: espindula/br-lfs
Catalog: blfs/*/general/prog/php.po
Languages: fr

source: Additionally, it may be useful to add an entry for <filename>index.php</filename> to the DirectoryIndex directive of the <filename>httpd.conf</filename> file. Lastly, adding a line to setup the <filename class='extension'>.phps</filename> extension to show highlighted <application>PHP</application> source may be desirable:
fr: En outre, il peut être utile d'ajouter une entrée pour <filename>index.php</filename> à la ligne DirectoryIndex du fichier <filename>httpd.conf</filename>. Enfin, l'ajout d'une ligne pour paramétrer l'extension <filename class='extension'>.phps</filename> pour montrer les sources <application>PHP</application> en surlignage peut être désirable&nbsp;:

source: You'll need to restart the <application>Apache</application> web server after making any modifications to the <filename>httpd.conf</filename> file.
fr: Vous devrez redémarrer le serveur web <application>Apache</application> après avoir apporté une modification au fichier <filename>httpd.conf</filename>.

source: <phrase revision="sysv">Boot Script</phrase> <phrase revision="systemd">Systemd Unit</phrase>
fr: <phrase revision="sysv">Script de démarrage</phrase> <phrase revision="systemd">Unité Systemd</phrase>

source: To automatically start the <command>php-fpm</command> daemon when the system is rebooted, install the <filename>/etc/rc.d/init.d/php</filename> bootscript from the <xref linkend="bootscripts"/> package as the <systemitem class="username">root</systemitem> user:
fr: Pour automatiquement démarrer le démon <command>php-fpm</command> quand le système est redémarré, installez le script de démarrage <filename>/etc/rc.d/init.d/php</filename> depuis le paquet <xref linkend="bootscripts"/> en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: To start the <command>php-fpm</command> daemon at boot, install the systemd unit from the <xref linkend="systemd-units"/> package by running the following command as the <systemitem class="username">root</systemitem> user:
fr: Pour démarrer le démon <command>php-fpm</command> au démarrage, installez l'unité systemd depuis le paquet <xref linkend="systemd-units"/> en lançant la commande suivante en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: pear, peardev, pecl, phar (symlink), phar.phar, php, php-cgi, php-config, php-fpm, phpdbg, and phpize
fr: pear, peardev, pecl, phar (symlink), phar.phar, php, php-cgi, php-config, php-fpm, phpdbg et phpize

source: dba.{so,a} and opcache.{so,a} in /usr/lib/php/extensions/no-debug-non-zts-20180731
fr: dba.{so,a} et opcache.{so,a} dans /usr/lib/php/extensions/no-debug-non-zts-20180731

source: /etc/php-fpm.d, /usr/{include,lib,share}/php and /usr/share/doc/php-&php-version;
fr: /etc/php-fpm.d, /usr/{include,lib,share}/php et /usr/share/doc/php-&php-version;

source: Short Descriptions
fr: Descriptions courtes

source: is a command line interface that enables you to parse and execute PHP code.
fr: est une interface en ligne de commande qui vous permet d'analyser et d'exécuter du code PHP.

source: is the PHP Extension and Application Repository (PEAR) package manager. This isn't installed by default.
fr: est l'extension PHP et le gestionnaire de paquet PHP Extension and Application Repository (PEAR, dépôt des extensions et des applications PHP). Il n'est pas installé par défaut.

source: is the fastCGI process manager for PHP.
fr: est le gestionnaire de processus fastCGI pour PHP.

source: is the interactive PHP debugger.
fr: est le débogueur PHP interactif.
