Repository: espindula/br-lfs
Catalog: blfs/*/archive/acl.po
Languages: fr

source: 384 KB
fr: 384 Kio

source: 9.1 MB
fr: 9.1 Mio

source: Introduction to acl
fr: Introduction à acl

source: The <application>acl</application> package contains utilities to administer Access Control Lists, which are used to define more fine-grained discretionary access rights for files and directories.
fr: Le paquet <application>acl</application> contiens des utilitaires pour administrer les Access Control List, qui sont utilisées pour définir plus finement les droits d'accès pour les fichiers et les répertoires.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&acl-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&acl-download-http;"/>

source: Download (FTP): <ulink url="&acl-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&acl-download-ftp;"/>

source: Download MD5 sum: &acl-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &acl-md5sum;

source: Download size: &acl-size;
fr: Taille du téléchargement&nbsp;: &acl-size;

source: Estimated disk space required: &acl-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &acl-buildsize;

source: Estimated build time: &acl-time;
fr: Estimation du temps de construction&nbsp;: &acl-time;

source: acl Dependencies
fr: Dépendances de acl

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/acl"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/acl"/>

source: Installation of acl
fr: Installation de acl

source: Install <application>acl</application> by running the following commands:
fr: Installez <application>acl</application> en lançant les commandes suivantes&nbsp;:

source: For meaningful results, the tests need to be carried out on a file system that supports extended attributes. It is also required that <application>Coreutils</application> is re-installed after <application>acl</application> is installed so that the extra acl bit displays correctly on a <command>ls</command> command.
fr: Pour obtenir des résultats plus probants, les tests ont besoin d'être effectués sur un système de fichier qui supporte les attributs étendus. Il requiert également que <application>Coreutils</application> soit réinstallé après qu'<application>acl</application> est installé, de ce fait, l'extra bit d'ACL est affiché correctement par <command>ls</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: You should now re-install <application><ulink url="&lfs-root;/chapter06/coreutils.html">Coreutils</ulink> </application> and proceed to run the test suite.
fr: Vous devriez maintenant réinstaller <application><ulink url="&lfs-root;/chapter06/coreutils.html">Coreutils</ulink> </application> et procéder à l'exécution de la suite de tests.

source: There are three sets of tests that come with this package. The local partition where the tests are run must be mounted with acl configured as described below. Additionally, the users <systemitem class="username">bin</systemitem> and <systemitem class="username">daemon</systemitem> must be created or modified to have a proper shell and home directory and the group <systemitem class="groupname">daemon</systemitem> must be a member of the <systemitem class="groupname">bin</systemitem> group. The kernel must also be configured with the appropriate ACL options (there are nine different options).
fr: Il y a trois séries de tests qui sont fournies avec ce paquet. La partition locale où les tests sont exécutés doit être montée avec acl configurée comme décrit précédemment. De plus, les utilisateurs <systemitem class="username">bin</systemitem> et <systemitem class="username">daemon</systemitem> doivent être créés ou modifiés pour avoir leur propre shell et leur propre répertoire home et le groupe <systemitem class="groupname">daemon</systemitem> doit être membre du groupe <systemitem class="groupname">bin</systemitem>. Le noyau doit également être configuré avec les options ACL adéquats (il y a neuf options différentes).

source: To run the standard tests run <command>make tests </command>. As <systemitem class="username">root</systemitem> user, run <command>make root-tests</command>.
fr: Pour exécuter les tests standards, lancez <command>make tests </command>. En tant qu'utilisateur <systemitem class="username">root</systemitem>, lancez <command>make root-tests</command>.

source: The third set of tests are Network File System (NFS) specific. See the contents of the test files in the test/nfs/ directory for the setup requirements.
fr: Le troisième ensemble de tests est spécifique à Network File System (NFS). Regardez le contenu des tests dans le répertoire test/nfs/ pour voir les prérequis.

source: Command Explanations
fr: Explication des commandes

source: <command>sed -i ... include/builddefs.in</command>: This command modifies the documentation directory so that it is a versioned directory.
fr: <command>sed -i ... include/builddefs.in</command>: Cette commande modifie le répertoire de la documentation afin de le versionner.

source: Configuring acl
fr: Configurer acl

source: Configuration Information
fr: Information de configuration

source: One way to achieve this is to add the acl option to an ext3 filesystem in the <filename>/etc/fstab</filename> file as shown below:
fr: Un des moyens pour y parvenir est d'ajouter l'option acl à un système de fichier dans <filename>/etc/fstab</filename> comme affiché en dessous:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: chacl, getfacl, and setfacl
fr: chacl, getfacl, et setfacl

source: Short Descriptions
fr: Descriptions courtes

source: changes the access control list of a file or directory.
fr: change les listes de contrôle d'accès d'une fichier ou d'un répertoire.

source: gets file access control lists.
fr: Récupère les listes de contrôle d'accès d'un fichier.

source: sets file access control lists.
fr: Défini les listes de contrôle d'accès d'un fichier.

source: contains the <application>acl</application> API functions.
fr: contient les fonctions de l'API d'<application>acl</application>.
