Repository: espindula/br-lfs
Catalog: blfs/*/archive/amarok.po
Languages: fr

source: 38.1 MB
fr: 38.1 Mio

source: 223 MB
fr: 223 Mio

source: Introduction to Amarok
fr: Introduction à Amarok

source: <application>Amarok</application> is a powerful audio player for the KDE environment. Features include a context browser, integration with many online music services and support for management of several digital music players including Apple's iPod.
fr: <application>Amarok</application> est un puissant lecteur audio pour l'environnement KDE. Ses possibilités incluent un navigateur contextuel, une intégration avec beaucoup de services de musique en ligne et le support pour la gestion de plusieurs lecteurs de musique digital iPod d'Apple inclus

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&amarok-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&amarok-download-http;"/>

source: Download (FTP): <ulink url="&amarok-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&amarok-download-ftp;"/>

source: Download MD5 sum: &amarok-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &amarok-md5sum;

source: Download size: &amarok-size;
fr: Taille du téléchargement&nbsp;: &amarok-size;

source: Estimated disk space required: &amarok-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &amarok-buildsize;

source: Estimated build time: &amarok-time;
fr: Estimation du temps de construction&nbsp;: &amarok-time;

source: Amarok Dependencies
fr: Dépendances de Amarok

source: Required
fr: Requises

source: <xref linkend="kdelibs"/>, <xref linkend="mariadb"/> or <ulink url="http://www.mysql.com/">MySQL</ulink>, and <xref linkend="taglib"/>
fr: <xref linkend="kdelibs"/>, <xref linkend="mariadb"/> ou <ulink url="http://www.mysql.com/">MySQL</ulink> et <xref linkend="taglib"/>

source: Recommended
fr: Recommandées

source: <xref linkend="libkcompactdisk"/> and <xref linkend="audiocd-kio"/> (for CD-ROM accesa and control) and <xref linkend="ffmpeg"/>
fr: <xref linkend="libkcompactdisk"/> et <xref linkend="audiocd-kio"/> (pour l'accès et le contrôle des CD-ROM) et <xref linkend="ffmpeg"/>

source: Optional
fr: Facultatives

source: <xref linkend="curl"/> (for MP3tunes integration), <xref linkend="libxml2"/> (for MP3tunes integration), <xref linkend="openssl"/> (for MP3tunes integration), <xref linkend="qjson"/>, <ulink url="&kde-download-http;&kde-version;/src/">nepomuk-core</ulink>, <ulink url="http://kollide.net/~jefferai/">Taglib-extras</ulink>, <ulink url="http://code.google.com/p/clamz/">Clamz</ulink> (For Amazon integration), <ulink url="http://www.gtkpod.org/libgpod.html">libgpod</ulink> (for iPod support), <ulink url="https://github.com/lastfm/liblastfm">liblastfm</ulink> (for Last.fm integration), <ulink url="http://libmtp.sourceforge.net/">libmtp</ulink> (for MTP device support), <ulink url="http://wiki.gpodder.org/wiki/Libmygpo-qt">libmygpo-qt</ulink> (for gpodder.net podcast support), <ulink url="http://code.google.com/p/musicip-libofa">libofa</ulink> (for MusicDNS support), <ulink url="&gnome-download-http;/loudmouth">Loudmouth</ulink> (for MP3tunes integration), <ulink url="http://code.google.com/p/qtscriptgenerator/">qtscript-qt</ulink>, and <ulink url="http://code.google.com/p/googlemock/">Google Mock</ulink> (for tests)
fr: <xref linkend="curl"/> (pour l'intégration de MP3tunes), <xref linkend="libxml2"/> (pour l'intégration de MP3tunes), <xref linkend="openssl"/> (pour l'intégration de MP3tunes), <xref linkend="qjson"/>, <ulink url="&kde-download-http;&kde-version;/src/">nepomuk-core</ulink>, <ulink url="http://kollide.net/~jefferai/">Taglib-extras</ulink>, <ulink url="http://code.google.com/p/clamz/">Clamz</ulink> (For Amazon integration), <ulink url="http://www.gtkpod.org/libgpod.html">libgpod</ulink> (pour le support de l'iPod), <ulink url="https://github.com/lastfm/liblastfm">liblastfm</ulink> (pour l'intégration de Last.fm), <ulink url="http://libmtp.sourceforge.net/">libmtp</ulink> (pour le support des périphériques MTP), <ulink url="http://wiki.gpodder.org/wiki/Libmygpo-qt">libmygpo-qt</ulink> (pour le support des podcasts gpodder.net), <ulink url="http://code.google.com/p/musicip-libofa">libofa</ulink> (pour le support de MusicDNS), <ulink url="&gnome-download-http;/loudmouth">Loudmouth</ulink> (for MP3tunes integration), <ulink url="http://code.google.com/p/qtscriptgenerator/">qtscript-qt</ulink> et <ulink url="http://code.google.com/p/googlemock/">Google Mock</ulink> (pour les tests)

source: User Notes: <ulink url="&blfs-wiki;/amarok"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/amarok"/>

source: Installation of Amarok
fr: Installation de Amarok

source: Amarok depends strongly on $KDE_PREFIX. If a new version of KDE is installed in a different location (for instance installing kde in a versioned directory of /opt), then this package will need to be reinstalled.
fr: Amarok dépend fortement de $KDE_PREFIX. Si une nouvelle version de KDE est installé dans un endroit différent (en installant kde dans un répertoire versionné de /opt), alors ce paquet devra être réinstallé.

source: Install <application>Amarok</application> by running the following commands:
fr: Installez <application>Amarok</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <command>sed ... CMakeLists.txt</command>: Change the minimum requirement for taglib to allow it to be found.
fr: <command>sed ... CMakeLists.txt</command>&nbsp;: Change l'exigence minimale pour taglib pour permettre de le trouver.

source: <option>-DKDE4_BUILD_TESTS=OFF</option>: This switch disables the integrated tests. The test suite requires Google Mock.
fr: <option>-DKDE4_BUILD_TESTS=OFF</option>&nbsp;: Ce paramètre désactive les tests intégrés. La suite de tests requiert Google Mock.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: amarok, amarok_afttagger, amarokcollectionscanner, amarokpkg, and amzdownloader
fr: amarok, amarok_afttagger, amarokcollectionscanner, amarokpkg et amzdownloader

source: libamarokcore.so, libamaroklib.so, libamarokocsclient.so, libamarokpud.so, libamarok_service_lastfm_shared.so, libamarok-sqlcollection.so, libamarok-transcoding.so, libampache_account_login.so, and several libraries in &kde-dir;/lib/kde4
fr: libamarokcore.so, libamaroklib.so, libamarokocsclient.so, libamarokpud.so, libamarok_service_lastfm_shared.so, libamarok-sqlcollection.so, libamarok-transcoding.so, libampache_account_login.so, et plusieurs bibliothèques dans &kde-dir;/lib/kde4

source: several in &kde-dir;/share
fr: plusieurs dans &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: Is a powerful music player and organizer built on top of KDE development platform.
fr: est un puissant lecteur de musique et organisateur construit sur la plateforme de développement de KDE.
