Repository: espindula/br-lfs
Catalog: blfs/*/archive/bazaar.po
Languages: fr

source: 10 MB
fr: 10 Mio

source: 69 MB
fr: 69 Mio

source: Introduction to Bazaar
fr: Introduction à Bazaar

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&bazaar-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&bazaar-download-http;"/>

source: Download (FTP): <ulink url="&bazaar-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&bazaar-download-ftp;"/>

source: Download MD5 sum: &bazaar-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &bazaar-md5sum;

source: Download size: &bazaar-size;
fr: Taille du téléchargement&nbsp;: &bazaar-size;

source: Estimated disk space required: &bazaar-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &bazaar-buildsize;

source: Estimated build time: &bazaar-time;
fr: Estimation du temps de construction&nbsp;: &bazaar-time;

source: Bazaar Dependencies
fr: Dépendances de Bazaar

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/bazaar"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/bazaar"/>

source: Installation of Bazaar
fr: Installation de Bazaar

source: Install <application>Bazaar</application> by running the following commands:
fr: Installez <application>Bazaar</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: Short Descriptions
fr: Descriptions courtes
