Repository: espindula/br-lfs
Catalog: blfs/*/archive/bc.po
Languages: fr

source: 288 KB
fr: 288 Kio

source: 3 MB
fr: 3 Mio

source: less than 0.1 SBU (0.2 SBU if running the testsuite)
fr: moins de 0.1 SBU (0.2 SBU si exécution de la suite de tests)

source: Introduction to bc
fr: Introduction à bc

source: The <application>bc</application> package contains an arbitrary precision numeric processing language.
fr: Le paquet <application>bc</application> contient un langage d'exécution numérique de précision arbitraire.

source: Starting with linux-3.9 the <command>bc</command> program is needed to build the linux kernel. It is been moved to LFS for LFS-7.4.
fr: Depuis linux-3.9 le programme <command>bc</command> est nécessaire pour construire le noyau linux. Il a été déplacé dans LFS pour LFS-7.4.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&bc-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&bc-download-http;"/>

source: Download (FTP): <ulink url="&bc-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&bc-download-ftp;"/>

source: Download MD5 sum: &bc-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &bc-md5sum;

source: Download size: &bc-size;
fr: Taille du téléchargement&nbsp;: &bc-size;

source: Estimated disk space required: &bc-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &bc-buildsize;

source: Estimated build time: &bc-time;
fr: Estimation du temps de construction&nbsp;: &bc-time;

source: User Notes: <ulink url="&blfs-wiki;/bc"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/bc"/>

source: Installation of Bc
fr: Installation de Bc

source: Install <application>bc</application> by running the following commands:
fr: Installez <application>bc</application> en lançant les commandes suivantes&nbsp;:

source: To test <application>bc</application>, run the commands below. There is quite a bit of output, so you may want to redirect it to a file. There are a very small percentage of tests (10 of 12,144) that will indicate a roundoff error at the last digit.
fr: Pour tester <application>bc</application>, lancez les commandes ci-dessous. Il y a beaucoup d'affichage, donc il se peut que vous vouliez la rediriger vers un fichier. Il y a une très faible proportion des tests ((10 sur 12 144) qui indiqueront une erreur roundoff sur le dernier chiffre.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <parameter>--with-readline</parameter>: This option enables <application>Readline</application> support in interactive mode.
fr: <parameter>--with-readline</parameter>&nbsp;: Cette option active le support de <application>Readline</application> en mode interactif.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: bc and dc
fr: bc et dc

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a calculator.
fr: est une calculatrice.

source: is a reverse-polish calculator.
fr: est une calculatrice en polonais inversé.
