Repository: espindula/br-lfs
Catalog: blfs/*/archive/gst-ffmpeg.po
Languages: fr

source: 4.6 MB
fr: 4.6 Mio

source: 272 MB
fr: 272 Mio

source: Introduction to Gst FFMpeg
fr: Introduction à Gst FFMpeg

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gst-ffmpeg-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gst-ffmpeg-download-http;"/>

source: Download (FTP): <ulink url="&gst-ffmpeg-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gst-ffmpeg-download-ftp;"/>

source: Download MD5 sum: &gst-ffmpeg-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gst-ffmpeg-md5sum;

source: Download size: &gst-ffmpeg-size;
fr: Taille du téléchargement&nbsp;: &gst-ffmpeg-size;

source: Estimated disk space required: &gst-ffmpeg-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gst-ffmpeg-buildsize;

source: Estimated build time: &gst-ffmpeg-time;
fr: Estimation du temps de construction&nbsp;: &gst-ffmpeg-time;

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch: <ulink url="&patch-root;/gst-ffmpeg-&gst-ffmpeg-version;-gcc-4.7-1.patch"/>
fr: Correctif requis&nbsp;: <ulink url="&patch-root;/gst-ffmpeg-&gst-ffmpeg-version;-gcc-4.7-1.patch"/>

source: Gst FFMpeg Dependencies
fr: Dépendances de Gst FFMpeg

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/gst-ffmpeg"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gst-ffmpeg"/>

source: Installation of Gst FFMpeg
fr: Installation de Gst FFMpeg

source: Install <application>Gst FFMpeg</application> by running the following commands:
fr: Installez <application>Gst FFMpeg</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue: <command>make check</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make check</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu
