Repository: espindula/br-lfs
Catalog: blfs/*/archive/hdwids.po
Languages: fr

source: 1.2 MB
fr: 1.2 Mio

source: 7.0 MB
fr: 7.0 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to hdwids
fr: Introduction à hdwids

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&hdwids-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&hdwids-download-http;"/>

source: Download (FTP): <ulink url="&hdwids-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&hdwids-download-ftp;"/>

source: Download MD5 sum: &hdwids-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &hdwids-md5sum;

source: Download size: &hdwids-size;
fr: Taille du téléchargement&nbsp;: &hdwids-size;

source: Estimated disk space required: &hdwids-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &hdwids-buildsize;

source: Estimated build time: &hdwids-time;
fr: Estimation du temps de construction&nbsp;: &hdwids-time;

source: User Notes: <ulink url="&blfs-wiki;/hdwids"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/hdwids"/>

source: Installation of hdwids
fr: Installation de hdwids

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
