Repository: espindula/br-lfs
Catalog: blfs/*/archive/libelf.po
Languages: fr

source: 145 KB
fr: 145 Kio

source: 3 MB
fr: 3 Mio

source: Introduction to libelf
fr: Introduction à libelf

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&libelf-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&libelf-download-http;"/>

source: Download (FTP): <ulink url="&libelf-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&libelf-download-ftp;"/>

source: Download MD5 sum: &libelf-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &libelf-md5sum;

source: Download size: &libelf-size;
fr: Taille du téléchargement&nbsp;: &libelf-size;

source: Estimated disk space required: &libelf-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &libelf-buildsize;

source: Estimated build time: &libelf-time;
fr: Estimation du temps de construction&nbsp;: &libelf-time;

source: User Notes: <ulink url="&blfs-wiki;/libelf"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/libelf"/>

source: Installation of libelf
fr: Installation de libelf

source: Install <application>libelf</application> by running the following commands:
fr: Installez <application>libelf</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: contains the <application>libelf</application> API functions.
fr: Contient les fonctions de l'API de <application>libelf</application>
