Repository: espindula/br-lfs
Catalog: blfs/*/archive/libvirt-glib.po
Languages: fr

source: 636 KB
fr: 636 Kio

source: 16 MB
fr: 16 Mio

source: Introduction to libvirt-glib
fr: Introduction à libvirt-glib

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&libvirt-glib-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&libvirt-glib-download-http;"/>

source: Download (FTP): <ulink url="&libvirt-glib-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&libvirt-glib-download-ftp;"/>

source: Download MD5 sum: &libvirt-glib-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &libvirt-glib-md5sum;

source: Download size: &libvirt-glib-size;
fr: Taille du téléchargement&nbsp;: &libvirt-glib-size;

source: Estimated disk space required: &libvirt-glib-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &libvirt-glib-buildsize;

source: Estimated build time: &libvirt-glib-time;
fr: Estimation du temps de construction&nbsp;: &libvirt-glib-time;

source: libvirt-glib Dependencies
fr: Dépendances de libvirt-glib

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/libvirt-glib"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/libvirt-glib"/>

source: Installation of libvirt-glib
fr: Installation de libvirt-glib

source: Install <application>libvirt-glib</application> by running the following commands:
fr: Installez <application>libvirt-glib</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: contains the <application>libvirt-glib</application> API functions.
fr: Contient les fonctions de l'API de <application>libvirt-glib</application>
