Repository: espindula/br-lfs
Catalog: blfs/*/archive/libXp.po
Languages: fr

source: 292 KB
fr: 292 Kio

source: 4.9 MB
fr: 4.9 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to libXp
fr: Introduction à libXp

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&libXp-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&libXp-download-http;"/>

source: Download (FTP): <ulink url="&libXp-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&libXp-download-ftp;"/>

source: Download MD5 sum: &libXp-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &libXp-md5sum;

source: Download size: &libXp-size;
fr: Taille du téléchargement&nbsp;: &libXp-size;

source: Estimated disk space required: &libXp-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &libXp-buildsize;

source: Estimated build time: &libXp-time;
fr: Estimation du temps de construction&nbsp;: &libXp-time;

source: libXp Dependencies
fr: Dépendances de libXp

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/libXp"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/libXp"/>

source: Installation of libXp
fr: Installation de libXp

source: Install <application>libXp</application> by running the following commands:
fr: Installez <application>libXp</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
