Repository: espindula/br-lfs
Catalog: blfs/*/archive/libxfcegui4.po
Languages: fr

source: 676 KB
fr: 676 Kio

source: 29 MB
fr: 29 Mio

source: Introduction to libxfcegui4
fr: Introduction à libxfcegui4

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&libxfcegui4-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&libxfcegui4-download-http;"/>

source: Download (FTP): <ulink url="&libxfcegui4-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&libxfcegui4-download-ftp;"/>

source: Download MD5 sum: &libxfcegui4-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &libxfcegui4-md5sum;

source: Download size: &libxfcegui4-size;
fr: Taille du téléchargement&nbsp;: &libxfcegui4-size;

source: Estimated disk space required: &libxfcegui4-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &libxfcegui4-buildsize;

source: Estimated build time: &libxfcegui4-time;
fr: Estimation du temps de construction&nbsp;: &libxfcegui4-time;

source: libxfcegui4 Dependencies
fr: Dépendances de libxfcegui4

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/libxfcegui4"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/libxfcegui4"/>

source: Installation of libxfcegui4
fr: Installation de libxfcegui4

source: Install <application>libxfcegui4</application> by running the following commands:
fr: Installez <application>libxfcegui4</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
