Repository: espindula/br-lfs
Catalog: blfs/*/archive/nepomuk-widgets.po
Languages: fr

source: 48 KB
fr: 48 Kio

source: 3.8 MB
fr: 3.8 Mio

source: Introduction to nepomuk-widgets
fr: Introduction à nepomuk-widgets

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&nepomuk-widgets-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&nepomuk-widgets-download-http;"/>

source: Download (FTP): <ulink url="&nepomuk-widgets-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&nepomuk-widgets-download-ftp;"/>

source: Download MD5 sum: &nepomuk-widgets-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &nepomuk-widgets-md5sum;

source: Download size: &nepomuk-widgets-size;
fr: Taille du téléchargement&nbsp;: &nepomuk-widgets-size;

source: Estimated disk space required: &nepomuk-widgets-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &nepomuk-widgets-buildsize;

source: Estimated build time: &nepomuk-widgets-time;
fr: Estimation du temps de construction&nbsp;: &nepomuk-widgets-time;

source: Nepomuk-widgets Dependencies
fr: Dépendances de Nepomuk-widgets

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/nepomuk-widgets"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/nepomuk-widgets"/>

source: Installation of nepomuk-widgets
fr: Installation de nepomuk-widgets

source: Install <application>nepomuk-widgets</application> by running the following commands:
fr: Installez <application>nepomuk-widgets</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue <command>make test</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make test</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
