Repository: espindula/br-lfs
Catalog: blfs/*/archive/notify-python.po
Languages: fr

source: 212 KB
fr: 212 Kio

source: 2.3 MB
fr: 2.3 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Notify Python Module
fr: Introduction à Notify Python Module

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&notify-python-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&notify-python-download-http;"/>

source: Download (FTP): <ulink url="&notify-python-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&notify-python-download-ftp;"/>

source: Download MD5 sum: &notify-python-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &notify-python-md5sum;

source: Download size: &notify-python-size;
fr: Taille du téléchargement&nbsp;: &notify-python-size;

source: Estimated disk space required: &notify-python-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &notify-python-buildsize;

source: Estimated build time: &notify-python-time;
fr: Estimation du temps de construction&nbsp;: &notify-python-time;

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch: <ulink url="&patch-root;/notify-python-&notify-python-version;-libnotify-0.7-1.patch"/>
fr: Correctif requis&nbsp;: <ulink url="&patch-root;/notify-python-&notify-python-version;-libnotify-0.7-1.patch"/>

source: Notify Python Dependencies
fr: Dépendances de Notify Python

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/notify-python"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/notify-python"/>

source: Installation of Notify Python
fr: Installation de Notify Python

source: Install <application>Notify Python</application> by running the following commands:
fr: Installez <application>Notify Python</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé
