Repository: espindula/br-lfs
Catalog: blfs/*/archive/pan.po
Languages: fr

source: 1.4 MB
fr: 1.4 Mio

source: 178 MB
fr: 178 Mio

source: Introduction to Pan
fr: Introduction à Pan

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&pan-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&pan-download-http;"/>

source: Download (FTP): <ulink url="&pan-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&pan-download-ftp;"/>

source: Download MD5 sum: &pan-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &pan-md5sum;

source: Download size: &pan-size;
fr: Taille du téléchargement&nbsp;: &pan-size;

source: Estimated disk space required: &pan-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &pan-buildsize;

source: Estimated build time: &pan-time;
fr: Estimation du temps de construction&nbsp;: &pan-time;

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch: <ulink url="&patch-root;/pan-&pan-version;-gmime_gcc-1.patch"/>
fr: Correctif requis&nbsp;: <ulink url="&patch-root;/pan-&pan-version;-gmime_gcc-1.patch"/>

source: Pan Dependencies
fr: Dépendances de Pan

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/pan"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/pan"/>

source: Installation of Pan
fr: Installation de Pan

source: Install <application>Pan</application> by running the following commands:
fr: Installez <application>Pan</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue <command>make check</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make check</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
