Repository: espindula/br-lfs
Catalog: blfs/*/archive/printproto.po
Languages: fr

source: 224 KB
fr: 224 Kio

source: 2.6 MB
fr: 2.6 Mio

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&printproto-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&printproto-download-http;"/>

source: Download (FTP): <ulink url="&printproto-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&printproto-download-ftp;"/>

source: Download MD5 sum: &printproto-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &printproto-md5sum;

source: Download size: &printproto-size;
fr: Taille du téléchargement&nbsp;: &printproto-size;

source: Estimated disk space required: &printproto-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &printproto-buildsize;

source: Estimated build time: &printproto-time;
fr: Estimation du temps de construction&nbsp;: &printproto-time;

source: User Notes: <ulink url="&blfs-wiki;/printproto"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/printproto"/>

source: Installation of printproto
fr: Installation de printproto

source: Install <application>printproto</application> by running the following commands:
fr: Installez <application>printproto</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé
