Repository: espindula/br-lfs
Catalog: blfs/*/archive/pyrex.po
Languages: fr

source: 252 KB
fr: 252 Kio

source: 4.0 MB
fr: 4.0 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Pyrex Module
fr: Introduction à Pyrex Module

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&pyrex-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&pyrex-download-http;"/>

source: Download (FTP): <ulink url="&pyrex-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&pyrex-download-ftp;"/>

source: Download MD5 sum: &pyrex-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &pyrex-md5sum;

source: Download size: &pyrex-size;
fr: Taille du téléchargement&nbsp;: &pyrex-size;

source: Estimated disk space required: &pyrex-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &pyrex-buildsize;

source: Estimated build time: &pyrex-time;
fr: Estimation du temps de construction&nbsp;: &pyrex-time;

source: Pyrex Dependencies
fr: Dépendances de Pyrex

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/pyrex"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/pyrex"/>

source: Installation of Pyrex
fr: Installation de Pyrex

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé
