Repository: espindula/br-lfs
Catalog: blfs/*/archive/shrdesktopontologies.po
Languages: fr

source: 3.8 MB
fr: 3.8 Mio

source: 6.7 MB
fr: 6.7 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to Shared-Desktop-Ontologies
fr: Introduction à Shared-Desktop-Ontologies

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&shared-desktop-ontologies-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&shared-desktop-ontologies-download-http;"/>

source: Download (FTP): <ulink url="&shared-desktop-ontologies-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&shared-desktop-ontologies-download-ftp;"/>

source: Download MD5 sum: &shared-desktop-ontologies-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &shared-desktop-ontologies-md5sum;

source: Download size: &shared-desktop-ontologies-size;
fr: Taille du téléchargement&nbsp;: &shared-desktop-ontologies-size;

source: Estimated disk space required: &shared-desktop-ontologies-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &shared-desktop-ontologies-buildsize;

source: Estimated build time: &shared-desktop-ontologies-time;
fr: Estimation du temps de construction&nbsp;: &shared-desktop-ontologies-time;

source: Shared-desktop-ontologies Dependencies
fr: Dépendances de Shared-desktop-ontologies

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/shared-desktop-ontologies"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/shared-desktop-ontologies"/>

source: Installation of Shared-desktop-ontologies
fr: Installation de Shared-desktop-ontologies

source: Install <application>Shared-desktop-ontologies</application> by running the following commands:
fr: Installez <application>Shared-desktop-ontologies</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
