Repository: espindula/br-lfs
Catalog: blfs/*/archive/sound-theme-freedesktop.po
Languages: fr

source: 472 KB
fr: 472 Kio

source: 2 MB
fr: 2 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to sound-theme-freedesktop
fr: Introduction à sound-theme-freedesktop

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&sound-theme-freedesktop-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&sound-theme-freedesktop-download-http;"/>

source: Download (FTP): <ulink url="&sound-theme-freedesktop-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&sound-theme-freedesktop-download-ftp;"/>

source: Download MD5 sum: &sound-theme-freedesktop-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &sound-theme-freedesktop-md5sum;

source: Download size: &sound-theme-freedesktop-size;
fr: Taille du téléchargement&nbsp;: &sound-theme-freedesktop-size;

source: Estimated disk space required: &sound-theme-freedesktop-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &sound-theme-freedesktop-buildsize;

source: Estimated build time: &sound-theme-freedesktop-time;
fr: Estimation du temps de construction&nbsp;: &sound-theme-freedesktop-time;

source: sound-theme-freedesktop Dependencies
fr: Dépendances de sound-theme-freedesktop

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/sound-theme-freedesktop"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/sound-theme-freedesktop"/>

source: Installation of sound-theme-freedesktop
fr: Installation de sound-theme-freedesktop

source: Install <application>sound-theme-freedesktop</application> by running the following commands:
fr: Installez <application>sound-theme-freedesktop</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé
