Repository: espindula/br-lfs
Catalog: blfs/*/archive/strigi.po
Languages: fr

source: 811 KB
fr: 811 Ko

source: 52 MB
fr: 52 Mo

source: Introduction to Strigi
fr: Introduction à Strigi

source: <application>Strigi</application> is a program for fast indexing and searching of personal data. It can gather and index information from files in the filesystem even if they are hidden in emails or archives.
fr: <application>Strigi</application> est un programme pour l'indexation rapide et la recherche de données personnelles. Il peut recueillir des informations et indexer des fichiers dans le système de fichiers, même s'ils sont cachés dans les courriels ou archives.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&strigi-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&strigi-download-http;"/>

source: Download (FTP): <ulink url="&strigi-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&strigi-download-ftp;"/>

source: Download MD5 sum: &strigi-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &strigi-md5sum;

source: Download size: &strigi-size;
fr: Taille du téléchargement&nbsp;: &strigi-size;

source: Estimated disk space required: &strigi-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &strigi-buildsize;

source: Estimated build time: &strigi-time;
fr: Estimation du temps de construction&nbsp;: &strigi-time;

source: Strigi Dependencies
fr: Dépendances de Strigi

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: <xref linkend="dbus"/> and <xref linkend="qt4"/>
fr: <xref linkend="dbus"/> et <xref linkend="qt4"/>

source: Optional
fr: Facultatives

source: <xref linkend="ffmpeg"/>, <xref linkend="exiv2"/>, <xref linkend="libxml2"/>, <ulink url="http://sourceforge.net/projects/clucene/files/clucene-core-stable/"> CLucene version 0.9x</ulink> , and <ulink url="http://logging.apache.org/log4cxx/">log4cxx</ulink>
fr: <xref linkend="ffmpeg"/>, <xref linkend="exiv2"/>, <xref linkend="libxml2"/>, <ulink url="http://sourceforge.net/projects/clucene/files/clucene-core-stable/"> CLucene version 0.9x</ulink> et <ulink url="http://logging.apache.org/log4cxx/">log4cxx</ulink>

source: User Notes: <ulink url="&blfs-wiki;/strigi"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/strigi"/>

source: Installation of Strigi
fr: Installation de Strigi

source: Install <application>strigi</application> by running the following commands:
fr: Installez <application>strigi</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue <command>make test</command>.
fr: Pour tester les résultats, lancez <command>make test</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <command>sed -i "..."</command>: This command fixes the build with recent <application>GCC</application> versions.
fr: <command>sed -i "..."</command>&nbsp;: Cette commande corrige la construction avec les versions récentes de <application>GCC</application>.

source: <parameter>-DCMAKE_INSTALL_LIBDIR=lib</parameter>: This switch is used so the package doesn't write over the lib64 symlink on 64 bit systems.
fr: <parameter>-DCMAKE_INSTALL_LIBDIR=lib</parameter>&nbsp;: Ce paramètre est utilisé sur les systèmes 64 bit pour que le paquet n'écrive pas sur le lien symbolique lib64.

source: <parameter>-DCMAKE_BUILD_TYPE=Release</parameter>: This switch is used to apply higher level of the compiler optimizations.
fr: <parameter>-DCMAKE_BUILD_TYPE=Release</parameter>&nbsp;: Ce paramètre est utilisé pour appliquer un niveau haut d'optimisation au compilateur.

source: <option>-DENABLE_DBUS=OFF</option>: Use this <command>cmake</command> variable if you don't have <application>D-Bus</application> installed.
fr: <option>-DENABLE_DBUS=OFF</option>&nbsp;: Utilisez cette variable <command>cmake</command> si vous n'avez pas installé <application>D-Bus</application>.

source: <option>-DENABLE_QT4=OFF</option>: Use this <command>cmake</command> variable if you don't have <application>Qt4</application> installed or if you compiled <application>Qt4</application> without <application>D-Bus</application> support.
fr: <option>-DENABLE_QT4=OFF</option>&nbsp;: Utilisez cette variable <command>cmake</command> si vous n'avez pas installé <application>Qt4</application> ou si vous avez compilé <application>Qt4</application> sans le support <application>D-Bus</application>.

source: <option>-DENABLE_CLUCENE*=OFF</option>: These statements disable the package from trying to use <xref linkend="clucene"/> (current stable version).
fr: <option>-DENABLE_CLUCENE*=OFF</option>&nbsp;: Ces variables désactivent l'utilisation de <xref linkend="clucene"/> (version stable actuelle).

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: deepfind, deepgrep, rdfindexer, strigiclient, strigicmd, strigidaemon, and xmlindexer
fr: deepfind, deepgrep, rdfindexer, strigiclient, strigicmd, strigidaemon et xmlindexer

source: libsearchclient.so, libstreamanalyzer.so, libstreams.so, libstrigihtmlgui.so, libstrigiqtdbusclient.so, and several in /usr/lib/strigi
fr: libsearchclient.so, libstreamanalyzer.so, libstreams.so, libstrigihtmlgui.so, libstrigiqtdbusclient.so et plusieurs dans /usr/lib/strigi

source: /usr/include/strigi, /usr/lib/strigi, and /usr/share/strigi
fr: /usr/include/strigi, /usr/lib/strigi et /usr/share/strigi

source: Short Descriptions
fr: Descriptions courtes

source: is a utility for searching for filenames in compressed archives like tar, cpio, and zip
fr: est un utilitaire pour chercher un nom de fichier dans des archives comprimés en tar, cpio, et zip.

source: is a utility for searching compressed archives like tar, cpio, and zip
fr: est un utilitaire pour chercher des archives comprimés en tar, cpio, et zip.

source: manages and performs indexing of the RDF data for entities present on your site
fr: gère et réalise l'indexage des données RDF pour des entités présentes sur votre site.

source: is a Qt4 client (GUI) for the Strigi Desktop Search software
fr: est un client Qt4 (GUI) pour le programme de recherche Strigi.

source: is a program for creating and querying indices
fr: est un programme pour créer et demander des indices.

source: is a daemon program for maintaining indices
fr: est un programme démon pour maintenir les indices

source: indexes XML documents
fr: indexe les documents XML.
