Repository: espindula/br-lfs
Catalog: blfs/*/archive/xfce4-mixer.po
Languages: fr

source: 452 KB
fr: 452 Kio

source: 9.3 MB
fr: 9.3 Mio

source: Introduction to Xfce4 Mixer
fr: Introduction à Xfce4 Mixer

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&xfce4-mixer-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&xfce4-mixer-download-http;"/>

source: Download (FTP): <ulink url="&xfce4-mixer-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&xfce4-mixer-download-ftp;"/>

source: Download MD5 sum: &xfce4-mixer-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &xfce4-mixer-md5sum;

source: Download size: &xfce4-mixer-size;
fr: Taille du téléchargement&nbsp;: &xfce4-mixer-size;

source: Estimated disk space required: &xfce4-mixer-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &xfce4-mixer-buildsize;

source: Estimated build time: &xfce4-mixer-time;
fr: Estimation du temps de construction&nbsp;: &xfce4-mixer-time;

source: Xfce4 Mixer Dependencies
fr: Dépendances de Xfce4 Mixer

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/xfce4-mixer"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/xfce4-mixer"/>

source: Installation of Xfce4 Mixer
fr: Installation de Xfce4 Mixer

source: Install <application>Xfce4 Mixer</application> by running the following commands:
fr: Installez <application>Xfce4 Mixer</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes
