Repository: espindula/br-lfs
Catalog: lfs/*/chapter02/creatingpartition.po
Languages: fr

source: Creating a New Partition
fr: Création d'une nouvelle partition

source: Like most other operating systems, LFS is usually installed on a dedicated partition. The recommended approach to building an LFS system is to use an available empty partition or, if you have enough unpartitioned space, to create one.
fr: Comme la plupart des autres systèmes d'exploitation, LFS est habituellement installé sur une partition dédiée. Pour construire un système LFS, il est recommandé d'utiliser une partition vide disponible ou d'en créer une, si vous avez assez d'espace non partitionné.

source: A minimal system requires a partition of around 10 gigabytes (GB). This is enough to store all the source tarballs and compile the packages. However, if the LFS system is intended to be the primary Linux system, additional software will probably be installed which will require additional space. A 30 GB partition is a reasonable size to provide for growth. The LFS system itself will not take up this much room. A large portion of this requirement is to provide sufficient free temporary storage as well as for adding additional capabilities after LFS is complete. Additionally, compiling packages can require a lot of disk space which will be reclaimed after the package is installed.
fr: Un système minimal requiert une partition d'environ 10&nbsp;Go. Cet espace est suffisant pour conserver toutes les archives tar des sources et pour compiler tous les paquets. Néanmoins, si le système LFS a pour but d'être un système Linux primaire, des logiciels additionnels seront probablement installés et nécessiteront de l’espace supplémentaire. Une partition de 30&nbsp;Go devrait suffire à garantir l’espace nécessaire à cette opération. Le système LFS en lui-même ne prendra pas tout cet espace. Une grande partie de cet espace servira à prévoir suffisamment d’espace temporaire libre ainsi qu’à accueillir des fonctionnalités supplémentaires une fois LFS terminé. De plus, la compilation des paquets peut demander beaucoup d'espace disque, qui sera récupéré après l'installation du paquet.

source: Because there is not always enough Random Access Memory (RAM) available for compilation processes, it is a good idea to use a small disk partition as <systemitem class="filesystem">swap</systemitem> space. This is used by the kernel to store seldom-used data and leave more memory available for active processes. The <systemitem class="filesystem">swap</systemitem> partition for an LFS system can be the same as the one used by the host system, in which case it is not necessary to create another one.
fr: Parce qu'il n'y a pas toujours assez de mémoire vive (RAM) disponible pour les processus de compilation, il est conseillé d'utiliser une petite partition comme espace d'échange <systemitem class="filesystem">swap</systemitem>. Le noyau utilise cet espace pour stocker des données rarement utilisées et pour laisser plus de mémoire aux processus actifs. Il se peut que la partition <systemitem class="filesystem">swap</systemitem> pour un système LFS soit la même que celle utilisée par le système hôte, auquel cas il n'est pas nécessaire de créer une autre partition si votre système hôte possède déjà cette configuration.

source: Start a disk partitioning program such as <command>cfdisk</command> or <command>fdisk</command> with a command line option naming the hard disk on which the new partition will be created&mdash;for example <filename class="devicefile">/dev/sda</filename> for the primary disk drive. Create a Linux native partition and a <systemitem class="filesystem">swap</systemitem> partition, if needed. Please refer to <filename>cfdisk(8)</filename> or <filename>fdisk(8)</filename> if you do not yet know how to use the programs.
fr: Lancez un programme de partitionnement de disques, tel que <command>cfdisk</command> ou <command>fdisk</command> avec une option en ligne de commande nommant le disque dur sur lequel la nouvelle partition sera créée. Par exemple, on utilisera <filename class="devicefile">/dev/sda</filename> pour le disque primaire. Créez une partition Linux native et, si nécessaire, une partition <systemitem class="filesystem">swap</systemitem>. Référez-vous au manuel de <filename>cfdisk(8)</filename> ou de <filename>fdisk(8)</filename> si vous ne savez pas encore utiliser les programmes.

source: For experienced users, other partitioning schemes are possible. The new LFS system can be on a software <ulink url="&blfs-book;postlfs/raid.html">RAID</ulink> array or an <ulink url="&blfs-book;postlfs/aboutlvm.html">LVM</ulink> logical volume. However, some of these options require an <ulink url="&blfs-book;postlfs/initramfs.html">initramfs</ulink>, which is an advanced topic. These partitioning methodologies are not recommended for first time LFS users.
fr: Pour les utilisateurs expérimentés, il est possible d'utiliser d'autres méthodes de partitionnement. Le nouveau système LFS peut être installé sur un logiciel <ulink url="&blfs-book;postlfs/raid.html">RAID</ulink> ou sur un volume logique <ulink url="&blfs-book;postlfs/aboutlvm.html">LVM</ulink>. Par contre, certaines options exigent un <ulink url="&blfs-book;postlfs/initramfs.html">initramfs</ulink>, qui concerne un sujet plus avancé. Ces méthodes de partitionnement ne sont pas recommandées pour les utilisateurs novices de LFS.

source: Remember the designation of the new partition (e.g., <filename class="devicefile">sda5</filename>). This book will refer to this as the LFS partition. Also remember the designation of the <systemitem class="filesystem">swap</systemitem> partition. These names will be needed later for the <filename>/etc/fstab</filename> file.
fr: Retenez bien la désignation de la nouvelle partition (par exemple <filename class="devicefile">sda5</filename>). Elle sera référencée dans ce livre comme partition LFS. Gardez également en mémoire la désignation de la partition <systemitem class="filesystem">swap</systemitem>. Ces noms vous seront utiles pour le fichier <filename>/etc/fstab</filename>.

source: Other Partition Issues
fr: Autres problèmes liés au partitionnement

source: Requests for advice on system partitioning are often posted on the LFS mailing lists. This is a highly subjective topic. The default for most distributions is to use the entire drive with the exception of one small swap partition. This is not optimal for LFS for several reasons. It reduces flexibility, makes sharing of data across multiple distributions or LFS builds more difficult, makes backups more time consuming, and can waste disk space through inefficient allocation of file system structures.
fr: Les demandes de conseils par rapport au partitionnement du système sont souvent postées sur les listes de diffusion LFS. Ce sujet est très subjectif. Par défaut, la plupart des distributions utilisent le disque entier, sauf une petite partie réservée à la partition d'échange. Cette solution n'est pas optimale pour LFS, et ce pour plusieurs raisons. Cela réduit la flexibilité, complique le partage de données entre plusieurs distributions ou constructions LFS et allonge le temps de sauvegarde. Cela peut également faire perdre de l'espace disque à cause d’une allocation inefficace des structures de fichiers.

source: The Root Partition
fr: La partition racine

source: A root LFS partition (not to be confused with the <filename class="directory">/root</filename> directory) of twenty gigabytes is a good compromise for most systems. It provides enough space to build LFS and most of BLFS, but is small enough so that multiple partitions can be easily created for experimentation.
fr: Une partition racine LFS (à ne pas confondre avec le répertoire <filename class="directory">/root</filename>), de 20&nbsp;Go est un bon compromis pour la plupart des systèmes. Elle fournit assez d’espace pour construire LFS et une grande partie de BLFS, tout en étant assez petit pour que plusieurs partitions puissent être créées facilement à des fins expérimentales.

source: The Swap Partition
fr: La partition d'échange (swap)

source: Most distributions automatically create a swap partition. Generally the recommended size of the swap partition is about twice the amount of physical RAM, however this is rarely needed. If disk space is limited, hold the swap partition to two gigabytes and monitor the amount of disk swapping.
fr: La plupart des distributions créent automatiquement une partition d'échange. En général, la taille recommandée pour une partition d'échange est à peu près deux fois supérieure à la taille de la RAM physique, bien que ce soit rarement nécessaire. Si votre espace disque est limité, laissez la partition d'échange à 2&nbsp;Go et surveillez l'utilisation de la mémoire d'échange sur le disque.

source: If you want to use the hibernation feature (suspend-to-disk) of Linux, it writes out the contents of RAM to the swap partition before turning off the machine. In this case the size of the swap partition should be at least as large as the system's installed RAM.
fr: Si vous voulez utiliser le mode hibernation (veille sur disque) de Linux, il transfère le contenu de la RAM vers la partition d'échange avant d'éteindre la machine. Dans ce cas, la partition d'échange doit être au moins aussi grande que la RAM installée sur le système.

source: Swapping is never good. For mechanical hard drives you can generally tell if a system is swapping by just listening to disk activity and observing how the system reacts to commands. With an SSD you will not be able to hear swapping, but you can tell how much swap space is being used by running the <command>top</command> or <command>free</command> programs. Use of an SSD for a swap partition should be avoided if possible. The first reaction to swapping should be to check for an unreasonable command such as trying to edit a five gigabyte file. If swapping becomes a normal occurrence, the best solution is to purchase more RAM for your system.
fr: L'utilisation de la mémoire d'échange n'est jamais une bonne chose. Avec un disque dur mécanique, vous pouvez déterminer si un système utilise la mémoire d'échange simplement en écoutant l'activité du disque et en observant la façon dont le système réagit aux commandes. Vous ne pourrez pas l'entendre utiliser l'espace d'échange avec un disque SSD, mais vous pouvez savoir combien d'espace d'échange est utilisé avec les programmes <command>top</command> et <command>free</command>. Si possible, vous devez éviter d'utiliser une partition d'échange sur un disque SSD. Lorsque la mémoire d’échange est utilisée, vous devez en premier lieu vérifier si l’une des commandes n'est pas insensée, comme par exemple l’édition d’un fichier de 5&nbsp;Go. Si l'utilisation de la mémoire d'échange devient un phénomène habituel, la meilleure solution est d'ajouter de la mémoire RAM à votre système.

source: The Grub Bios Partition
fr: La partition Bios de Grub

source: If the <emphasis>boot disk</emphasis> has been partitioned with a GUID Partition Table (GPT), then a small, typically 1 MB, partition must be created if it does not already exist. This partition is not formatted, but must be available for GRUB to use during installation of the boot loader. This partition will normally be labeled 'BIOS Boot' if using <command>fdisk</command> or have a code of <emphasis>EF02</emphasis> if using the <command>gdisk</command> command.
fr: Si le <emphasis>disque de démarrage</emphasis> est partitionné avec une table de partition GUID (GPT), alors une petite partition de l’ordre d’1&nbsp;Mo doit être créée, si elle n’existe pas déjà. Cette partition n’est pas formatée, mais doit être disponible pour que GRUB l’utilise pendant l’installation du chargeur d’amorçage. Cette partition sera normalement intitulée «&nbsp;<foreignphrase>BIOS Boot</foreignphrase>&nbsp;» si vous utilisez <command>fdisk</command> ou aura le code <emphasis>EF02</emphasis> avec <command>gdisk</command>.

source: The Grub Bios partition must be on the drive that the BIOS uses to boot the system. This is not necessarily the drive that holds the LFS root partition. The disks on a system may use different partition table types. The necessity of the Grub Bios partition depends only on the partition table type of the boot disk.
fr: La partition Bios de Grub doit se trouver sur le disque que le BIOS utilise pour démarrer le système. Il ne s’agit pas nécessairement du même disque que celui sur lequel la partition racine de LFS est installée. Les disques d’un système peuvent utiliser des types de tables de partitionnement différents. Seul le type de table de partitionnement du disque de démarrage détermine si cette partition est nécessaire ou non.

source: Convenience Partitions
fr: Partitions de commodité

source: There are several other partitions that are not required, but should be considered when designing a disk layout. The following list is not comprehensive, but is meant as a guide.
fr: Il existe d’autres partitions qui ne sont pas indispensables, mais que vous devez envisager lorsque vous aménagez un disque dur. La liste suivante n’est pas exhaustive mais a été conçue pour vous guider.

source: /boot &ndash; Highly recommended. Use this partition to store kernels and other booting information. To minimize potential boot problems with larger disks, make this the first physical partition on your first disk drive. A partition size of 200 megabytes is adequate.
fr: /boot &ndash; Fortement recommandée. Utilisez cette partition pour stocker les noyaux et d'autres informations de démarrage. Pour limiter les risques de problèmes de démarrage avec les disques volumineux, faites-en la première partition physique sur votre premier disque dur. Une taille de partition de 200&nbsp;mégaoctets est parfaitement adaptée.

source: /boot/efi &ndash; The EFI System Partition, which is needed for booting the system with UEFI. Read <ulink url="&blfs-book;postlfs/grub-setup.html">the BLFS page</ulink> for details.
fr: /boot/efi &ndash; La partition EFI système, qui est requise pour démarrer le système avec UEFI. Consultez <ulink url="&blfs-book;postlfs/grub-setup.html">la page BLFS</ulink> pour plus d’informations.

source: /home &ndash; Highly recommended. Share your home directory and user customization across multiple distributions or LFS builds. The size is generally fairly large and depends on available disk space.
fr: /home &ndash; Fortement recommandée. Partage votre répertoire home et vos paramètres utilisateur entre plusieurs distributions ou constructions de LFS. La taille est généralement assez importante et dépend de l'espace disque disponible.

source: /usr &ndash; In LFS, <filename class="directory">/bin</filename>, <filename class="directory">/lib</filename>, and <filename class="directory">/sbin</filename> are symlinks to their counterparts in <filename class="directory">/usr</filename>. So <filename class="directory">/usr</filename> contains all the binaries needed for the system to run. For LFS a separate partition for <filename class="directory">/usr</filename> is normally not needed. If you create it anyway, you should make a partition large enough to fit all the programs and libraries in the system. The root partition can be very small (maybe just one gigabyte) in this configuration, so it's suitable for a thin client or diskless workstation (where <filename class="directory">/usr</filename> is mounted from a remote server). However, you should be aware that an initramfs (not covered by LFS) will be needed to boot a system with a separate <filename class="directory">/usr</filename> partition.
fr: /usr &ndash; Dans LFS, <filename class="directory">/bin</filename>, <filename class="directory">/lib</filename> et <filename class="directory">/sbin</filename> sont des liens symboliques vers leurs équivalents dans <filename class="directory">/usr</filename>. Le dossier <filename class="directory">/usr</filename> contient tous les binaires nécessaires à l’exécution du système. Dans LFS, une partition séparée pour <filename class="directory">/usr</filename> n'est généralement pas requise. Si vous souhaitez quand même en créer une, vous devrez faire en sorte qu’elle soit assez grande pour contenir tous les programmes et bibliothèques du système. La partition racine de cette configuration peut être très petite (par exemple seulement un gigaoctet). Elle est donc parfaitement adaptée à un client léger ou une station de travail sans disque (où <filename class="directory">/usr</filename> est monté depuis un serveur distant). Cependant, il faut savoir que vous aurez besoin d’un initramfs (dont la construction n’est pas évoquée dans LFS) pour démarrer le système avec une partition <filename class="directory">/usr</filename> séparée.

source: /opt &ndash; This directory is most useful for BLFS, where multiple large packages like KDE or Texlive can be installed without embedding the files in the /usr hierarchy. If used, 5 to 10 gigabytes is generally adequate.
fr: /opt &ndash; Ce répertoire est surtout utile pour BLFS, où vous pouvez installer plusieurs versions de paquets volumineux tels que KDE ou Texlive sans incorporer les fichiers dans la hiérarchie /usr. Si vous l'utilisez, un espace de 5 à 10&nbsp;gigaoctets est généralement adapté.

source: /tmp &ndash; By default, systemd mounts a <systemitem class='filesystem'>tmpfs</systemitem> here. If you want to override that behavior, follow <xref linkend='systemd-no-tmpfs'/> when configuring the LFS system.
fr: /tmp &ndash; systemd monte par défaut un <systemitem class='filesystem'>tmpfs</systemitem> à cet emplacement. Vous pouvez redéfinir ce comportement en suivant <xref linkend='systemd-no-tmpfs'/> lors de la configuration du système LFS.

source: /usr/src &ndash; This partition is very useful for providing a location to store BLFS source files and share them across LFS builds. It can also be used as a location for building BLFS packages. A reasonably large partition of 30-50 gigabytes provides plenty of room.
fr: /usr/src &ndash; Cette partition est très utile pour assurer un emplacement de stockage des fichiers source de BLFS et les partager entre les constructions LFS. Vous pouvez aussi l'utiliser comme un espace de construction des paquets BLFS. Une partition entre 30 et 50&nbsp;gigaoctets offre suffisamment d’espace.

source: Any separate partition that you want automatically mounted when the system starts must be specified in the <filename>/etc/fstab</filename> file. Details about how to specify partitions will be discussed in <xref linkend="ch-bootable-fstab"/>.
fr: Vous devez spécifier toute partition que vous voulez monter automatiquement au démarrage dans <filename>/etc/fstab</filename>. La spécification des partitions sera expliquée en détails dans le <xref linkend="ch-bootable-fstab"/>.
