Repository: espindula/br-lfs
Catalog: lfs/*/chapter02/creatingfilesystem.po
Languages: fr

source: Creating a File System on the Partition
fr: Création d'un système de fichiers sur la partition

source: A partition is just a range of sectors on a disk drive, delimited by boundaries set in a partition table. Before the operating system can use a partition to store any files, the partition must be formatted to contain a file system, typically consisting of a label, directory blocks, data blocks, and an indexing scheme to locate a particular file on demand. The file system also helps the OS keep track of free space on the partition, reserve the needed sectors when a new file is created or an existing file is extended, and recycle the free data segments created when files are deleted. It may also provide support for data redundancy, and for error recovery.
fr: Une partition est un ensemble de secteurs sur un lecteur de disque. Cet ensemble est délimité par des bornes placées dans un tableau de partitions. Avant que le système d’exploitation ne puisse utiliser une partition pour stocker des fichiers, il faut d’abord formater la partition. Elle pourra contenir un système de fichiers constitué principalement d’une étiquette interne, d’un répertoire de blocs, de blocs de données et d’un schéma d’indexation qui permettront de localiser un fichier précis sur demande. Le système de fichiers aide aussi l’OS à garder une trace de l’espace libre sur la partition, stocker les secteurs nécessaires quand un nouveau fichier est créé ou qu’un fichier existant est étendu et recycler les segments de données libres qui sont créés lorsque des fichiers sont supprimés. Le système de fichiers peut aussi servir de support en cas de redondance des données et d’élimination d’erreurs.

source: LFS can use any file system recognized by the Linux kernel, but the most common types are ext3 and ext4. The choice of the right file system can be complex; it depends on the characteristics of the files and the size of the partition. For example:
fr: Maintenant qu'une partition vierge est prête, le système de fichiers peut être créé. LFS peut utiliser n'importe quel système de fichiers reconnu par le noyau Linux, mais les types ext3 et ext4 sont les plus communs. Le choix d'un système de fichiers peut être complexe et dépend des caractéristiques des fichiers et de la taille de la partition. Par exemple&nbsp;:

source: is suitable for small partitions that are updated infrequently such as /boot.
fr: convient aux petites partitions rarement mises à jour, telles que /boot.

source: is an upgrade to ext2 that includes a journal to help recover the partition's status in the case of an unclean shutdown. It is commonly used as a general purpose file system.
fr: est une mise à jour d’ext2 qui comprend un journal aidant à récupérer l'état de la partition en cas d'arrêt brutal. Ce type est communément employé dans une perspective généraliste.

source: is the latest version of the ext family of file systems. It provides several new capabilities including nano-second timestamps, creation and use of very large files (up to 16 TB), and speed improvements.
fr: est la dernière version de type ext des systèmes de fichiers. Ce type offre de nouvelles possibilités, notamment l'horodatage à la nanoseconde, la création et l'utilisation de très gros fichiers (16&nbsp;To), ainsi que des améliorations de vitesse.

source: Other file systems, including FAT32, NTFS, ReiserFS, JFS, and XFS are useful for specialized purposes. More information about these file systems, and many others, can be found at <ulink url="https://en.wikipedia.org/wiki/Comparison_of_file_systems"/>.
fr: D'autres systèmes de fichiers comme FAT32, NTFS, ReiserFS, JFS et XFS servent à des fins plus spécifiques. Vous pouvez trouver plus d'informations sur ces systèmes de fichiers sur <ulink url="https://fr.wikipedia.org/wiki/Liste_des_syst%C3%A8mes_de_fichiers"/>.

source: LFS assumes that the root file system (/) is of type ext4. To create an <systemitem class="filesystem">ext4</systemitem> file system on the LFS partition, issue the following command:
fr: LFS considère que le système de fichiers racine (/) est de type ext4. Pour créer un système de fichiers <systemitem class="filesystem">ext4</systemitem> sur la partition LFS, exécutez la commande suivante&nbsp;:

source: Replace <replaceable>&lt;xxx&gt;</replaceable> with the name of the LFS partition.
fr: Remplacez <replaceable>&lt;xxx&gt;</replaceable> par le nom de la partition LFS.

source: If you are using an existing <systemitem class="filesystem">swap </systemitem> partition, there is no need to format it. If a new <systemitem class="filesystem"> swap</systemitem> partition was created, it will need to be initialized with this command:
fr: Si vous utilisez une partition <systemitem class="filesystem">swap</systemitem> déjà existante, il n'est pas nécessaire de la formater. En cas de création d’une nouvelle partition <systemitem class="filesystem">swap</systemitem>, initialisez-la à l'aide de la commande suivante&nbsp;:

source: Replace <replaceable>&lt;yyy&gt;</replaceable> with the name of the <systemitem class="filesystem">swap</systemitem> partition.
fr: Remplacez <replaceable>&lt;yyy&gt;</replaceable> par le nom de la partition <systemitem class="filesystem">swap</systemitem>.
