Repository: espindula/br-lfs
Catalog: lfs/*/chapter02/mounting.po
Languages: fr, pt_br, zh_cn

source: Mounting the New Partition
fr: Montage de la nouvelle partition
pt_br: Montando a Nova Partição
zh_cn: 挂载新的分区

source: Now that a file system has been created, the partition must be mounted so the host system can access it. This book assumes that the file system is mounted at the directory specified by the <envar>LFS</envar> environment variable described in the previous section.
fr: Maintenant qu'un système de fichiers a été créé, la partition doit être montée afin que le système hôte puisse y accéder. Dans ce livre, on suppose que le système de fichiers est monté sur le répertoire spécifié par la variable d'environnement <envar>LFS</envar>, comme décrit dans la section précédente.
pt_br: Agora que um sistema de arquivos tenha sido criado, a partição precisa ser montada, de forma que o sistema anfitrião consiga acessá-la. Este livro presume que o sistema de arquivos esteja montado no diretório especificado pela variável de ambiente <envar>LFS</envar> descrita na seção anterior.

source: Strictly speaking, one cannot "mount a partition". One mounts the <emphasis>file system</emphasis> embedded in that partition. But since a single partition can't contain more than one file system, people often speak of the partition and the associated file system as if they were one and the same.
fr: On ne peut pas «&nbsp;monter une partition&nbsp;» à proprement parler. On monte le <emphasis>système de fichiers</emphasis> intégré à cette partition. Mais comme une partition seule ne peut pas contenir plus d’un système de fichiers, la partition et le système de fichiers associé sont souvent considérés comme une seule et même entité.
pt_br: Estritamente falando, ninguém consegue "montar uma partição". A pessoa monta o <emphasis>sistema de arquivos</emphasis> embutido naquela partição. Porém, dado que uma partição única não pode conter mais que um sistema de arquivos, as pessoas frequentemente falam da partição e do sistema de arquivos associado como se fossem um e o mesmo.

source: Create the mount point and mount the LFS file system with these commands:
fr: Créez le point de montage et montez le système de fichiers LFS en exécutant la commande suivante&nbsp;:
pt_br: Crie o ponto de montagem e monte o sistema de arquivos do LFS com estes comandos:

source: Replace <replaceable>&lt;xxx&gt;</replaceable> with the name of the LFS partition.
fr: Remplacez <replaceable>&lt;xxx&gt;</replaceable> par le nom de la partition LFS.
pt_br: Substitua <replaceable>&lt;xxx&gt;</replaceable> pelo nome da partição do LFS.

source: If you are using multiple partitions for LFS (e.g., one for <filename class="directory">/</filename> and another for <filename class="directory">/home</filename>), mount them like this:
fr: Si vous utilisez plusieurs partitions pour LFS (par exemple une pour <filename class="directory">/</filename> et une autre pour <filename class="directory">/home</filename>), montez-les en utilisant&nbsp;:
pt_br: Se estiver usando múltiplas partições para o LFS (por exemplo, uma para <filename class="directory">/</filename> e outra para <filename class="directory">/home</filename>), [então] monte-as como isto:

source: Replace <replaceable>&lt;xxx&gt;</replaceable> and <replaceable>&lt;yyy&gt;</replaceable> with the appropriate partition names.
fr: Remplacez <replaceable>&lt;xxx&gt;</replaceable> et <replaceable>&lt;yyy&gt;</replaceable> par les noms de partition correspondants.
pt_br: Substitua <replaceable>&lt;xxx&gt;</replaceable> e <replaceable>&lt;yyy&gt;</replaceable> pelos nomes apropriados das partições.
zh_cn: 将 <replaceable>&lt;xxx&gt;</replaceable> 和 <replaceable>&lt;yyy&gt;</replaceable> 替换成对应的分区代号。

source: Ensure that this new partition is not mounted with permissions that are too restrictive (such as the <option>nosuid</option> or <option>nodev</option> options). Run the <command>mount</command> command without any parameters to see what options are set for the mounted LFS partition. If <option>nosuid</option> and/or <option>nodev</option> are set, the partition must be remounted.
fr: Assurez-vous que cette nouvelle partition n'est pas montée avec des droits trop restrictifs (comme les options <option>nosuid</option> ou <option>nodev</option>). Exécutez la commande <command>mount</command> sans aucun paramètre pour voir les options configurées pour la partition LFS que vous avez montée. Si les options <option>nosuid</option> ou <option>nodev</option> sont configurées, la partition devra être remontée.
pt_br: Assegure-se de que essa nova partição não esteja montada com permissões que sejam restritivas demais (tais como as opções <option>nosuid</option> ou <option>nodev</option>). Execute o comando <command>mount</command> sem quaisquer parâmetros para ver quais opções estão configuradas para a partição do LFS montada. Se <option>nosuid</option> e (ou) <option>nodev</option> estiverem configuradas, [então] a partição precisa ser remontada.

source: The above instructions assume that you will not restart your computer throughout the LFS process. If you shut down your system, you will either need to remount the LFS partition each time you restart the build process, or modify the host system's &fstab; file to automatically remount it when you reboot. For example, you might add this line to your &fstab; file: <placeholder type="screen" id="0"/> If you use additional optional partitions, be sure to add them also.
fr: Les instructions ci-dessus supposent que vous ne redémarrerez pas votre ordinateur pendant le processus LFS. Si vous éteignez votre système, vous devrez soit remonter la partition LFS à chaque redémarrage de la construction, soit modifier le fichier &fstab; de votre système hôte pour qu’il soit remonté automatiquement au démarrage. Par exemple, vous pouvez ajouter cette ligne à votre fichier &fstab;&nbsp;: <placeholder type="screen" id="0"/> Si vous utilisez des partitions facultatives supplémentaires, assurez-vous de les ajouter aussi.
pt_br: As instruções acima assumem que você não estará reiniciando seu computador no decorrer do processo do LFS. Se você desligar seu sistema, [então] você ou precisará remontar a partição do LFS a cada vez que você reiniciar o processo de construção, ou modificar o arquivo &fstab; do sistema anfitrião para remontá-la automaticamente quando você reinicializar. Por exemplo, você poderia acrescentar esta linha ao seu arquivo &fstab;: <placeholder type="screen" id="0"/> Se você usar partições adicionais opcionais, [então] certifique-se de acrescentá-las também.

source: If you are using a <systemitem class="filesystem">swap</systemitem> partition, ensure that it is enabled using the <command>swapon</command> command:
fr: Si vous utilisez une partition <systemitem class="filesystem">swap</systemitem>, assurez-vous qu'elle est activée en exécutant la commande <command>swapon</command>&nbsp;:
pt_br: Se você estiver usando uma partição <systemitem class="filesystem">swap</systemitem>, [então] assegure-se de que ela está habilitada usando o comando <command>swapon</command>:
zh_cn: 如果您使用了 <systemitem class="filesystem">swap</systemitem> 分区，使用 <command>swapon</command> 命令启用它：

source: Replace <replaceable>&lt;zzz&gt;</replaceable> with the name of the <systemitem class="filesystem">swap</systemitem> partition.
fr: Remplacez <replaceable>&lt;zzz&gt;</replaceable> par le nom de la partition <systemitem class="filesystem">swap</systemitem>.
pt_br: Substitua <replaceable>&lt;zzz&gt;</replaceable> pelo nome da partição <systemitem class="filesystem">swap</systemitem>.
zh_cn: 将 <replaceable>&lt;zzz&gt;</replaceable> 替换成 <systemitem class="filesystem">swap</systemitem> 分区的名称。

source: Now that the new LFS partition is open for business, it's time to download the packages.
fr: Maintenant que votre nouvelle partition LFS est prête à être utilisée, vous pouvez télécharger les paquets.
pt_br: Agora que a nova partição do LFS está aberta para negócios, é tempo de baixar os pacotes.

source: Now that a file system has been created, the partition needs to be made accessible. In order to do this, the partition needs to be mounted at a chosen mount point. For the purposes of this book, it is assumed that the file system is mounted under the directory specified by the <envar>LFS</envar> environment variable as described in the previous section.
zh_cn: 我们已经在分区上建立了文件系统，为了访问分区， 我们需要把分区挂载到选定的挂载点上。正如前一节所述， 本书假设将文件系统挂载到 <envar>LFS</envar> 环境变量指定的目录中。

source: Create the mount point and mount the LFS file system by running:
zh_cn: 输入以下命令以创建挂载点，并挂载 LFS 文件系统：

source: Replace <replaceable>&lt;xxx&gt;</replaceable> with the designation of the LFS partition.
zh_cn: 将 <replaceable>&lt;xxx&gt;</replaceable> 替换成 LFS 分区的代号。

source: If using multiple partitions for LFS (e.g., one for <filename class="directory">/</filename> and another for <filename class="directory">/usr</filename>), mount them using:
zh_cn: 如果为 LFS 创建了多个分区 (例如一个作为 <filename class="directory">/</filename>，另一个作为 <filename class="directory">/usr</filename>)，那么它们都需要被挂载：

source: Ensure that this new partition is not mounted with permissions that are too restrictive (such as the <option>nosuid</option> or <option>nodev</option> options). Run the <command>mount</command> command without any parameters to see what options are set for the mounted LFS partition. If <option>nosuid</option> and/or <option>nodev</option> are set, the partition will need to be remounted.
zh_cn: 请确认在挂载新分区时没有使用过于严格的安全限制 (比如 <option>nosuid</option> 或者 <option>nodev</option> 等选项) 。 直接执行不带任何参数的 <command>mount</command> 命令， 检查挂载好的 LFS 分区被指定了哪些选项。如果 <option>nodev</option> 或者 <option>nosuid</option> 被设置了，就必须重新挂载分区。

source: The above instructions assume that you will not be restarting your computer throughout the LFS process. If you shut down your system, you will either need to remount the LFS partition each time you restart the build process or modify your host system's /etc/fstab file to automatically remount it upon boot. For example: <placeholder type="screen" id="0"/> If you use additional optional partitions, be sure to add them also.
zh_cn: 上面的命令假设您在构建 LFS 的过程中不会重启计算机。 如果您关闭了系统，那么您要么在继续构建过程时重新挂载分区， 要么修改宿主系统的 /etc/fstab 文件， 使得系统在引导时自动挂载它们。例如： <placeholder type="screen" id="0"/> 如果您使用了多个分区，它们都需要添加到 fstab 中。

source: Now that there is an established place to work, it is time to download the packages.
zh_cn: 现在我们准备好了工作环境，可以下载软件包了。
