Repository: espindula/br-lfs
Catalog: lfs/*/chapter02/stages.po
Languages: fr, pt_br, zh_cn

source: Building LFS in Stages
fr: Les étapes de la construction de LFS
pt_br: Construindo o LFS em Estágios
zh_cn: 分阶段构建 LFS

source: LFS is designed to be built in one session. That is, the instructions assume that the system will not be shut down during the process. This does not mean that the system has to be built in one sitting. The issue is that certain procedures must be repeated after a reboot when resuming LFS at different points.
fr: LFS est conçu pour être construit en une seule session. En d’autres termes, les instructions supposent que le système ne sera pas éteint pendant la construction. Cela ne signifie pas que le système doit être construit d’une traite. Le problème, c'est que certaines procédures devront être relancées après un redémarrage si vous reprenez la construction de LFS à différentes étapes.
pt_br: O LFS é projetado para ser construído em uma sessão. Isto é, as instruções assumem que o sistema não será desligado durante o processo. Isso não significa que o sistema tenha de ser construído de uma vez só. O problema é que certos procedimentos precisam ser repetidos depois de uma inicialização quando se retomando o LFS em pontos diferentes.

source: Chapters&nbsp;1&ndash;4
fr: Chapitres&nbsp;1 à 4
pt_br: Capítulos&nbsp;1&ndash;4
zh_cn: 第 1&ndash;4 章

source: These chapters run commands on the host system. When restarting, be certain of one thing:
fr: Ces chapitres exécutent des commandes sur le système hôte. En cas de redémarrage, vérifiez une chose&nbsp;:
pt_br: Esses capítulos executam comandos no sistema anfitrião. Quando da reinicialização, esteja certo(a) de uma coisa:

source: Procedures performed as the <systemitem class="username">root</systemitem> user after Section 2.4 must have the LFS environment variable set <emphasis>FOR THE ROOT USER</emphasis>.
fr: Les procédures effectuées en tant qu’utilisateur <systemitem class="username">root</systemitem> après la Section 2.4 ont besoin que la variable d’environnement LFS soit définie <emphasis>POUR L’UTILISATEUR ROOT</emphasis>.
pt_br: Os procedimentos realizados como o(a) usuário(a) <systemitem class="username">root</systemitem> após a Seção 2.4 precisam ter a variável de ambiente LFS configurada <emphasis>PARA A(O) USUÁRIA(O) ROOT</emphasis>.

source: Chapters&nbsp;5&ndash;6
fr: Chapitres&nbsp;5&ndash;6
pt_br: Capítulos&nbsp;5&ndash;6

source: The /mnt/lfs partition must be mounted.
fr: La partition /mnt/lfs doit être montée.
pt_br: A partição /mnt/lfs precisa estar montada.
zh_cn: /mnt/lfs 分区需要重新挂载。

source: These two chapters <emphasis>must</emphasis> be done as user <systemitem class="username">lfs</systemitem>. A <command>su - lfs</command> command must be issued before performing any task in these chapters. If you don't do that, you are at risk of installing packages to the host, and potentially rendering it unusable.
fr: Ces deux chapitres <emphasis>doivent</emphasis> être effectués en tant qu'utilisateur <systemitem class="username">lfs</systemitem>. Vous devez exécuter <command>su - lfs</command> avant d'effectuer quoi que ce soit dans ces chapitres. Si vous ne le faites pas, vous risquez d'installer des paquets sur l'hôte et éventuellement de le rendre inutilisable.
pt_br: Esses dois capítulos <emphasis>precisam</emphasis> ser feitos como o(a) usuário(a) <systemitem class="username">lfs</systemitem>. Um comando <command>su - lfs</command> precisa ser emitido antes de realizar qualquer tarefa nesses capítulos. Se você não fizer isso, [então] você está no risco de instalar pacotes no sistema anfitrião e potencialmente torná-lo inutilizável.

source: The procedures in <xref linkend='ch-tools-generalinstructions'/> are critical. If there is any doubt a package has been installed correctly, ensure the previously expanded tarball has been removed, then re-extract the package, and complete all the instructions in that section.
fr: Les procédures de <xref linkend='ch-tools-generalinstructions'/> sont cruciales. Si vous avez le moindre doute sur l’installation correcte d’un paquet, assurez-vous d’avoir supprimé toute archive décompressée, extrayez de nouveau les fichiers du paquet et suivez toutes les instructions de cette section.
pt_br: Os procedimentos em <xref linkend='ch-tools-generalinstructions'/> são críticos. Se existir qualquer dúvida se um pacote tiver sido instalado corretamente, [então] certifique-se de que o tarball anteriormente expandido tenha sido removido, então extraia novamente o pacote e complete todas as instruções naquela seção.

source: Chapters&nbsp;7&ndash;10
fr: Chapitres&nbsp;7&ndash;10
pt_br: Capítulos&nbsp;7&ndash;10

source: A few operations, from <quote>Changing Ownership</quote> to <quote>Entering the Chroot Environment</quote>, must be done as the <systemitem class="username">root</systemitem> user, with the LFS environment variable set for the &root; user.
fr: Certaines opérations, de <quote>Changer de propriétaire</quote> à <quote>Entrer dans l'environnement chroot</quote> doivent être effectuées en tant qu'utilisateur <systemitem class="username">root</systemitem>, avec la variable d'environnement configurée pour l'utilisateur &root;.
pt_br: Umas poucas operações, a partir de <quote>Mudando o(a) Dono(a)</quote> até <quote>Entrando no Ambiente Chroot</quote>, precisam ser feitas como o(a) usuário(a) <systemitem class="username">root</systemitem>, com a variável de ambiente LFS configurada para o(a) usuário(a) &root;.

source: When entering chroot, the LFS environment variable must be set for <systemitem class="username">root</systemitem>. The LFS variable is not used after the chroot environment has been entered.
fr: En entrant dans l’environnement chroot, la variable d’environnement LFS doit être définie pour l’utilisateur <systemitem class="username">root</systemitem>. La variable LFS n’est plus utilisée après l'entrée dans l'environnement chroot.
pt_br: Quando entrar em chroot, a variável de ambiente LFS precisa estar configurada para o(a) <systemitem class="username">root</systemitem>. A variável LFS não é usada depois que o ambiente chroot tiver sido acessado.

source: The virtual file systems must be mounted. This can be done before or after entering chroot by changing to a host virtual terminal and, as <systemitem class="username">root</systemitem>, running the commands in <xref linkend='ch-tools-bindmount'/> and <xref linkend='ch-tools-kernfsmount'/>.
fr: Les systèmes de fichiers virtuels doivent être montés. Ceci peut se faire avant ou après être entré dans l’environnement chroot en changeant de terminal dans le système hôte et, en tant que <systemitem class="username">root</systemitem>, en exécutant les commandes de la <xref linkend='ch-tools-bindmount'/> et de la <xref linkend='ch-tools-kernfsmount'/>.
pt_br: Os sistemas virtuais de arquivo precisam estar montados. Isso pode ser feito antes ou depois de entrar no chroot mudando para um terminal virtual do anfitrião e, como <systemitem class="username">root</systemitem>, executando os comandos em <xref linkend='ch-tools-bindmount'/> e <xref linkend='ch-tools-kernfsmount'/>.

source: LFS is designed to be built in one session. That is, the instructions assume that the system will not be shut down during the process. That does not mean that the system has to be done in one sitting. The issue is that certain procedures have to be re-accomplished after a reboot if resuming LFS at different points.
zh_cn: LFS 被设计为在一次会话中构建完成。换句话说，本书的指令假设，在整个编译过程中，系统不会关闭或重启。当然，构建过程不需要严格地一气呵成，只要注意在重新启动后，继续编译 LFS 时，根据构建进度的不同，可能需要再次进行某些操作。

source: These chapters are accomplished on the host system. When restarting, be careful of the following:
zh_cn: 这些章节是在宿主系统完成的。在重启后，注意下列事项：

source: Procedures done as the root user after Section 2.4 need to have the LFS environment variable set <emphasis>FOR THE ROOT USER</emphasis>.
zh_cn: 在第 2.4 节之后，以 root 用户身份执行的步骤要求 LFS 环境变量已经 <emphasis>为 root 用户</emphasis>设置好。

source: Chapter&nbsp;5&ndash;6
zh_cn: 第 5&ndash;6 章

source: Threse two chapters must be done as user <emphasis>lfs</emphasis>. A <command>su - lfs</command> needs to be done before any task in these chapters. Failing to do that, you are at risk of installing packages to the host, and potentially rendering it unusable.
zh_cn: 这两章的步骤必须由用户 <emphasis>lfs</emphasis> 完成。在完成这些步骤时，必须先执行 <command>su - lfs</command> 命令。否则，您可能会将软件包安装到宿主系统上，这可能导致宿主系统无法使用。

source: The procedures in <xref linkend='ch-tools-generalinstructions'/> are critical. If there is any doubt about installing a package, ensure any previously expanded tarballs are removed, then re-extract the package files, and complete all instructions in that section.
zh_cn: <xref linkend='ch-tools-generalinstructions'/>中的过程是关键的。如果在安装软件包时感觉不对劲，确认之前解压的源码包已经被删除，然后重新解压源码包的文件，重新执行该软件包对应章节的所有命令。

source: Chapter&nbsp;7&ndash;10
zh_cn: 第 7&ndash;10 章

source: A few operations, from <quote>Changing Ownership</quote> to <quote>Entering the Chroot Environment</quote> must be done as the root user, with the LFS environment variable set for the root user.
zh_cn: 从 <quote>改变所有权</quote> 到 <quote>进入 Chroot 环境</quote> 的一些操作必须以 root 身份完成，且 LFS 环境变量必须为 root 用户设定。

source: When entering chroot, the LFS environment variable must be set for root. The LFS variable is not used afterwards.
zh_cn: 在进入 chroot 环境时，LFS 环境变量必须为 root 设置好。之后就不需要 LFS 变量。

source: The virtual file systems must be mounted. This can be done before or after entering chroot by changing to a host virtual terminal and, as root, running the commands in <xref linkend='ch-tools-bindmount'/> and <xref linkend='ch-tools-kernfsmount'/>.
zh_cn: 虚拟文件系统必须挂载好。在进入 chroot 环境之前，请切换到一个宿主系统的虚拟终端，以 root 身份执行<xref linkend='ch-tools-bindmount'/>和<xref linkend='ch-tools-kernfsmount'/>中的命令。
