Repository: espindula/br-lfs
Catalog: blfs/*/x/lib/atkmm.po
Languages: fr

source: 676 KB
fr: 676&nbsp;Ko

source: 11 MB
fr: 11&nbsp;Mo

source: 0.2 SBU
fr: 0.2&nbsp;SBU

source: Introduction to Atkmm
fr: Introduction à Atkmm

source: <application>Atkmm</application> is the official C++ interface for the ATK accessibility toolkit library.
fr: <application>Atkmm</application> est l'interface officielle en C++ de la bibliothèque d'accessoires pour l'accessibilité ATK.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&atkmm-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&atkmm-download-http;"/>

source: Download (FTP): <ulink url="&atkmm-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&atkmm-download-ftp;"/>

source: Download MD5 sum: &atkmm-md5sum;
fr: Somme de contrôle MD5&nbsp;: &atkmm-md5sum;

source: Download size: &atkmm-size;
fr: Taille du téléchargement&nbsp;: &atkmm-size;

source: Estimated disk space required: &atkmm-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &atkmm-buildsize;

source: Estimated build time: &atkmm-time;
fr: Estimation du temps de construction&nbsp;: &atkmm-time;

source: Atkmm Dependencies
fr: Dépendances de Atkmm

source: Required
fr: Requises

source: <xref linkend="at-spi2-core"/> and <xref linkend="glibmm"/>
fr: <xref linkend="at-spi2-core"/> et <xref linkend="glibmm"/>

source: Installation of Atkmm
fr: Installation de Atkmm

source: Install <application>Atkmm</application> by running the following commands:
fr: Installez <application>Atkmm</application> en exécutant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: /usr/{include,lib}/atkmm-1.6 and /usr/share/{devhelp/books/atkmm-1.6,doc/atkmm-&atkmm-version;}
fr: /usr/{include,lib}/atkmm-1.6 et /usr/share/{devhelp/books/atkmm-1.6,doc/atkmm-&atkmm-version;}

source: Short Descriptions
fr: Descriptions courtes

source: contains the <application>ATK</application> API classes
fr: contient les classes de l'API de <application>ATK</application>
