Repository: espindula/br-lfs
Catalog: blfs/*/x/lib/libxklavier.po
Languages: fr

source: 384 KB
fr: 384 Kio

source: 5.2 MB
fr: 5.2 Mio

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to libxklavier
fr: Introduction à libxklavier

source: The <application>libxklavier</application> package contains a utility library for <application>X</application> keyboard.
fr: Le paquet <application>libxklavier</application> contient une bibliothèque outil pour le clavier <application>X</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&libxklavier-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&libxklavier-download-http;"/>

source: Download (FTP): <ulink url="&libxklavier-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&libxklavier-download-ftp;"/>

source: Download MD5 sum: &libxklavier-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &libxklavier-md5sum;

source: Download size: &libxklavier-size;
fr: Taille du téléchargement&nbsp;: &libxklavier-size;

source: Estimated disk space required: &libxklavier-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &libxklavier-buildsize;

source: Estimated build time: &libxklavier-time;
fr: Estimation du temps de construction&nbsp;: &libxklavier-time;

source: libxklavier Dependencies
fr: Dépendances de libxklavier

source: Required
fr: Requises

source: <xref linkend="glib2"/>, <xref linkend="iso-codes"/>, <xref linkend="libxml2"/> and <xref linkend="xorg7-lib"/>
fr: <xref linkend="glib2"/>, <xref linkend="iso-codes"/>, <xref linkend="libxml2"/> et <xref linkend="xorg7-lib"/>

source: Recommended
fr: Recommandées

source: Optional
fr: Facultatives

source: <xref linkend="gtk-doc"/> and <xref linkend="vala"/>
fr: <xref linkend="gtk-doc"/> et <xref linkend="vala"/>

source: User Notes: <ulink url="&blfs-wiki;/libxklavier"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/libxklavier"/>

source: Installation of libxklavier
fr: Installation de libxklavier

source: Install <application>libxklavier</application> by running the following commands:
fr: Installez <application>libxklavier</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <parameter>--with-xkb-base=$XORG_PREFIX/share/X11/xkb</parameter>: Use this switch if the $XORG_PREFIX is anything other than <filename class="directory">/usr</filename>.
fr: <parameter>--with-xkb-base=$XORG_PREFIX/share/X11/xkb</parameter>&nbsp;: Utilisez ce paramètre si $XORG_PREFIX est différente de <filename class="directory">/usr</filename>.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: /usr/include/libxklavier and /usr/share/gtk-doc/html/libxklavier
fr: /usr/include/libxklavier et /usr/share/gtk-doc/html/libxklavier

source: Short Descriptions
fr: Descriptions courtes

source: contains XKB utility functions.
fr: contient les fonctions de l'outil XKB.
