Repository: espindula/br-lfs
Catalog: clfs/*/introduction/common/acknowledgements.po
Languages: fr

source: Cross-LFS Acknowledgements
fr: Remerciements LFS Croisé

source: The CLFS team would like to acknowledge people who have assisted in making the book what it is today.
fr: L'équipe CLFS aimerait remercier les gens qui nous ont aidé à faire de ce livre ce qu'il est aujourd'hui.

source: Our Leaders:
fr: Nos Leaders&nbsp;:

source: William Harrington - Lead Developer.
fr: William Harrington - Développeur principal.

source: Jonathan Norman - x86, x86_64, PowerPC &amp; UltraSPARC builds, Release Manager 2.x Series
fr: Jonathan Norman — Constructions x86, x86_64, PowerPC &amp; UltraSPARC, Responsable de la publication des versions 2.x

source: Chris Staub - x86 and x86_64 builds. Leader of Quality Control.
fr: Chris Staub — Constructions x86 et x86_64. Chef du Contrôle Qualité.

source: Our CLFS Team:
fr: Notre équipe CLFS&nbsp;:

source: Matt Darcy - x86, X86_64, and Sparc builds.
fr: Matt Darcy — Constructions x86, X86_64 et Sparc.

source: Manuel Canales Esparcia - Book XML.
fr: Manuel Canales Esparcia — XML du livre.

source: Justin Knierim - Website Architect.
fr: Justin Knierim — architecte du site Internet.

source: Ken Moffat - PowerPC and X86_64 builds. Developer of Pure 64 Hint.
fr: Ken Moffat — Constructions PowerPC et X86_64. Développeur de l'astuce Pure 64.

source: Outside the Development Team
fr: À l'extérieur de l'équipe de développement

source: Jrg Billeter - Testing and assisting in the development of the Linux Headers Package
fr: Jürg Billeter - Test et aide au développement du paquet des en-têtes Linux

source: Richard Downing - Testing, typo, and content fixes.
fr: Richard Downing — Test, correction de coquilles et correction du contenu.

source: Peter Ennis - Typo and content fixes.
fr: Peter Ennis — Correction de coquilles et du contenu.

source: Tony Morgan - Typo and content fixes.
fr: Tony Morgan — Correction de coquilles et du contenu.

source: The CLFS team would also like to acknowledge contributions of people from <ulink url="clfs-dev@lists.clfs.org"/> and associated mailing lists who have provided valuable technical and editorial corrections while testing the Cross-LFS book.
fr: L'équipe CLFS aimerait aussi remercier les contributions de gens issus de <ulink url="clfs-dev@lists.clfs.org"/> et des listes de diffusion associées qui ont fourni des corrections techniques et éditoriales appréciables lors du test du livre LFS croisé.

source: G. Moko - Text updates and Typos
fr: G. Moko — Mises à jour du textes et correction de coquilles

source: Maxim Osipov - MIPS Testing.
fr: Maxim Osipov — Test sur MIPS.

source: Doug Ronne - Various x86_64 fixes.
fr: Doug Ronne — Divers corrections pour x86_64.

source: Theo Schneider - Testing of the Linux Headers Package
fr: Theo Schneider — Test du paquet des en-têtes Linux.

source: Martin Ward - Recommendations for Systemd and the Boot method, among other contributions
fr: Martin Ward — Recommandations pour Systemd et la méthode du redémarrage, entre autres contributions.

source: William Zhou - Text updates and Typos
fr: William Zhou — Mises à jour du texte et correction de coquilles.

source: Former Team Members
fr: Ancien Membres de l'Équipe

source: Joe Ciccone - Lead Developer.
fr: Joe Ciccone — Développeur principal.

source: Nathan Coulson - Bootscripts.
fr: Nathan Coulson — Scripts de démarrage.

source: Jim Gifford - Lead Developer.
fr: Jim Gifford — Développeur principal.

source: Jeremy Huntwork - PowerPC, x86, Sparc builds.
fr: Jeremy Huntwork — Constructions PowerPC, x86 et Sparc.

source: Karen McGuiness - Proofreader.
fr: Karen MacGuiness — Relecteur.

source: Ryan Oliver - Build Process Developer.
fr: Ryan Oliver — Développeur de la procédure de construction.

source: Alexander E. Patrakov - Udev/Hotplug Integration
fr: Alexandre E. Patrakov — Intégration d'Udev/Hotplug.

source: Jeremy Utley - Release Manager 1.x Series.
fr: Jeremy Utley — Responsable de la publication pour les versions 1.x.

source: Zack Winkles - Unstable book work.
fr: Zack Winkles — Travail sur la version instable.

source: The Linux From Scratch Project
fr: Le projet Linux From Scratch

source: <ulink url="mailto:gerard@linuxfromscratch.org">Gerard Beekmans</ulink> &lt;gerard@linuxfromscratch.org&gt; &ndash; Creator of Linux From Scratch, on which Cross-LFS is based
fr: <ulink url="mailto:gerard@linuxfromscratch.org">Gerard Beekmans</ulink> &lt;gerard@linuxfromscratch.org&gt; &ndash; Créateur de Linux From Scratch, sur lequel Cross-LFS est basé.

source: Thank you all for your support.
fr: Merci à tous pour votre soutien.
