Repository: espindula/br-lfs
Catalog: clfs/*/introduction/common/askforhelp.po
Languages: fr

source: Help
fr: Aide

source: If an issue or a question is encountered while working through this book, check the FAQ page at <ulink url="&faq-root;#generalfaq"/>. Questions are often already answered there. If your question is not answered on this page, try to find the source of the problem. The following hint will give you some guidance for troubleshooting: <ulink url="&hints-root;Errors"/>.
fr: Si vous rencontrez une erreur ou si vous vous posez une question en travaillant avec ce livre, vérifiez la FAQ sur <ulink url="&faq-root;#generalfaq"/>. Les questions y ont souvent des réponses. Si votre question n'a pas sa réponse sur cette page, essayez de trouver la source du problème. L'astuce suivante vous donnera quelques conseils pour cela&nbsp;: <ulink url="&hints-root;Errors"/>.

source: We also have a wonderful CLFS community that is willing to offer assistance through the mailing lists and IRC (see the <xref linkend="ch-intro-resources"/> section of this book). However, we get several support questions everyday and many of them can be easily answered by going to the FAQ and by searching the mailing lists first. So for us to offer the best assistance possible, you need to do some research on your own first. This allows us to focus on the more unusual support needs. If your searches do not produce a solution, please include all relevant information (mentioned below) in your request for help.
fr: Nous avons aussi une formidable communauté CLFS, volontaire pour offrir une assistance via les listes de discussion et IRC (voir la section <xref linkend="ch-intro-resources"/> de ce livre). Néanmoins, nous recevons plusieurs questions de support chaque jour et un grand nombre d'entre elles ont une réponse dans la FAQ et dans les listes de discussions. Pour que nous puissions vous offrir la meilleure assistance possible, vous devez faire quelques recherches de votre côté. Ceci nous permet de nous concentrer sur les besoins inhabituels. Si vos recherches ne vous apportent aucune solution, merci d'inclure toutes les informations adéquates (mentionnées ci-dessous) dans votre demande d'assistance.

source: Things to Mention
fr: Éléments à mentionner

source: Apart from a brief explanation of the problem being experienced, the essential things to include in any request for help are:
fr: À part une brève explication du problème, voici les éléments essentiels à inclure dans votre demande d'aide&nbsp;:

source: The version of the book being used (in this case &version;)
fr: La version du livre que vous utilisez (dans ce cas, &version;)

source: The host distribution and version being used to create CLFS.
fr: La distribution hôte (et sa version) que vous utilisez pour créer CLFS

source: The architecture of the host and target.
fr: L'architecture de l'hôte et de la cible.

source: The value of the ${CLFS_HOST} and ${CLFS_TARGET} environment variables, and if applicable, ${BUILD32}, ${BUILD64}, ${BUILDN32}, and ${GCCTARGET}.
fr: La valeur des variables d'environnement ${CLFS_HOST} et ${CLFS_TARGET}, et le cas échéant, de ${BUILD32}, ${BUILD64}, ${BUILDN32} et ${GCCTARGET}.

source: The package or section in which the problem was encountered.
fr: Le paquet ou la section où le problème a été rencontré

source: The exact error message or symptom received. See <xref linkend="ch-intro-askforhelp-compilation-problems"/> below for an example.
fr: Le message d'erreur exact ou le symptôme reçu. Voir <xref linkend="ch-intro-askforhelp-compilation-problems"/> pour un exemple.

source: Note whether you have deviated from the book at all. A package version change or even a minor change to any command is considered deviation.
fr: Notez si vous avez dévié du livre. Un changement de version de paquet ou même un changement mineur sur une commande est considéré comme une déviation.

source: Deviating from this book does <emphasis>not</emphasis> mean that we will not help you. After all, the CLFS project is about personal preference. Be upfront about any changes to the established procedure&mdash;this helps us evaluate and determine possible causes of your problem.
fr: Dévier du livre ne signifie <emphasis>pas</emphasis> que nous n'allons pas vous aider. Après tout, CLFS est basé sur les préférences de l'utilisateur. Nous préciser les modifications effectuées sur la procédure établie nous aide à évaluer et à déterminer les causes probables de votre problème.

source: Configure Script Problems
fr: Problèmes avec le script configure

source: If something goes wrong while running the <command>configure</command> script, review the <filename>config.log</filename> file. This file may contain the errors you encountered during <command>configure</command>. It often logs errors that may have not been printed to the screen. Include only the <emphasis>relevant</emphasis> lines if you need to ask for help.
fr: Si quelque chose se passe mal lors de l'exécution du script <command>configure</command>, regardez le fichier <filename>config.log</filename> Ce fichier pourrait contenir les erreurs rencontrées lors de l'exécution de <command>configure</command> qui n'ont pas été affichées à l'écran. Incluez les lignes <emphasis>intéressantes</emphasis> si vous avez besoin d'aide.

source: Compilation Problems
fr: Problèmes de compilation

source: Both the screen output and the contents of various files are useful in determining the cause of compilation problems. The screen output from the <command>configure</command> script and the <command>make</command> run can be helpful. It is not necessary to include the entire output, but do include enough of the relevant information. Below is an example of the type of information to include from the screen output from <command>make</command>:
fr: L'affichage à l'écran et le contenu de différents fichiers sont utiles pour déterminer la cause des problèmes de compilation. L'affichage de l'écran du script <command>configure</command> et de <command>make</command> peuvent être utiles. Il n'est pas nécessaire d'inclure la sortie complète mais incluez suffisamment d'informations intéressantes. Ci-dessous se trouve un exemple de type d'informations à inclure à partir de l'affichage écran de <command>make</command>&nbsp;:

source: In this case, many people would just include the bottom section:
fr: Dans ce cas, beaucoup de personnes n’incluraient que la section du bas

source: This is not enough information to properly diagnose the problem because it only notes that something went wrong, not <emphasis>what</emphasis> went wrong. The entire section, as in the example above, is what should be saved because it includes the command that was executed and the associated error message(s).
fr: Cette information n'est pas suffisante pour diagnostiquer correctement le problème car il note seulement que quelque chose s'est mal passé, pas <emphasis>ce qui</emphasis> s'est mal passé. La section entière, comme dans l'exemple ci-dessus, est ce qui devrait être sauvée car la commande exécutée et le(s) message(s) d'erreur associé(s) sont inclus.

source: An excellent article about asking for help on the Internet is available online at <ulink url="http://catb.org/~esr/faqs/smart-questions.html"/>. Read and follow the hints in this document to increase the likelihood of getting the help you need.
fr: Un excellent article sur les demandes d'aide sur Internet est disponible en ligne sur <ulink url="http://catb.org/~esr/faqs/smart-questions.html"/>. Lisez et suivez les astuces de ce document pour accroître vos chances d'obtenir l'aide dont vous avez besoin.
