Repository: espindula/br-lfs
Catalog: clfs/*/introduction/common/changelog.po
Languages: fr

source: [William Harrington] - Update KMOD to 21. Fixes ticket <ulink url="&clfs-ticket-root;1031">#1031.</ulink>
fr: [William Harrington] - Mise à jour vers KMOD 21. Corrige le ticket <ulink url="&clfs-ticket-root;1031">#1031.</ulink>

source: [William Harrington] - Update Intltool to 0.51.0. Fixes ticket <ulink url="&clfs-ticket-root;1030">#1030.</ulink>
fr: [William Harrington] - Mise à jour vers Intltool 0.51.0. Corrige le ticket <ulink url="&clfs-ticket-root;1030">#1030.</ulink>

source: [William Harrington] - Update Groff to 1.22.3. Fixes ticket <ulink url="&clfs-ticket-root;1029">#1029.</ulink>
fr: [William Harrington] - Mise à jour vers Groff 1.22.3. Corrige le ticket <ulink url="&clfs-ticket-root;1029">#1029.</ulink>

source: [William Harrington] - Update Grep to 2.21. Fixes ticket <ulink url="&clfs-ticket-root;1028">#1028.</ulink>
fr: [William Harrington] - Mise à jour vers Grep 2.21. Corrige le ticket <ulink url="&clfs-ticket-root;1028">#1028.</ulink>

source: [William Harrington] - Update DejaGNU to 1.5.3. Fixes ticket <ulink url="&clfs-ticket-root;1025">#1025.</ulink>
fr: [William Harrington] - Mise à jour vers DejaGNU 1.5.3. Corrige le ticket <ulink url="&clfs-ticket-root;1025">#1025.</ulink>

source: [William Harrington] - Update Bison to 3.0.4. Fixes ticket <ulink url="&clfs-ticket-root;1024">#1024.</ulink>
fr: [William Harrington] - Mise à jour vers Bison 3.0.4. Corrige le ticket <ulink url="&clfs-ticket-root;1024">#1024.</ulink>

source: [William Harrington] - Update Automake to 1.15. Fixes ticket <ulink url="&clfs-ticket-root;1022">#1022.</ulink>
fr: [William Harrington] - Mise à jour vers Automake 1.15. Corrige le ticket <ulink url="&clfs-ticket-root;1022">#1022.</ulink>

source: [William Harrington] - Update LESS to 479. Fixes ticket <ulink url="&clfs-ticket-root;1056">#1056.</ulink>
fr: [William Harrington] - Mise à jour vers LESS 479. Corrige le ticket <ulink url="&clfs-ticket-root;1056">#1056.</ulink>

source: 04 September 2015
fr: 04 septembre 2015

source: [William Harrington] - Update File to 5.24. Fixes ticket <ulink url="&clfs-ticket-root;1021">#1021.</ulink>
fr: [William Harrington] - Mise à jour vers File 5.24. Corrige le ticket <ulink url="&clfs-ticket-root;1021">#1021.</ulink>

source: [William Harrington] - Update Man-db to 2.7.2. Fixes ticket <ulink url="&clfs-ticket-root;1032">#1032.</ulink>
fr: [William Harrington] - Mise à jour vers Man-db 2.7.2. Corrige le ticket <ulink url="&clfs-ticket-root;1032">#1032.</ulink>

source: [William Harrington] - Update TCL to 8.6.4. Fixes ticket <ulink url="&clfs-ticket-root;1036">#1036.</ulink>
fr: [William Harrington] - Mise à jour vers TCL 8.6.4. Corrige le ticket <ulink url="&clfs-ticket-root;1036">#1036.</ulink>

source: [William Harrington] - Update Check to 0.10.0. Fixes ticket <ulink url="&clfs-ticket-root;1045">#1045.</ulink>
fr: [William Harrington] - Mise à jour vers Check 0.10.0. Corrige le ticket <ulink url="&clfs-ticket-root;1045">#1045.</ulink>

source: [William Harrington] - Update E2fsprogs to 1.42.13. Fixes ticket <ulink url="&clfs-ticket-root;1046">#1046.</ulink>
fr: [William Harrington] - Mise à jour vers E2fsprogs 1.42.13. Corrige le ticket <ulink url="&clfs-ticket-root;1046">#1046.</ulink>

source: [William Harrington] - Update Gawk to 4.1.3. Fixes ticket <ulink url="&clfs-ticket-root;1047">#1047.</ulink>
fr: [William Harrington] - Mise à jour vers Gawk 4.1.3. Corrige le ticket <ulink url="&clfs-ticket-root;1047">#1047.</ulink>

source: [William Harrington] - Update Gettext to 0.19.5.1. Fixes ticket <ulink url="&clfs-ticket-root;1048">#1048.</ulink>
fr: [William Harrington] - Mise à jour vers Gettext 0.19.5.1. Corrige le ticket <ulink url="&clfs-ticket-root;1048">#1048.</ulink>

source: [William Harrington] - Update Man-pages to 4.02. Fixes ticket <ulink url="&clfs-ticket-root;1050">#1050.</ulink>
fr: [William Harrington] - Mise à jour vers Man-pages 4.02. Corrige le ticket <ulink url="&clfs-ticket-root;1050">#1050.</ulink>

source: 30 July 2015
fr: 30 juillet 2015

source: 07 February 2015
fr: 07 février 2015

source: 2 November 2014
fr: 2 novembre 2014

source: [William Harrington] - Update E2FSprogs to 1.42.12. Fixes ticket <ulink url="&clfs-ticket-root;1012">#1012.</ulink>
fr: [William Harrington] - Mise à jour vers E2FSprogs 1.42.12. Corrige le ticket <ulink url="&clfs-ticket-root;1012">#1012.</ulink>

source: [William Harrington] - Update Libtool to 2.4.3. Fixes ticket <ulink url="&clfs-ticket-root;1013">#1013.</ulink>
fr: [William Harrington] - Mise à jour vers Libtool 2.4.3. Corrige le ticket <ulink url="&clfs-ticket-root;1013">#1013.</ulink>

source: 31 October 2014
fr: 31 octobre 2014

source: [William Harrington] - Update TZDATA to 2014i. Fixes ticket <ulink url="&clfs-ticket-root;1006">#1006.</ulink>
fr: [William Harrington] - Mise à jour vers TZDATA 2014i. Corrige le ticket <ulink url="&clfs-ticket-root;1006">#1006.</ulink>

source: [William Harrington] - Update Util-linux to 2.25.2. Fixes ticket <ulink url="&clfs-ticket-root;1007">#1007.</ulink>
fr: [William Harrington] - Mise à jour vers Util-linux 2.25.2. Corrige le ticket <ulink url="&clfs-ticket-root;1007">#1007.</ulink>

source: [William Harrington] - Update DHCPCD to 6.6.0. Fixes ticket <ulink url="&clfs-ticket-root;1009">#1009.</ulink>
fr: [William Harrington] - Mise à jour vers DHCPCD 6.6.0. Corrige le ticket <ulink url="&clfs-ticket-root;1009">#1009.</ulink>

source: [William Harrington] - Update Libpipeline to 1.4.0. Fixes ticket <ulink url="&clfs-ticket-root;1010">#1010.</ulink>
fr: [William Harrington] - Mise à jour vers Libpipeline 1.4.0. Corrige le ticket <ulink url="&clfs-ticket-root;1010">#1010.</ulink>

source: [William Harrington] - Update D-Bus to 1.9.0. Fixes ticket <ulink url="&clfs-ticket-root;987">#987.</ulink>
fr: [William Harrington] - Mise à jour vers D-Bus 1.9.0. Corrige le ticket <ulink url="&clfs-ticket-root;987">#987.</ulink>

source: [William Harrington] - Update GLIBC to 2.20. Fixes ticket <ulink url="&clfs-ticket-root;982">#982.</ulink>
fr: [William Harrington] - Mise à jour vers GLIBC 2.20. Corrige le ticket <ulink url="&clfs-ticket-root;982">#982.</ulink>

source: [William Harrington] - Update Coreutils to 8.23. Fixes ticket <ulink url="&clfs-ticket-root;975">#975.</ulink>
fr: [William Harrington] - Mise à jour vers Coreutils 8.23. Corrige le ticket <ulink url="&clfs-ticket-root;975">#975.</ulink>

source: 25 October 2014
fr: 25 octobre 2014

source: [William Harrington] - Update GREP to 2.20. Fixes ticket <ulink url="&clfs-ticket-root;969">#969.</ulink>
fr: [William Harrington] - Mise à jour vers GREP 2.20. Corrige le ticket <ulink url="&clfs-ticket-root;969">#969.</ulink>

source: [William Harrington] - Update Check to 0.9.14. Fixes ticket <ulink url="&clfs-ticket-root;986">#986.</ulink>
fr: [William Harrington] - Mise à jour vers Check 0.9.14. Corrige le ticket <ulink url="&clfs-ticket-root;986">#986.</ulink>

source: [William Harrington] - Update DHCPCD to 6.5.1. Fixes ticket <ulink url="&clfs-ticket-root;988">#988.</ulink>
fr: [William Harrington] - Mise à jour vers DHCPCD 6.5.1. Corrige le ticket <ulink url="&clfs-ticket-root;988">#988.</ulink>

source: [William Harrington] - Update File to 5.20. Fixes ticket <ulink url="&clfs-ticket-root;990">#990.</ulink>
fr: [William Harrington] - Mise à jour vers File 5.20. Corrige le ticket <ulink url="&clfs-ticket-root;990">#990.</ulink>

source: [William Harrington] - Update Gettext to 0.19.3. Fixes ticket <ulink url="&clfs-ticket-root;991">#991.</ulink>
fr: [William Harrington] - Mise à jour vers Gettext 0.19.3. Corrige le ticket <ulink url="&clfs-ticket-root;991">#991.</ulink>

source: [William Harrington] - Update KBD to 2.0.2. Fixes ticket <ulink url="&clfs-ticket-root;993">#993.</ulink>
fr: [William Harrington] - Mise à jour vers KBD 2.0.2. Corrige le ticket <ulink url="&clfs-ticket-root;993">#993.</ulink>

source: [William Harrington] - Update Make to 4.1. Fixes ticket <ulink url="&clfs-ticket-root;996">#996.</ulink>
fr: [William Harrington] - Mise à jour vers Make 4.1. Corrige le ticket <ulink url="&clfs-ticket-root;996">#996.</ulink>

source: [William Harrington] - Update Man-DB to 2.7.0.2. Fixes ticket <ulink url="&clfs-ticket-root;998">#998.</ulink>
fr: [William Harrington] - Mise à jour vers Man-DB 2.7.0.2. Corrige le ticket <ulink url="&clfs-ticket-root;998">#998.</ulink>

source: [William Harrington] - Update Man-pages to 3.75. Fixes ticket <ulink url="&clfs-ticket-root;999">#999.</ulink>
fr: [William Harrington] - Mise à jour vers Man-pages 3.75. Corrige le ticket <ulink url="&clfs-ticket-root;999">#999.</ulink>

source: [William Harrington] - Update Procps-ng to 3.3.10. Fixes ticket <ulink url="&clfs-ticket-root;1001">#1001.</ulink>
fr: [William Harrington] - Mise à jour vers Procps-ng 3.3.10. Corrige le ticket <ulink url="&clfs-ticket-root;1001">#1001.</ulink>

source: [William Harrington] - Update Tar to 1.28. Fixes ticket <ulink url="&clfs-ticket-root;1004">#1004.</ulink>
fr: [William Harrington] - Mise à jour vers Tar 1.28. Corrige le ticket <ulink url="&clfs-ticket-root;1004">#1004.</ulink>

source: [William Harrington] - Update TCL to 8.6.2. Fixes ticket <ulink url="&clfs-ticket-root;1005">#1005.</ulink>
fr: [William Harrington] - Mise à jour vers TCL 8.6.2. Corrige le ticket <ulink url="&clfs-ticket-root;1005">#1005.</ulink>

source: 18 October 2014
fr: 18 octobre 2014

source: [William Harrington] - Update LESS to 464.
fr: [William Harrington] - Mise à jour vers LESS 464.

source: [William Harrington] - Changelog restarted, see the 3.0.0 book for the old changelog.
fr: [William Harrington] - Redémarrage de l'historique des changements, voir le livre 3.0.0 pour l'ancien historique.
