Repository: espindula/br-lfs
Catalog: clfs/*/introduction/common/changelog.po
Languages: fr

source: Master Changelog
fr: Historique des changements communs

source: This is version &version; of the Cross-Compiled Linux From Scratch book, dated &releasedate;. If this book is more than six months old, a newer and better version is probably already available. To find out, please check one of the mirrors via <ulink url="&clfs-wiki;"/>.
fr: Ceci est la version &version; du livre Cross-Compiled Linux From Scratch (Linux From Scratch Croisé), datant du &releasedate;. Si ce livre a plus de six mois, une version plus récente et meilleure est probablement disponible. Pour la trouver, merci de vérifier un des miroirs sur <ulink url="&clfs-wiki;"/>.

source: Below is a list of detailed changes made since the previous release of the book.
fr: Ci-dessous une liste des changements détaillés effectués depuis la version précédente du livre.

source: Changelog Entries:
fr: Liste des modifications&nbsp;:

source: 09 June 2017
fr: 09 juin 2017

source: [William Harrington] - Upgrade PERL to 5.26.0. Fixes ticket <ulink url="&clfs-ticket-root;1167">#1167.</ulink>
fr: [William Harrington] - Mise à jour vers PERL 5.26.0. Corrige le ticket <ulink url="&clfs-ticket-root;1167">#1167.</ulink>

source: 04 June 2017
fr: 04 juin 2017

source: [Chris] - Simplified sed command in temp-system Bzip2.
fr: [Chris] - Simplication de la commande sed dans Bzip2 du système temporaire.

source: 02 June 2017
fr: 02 juin 2017

source: [William Harrington] - Upgrade Sed to 4.4. Fixes ticket <ulink url="&clfs-ticket-root;1149">#1149.</ulink>
fr: [William Harrington] - Mise à jour vers Sed 4.4. Corrige le ticket <ulink url="&clfs-ticket-root;1149">#1149.</ulink>

source: 01 June 2017
fr: 01 juin 2017

source: [William Harrington] - Upgrade Shadow to 4.5. Fixes ticket <ulink url="&clfs-ticket-root;1150">#1150.</ulink>
fr: [William Harrington] - Mise à jour vers Shadow 4.5. Corrige le ticket <ulink url="&clfs-ticket-root;1150">#1150.</ulink>

source: 29 May 2017
fr: 29 mai 2017

source: [William Harrington] - Upgrade File to 5.31. Fixes ticket <ulink url="&clfs-ticket-root;1163">#1163.</ulink>
fr: [William Harrington] - Mise à jour vers File 5.31. Corrige le ticket <ulink url="&clfs-ticket-root;1163">#1163.</ulink>

source: [William Harrington] - Upgrade Flex to 2.6.4. Fixes ticket <ulink url="&clfs-ticket-root;1089">#1089.</ulink>
fr: [William Harrington] - Mise à jour vers Flex 2.6.4. Corrige le ticket <ulink url="&clfs-ticket-root;1089">#1089.</ulink>

source: 24 May 2017
fr: 24 mai 2017

source: [William Harrington] - Upgrade Coreutils to 8.27. Fixes ticket <ulink url="&clfs-ticket-root;1142">#1142.</ulink>
fr: [William Harrington] - Mise à jour vers Coreutils 8.27. Corrige le ticket <ulink url="&clfs-ticket-root;1142">#1142.</ulink>

source: 19 May 2017
fr: 19 mai 2017

source: [William Harrington] - Upgrade Libcap to 2.25. Fixes ticket <ulink url="&clfs-ticket-root;1140">#1140.</ulink>
fr: [William Harrington] - Mise à jour vers Libcap 2.25. Corrige le ticket <ulink url="&clfs-ticket-root;1140">#1140.</ulink>

source: [William Harrington] - Move Libcap after Acl.
fr: [William Harrington] - Déplacement de Libcap après Acl.

source: 17 May 2017
fr: 17 mai 2017

source: [William Harrington] - Upgrade Vim to 8.0-0597. Fixes ticket <ulink url="&clfs-ticket-root;1154">#1154.</ulink>
fr: [William Harrington] - Mise à jour vers Vim 8.0-0597. Corrige le ticket <ulink url="&clfs-ticket-root;1154">#1154.</ulink>

source: 14 May 2017
fr: 14 mai 2017

source: [William Harrington] - Upgrade Perl to 5.24.1. Fixes ticket <ulink url="&clfs-ticket-root;1035">#1035.</ulink>
fr: [William Harrington] - Mise à jour vers Perl 5.24.1. Corrige le ticket <ulink url="&clfs-ticket-root;1035">#1035.</ulink>

source: [William Harrington] - Upgrade Binutils to 2.28. Fixes ticket <ulink url="&clfs-ticket-root;1108">#1108.</ulink>
fr: [William Harrington] - Mise à jour vers Binutils 2.28. Corrige le ticket <ulink url="&clfs-ticket-root;1108">#1108.</ulink>

source: [William Harrington] - Upgrade ISL to 0.17.1. Fixes ticket <ulink url="&clfs-ticket-root;1114">#1114.</ulink>
fr: [William Harrington] - Mise à jour vers ISL 0.17.1. Corrige le ticket <ulink url="&clfs-ticket-root;1114">#1114.</ulink>

source: 13 May 2017
fr: 13 mai 2017

source: [William Harrington] - Upgrade GCC to 7.1.0. Fixes ticket <ulink url="&clfs-ticket-root;1114">#1114.</ulink>
fr: [William Harrington] - Mise à jour vers GCC 7.1.0. Corrige le ticket <ulink url="&clfs-ticket-root;1114">#1114.</ulink>

source: 10 May 2017
fr: 10 mai 2017

source: [William Harrington] - Upgrade MPFR to 3.1.5. Fixes ticket <ulink url="&clfs-ticket-root;1145">#1145.</ulink>
fr: [William Harrington] - Mise à jour vers MPFR 3.1.5. Corrige le ticket <ulink url="&clfs-ticket-root;1145">#1145.</ulink>

source: 06 May 2017
fr: 06 mai 2017

source: [William Harrington] - Upgrade GLIBC to 2.25. Fixes ticket <ulink url="&clfs-ticket-root;1109">#1109.</ulink>
fr: [William Harrington] - Mise à jour vers GLIBC 2.25. Corrige le ticket <ulink url="&clfs-ticket-root;1109">#1109.</ulink>

source: [William Harrington] - Upgrade Expat to 2.2.0. Fixes ticket <ulink url="&clfs-ticket-root;1130">#1130.</ulink>
fr: [William Harrington] - Mise à jour vers Expat 2.2.0. Corrige le ticket <ulink url="&clfs-ticket-root;1130">#1130.</ulink>

source: [William Harrington] - Upgrade Check to 0.11.0. Fixes ticket <ulink url="&clfs-ticket-root;1127">#1127.</ulink>
fr: [William Harrington] - Mise à jour vers Check 0.11.0. Corrige le ticket <ulink url="&clfs-ticket-root;1127">#1127.</ulink>

source: 04 May 2017
fr: 04 mai 2017

source: [William Harrington] - Upgrade Man-DB to 2.7.6.1. Fixes ticket <ulink url="&clfs-ticket-root;1143">#1143.</ulink>
fr: [William Harrington] - Mise à jour vers Man-DB 2.7.6.1. Corrige le ticket <ulink url="&clfs-ticket-root;1143">#1143.</ulink>

source: [William Harrington] - Upgrade Tar to 1.29. Fixes ticket <ulink url="&clfs-ticket-root;1151">#1151.</ulink>
fr: [William Harrington] - Mise à jour vers Tar 1.29. Corrige le ticket <ulink url="&clfs-ticket-root;1151">#1151.</ulink>

source: [William Harrington] - Upgrade BC to 1.07.1. Fixes ticket <ulink url="&clfs-ticket-root;1124">#1124.</ulink>
fr: [William Harrington] - Mise à jour vers BC 1.07.1. Corrige le ticket <ulink url="&clfs-ticket-root;1124">#1124.</ulink>

source: [William Harrington] - Upgrade Grep to 3.0. Fixes ticket <ulink url="&clfs-ticket-root;1107">#1107.</ulink>
fr: [William Harrington] - Mise à jour vers Grep 3.0. Corrige le ticket <ulink url="&clfs-ticket-root;1107">#1107.</ulink>

source: [William Harrington] - Upgrade Readline to 7.0. Fixes ticket <ulink url="&clfs-ticket-root;1086">#1086.</ulink>
fr: [William Harrington] - Mise à jour vers Readline 7.0. Corrige le ticket <ulink url="&clfs-ticket-root;1086">#1086.</ulink>

source: 03 May 2017
fr: 03 mai 2017

source: [William Harrington] - Upgrade Bash to 4.4. Fixes ticket <ulink url="&clfs-ticket-root;1085">#1085.</ulink>
fr: [William Harrington] - Mise à jour vers Bash 4.4. Corrige le ticket <ulink url="&clfs-ticket-root;1085">#1085.</ulink>

source: 16 April 2017
fr: 16 avril 2017

source: [William Harrington] - Upgrade Util-linux to 2.29.2. Fixes ticket <ulink url="&clfs-ticket-root;1038">#1038.</ulink>
fr: [William Harrington] - Mise à jour vers Util-linux 2.29.2. Corrige le ticket <ulink url="&clfs-ticket-root;1038">#1038.</ulink>

source: [William Harrington] - Upgrade Systemd 233. Fixes ticket <ulink url="&clfs-ticket-root;1003">#1003.</ulink>
fr: [William Harrington] - Mise à jour vers Systemd 233. Corrige le ticket <ulink url="&clfs-ticket-root;1003">#1003.</ulink>

source: [William Harrington] - Update group and user ids.
fr: [William Harrington] - Mise à jour des numéros de groupe et d'utilisateur.

source: [William Harrington] - Upgrade Linux kernel to 4.9.21. Fixes ticket <ulink url="&clfs-ticket-root;1105">#1105.</ulink>
fr: [William Harrington] - Mise à jour vers le noyau Linux 4.9.21. Corrige le ticket <ulink url="&clfs-ticket-root;1105">#1105.</ulink>

source: [William Harrington] - Upgrade IProute2 to 4.9.0. Fixes ticket <ulink url="&clfs-ticket-root;1103">#1103.</ulink>
fr: [William Harrington] - Mise à jour vers IProute2 4.9.0. Corrige le ticket <ulink url="&clfs-ticket-root;1103">#1103.</ulink>

source: 15 April 2017
fr: 15 avril 2017

source: [William Harrington] - Upgrade D-Bus to 1.10.18. Fixes ticket <ulink url="&clfs-ticket-root;1049">#1049.</ulink>
fr: [William Harrington] - Mise à jour vers D-Bus 1.10.18. Corrige le ticket <ulink url="&clfs-ticket-root;1049">#1049.</ulink>

source: [William Harrington] - Upgrade DejaGNU to 1.6. Fixes ticket <ulink url="&clfs-ticket-root;1128">#1128.</ulink>
fr: [William Harrington] - Mise à jour vers DejaGNU 1.6. Corrige le ticket <ulink url="&clfs-ticket-root;1128">#1128.</ulink>

source: [William Harrington] - Upgrade DHCPCD to 6.11.5. Fixes ticket <ulink url="&clfs-ticket-root;1077">#1077.</ulink>
fr: [William Harrington] - Mise à jour vers DHCPCD 6.11.5. Corrige le ticket <ulink url="&clfs-ticket-root;1077">#1077.</ulink>

source: [William Harrington] - Upgrade Diffutils to 3.5. Fixes ticket <ulink url="&clfs-ticket-root;1129">#1129.</ulink>
fr: [William Harrington] - Mise à jour vers Diffutils 3.5. Corrige le ticket <ulink url="&clfs-ticket-root;1129">#1129.</ulink>

source: [William Harrington] - Upgrade E2fsprogs to 1.43.4. Fixes ticket <ulink url="&clfs-ticket-root;1113">#1113.</ulink>
fr: [William Harrington] - Mise à jour vers E2fsprogs 1.43.4. Corrige le ticket <ulink url="&clfs-ticket-root;1113">#1113.</ulink>

source: [William Harrington] - Upgrade File to 5.30. Fixes ticket <ulink url="&clfs-ticket-root;1131">#1131.</ulink>
fr: [William Harrington] - Mise à jour vers File 5.30. Corrige le ticket <ulink url="&clfs-ticket-root;1131">#1131.</ulink>

source: [William Harrington] - Upgrade Findutils to 4.6.0. Fixes ticket <ulink url="&clfs-ticket-root;1101">#1101.</ulink>
fr: [William Harrington] - Mise à jour vers Findutils 4.6.0. Corrige le ticket <ulink url="&clfs-ticket-root;1101">#1101.</ulink>

source: [William Harrington] - Upgrade Gawk to 4.1.4. Fixes ticket <ulink url="&clfs-ticket-root;1132">#1132.</ulink>
fr: [William Harrington] - Mise à jour vers Gawk 4.1.4. Corrige le ticket <ulink url="&clfs-ticket-root;1132">#1132.</ulink>

source: [William Harrington] - Upgrade GDBM to 1.13. Fixes ticket <ulink url="&clfs-ticket-root;1133">#1133.</ulink>
fr: [William Harrington] - Mise à jour vers GDBM 1.13. Corrige le ticket <ulink url="&clfs-ticket-root;1133">#1133.</ulink>

source: [William Harrington] - Upgrade Gettext to 0.19.8.1. Fixes ticket <ulink url="&clfs-ticket-root;1134">#1134.</ulink>
fr: [William Harrington] - Mise à jour vers Gettext 0.19.8.1. Corrige le ticket <ulink url="&clfs-ticket-root;1134">#1134.</ulink>

source: [William Harrington] - Upgrade GMP to 6.1.2. Fixes ticket <ulink url="&clfs-ticket-root;1100">#1100.</ulink>
fr: [William Harrington] - Mise à jour vers GMP 6.1.2. Corrige le ticket <ulink url="&clfs-ticket-root;1100">#1100.</ulink>

source: [William Harrington] - Upgrade GZIP to 1.8. Fixes ticket <ulink url="&clfs-ticket-root;1136">#1136.</ulink>
fr: [William Harrington] - Mise à jour vers GZIP 1.8. Corrige le ticket <ulink url="&clfs-ticket-root;1136">#1136.</ulink>

source: [William Harrington] - Upgrade KBD to 2.0.4. Fixes ticket <ulink url="&clfs-ticket-root;1137">#1137.</ulink>
fr: [William Harrington] - Mise à jour vers KBD 2.0.4. Corrige le ticket <ulink url="&clfs-ticket-root;1137">#1137.</ulink>

source: [William Harrington] - Upgrade LESS to 491. Fixes ticket <ulink url="&clfs-ticket-root;1139">#1139.</ulink>
fr: [William Harrington] - Mise à jour vers LESS 491. Corrige le ticket <ulink url="&clfs-ticket-root;1139">#1139.</ulink>

source: [William Harrington] - Upgrade M4 to 1.4.18. Fixes ticket <ulink url="&clfs-ticket-root;1142">#1142.</ulink>
fr: [William Harrington] - Mise à jour vers M4 1.4.18. Corrige le ticket <ulink url="&clfs-ticket-root;1142">#1142.</ulink>

source: [William Harrington] - Upgrade Make to 4.2.1. Fixes ticket <ulink url="&clfs-ticket-root;1112">#1112.</ulink>
fr: [William Harrington] - Mise à jour vers Make 4.2.1. Corrige le ticket <ulink url="&clfs-ticket-root;1112">#1112.</ulink>

source: [William Harrington] - Upgrade Man-pages to 4.09. Fixes ticket <ulink url="&clfs-ticket-root;1144">#1144.</ulink>
fr: [William Harrington] - Mise à jour vers Man-pages 4.09. Corrige le ticket <ulink url="&clfs-ticket-root;1144">#1144.</ulink>

source: [William Harrington] - Upgrade Procps-ng to 3.3.12. Fixes ticket <ulink url="&clfs-ticket-root;1148">#1148.</ulink>
fr: [William Harrington] - Mise à jour vers Procps-ng 3.3.12. Corrige le ticket <ulink url="&clfs-ticket-root;1148">#1148.</ulink>

source: [William Harrington] - Upgrade Texinfo to 6.3. Fixes ticket <ulink url="&clfs-ticket-root;1152">#1152.</ulink>
fr: [William Harrington] - Mise à jour vers Texinfo 6.3. Corrige le ticket <ulink url="&clfs-ticket-root;1152">#1152.</ulink>

source: [William Harrington] - Upgrade TZData to 2017b. Fixes ticket <ulink url="&clfs-ticket-root;1153">#1153.</ulink>
fr: [William Harrington] - Mise à jour vers TZData 2017b. Corrige le ticket <ulink url="&clfs-ticket-root;1153">#1153.</ulink>

source: [William Harrington] - Upgrade XZ-Utils to 5.2.3. Fixes ticket <ulink url="&clfs-ticket-root;1157">#1157.</ulink>
fr: [William Harrington] - Mise à jour vers XZ-Utils 5.2.3. Corrige le ticket <ulink url="&clfs-ticket-root;1157">#1157.</ulink>

source: [William Harrington] - Upgrade Zlib to 1.2.11. Fixes ticket <ulink url="&clfs-ticket-root;1156">#1156.</ulink>
fr: [William Harrington] - Mise à jour vers Zlib 1.2.11. Corrige le ticket <ulink url="&clfs-ticket-root;1156">#1156.</ulink>

source: 28 December 2016
fr: 28 décembre 2016

source: [Chris] - Added "ext_attr" to the list of filesystem attributes to check for when creating a filesystem. Thanks to Roger Koehler for pointing this out.
fr: [Chris] - Ajout de «&nbsp;ext_attr&nbsp;» à la liste des attributs de système de fichiers à vérifier lors de la création d'un système de fichiers. Merci à Roger Koehler pour l'avoir remarqué.

source: 13 March 2016
fr: 13 mars 2016

source: [Chris] - Updated Gawk dependencies - Gawk can use GMP, MPFR, Readline.
fr: [Chris] - Mise à jour des dépendances de Gawk - Gawk peut utilise GMP, MPFR et Readline.

source: 04 March 2016
fr: 04 mars 2016

source: [Chris] - Added creation of <filename>/var/log/faillog</filename> to Shadow instructions.
fr: [Chris] - Ajout de la création de <filename>/var/log/faillog</filename> aux instructions de Shadow.

source: 19 February 2016
fr: 19 février 2016

source: [Chris] - Removed --disable-profile from Glibc instructions - profiling is disabled by default.
fr: [Chris] - Suppression de --disable-profile des instructions de Glibc — le profilage est désactivé par défaut.

source: [Chris] - Removed commands to create libcurses* symlinks in Ncurses, as few packages now are likely to need them. Fixes ticket <ulink url="&clfs-ticket-root;1102">#1102.</ulink>
fr: [Chris] - Suppression des commandes pour créer les liens symboliques libcurses* dans Ncurses car peu de paquet sont maintenant susceptibles d'en avoir besoin. Corrige le ticket <ulink url="&clfs-ticket-root;1102">#1102.</ulink>

source: [Chris] - Modified Ncurses instructions to move fewer libs to /lib{,32,64} as only libncursesw itself is needed there.Fixes ticket <ulink url="&clfs-ticket-root;1104">#1104.</ulink>
fr: [Chris] - Modification des instruction de Ncurses pour bouger moins de bibliothèques vers /lib{,32,64} comme seul libncursesw y est requis. Corrige le ticket <ulink url="&clfs-ticket-root;1104">#1104.</ulink>

source: [Chris] - Prevented the <command>bashbug</command> script from being installed in <filename class="directory">/bin</filename>, as it is not needed there. Fixes ticket <ulink url="&clfs-ticket-root;1099">#1099.</ulink>
fr: [Chris] - Évitement de l'installation du script <command>bashbug</command> dans <filename class="directory">/bin</filename>, comme il n'y est pas requis. Corrige le ticket <ulink url="&clfs-ticket-root;1099">#1099.</ulink>

source: 17 January 2016
fr: 17 janvier 2016

source: [Chris] - Removed redundant commands from multilib Ncurses pages.
fr: [Chris] - Suppression de commandes redondantes des pages multilib de Ncurses.

source: 07 January 2016
fr: 07 janvier 2016

source: [Chris] - Removed command in Grep instructions for security fix that was addressed in latest version.
fr: [Chris] - Suppression d'une commande dans les instruction des Grep pour un problème de sécurité résolu dans la dernière version.

source: 28 December 2015
fr: 28 décembre 2015

source: [William Harrington] - Upgrade to GREP 2.22. Fixes ticket <ulink url="&clfs-ticket-root;1087">#1087.</ulink>
fr: [William Harrington] - Mise à jour vers GREP 2.22.. Corrige le ticket <ulink url="&clfs-ticket-root;1087">#1087.</ulink>

source: [William Harrington] - Upgrade to LESS 481. Fixes ticket <ulink url="&clfs-ticket-root;1088">#1088.</ulink>
fr: [William Harrington] - Mise à jour vers LESS 481.. Corrige le ticket <ulink url="&clfs-ticket-root;1088">#1088.</ulink>

source: [William Harrington] - Upgrade to Ncurses 6.0. Fixes ticket <ulink url="&clfs-ticket-root;1044">#1044.</ulink>
fr: [William Harrington] - Mise à jour vers Ncurses 6.0.. Corrige le ticket <ulink url="&clfs-ticket-root;1044">#1044.</ulink>

source: [William Harrington] - Upgrade to GCC 5.3.0. Fixes ticket <ulink url="&clfs-ticket-root;1094">#1094.</ulink>
fr: [William Harrington] - Mise à jour vers GCC 5.3.0.. Corrige le ticket <ulink url="&clfs-ticket-root;1094">#1094.</ulink>

source: 23 December 2015
fr: 23 décembre 2015

source: [Chris] - Changed LSB link to its new location at linuxfoundation.org.
fr: [Chris] - Changement du lien LSB vers son nouvel emplacement sur linuxfoundation.org.

source: 19 December 2015
fr: 19 décembre 2015

source: 13 December 2015
fr: 13 décembre 2015

source: 05 December 2015
fr: 05 décembre 2015

source: 30 November 2015
fr: 30 novembre 2015

source: 27 November 2015
fr: 27 novembre 2015

source: [William Harrington] - Update GCC to 5.2.0. Fixes ticket <ulink url="&clfs-ticket-root;1019">#1019.</ulink>
fr: [William Harrington] - Mise à jour vers GCC 5.2.0. Corrige le ticket <ulink url="&clfs-ticket-root;1019">#1019.</ulink>

source: [William Harrington] - Update ISL to 0.15. Fixes ticket <ulink url="&clfs-ticket-root;978">#978.</ulink>
fr: [William Harrington] - Mise à jour vers ISL 0.15. Corrige le ticket <ulink url="&clfs-ticket-root;978">#978.</ulink>

source: 17 October 2015
fr: 17 octobre 2015

source: [William Harrington] - Update GLIBC to 2.22. Fixes ticket <ulink url="&clfs-ticket-root;1027">#1027.</ulink>
fr: [William Harrington] - Mise à jour vers GLIBC 2.22. Corrige le ticket <ulink url="&clfs-ticket-root;1027">#1027.</ulink>

source: 16 October 2015
fr: 16 octobre 2015

source: [William Harrington] - Update Binutils to 2.25.1. Fixes ticket <ulink url="&clfs-ticket-root;1023">#1023.</ulink>
fr: [William Harrington] - Mise à jour vers Binutils 2.25.1. Corrige le ticket <ulink url="&clfs-ticket-root;1023">#1023.</ulink>

source: [William Harrington] - Update XZ to 5.2.2. Fixes ticket <ulink url="&clfs-ticket-root;1081">#1081.</ulink>
fr: [William Harrington] - Mise à jour vers XZ 5.2.2. Corrige le ticket <ulink url="&clfs-ticket-root;1081">#1081.</ulink>

source: [William Harrington] - Update KBD to 2.0.3. Fixes ticket <ulink url="&clfs-ticket-root;1057">#1057.</ulink>
fr: [William Harrington] - Mise à jour vers KBD 2.0.3. Corrige le ticket <ulink url="&clfs-ticket-root;1057">#1057.</ulink>

source: [William Harrington] - Update TZDATA to 2015g. Fixes ticket <ulink url="&clfs-ticket-root;1051">#1051.</ulink>
fr: [William Harrington] - Mise à jour vers TZDATA 2015g. Corrige le ticket <ulink url="&clfs-ticket-root;1051">#1051.</ulink>

source: [William Harrington] - Update Libpipeline to 1.4.1. Fixes ticket <ulink url="&clfs-ticket-root;1067">#1067.</ulink>
fr: [William Harrington] - Mise à jour vers Libpipeline 1.4.1. Corrige le ticket <ulink url="&clfs-ticket-root;1067">#1067.</ulink>

source: 01 October 2015
fr: 1er octobre 2015

source: 22 September 2015
fr: 22 septembre 2015

source: [William Harrington] - Update Libtool to 2.4.6. Fixes ticket <ulink url="&clfs-ticket-root;1076">#1076.</ulink>
fr: [William Harrington] - Mise à jour vers Libtool 2.4.6. Corrige le ticket <ulink url="&clfs-ticket-root;1076">#1076.</ulink>

source: [William Harrington] - Update Gettext to 0.19.6. Fixes ticket <ulink url="&clfs-ticket-root;1075">#1075.</ulink>
fr: [William Harrington] - Mise à jour vers Gettext 0.19.6. Corrige le ticket <ulink url="&clfs-ticket-root;1075">#1075.</ulink>

source: [William Harrington] - Update File to 5.25. Fixes ticket <ulink url="&clfs-ticket-root;1074">#1074.</ulink>
fr: [William Harrington] - Mise à jour vers File 5.25. Corrige le ticket <ulink url="&clfs-ticket-root;1074">#1074.</ulink>

source: 18 September 2015
fr: 18 septembre 2015

source: 16 September 2015
fr: 16 septembre 2015

source: [William Harrington] - Update IProute2 to 4.1.1. Fixes ticket <ulink url="&clfs-ticket-root;992">#992.</ulink>
fr: [William Harrington] - Mise à jour vers IProute2 4.1.1. Corrige le ticket <ulink url="&clfs-ticket-root;992">#992.</ulink>

source: [William Harrington] - Update Linux to 4.1.7. Fixes ticket <ulink url="&clfs-ticket-root;995">#995.</ulink>
fr: [William Harrington] - Mise à jour vers Linux 4.1.7. Corrige le ticket <ulink url="&clfs-ticket-root;995">#995.</ulink>

source: 15 September 2015
fr: 15 septembre 2015

source: [William Harrington] - Update Procps-ng to 3.3.11. Fixes ticket <ulink url="&clfs-ticket-root;1072">#1072.</ulink>
fr: [William Harrington] - Mise à jour vers Procps-ng 3.3.11. Corrige le ticket <ulink url="&clfs-ticket-root;1072">#1072.</ulink>

source: 07 September 2015
fr: 07 septembre 2015

source: 06 September 2015
fr: 06 septembre 2015

source: [William Harrington] - Update iputils to s20150815. Fixes ticket <ulink url="&clfs-ticket-root;1066">#1066.</ulink>
fr: [William Harrington] - Mise à jour vers iputils s20150815. Corrige le ticket <ulink url="&clfs-ticket-root;1066">#1066.</ulink>

source: [William Harrington] - Update MPFR to 3.1.3. Fixes ticket <ulink url="&clfs-ticket-root;1043">#1043.</ulink>
fr: [William Harrington] - Mise à jour vers MPFR 3.1.3. Corrige le ticket <ulink url="&clfs-ticket-root;1043">#1043.</ulink>

source: [William Harrington] - Update Texinfo to 6.0. Fixes ticket <ulink url="&clfs-ticket-root;1041">#1041.</ulink>
fr: [William Harrington] - Mise à jour vers Texinfo 6.0. Corrige le ticket <ulink url="&clfs-ticket-root;1041">#1041.</ulink>

source: [William Harrington] - Update XML-Parser to 2.44. Fixes ticket <ulink url="&clfs-ticket-root;1039">#1039.</ulink>
fr: [William Harrington] - Mise à jour vers XML-Parser 2.44. Corrige le ticket <ulink url="&clfs-ticket-root;1039">#1039.</ulink>

source: [William Harrington] - Update XZ to 5.2.1. Fixes ticket <ulink url="&clfs-ticket-root;1037">#1037.</ulink>
fr: [William Harrington] - Mise à jour vers XZ 5.2.1. Corrige le ticket <ulink url="&clfs-ticket-root;1037">#1037.</ulink>

source: [William Harrington] - Update Patch to 2.7.5. Fixes ticket <ulink url="&clfs-ticket-root;1034">#1034.</ulink>
fr: [William Harrington] - Mise à jour vers Patch 2.7.5. Corrige le ticket <ulink url="&clfs-ticket-root;1034">#1034.</ulink>

source: [William Harrington] - Update MPC to 1.0.3. Fixes ticket <ulink url="&clfs-ticket-root;1033">#1033.</ulink>
fr: [William Harrington] - Mise à jour vers MPC 1.0.3. Corrige le ticket <ulink url="&clfs-ticket-root;1033">#1033.</ulink>
