Repository: espindula/br-lfs
Catalog: clfs/*/introduction/common/how.po
Languages: fr

source: How to Build a CLFS System
fr: Comment construire un système CLFS

source: The CLFS system will be built by using a previously installed Unix system or Linux distribution (such as Debian, Fedora, openSUSE, or Ubuntu). This existing system (the host) will be used as a starting point to provide necessary programs, including a compiler, linker, and shell, to build the new system. Select the <quote>development</quote> option during the distribution installation to be able to access these tools.
fr: Le système CLFS sera construit en utilisant une distribution Linux déjà installée (telle que Debian, Fedora, Mandrake, Red Hat, SuSE ou Ubuntu). Ce système Linux existant (l'hôte) sera utilisé comme point de départ pour fournir certains programmes nécessaires, ceci incluant un compilateur, un éditeur de liens et un shell, pour construire le nouveau système. Sélectionnez l'option <quote>développement</quote> (development) lors de l'installation de la distribution pour disposer de ces outils.

source: As an alternative to installing an entire separate distribution onto your machine, you may wish to use a livecd. Most distributions provide a livecd, which provides an environment to which you can add the required tools onto, allowing you to successfully follow the instructions in this book. Remember that if you reboot the livecd you will need to reconfigure the host environment before continuing with your build.
fr: Alternativement à l'installation d'une distribution séparée complète sur votre machine, vous pouvez utiliser un LiveCD. La plupart des distribution offrent un LiveCD, qui fournissent un environnement sur lequel vous pouvez ajouter les outils nécessaires, ce qui vous permet de suivre sans problèmes les instructions de ce livre. Souvenez-vous que si vous redémarrez le liveCD, vous devrez reconfigurer l'environnement hôte avant de continuer votre construction.

source: <xref linkend="chapter-partitioning"/> of this book describes how to create a new Linux native partition and file system, the place where the new CLFS system will be compiled and installed. <xref linkend="chapter-getting-materials"/> explains which packages and patches need to be downloaded to build a CLFS system and how to store them on the new file system. <xref linkend="chapter-final-preps"/> discusses the setup for an appropriate working environment. Please read <xref linkend="chapter-final-preps"/> carefully as it explains several important issues the developer should be aware of before beginning to work through <xref linkend="chapter-cross-tools"/> and beyond.
fr: Le <xref linkend="chapter-partitioning"/> de ce livre décrit comment créer une nouvelle partition native Linux et un système de fichiers, c'est-à-dire un emplacement où le nouveau système CLFS sera compilé et installé. Le <xref linkend="chapter-getting-materials"/> explique quels paquets et correctifs ont besoin d'être téléchargés pour construire un système CLFS et comment les stocker sur le nouveau système de fichiers. <xref linkend="chapter-final-preps"/> traite de l'initialisation d'un environnement de travail approprié. Merci de lire le <xref linkend="chapter-final-preps"/> attentivement car il explique plusieurs points importants qu'un développeur doit savoir avant de commencer à travailler sur le <xref linkend="chapter-cross-tools"/> et au-delà.

source: <xref linkend="chapter-cross-tools"/> explains the installation of cross-compile tools which will be built on the host but be able to compile programs that run on the target machine. These cross-compile tools will be used to create a temporary, minimal system that will be the basis for building the final CLFS system. Some of these packages are needed to resolve circular dependencies&mdash;for example, to compile a compiler, you need a compiler.
fr: <xref linkend="chapter-cross-tools"/> explique l'installation des outils de compilation croisée qui seront construits sur l'hôte mais qui pourront compiler des programmes qui se lancent sur la machine cible. Ces outils de compilation croisée seront utilisés pour créer un système temporaire et minimal, qui sera la base de la construction du système CLFS final. Certains de ces paquets sont nécessaires pour résoudre des dépendances circulaires — par exemple, pour compiler un compilateur, vous avez besoin d'un compilateur.

source: The process of building cross-compile tools first involves building and installing all the necessary tools to create a build system for the target machine. With these cross-compiled tools, we eliminate any dependencies on the toolchain from our host distro.
fr: La procédure de construction des outils de compilation croisée implique tout d'abord de construire et d'installer tous les outils nécessaires pour créer un système de construction pour la machine cible. Avec ces outils de compilation croisée, nous éliminons toute dépendance de la chaîne d'outils par rapport à notre distribution hôte.

source: After we build our <quote>Cross-Tools</quote>, we start building a very minimal working system in <filename class="directory">/tools</filename>, using the cross-toolchain in <filename class="directory">/cross-tools</filename>. Once the temporary system is finished, we perform a few additional tasks to prepare to enter this temporary build environment, either by booting or chrooting into it. For more details about the difference between these methods, see <xref linkend="ch-temp-system-choose"/>.
fr: Après avoir construit nos <quote>outils croisés</quote>, nous commençons à construire un système opérationnel très minimal dans <filename class="directory">/tools</filename> en utilisant la chaîne croisée de <filename class="directory">/cross-tools</filename>. Une fois que ce système temporaire est terminé, nous effectuons quelques tâches supplémentaires pour entrer dans cet environnement de construction temporaire, soit en redémarrant, soit en utilisant chroot. Pour plus de détails concernant la différence entre ces méthodes, voir <xref linkend="ch-temp-system-choose"/>.

source: In <xref linkend="chapter-building-system"/>, after having booted or chrooted into the temporary build environment, the full CLFS system is built.
fr: Dans <xref linkend="chapter-building-system"/>, après avoir redémarré ou chrooté dans l'environnement de construction temporaire, le système CLFS complet est construit.

source: To finish the installation, several configuration files are created in <xref linkend="chapter-system-config"/>, and the kernel and boot loader are set up in <xref linkend="chapter-bootable"/>. <xref linkend="chapter-finalizing"/> contains information on furthering the CLFS experience beyond this book. After the steps in this book have been implemented, the computer will be ready to reboot into the new CLFS system.
fr: Pour finir l'installation, on initialise les scripts de démarrage CLFS dans le <xref linkend="chapter-system-config"/>, le noyau ainsi que le chargeur de démarrage dans le <xref linkend="chapter-bootable"/>. Le <xref linkend="chapter-finalizing"/> contient des informations pour aller au-delà de l'expérience CLFS, plus loin que le livre. Après avoir effectué cette étape du livre, l'ordinateur sera prêt à redémarrer dans le nouveau système CLFS.

source: This is the process in a nutshell. Detailed information on each step is discussed in the following chapters and package descriptions. Items that may seem complicated will be clarified, and everything will fall into place as the reader embarks on the CLFS adventure.
fr: C'est en gros la procédure. Des informations détaillées sur chaque étape sont données dans les chapitres suivants, ainsi que les descriptions des paquets. Les points qui paraissent complexes seront clarifiés et et tout prendra du sens au fur et à mesure que le lecteur se lance dans l'aventure CLFS.
