Repository: espindula/br-lfs
Catalog: clfs/*/introduction/common/resources.po
Languages: fr

source: If during the building of the CLFS system you encounter any errors, have any questions, or think there is a typo in the book, please start by consulting the Frequently Asked Questions (FAQ) that is located at <ulink url="&faq-root;"/>.
fr: Si vous rencontrez des erreurs lors de la construction du système CLFS, si vous avez des questions ou si vous pensez qu'il y a une faute de frappe dans ce livre, merci de commencer par consulter la Foire aux Questions (FAQ) sur <ulink url="&faq-root;"/>.

source: Mailing Lists
fr: Listes de diffusion

source: The <uri>clfs.org</uri> server hosts a number of mailing lists used for the development of the CLFS project. These lists include the main development and support lists, among others. If the FAQ does not contain your answer, you can search the CLFS lists via The Mail Archive <ulink url="http://www.mail-archive.com"/>. You can find the mail lists with the following link:
fr: Le serveur <uri>clfs.org</uri> gère quelques listes de diffusion utilisées pour le développement du projet CLFS. Ces listes incluent, entre autres, les listes de développement et de support. Si la FAQ ne résout pas votre problème, vous pouvez chercher sur les listes CLFS dans les Archives Mail <ulink url="http://www.mail-archive.com"/>. Vous pouvez trouver les listes de diffusion par le lien suivant&nbsp;:

source: For information on the different lists, how to subscribe, archive locations, and additional information, visit <ulink url="&clfs-wiki;wiki/lists"/>.
fr: Pour connaître les listes disponibles, les conditions d'abonnement, l'emplacement des archives et d'autres informations, allez sur <ulink url="&clfs-wiki;wiki/lists"/>.

source: News Server
fr: Serveur de nouvelles

source: Cross-LFS does not maintain its own News Server, but we do provide access via <uri>gmane.org</uri> <ulink url="http://gmane.org"/>. If you want to subscribe to the Cross-LFS lists via a newsreader you can utilize <uri>gmane.org</uri>. You can find the gmane search for CLFS with the following link:
fr: LFS croisé ne maintient pas son propre serveur de nouvelles mais nous fournissons un accès via <uri>gmane.org</uri> <ulink url="http://gmane.org"/>. Si vous voulez vous abonner aux listes Cross-LFS par un lecteur de nouvelles, vous pouvez utiliser <uri>gmane.org</uri>. Vous pouvez trouver la recherche gname pour CLFS avec le lien suivant&nbsp;:

source: Several members of the CLFS community offer assistance on our community Internet Relay Chat (IRC) network. Before using this support, please make sure that your question is not already answered in the CLFS FAQ or the mailing list archives. You can find the IRC network at <uri>chat.freenode.net</uri>. The support channel for cross-lfs is named #cross-lfs. If you need to show people the output of your problems, please use <ulink url="http://pastebin.clfs.org"/> and reference the pastebin URL when asking your questions.
fr: Plusieurs membres de la communauté CLFS offrent une assistance sur le réseau IRC (Internet Relay Chat) de notre communauté. Avant d'utiliser ce support, merci de vous assurer qu'on n'a pas répondu à votre question dans la FAQ CLFS ou dans les archives de la liste de diffusion. Vous pouvez trouver le réseau IRC sur <uri>chat.freenode.net</uri>. Le canal de support pour lfs croisé se nomme #cross-lfs. Si vous avez besoin de montrer aux gens la sortie de vos problèmes, merci d'utiliser <ulink url="http://pastebin.clfs.org"/> et d'indiquer le lien pastebin lorsque vous posez vos questions.

source: Mirror Sites
fr: Sites miroirs

source: The CLFS project has a number of world-wide mirrors to make accessing the website and downloading the required packages more convenient. Please visit the CLFS website at <ulink url="&clfs-wiki;wiki/mirrors"/> for mirrors of CLFS.
fr: Le projet CLFS a un bon nombre de miroirs configurés tout autour du monde pour faciliter l'accès au site web ainsi que le téléchargement des paquets requis. Merci de visiter le site web de CLFS sur <ulink url="&clfs-wiki;wiki/mirrors"/> pour les miroirs de CLFS.

source: Contact Information
fr: Contacts

source: Please direct all your questions and comments to the CLFS mailing lists (see above).
fr: Merci d'envoyer toutes vos questions et commentaires sur les listes de diffusion CLFS (voir ci-dessus).
