Repository: espindula/br-lfs
Catalog: clfs/*/the-end/reboot.po
Languages: fr

source: Rebooting the System
fr: Redémarrer le système

source: If you built your final system using the boot method, just run <command>shutdown -r now</command> to reboot again, using your newly-built kernel instead of the miminal one currently in use. If you chrooted, there are a few more steps.
fr: Si vous avez construit votre système final en utilisant la méthode du démarrage, lancez simplement <command>shutdown -r now</command> pour redémarrer à nouveau en utilisant votre noyau nouvellement construit à la place de celui minimal actuellement utilisé. Si vous vous êtes chrooté, il y a quelques étapes en plus.

source: The system you have created in this book is quite minimal, and most likely will not have the functionality you would need to be able to continue forward. By installing a few extra packages from CBLFS while still in our current chroot environment, you can leave yourself in a much better position to continue on once you reboot into your new CLFS installation. Installing a text mode web browser, such as Lynx, you can easily view the CBLFS website in one virtual terminal, while building packages in another. The GPM package will also allow you to perform copy/paste actions in your virtual terminals. Lastly, if you are in a situation where static IP configuration does not meet your networking requirements, installing packages such as Dhcpcd or PPP at this point might also be useful.
fr: Le système que vous avez créé dans ce livre est vraiment minimal et a toutes les chances de ne pas avoir les fonctionnalités dont vous aurez besoin pour continuer. En installant quelques autres paquets à partir de CBLFS en restant dans l'environnement chroot actuel, vous serez dans une bien meilleure position pour continuer une fois que vous aurez redémarré votre nouvelle installation CLFS. Installer un navigateur web en mode texte, comme Lynx, vous permettra de voir facilement le site Internet CBLFS dans un terminal virtuel tout en construisant des paquets dans un autre. Le paquet GPM vous permettra aussi de réaliser des actions de copier/coller dans vos terminaux virtuels. Enfin, si vous êtes dans une situation où la configuration IP statique ne correspond pas à vos besoins en terme de réseau, installer des paquets comme Dhcpcd ou PPP pourrait aussi être utile.

source: Now that we have said that, lets move on to booting our shiny new CLFS installation for the first time! First exit from the chroot environment:
fr: Maintenant qu'on a dit ça, démarrons notre toute nouvelle installation CLFS pour la première fois&nbsp;! Tout d'abord, quittez l'environnement chroot&nbsp;:

source: Then unmount the virtual file systems:
fr: Puis, démontez les systèmes de fichiers virtuels&nbsp;:

source: Unmount the CLFS file system itself:
fr: Démontez le système de fichiers CLFS&nbsp;:

source: If multiple partitions were created, unmount the other partitions before unmounting the main one, like this:
fr: Si plusieurs partitions ont été créées, démontez les autres partitions avant de démonter la principale, comme ceci&nbsp;:

source: Now, reboot the system with:
fr: Maintenant, redémarrez le système avec&nbsp;:

source: Assuming the boot loader was set up as outlined earlier, <emphasis>CLFS &version;</emphasis> will boot automatically.
fr: En supposant que le chargeur de démarrage a été initialisé comme indiqué plus tôt, <emphasis>CLFS &version;</emphasis> va démarrer automatiquement.

source: When the reboot is complete, the CLFS system is ready for use and more software may be added to suit your needs.
fr: Quand le redémarrage est terminé, le système CLFS est prêt à être utilisé et des logiciels peuvent enfin être installés pour satisfaire vos besoins.
