Repository: espindula/br-lfs
Catalog: clfs/*/the-end/whatnow.po
Languages: fr

source: What Now?
fr: Et maintenant&nbsp;?

source: Thank you for reading this CLFS book. We hope that you have found this book helpful and have learned more about the system creation process.
fr: Merci d'avoir lu le livre CLFS. Nous espérons que vous avez trouvé ce livre utile et que vous avez appris plus sur le processus de création d'un système.

source: Now that the CLFS system is installed, you may be wondering <quote>What next?</quote> To answer that question, we have compiled a list of resources for you.
fr: Maintenant que le système CLFS est installé, vous êtes peut-être en train de vous demander <quote>Quelle est la suite&nbsp;?</quote>. Pour répondre à cette question, nous vous avons préparé une liste de ressources.

source: Bugs and security notices are reported regularly for all software. Since a CLFS system is compiled from source, it is up to you to keep abreast of such reports. There are several online resources that track such reports, some of which are shown below:
fr: Les bogues et informations de sécurité sont rapportés régulièrement pour tous les logiciels. Comme un système CLFS est compilé à partir des sources, c'est à vous de prendre en compte ces rapports. Il existe plusieurs ressources en ligne pour garder trace de tels rapports, certains d'entre eux sont indiqués ci-dessous&nbsp;:

source: CERT has a mailing list that publishes security alerts concerning various operating systems and applications. Subscription information is available at <ulink url="http://www.us-cert.gov/cas/signup.html"/>.
fr: Le CERT a une liste de diffusion publiant les alertes de sécurité concernant différents systèmes d'exploitation et applications. Les informations de souscription sont disponibles sur <ulink url="http://www.us-cert.gov/cas/signup.html"/>.

source: Bugtraq is a full-disclosure computer security mailing list. It publishes newly discovered security issues, and occasionally potential fixes for them. Subscription information is available at <ulink url="http://www.securityfocus.com/archive"/>.
fr: Bugtraq est une liste de diffusion pour la transparence des problèmes de sécurité. Elle publie les problèmes de sécurité qui viennent d'être découverts et, occasionnellement, des corrections potentielles. Les informations de souscription sont disponibles sur <ulink url="http://www.securityfocus.com/archive"/>.

source: The Community Driven Beyond Linux From Scratch wiki covers installation procedures for a wide range of software beyond the scope of the CLFS Book. CBLFS is designed specifically to work with the CLFS book, and has all the necessary information to continue the builds in the same manner that CLFS uses. This is a community driven project, which means anyone can contribute and provide updates. The CBLFS project is located at <ulink url="&cblfs-root;"/>.
fr: Le wiki Community Driven Beyond Linux From Scratch (au-delà de Linux From Scratch par la communauté) couvre les procédures d'installation d'un grand nombre de logiciels en dehors du livre CLFS. CBLFS est destiné spécifiquement à fonctionner avec le livre CLFS et contient toutes les informations nécessaires pour continuer les constructions de la même manière que ce que pratique CLFS. C'est le projet de la communauté amenant à cela, ce qui signifie que n'importe qui peut contribuer et fournir des mises à jour. Le projet CBLFS se situe sur <ulink url="&cblfs-root;"/>.

source: CLFS Hints
fr: Astuces CLFS

source: The CLFS Hints are a collection of educational documents submitted by volunteers in the CLFS community. The hints are available at <ulink url="&hints-root;"/>.
fr: Les astuces CLFS sont une collection de documents éducatifs soumis par des volontaires à la communauté CLFS. Ces astuces sont disponibles sur <ulink url="&hints-root;"/>.

source: Mailing lists
fr: Listes de diffusion

source: There are several CLFS mailing lists you may subscribe to if you are in need of help, want to stay current with the latest developments, want to contribute to the project, and more. See <xref linkend="ch-intro-maillists"/> for more information.
fr: Il existe plusieurs listes de diffusion CLFS auxquelles vous pouvez vous abonner si vous cherchez de l'aide, voulez rester à jour avec les derniers développements, voulez contribuer au projet et plus. Voir <xref linkend="ch-intro-maillists"/> pour plus d'informations.

source: The Linux Documentation Project
fr: Le projet de documentation Linux (Linux Documentation Project)

source: The goal of The Linux Documentation Project (TLDP) is to collaborate on all of the issues of Linux documentation. The TLDP features a large collection of HOWTOs, guides, and man pages. It is located at <ulink url="http://www.tldp.org/"/>.
fr: Le but du TLDP est de collaborer à tous les problèmes relatifs à la documentation sur Linux. Le TLDP offre une large collection de guides pratiques, livres et pages man. Il est disponible sur <ulink url="http://www.tldp.org/"/>.
