Repository: espindula/br-lfs
Catalog: clfs/*/prologue/common/audience.po
Languages: fr

source: Audience
fr: Public visé

source: There are many reasons why somebody would want to read this book. The principal reason is to install a Linux system from the source code. A question many people raise is, <quote>why go through all the hassle of manually building a Linux system from scratch when you can just download and install an existing one?</quote> That is a good question and is the impetus for this section of the book.
fr: Il y a beaucoup de raisons qui pousseraient quelqu'un à vouloir lire ce livre. La raison principale est d'installer un système Linux à partir du code source. La question que beaucoup de personnes se posent est <quote>pourquoi se fatiguer à installer manuellement un système Linux à partir de rien alors qu'il suffit de télécharger une distribution existante&nbsp;?</quote>. C'est une bonne question et c'est l'origine de cette section du livre.

source: One important reason for the existence of CLFS is to help people understand how a Linux system works. Building an CLFS system helps demonstrate what makes Linux tick, and how things work together and depend on each other. One of the best things this learning experience provides is the ability to customize Linux to your own tastes and needs.
fr: Une raison importante de l'existence de CLFS est d'apprendre comment fonctionne un système Linux. Construire un système CLFS vous apprend tout ce qui fait que Linux fonctionne, et comment les choses interagissent et dépendent les unes des autres et, le plus important, vous apprend à le personnaliser afin qu'il soit à votre goût et réponde à vos besoins.

source: A key benefit of CLFS is that it allows users to have more control over their system without any reliance on a Linux implementation designed by someone else. With CLFS, <emphasis>you</emphasis> are in the driver's seat and dictate every aspect of the system, such as the directory layout and bootscript setup. You also dictate where, why, and how programs are installed.
fr: Un avantage clé de CLFS est qu'il permet aux utilisateurs d'avoir plus de contrôle sur leur système sans avoir à dépendre d'une implémentation créée par quelqu'un d'autre. Avec CLFS, <emphasis>vous</emphasis> êtes maintenant au volant et vous êtes capable de décider chaque aspect du système comme la disposition des répertoires ou la configuration des scripts de démarrage. Vous saurez également exactement où, pourquoi et comment les programmes sont installés.

source: Another benefit of CLFS is the ability to create a very compact Linux system. When installing a regular distribution, one is often forced to include several programs which are probably never used. These programs waste disk space or CPU cycles. It is not difficult to build an CLFS system of less than 100 megabytes (MB), which is substantially smaller than the majority of existing installations. Does this still sound like a lot of space? A few of us have been working on creating a very small embedded CLFS system. We successfully built a system that was specialized to run the Apache web server with approximately 8MB of disk space used. Further stripping could bring this down to 5 MB or less. Try that with a regular distribution! This is only one of the many benefits of designing your own Linux implementation.
fr: Un autre avantage de CLFS est la possibilité de créer un système Linux très compact. Lors de l'installation d'une distribution habituelle, l'utilisateur est amené à inclure beaucoup de programmes qui ne seront peut-être jamais utilisés. Ces programmes occupent de l'espace disque et font parfois perdre de précieux cycles de processeur. Il n'est pas difficile de construire un système CLFS de moins de 100&nbsp;Mo, ce qui est très petit comparé à la majorité des installations existantes. Cela vous semble-t-il toujours beaucoup&nbsp;? Certains d'entre nous ont travaillé afin de créer un minuscule système CLFS. Nous avons installé un système spécialisé pour faire fonctionner le serveur web Apache&nbsp;; l'espace disque total occupé était approximativement de 8&nbsp;Mo voire moins. Avec plus de dépouillement encore, cela peut être ramené à 5&nbsp;Mo ou moins. Essayez donc d'en faire autant avec une distribution courante&nbsp;! C'est un des points bénéfiques de la conception de votre propre implémentation d'un système Linux.

source: We could compare Linux distributions to a hamburger purchased at a fast-food restaurant&mdash;you have no idea what might be in what you are eating. CLFS, on the other hand, does not give you a hamburger. Rather, CLFS provides the recipe to make the exact hamburger desired. This allows users to review the recipe, omit unwanted ingredients, and add your own ingredients to enhance the flavor of the burger. When you are satisfied with the recipe, move on to preparing it. It can be made to exact specifications&mdash;broil it, bake it, deep-fry it, or barbecue it.
fr: Si nous devions comparer une distribution Linux à un hamburger que vous achetez à un restaurant fast-food, vous n'avez aucune idée de ce que vous mangez. CLFS ne vous donne pas un hamburger, mais la recette pour faire un hamburger. Cela permet aux utilisateurs d'inspecter la recette, d'enlever les ingrédients non désirés et, par la même occasion, de rajouter des ingrédients qui améliorent la saveur de ce hamburger. Quand vous êtes satisfait de la recette, vous passez à l'étape suivante en les combinant ensemble. Vous avez désormais la chance de pouvoir le faire de la façon dont vous le souhaitez&nbsp;: grillez-le, faites-le cuire au four, faites-le frire, faites-le au barbecue ou mangez-le cru.

source: Another analogy that we can use is that of comparing CLFS with a finished house. CLFS provides the skeletal plan of a house, but it is up to you to build it. CLFS maintains the freedom to adjust plans throughout the process, customizing it to the needs and preferences of the user.
fr: Une autre analogie que nous pouvons utiliser est de comparer CLFS à une maison construite. CLFS fournit les plans de la maison, mais c'est à vous de la construire. CLFS vous donne la liberté d'ajuster les plans pendant tout le processus, le personnalisant suivant les besoins et préférences des utilisateurs.

source: Security is an additional advantage of a custom built Linux system. By compiling the entire system from source code, you are empowered to audit everything and apply all the security patches desired. It is no longer necessary to wait for somebody else to compile binary packages that fix a security hole. Unless you examine the patch and implement it yourself, you have no guarantee that the new binary package was built correctly and adequately fixes the problem.
fr: Un autre avantage d'un système Linux personnalisé est un surcroît de sécurité. Vous compilerez le système complet à partir de la base, ce qui vous permet de tout vérifier, si vous le voulez, et d'appliquer tous les correctifs de sécurité désirés. Il n'est plus nécessaire d'attendre que quelqu'un d'autre vous fournisse un paquet réparant une faille de sécurité. À moins que vous examiniez vous-mêmes le correctif et que vous l'appliquiez, vous n'avez aucune garantie que le nouveau paquet ait été compilé correctement et résolve effectivement le problème.

source: The goal of Cross Linux From Scratch is to build a complete and usable foundation-level system. Readers who do not wish to build their own Linux system from scratch may not benefit from the information in this book. If you only want to know what happens while the computer boots, we recommend the <quote>From Power Up To Bash Prompt</quote> HOWTO located at <ulink url="http://axiom.anu.edu.au/~okeefe/p2b/"/> or on The Linux Documentation Project's (TLDP) website at <ulink url="http://www.tldp.org/HOWTO/From-PowerUp-To-Bash-Prompt-HOWTO.html"/>. The HOWTO builds a system which is similar to that of this book, but it focuses strictly on creating a system capable of booting to a BASH prompt. Consider your objective. If you wish to build a Linux system and learn along the way, this book is your best choice.
fr: Le but de Cross Linux From Scratch est de construire un système complet et utilisable, en ce qui concerne les fondations. Les lecteurs qui ne souhaitent pas construire leur propre système à partir de rien pourraient ne pas bénéficier des informations contenues dans ce livre. Si vous voulez seulement savoir ce qui se passe pendant le démarrage de l'ordinateur, nous vous recommandons le guide pratique <quote>De la mise sous tension à l'invite de commande de Bash</quote>, disponible sur <ulink url="http://www.traduc.org/docs/HOWTO/lecture/From-PowerUp-To-Bash-Prompt-HOWTO.html"/> ou, en anglais, <ulink url="http://axiom.anu.edu.au/~okeefe/p2b/"/> ou sur le site du projet de documentation Linux (TLDP) à <ulink url="http://www.tldp.org/HOWTO/From-PowerUp-To-Bash-Prompt-HOWTO.html"/>. Ce guide pratique construit un système qui est similaire à celui de ce livre mais qui se concentre strictement sur la création d'un système capable de démarrer jusqu'à l'invite de BASH. Prenez en compte vos objectifs. Si vous souhaitez construire un système Linux tout en apprenant, alors ce livre est votre meilleur choix possible.

source: There are too many good reasons to build your own CLFS system to list them all here. This section is only the tip of the iceberg. As you continue in your CLFS experience, you will find the power that information and knowledge truly bring.
fr: Il existe trop de bonnes raisons de construire votre système CLFS pour pouvoir toutes les lister ici. Cette section n'aborde que la partie visible de l'iceberg. En continuant dans votre expérience de CLFS, vous trouverez la puissance réelle que donnent l'information et la connaissance.
