Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/important/beyond.xml.1.chaine.po
Languages: fr

source: Going Beyond BLFS
fr: Aller au-delà de BLFS

source: The packages that are installed in this book are only the tip of the iceberg.
fr: Les paquets installés dans ce livre ne sont que le sommet de l"iceberg.

source: We hope that the experience you gained with the LFS book and the BLFS book will give you the background needed to compile, install and configure packages that are not included in this book.
fr: Nous espérons que l"expérience que vous avez acquise avec le livre LFS et le livre BLFS vous donnera les bases nécessaires pour compiler, installer et configurer des paquets non inclus dans ce livre.

source: When you want to install a package to a location other than _F848_ , or _F190_ , you are installing outside the default environment settings on most machines.
fr: Quand vous voulez installer un paquet à un endroit différent de _F848_ , ou _F190_ , vous installez à l"extérieur des paramètres d"environnement par défaut de la plupart des machines.

source: The following examples should assist you in determining how to correct this situation.
fr: Les exemples suivants devraient vous aider à déterminer la façon de remédier à cette situation.

source: The examples cover the complete range of settings that may need updating, but they are not all needed in every situation.
fr: Les exemples couvrent toute la palette des paramètres qui peuvent nécessiter une mise à jour, mais ils ne sont pas tous nécessaires dans toutes les situations.

source: Expand the _E16_ to include _F849_ .
fr: Étendez _E16_ pour inclure _F849_.

source: Expand the _E16_ for _U1_ to include _F850_ .
fr: Étendez _E16_ de _U1_ pour inclure _F850_.

source: Add _F851_ to _F680_ or expand _E38_ to include it.
fr: Ajoutez _F851_ à _F680_ ou étendez _E38_ pour l"inclure.

source: Before using the latter option, check out _L2287_ .
fr: Avant d"utiliser la toute dernière option, regardez _L2287_.

source: If you modify _F680_ , remember to update _F852_ by executing _C1107_ as the _U1_ user.
fr: Si vous modifiez _F680_ , souvenez-vous de mettre à jour _F852_ en exécutant _C1107_ en tant qu"utilisateur _U1_.

source: Add _F853_ to _F854_ or expand _E39_ .
fr: Ajoutez _F853_ à _F854_ ou étendez _E39_.

source: Add _F855_ to _E40_ .
fr: Ajoutez _F855_ à _E40_.

source: Add _F856_ to _E25_ .
fr: Ajoutez _F856_ à _E25_.

source: Some packages are now installing _F857_ files in _F858_ , so you may have to include this directory also.
fr: Certains paquets installent maintenant des fichiers _F857_ dans _F858_ , donc il se peut que vous deviez inclure aussi ce répertoire.

source: Add _F859_ to _E41_ when compiling packages that depend on the package you installed.
fr: Ajoutez _F859_ à _E41_ lors de la compilation de paquets qui dépendent du paquet que vous avez installé.

source: Add _F851_ to _E42_ when compiling packages that depend on a library installed by the package.
fr: Ajoutez _F851_ à _E42_ lors de la compilation de paquets qui dépendent d"une bibliothèque installée par le paquet.

source: If you are in search of a package that is not in the book, the following are different ways you can search for the desired package.
fr: Si vous cherchez un paquet qui n"est pas dans le livre, ce qui suit présente les différentes manières de chercher le paquet désiré.

source: If you know the name of the package, then search Freecode for it at _L2288_ .
fr: Si vous connaissez le nom du paquet, cherchez-le sur Freecode sur _L2288_.

source: Also search Google at _L2289_ .
fr: De même, cherchez sur Google sur _L2289_.

source: Sometimes a search for the _F860_ at _L2290_ or the _F861_ at _L2291_ can also lead to a link to the package.
fr: Une recherche de _F860_ sur _L2290_ ou de _F861_ sur _L2291_ peut parfois aussi mener à un lien vers le paquet.

source: If you know the name of the executable, but not the package that the executable belongs to, first try a Google search with the name of the executable.
fr: Si vous connaissez le nom de l"exécutable mais pas le paquet auquel appartient l"exécutable, essayez d"abord une recherche Google avec le nom de l"exécutable.

source: If the results are overwhelming, try searching for the given executable in the Debian repository at _L2292_ .
fr: S"il y a trop de résultats, essayez de chercher l"exécutable donné dans le dépôt de Debian sur _L2292_.

source: Some general hints on handling new packages:
fr: Certaines astuces générales sur la gestion des nouveaux paquets :

source: Many of the newer packages follow the _C2079_ process.
fr: Beaucoup de paquets récents suivent le processus _C2079_.

source: Help on the options accepted by configure can be obtained via the command _C276_ .
fr: Vous pouvez obtenir de l"aide sur les options acceptées par configure via command _C276_.

source: Most of the packages contain documentation on compiling and installing the package.
fr: La plupart des paquets contiennent de la documentation sur la compilation et l"installation du paquet.

source: Some of the documents are excellent, some not so excellent.
fr: Certains documents sont excellents, d"autres ne le sont pas.

source: Check out the homepage of the package for any additional and updated hints for compiling and configuring the package.
fr: Regardez la page d"accueil du paquet pour des astuces supplémentaires et mises à jour sur la compilation et la configuration du paquet.

source: If you are having a problem compiling the package, try searching the LFS archives at _L2293_ for the error or if that fails, try searching Google.
fr: Si vous avez un problème en compilant le paquet, essayez de chercher dans les archives LFS sur _L2293_ l"erreur qui échoue, essayez de chercher sur Google.

source: Often, a distribution will have already solved the problem (many of them use development versions of packages, so they see the changes sooner than those of us who normally use stable released versions).
fr: Souvent une distribution a déjà corrigé le problème (beaucoup d"entre elles utilisent les versions de développement des paquets, donc elles voient les changements plus tôt que nous qui utilisons en général les versions stables publiées).

source: But be cautious - all builders tend to carry patches which are no longer necessary, and to have fixes which are only required because of their particular choices in how they build a package.
fr: Mais faites attention - tous les constructeurs ont tendance à utiliser des correctifs qui ne sont plus nécessaires et à faire des corrections qui ne sont requises que du fait de leurs choix propres quant à la manière de construire un paquet.

source: You may have to search deeply to find a fix for the package version you are trying to use, or even to find the package (names are sometimes not what you might expect, e.g.
fr: Il se peut qu"il vous faille des recherches approfondies pour trouver la correction pour la version du paquet que vous essayez d"utiliser, voire même pour trouver le paquet (les noms sont parfois différents de ceux auxquels on s"attend, comme _A_ qui a parfois un préfixe ou un suffixe dans son nom.

source: These additions often show how the package is built, and may contain patches.
fr: Dans les versions .diff.gz, tous les correctifs créent des fichiers dans _F_.

source: In the .diff.gz versions, any patches create files in _F865_ .
fr: Fedora _L865_ - ce site reste occasionnellement surchargé mais c"est une façon facile de lire les fichiers .spec et les correctifs.

source: Fedora _L2296_ - this site is still occasionally overloaded, but it is an easy way of looking at .spec files and patches.
fr: Si vous connaissez le nom d"un paquet.

source: If you know their name for the package (e.g.
fr: Sinon, utilisez la boite de recherche (e.g.

source: If not, use the search box.
fr: Gentoo - les mirroirs des ebuilds et des correctifs on l"air bien cachés et ils changent fréquemment.

source: Gentoo - the mirrors for ebuilds and patches seem to be well-hidden, and they change frequently.
fr: Vous pouvez trouver les ebuilds eux-mêmes sur _L_ - utilisez le champ de recherche.

source: Also, if you have found a mirror, you need to know which directory the application has been assigned to.
fr: S"il y a un correctif, un mirroir l"aura, dans le répertoire _F_.

source: The ebuilds themselves can be found at _L2297_ - use the search field.
fr: Selon votre navigateur ou le miroir, il se peut que vous deviez télécharger le ebuild pour pouvoir le lire.

source: If there are any patches, a mirror will have them in the _F866_ directory.
fr: Voyez l"ebuild comme une sorte de combinaison pseudo-code / shell - cherchez en particulier les commandes _C866_ et les correctifs, ou hasardez-vous à deviner ce que signifient des fonctions comme _C_.

source: Depending on your browser, or the mirror, you might need to download the ebuild to be able to read it.
fr: openSUSE _L_ - les sources semblent seulement être disponible dans les sources rpms.

source: Treat the ebuild as a sort of pseudo-code / shell combination - look in particular for _C72_ commands and patches, or hazard a guess at the meanings of the functions such as _C2080_ .
fr: Slackware - le navigateur de paquets officiel est actuellement cassé.

source: openSUSE _L2298_ - source only seems to be available in source rpms.
fr: Le site sur _L2298_ contient les versions actuelle et précédente de leur dépôt non officiel, avec des liens vers les pages d"accueil, les téléchargements et des fichiers individuels, en particulier les fichiers _F_.

source: Slackware - the official package browser is currently broken.
fr: Ubuntu _L_ - voir les notes debian ci-dessus.

source: The site at _L2299_ has current and previous versions in their unofficial repository with links to homepages, downloads, and some individual files, particularly the _F867_ files.
fr: Si tout échoue, essayez la liste de diffusion blfs-support.

source: Ubuntu _L2300_ - see the debian notes above.
fr: Si vous avez trouvé un paquet qui n"est disponible qu"au format _F2300_ ou _F_ , deux petits scripts _C_ et _C_ sont disponibles sur _L_ et _L_ pour convertir les archives dans un simple format _F_.

source: If everything else fails, try the blfs-support mailing-list.
fr: Il se peut que vous trouviez utile aussi le script rpm2cpio.

source: If you have found a package that is only available in _F868_ or _F869_ format, there are two small scripts, _C2081_ and _C2082_ that are available at _L2301_ and _L2302_ to convert the archives into a simple _F870_ format.
fr: La version perl des archives du noyau linux est sur _L868_ fonctionne pour la plupart des sources rpm.

source: You may also find an rpm2cpio script useful.
fr: Le script rpm2targz utilisera un script rpm2cpio ou un binaire s"il y en a un dans votre path.

source: The Perl version in the linux kernel archives at _L2303_ works for most source rpms.
fr: Remarquez que rpm2cpio déballera un rpm source dans le répertoire actuel, ce qui donne une archive tar, un fichier spec, et peut-être des correctifs ou d"autres fichiers.
