Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/important/bootscripts.xml.1.chaine.po
Languages: fr

source: BLFS Boot Scripts
fr: Scripts de démarrage BLFS

source: The BLFS Bootscripts package contains the init scripts that are used throughout the book.
fr: Le paquet BLFS Bootscripts contient les scripts de démarrage utilisé tout au long du livre.

source: It is assumed that you will be using the BLFS Bootscripts package in conjunction with a compatible LFS-Bootscripts package.
fr: On suppose que vous utiliserez le paquet BLFS Bootscripts avec un paquet LFS-Bootscripts compatible.

source: Refer to _L2860_ for more information on the LFS-Bootscripts package.
fr: Reportez-vous à _L2860_ pour plus d'informations sur le paquet LFS-Bootscripts.

source: Package Information
fr: Informations sur le paquet

source: Download:
fr: Téléchargement :

source: The BLFS Bootscripts package will be used throughout the BLFS book for startup scripts.
fr: Le paquet BLFS Bootscripts sera utilisé tout au long du livre BLFS pour les scripts de démarrage.

source: Unlike LFS, each init script has a separate install target in the BLFS Bootscripts package.
fr: Contrairement à LFS, chaque scripts de démarrage a une cible d'installation distincte dans le paquet BLFS Bootscripts.

source: It is recommended you keep the package source directory around until completion of your BLFS system.
fr: Il vous est recommandé de conserver le répertoire source du paquet jusqu'à ce que vous ayez terminé votre système BLFS.

source: When a script is requested from BLFS Bootscripts, simply change to the directory and as the _U1_ user, execute the given _C2084_ command.
fr: Quand un script est demandé dans le paquet BLFS Bootscripts, allez simplement dans le répertoire et en tant qu'utilisateur _U1_, exécutez la commande _C2084_ donnée.

source: This command installs the init script to its proper location (along with any auxiliary configuration scripts) and also creates the appropriate symlinks to start and stop the service at the appropriate run-level.
fr: Cette commande installe le script de démarrage au bon endroit (ainsi que les scripts auxiliaires de configuration) et crée aussi les liens symboliques adéquats pour démarrer et arrêter le service au niveau d'exécution adéquat.

source: You should review each bootscript before installation to ascertain that it satisfies your need.
fr: Il est conseillé d'examiner chaque script de démarrage avant l'installation pour être sûr qu'il satisfait vos besoins.

source: Also verify that the start and stop symlinks it creates match your preferences.
fr: Vérifiez aussi que les liens symboliques de démarrage et d'arrêt qu'il crée correspondent à vos préférences.

source: From time to time the bootscripts are updated to accomodate new packages or to make minor corrections.
fr: De temps en temps les scripts de démarrage sont mis à jour pour s'adapter à de nouveaux paquets ou pour faire des corrections mineurs.

source: All versions of the bootscripts are located at _L2862_ .
fr: Toutes les version des scripts de démarrage sont à l'adresse _L2862_.
