Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/important/building-notes.xml.1.chaine.po
Languages: fr

source: For more information on stripping, see _L3033_ .
fr: Pour plus d'information sur le nettoyage, regardez _L3033_.

source: :Libtool filesOne of the side effects of packages that use Autotools, including libtool, is that they create many files with an .la extensionThese files are not needed in an LFS environmentIf there are conflicts with pkgconfig entries, they can actually prevent successful buildsYou may want to consider removing these files periodicallyThe above command removes all .la files with the exception of those that have "Image" as a part of the pathhese .la files are used by the ImageMagick programshere may be other exceptions by packages not in BLFS
fr: :Libtool filesOne of the side effects of packages that use Autotools, including libtool, is that they create many files with an .la extensionThese files are not needed in an LFS environmentIf there are conflicts with pkgconfig entries, they can actually prevent successful buildsYou may want to consider removing these files periodicallyThe above command removes all .la files with the exception of those that have "Image" as a part of the path
