Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/important/building-notes.xml.1.chaine.po
Languages: fr

source: Notes on Building Software
fr: Remarques sur la construction de logiciels

source: Those people who have built an LFS system may be aware of the general principles of downloading and unpacking software.
fr: Il se peut que les gens qui ont construit un système LFS connaissent les principes généraux du téléchargement et du déballage de logiciel.

source: Some of that information is repeated here for those new to building their own software.
fr: Certaines de ces informations sont répétées ici pour les nouveaux qui construisent leurs propres logiciels.

source: Each set of installation instructions contains a URL from which you can download the package.
fr: Chaque groupe d'instructions d'installation contient une adresse Web depuis laquelle vous pouvez télécharger le paquet.

source: The patches; however, are stored on the LFS servers and are available via HTTP.
fr: Les correctifs; cependant, sont enregistrés sur les serveurs LFS et sont disponibles via HTTP.

source: These are referenced as needed in the installation instructions.
fr: Ils sont référencés comme nécessaires dans les instructions d'installation.

source: We can not emphasize strongly enough that you should start from a
fr: Nous ne saurions que trop vous recommander fortement de démarrer à partir d'une

source: clean source tree
fr: arborescence de sources propre

source: each time.
fr: à chaque fois.

source: before
fr: avant

source: trying again.
fr: de réessayer.

source: The golden rule of Unix System Administration is to use your superpowers only when necessary.
fr: La règle d'or de l'administration d'un système Unix est de n'utiliser vos super-pouvoirs que si nécessaire.

source: Hence, BLFS recommends that you build software as an unprivileged user and only become the _U3_ user when installing the software.
fr: D'où la recommandation de BLFS de construire les logiciels en tant qu'utilisateur non privilégié et de ne devenir l'utilisateur _U3_ que lors de l'installation du logiciel.

source: This philosophy is followed in all the packages in this book.
fr: On suit cette philosophie dans tous les paquets du livre.

source: Unless otherwise specified, all instructions should be executed as an unprivileged user.
fr: Sauf spécifications contraires, toutes les instructions devraient être exécutées en tant qu'utilisateur non privilégié.

source: The book will advise you on instructions that need _U3_ privileges.
fr: Le livre vous conseillera sur les instructions qui ont besoin des privilèges _U3_.

source: Unpacking the Software
fr: Déballer le logiciel

source: If a file is in _F875_ format and compressed, it is unpacked by running one of the following commands:
fr: S'il y a un fichier compressé au format _F875_ , on le déballe en utilisant une des commandes suivantes :

source: You may omit using the _O280_ parameter in the commands shown above and below if you wish to suppress the verbose listing of all the files in the archive as they are extracted.
fr: Vous pouvez ne pas utiliser le paramètre _O280_ dans les commandes décrites ci-dessus et ci-dessous si vous supprimez le listage verbeux de tous les fichiers de l'archive au fur et à mesure qu'ils sont extraits.

source: This can help speed up the extraction as well as make any errors produced during the extraction more obvious to you.
fr: Cela peut aider à accélérer l'extraction mais aussi rendre la compréhension des erreurs produites pendant l'extraction moins évidentes.

source: You can also use a slightly different method:
fr: Vous pouvez utiliser aussi une méthode légèrement différente :

source: Finally, you sometimes need to be able to unpack patches which are generally not in _F875_ format.
fr: Enfin, vous avez parfois besoin de déballer des correctifs qui ne sont généralement pas au format _F875_.

source: Generally, to verify that the downloaded file is genuine and complete, many package maintainers also distribute md5sums of the files.
fr: En général, pour vérifier que le fichier téléchargé est authentique et complet, de nombreux mainteneurs de paquets distribuent aussi des sommes md5 des fichiers.

source: If there are any errors, they will be reported.
fr: S'il y a une erreur, elle sera signalée.

source: Note that the BLFS book includes md5sums for all the source files also.
fr: Remarquez que le livre BLFS comprend les sommes md5 de tous les fichiers sources.

source: Alternately, simply run the command shown below and compare the output to the md5sum data shown in the BLFS book.
fr: Sinon, lancez simplement la commande décrite ci-dessus et comparez la sortie avec les données de somme md5 inscrites dans le livre BLFS.

source: Creating Log Files During Installation
fr: Créer des fichiers journaux pendant l'installation

source: For larger packages, it is convenient to create log files instead of staring at the screen hoping to catch a particular error or warning.
fr: Pour les gros paquets, il est commode de créer des fichiers journaux plutôt que de dévisager l'écran en espérant récupérer une erreur ou un avertissement particulier.

source: Log files are also useful for debugging and keeping records.
fr: Les fichiers journaux sont aussi utiles pour déboguer et garder des enregistrements.

source: The following command allows you to create an installation log.
fr: La commande suivante vous permet de créer un journal d'installation.

source: Replace
fr: Remplacez

source: with the command you intend to execute.
fr: par la commande que vous cherchez à exécuter.

source: The _C2088_ command allows viewing of the output while logging the results to a file.
fr: La commande _C2088_ vous permet de voir la sortie en journalisant les résultats dans un fichier.

source: The parentheses around the command run the entire command in a subshell and finally the _C2089_ command ensures the result of the
fr: Les parenthèses autour de la commande exécutent toute la commande dans un sous-shell et, enfin, la commande _C2089_ s'assure que c'est bien le résultat de

source: is returned as the result and not the result of the _C2088_ command.
fr: qui est retourné et pas le résultat de la commande _C2088_.

source: For many modern systems with multiple processors (or cores) the compilation time for a package can be reduced by performing a "parallel make" by either setting an environment variable or telling the make program how many processors are available.
fr: Pour la plupart des systèmes modernes avec des processeurs multiples () .

source: For instance, a Core2Duo can support two simultaneous processes with:
fr: Par exemple, un Core2Duo peut supporter deux processus simultanées avec :

source: or just building with:
fr: ou en compilant avec :

source: Generally the number of processes should not exceed the number of cores supported by the CPU.
fr: Générallement le nombre de processus ne doit pas dépasser le nombre de coeurs supportés par le CPU.

source: To list the processors on your system, issue:
fr: Pour lister les processeurs de votre système, tapez :

source: For instance, if an executable needs File A and File B, attempting to link the program before one of the dependent components is available will result in a failure.
fr: Par exemple, si un exécutable demande un fichier A et un fichier B, en essayant de lier le programme avant qu'un des composants dépendants ne soit disponible, aboutira à un échec.

source: This condition usually arises because the upstream developer has not properly designated all the prerequsites needed to accomplish a step in the Makefile.
fr: Cela est possible car les développeurs n'ont pas proprement désigné tous les prérequis utiles pour accomplir une étape du Makefile.

source: If this occurs, the best way to proceed is to drop back to a single processor build.
fr: Si cela arrive, la meilleure chose à faire est revenir à la construction avec un seul processeur.

source: There are times when automating the building of a package can come in handy.
fr: Il y a des fois où automatiser la construction d"un paquet peut s"avérer utile.

source: Everyone has their own reasons for wanting to automate building, and everyone goes about it in their own way.
fr: Chacun a ses raisons de vouloir automatiser la construction, et chacun le fait par ses propres moyens.

source: Creating _F27_ s, _A292_ scripts, _A107_ scripts or simply a list of commands used to cut and paste are just some of the methods you can use to automate building BLFS packages.
fr: Soit en créant des _F27_ s, des scripts _A292_ , des scripts _A107_ ou simplement une liste de commandes utilisées qui sont copier-coller, sont des méthodes que vous pouvez utiliser pour automatiser la construction de paquets BLFS.

source: Detailing how and providing examples of the many ways you can automate the building of packages is beyond the scope of this section.
fr: Détailler et donner des exemples sur les nombreuses manières d"automatiser la construction de paquets va au-delà des objectifs de cette section.

source: This section will expose you to using file redirection and the _C2090_ command to help provide ideas on how to automate your builds.
fr: Cette section vous présentera l"utilisation de la redirection de fichiers et de la commande _C2090_ pour vous donner des idées sur la façon d"automatiser vos constructions.

source: File Redirection to Automate Input
fr: Redirection de fichier pour automatiser l"entrée

source: You will find times throughout your BLFS journey when you will come across a package that has a command prompting you for information.
fr: Il y aura des moments, pendant votre aventure BLFS, où vous tomberez sur un paquet ayant une invite de commande vous demandant des informations.

source: This information might be configuration details, a directory path, or a response to a license agreement.
fr: Ces informations peuvent être des détails de configuration, un chemin de répertoire ou une réponse à un accord de licence.

source: This can present a challenge to automate the building of that package.
fr: Il peut être un challenge d"automatiser la construction de ce paquet.

source: Occasionally, you will be prompted for different information in a series of questions.
fr: On vous demandera occasionnellement des informations via une série de questions.

source: One method to automate this type of scenario requires putting the desired responses in a file and using redirection so that the program uses the data in the file as the answers to the questions.
fr: Une méthode pour automatiser ce type de scénario est de mettre les réponses désirées dans un fichier et d"utiliser la redirection pour que le programme utilise les données du fichier comme réponses aux questions.

source: Building the _A772_ package is a good example of how redirecting a file as input to prompts can help you automate the build.
fr: La construction du paquet _A772_ est un bon exemple de la façon de rediriger un fichier comme entrée aux invites, cela peut vous aider à automatiser la construction.

source: If you run the test suite, you are asked to respond to a series of questions regarding the type of test to run and if you have any auxiliary programs the test can use.
fr: Si vous lancez la suite de test, on vous demande de répondre à une série de questions concernant le type de test à exécuter et si vous avez un programme auxiliaire que le test peut utiliser.

source: You can create a file with your responses, one response per line, and use a command similar to the one shown below to automate running the test suite:
fr: Vous pouvez créer un fichier avec vos réponses, une par ligne, et utiliser une commande ressemblant à celle indiquée ci-dessous pour automatiser l"exécution de la suite de tests :

source: This effectively makes the test suite use the responses in the file as the input to the questions.
fr: Cela fait que la suite de tests utilise les réponses du fichier comme entrée pour les questions.

source: Occasionally you may end up doing a bit of trial and error determining the exact format of your input file for some things, but once figured out and documented you can use this to automate building the package.
fr: Vous pouvez finir par faire des essais et des erreurs pour déterminer le format exact de votre fichier d"entrée pour certaines choses, mais une fois expérimenté et documenté, vous pouvez utiliser cela pour automatiser la construction du paquet.

source: Using _C2090_ to Automate Input
fr: Utiliser _C2090_ pour automatiser l"entrée

source: Sometimes you will only need to provide one response, or provide the same response to many prompts.
fr: Vous n"aurez parfois besoin que de fournir une réponse ou une même réponse à de nombreuses invites.

source: For these instances, the _C2090_ command works really well.
fr: Dans ces cas-là, la commande _C2090_ fonctionne vraiment bien.

source: The _C2090_ command can be used to provide a response (the same one) to one or more instances of questions.
fr: On peut utiliser la commande _C2090_ pour fournir une réponse (la même) à une ou plusieurs questions.

source: It can be used to simulate pressing just the
fr: On peut l"utiliser pour simuler un simple appui sur la touche

source: Enter
fr: Entrée

source: key or entering a string of text.
fr: ou l"entrée d"une chaîne de texte.

source: Perhaps the easiest way to show its use is in an example.
fr: La manière la plus facile de montrer son utilisation est peut-être de prendre un exemple.

source: First, create a short _A292_ script by entering the following commands:
fr: Créez tout d"abord un petit script _A292_ en entrant les commandes suivantes :

source: Now run the script by issuing _C2091_ from the command line.
fr: Maintenant, lancez le script en lançant _C2091_ depuis la ligne de commande.

source: It will wait for a response, which can be anything (or nothing) followed by the
fr: Il attendra une réponse, qui peut être n"importe quoi (ou rien) suivi de la touche

source: After entering something, the result will be echoed to the screen.
fr: Après avoir entré quelque chose, le résultat sera affiché à l"écran.

source: Now use the _C2090_ command to automate the entering of a response:
fr: Utilisez maintenant la commande _C2090_ pour automatiser l"entrée d"une réponse :

source: Notice that piping _C2090_ by itself to the script results in
fr: Remarquez que la redirection

source: being passed to the script.
fr: est passé au script.

source: Now try it with a string of text:
fr: Essayez-la maintenant avec une chaine de texte :

source: The exact string was used as the response to the script.
fr: La chaîne exacte était utilisée comme réponse au script.

source: Notice this results in passing just the press of the
fr: Remarquez que cela aboutit à ne passer au script que l"appui sur la touche

source: This is useful for times when the default answer to the prompt is sufficient.
fr: C"est utile parfois quand la réponse par défaut à l"invite est suffisante.

source: This syntax is used in the _X459_ instructions to accept all the defaults to the many prompts during the configuration step.
fr: Cette syntaxe est utilisée dans les instructions de _X459_ pour accepter tous les réglages par défaut à toutes les invites lors de l"étape de configuration.

source: You may now remove the test script, if desired.
fr: Vous pouvez maintenant supprimer le script de test si vous le désirez.

source: File Redirection to Automate Output
fr: Redirection de fichiers pour automatiser la sortie

source: In order to automate the building of some packages, especially those that require you to read a license agreement one page at a time, requires using a method that avoids having to press a key to display each page.
fr: Pour automatiser la construction de certains paquets, surtout ceux qui vous demandent de lire un accord de licence page après page, il faut utiliser une méthode qui évite de devoir appuyer sur une touche pour afficher chaque page.

source: Redirecting the output to a file can be used in these instances to assist with the automation.
fr: On peut utiliser la redirection de sortie vers un fichier dans ce cas-là pour vous aider à automatiser.

source: The previous section on this page touched on creating log files of the build output.
fr: La section précédente de cette page a visé à créer des fichiers journaux de la sortie de la construction.

source: The redirection method shown there used the _C2088_ command to redirect output to a file while also displaying the output to the screen.
fr: La méthode de redirection qui y est décrite utilisait la commande _C2088_ pour rediriger la sortie tout en affichant aussi la sortie à l"écran.

source: Here, the output will only be sent to a file.
fr: D"où le fait qu"on ne verra la sortie que dans un fichier.

source: Again, the easiest way to demonstrate the technique is to show an example.
fr: De nouveau, la manière la plus facile de montrer la technique est de présenter un exemple.

source: First, issue the command:
fr: Lancez d"abord la commande :

source: Now try the same command, but this time redirect the output to a file.
fr: Essayez maintenant la même commande, mais en redirigeant cette fois la sortie vers un fichier.

source: The special file _F879_ can be used instead of the filename shown, but you will have no log file to examine:
fr: Le fichier spécial _F879_ peut être utilisé à la place du fichier indiqué, mais vous n"aurez pas de fichier journal à examiner :

source: Notice that this time the command immediately returned to the shell prompt without having to page through the output.
fr: Remarquez que cette fois, la commande est immédiatement revenue à l"invite du shell sans devoir parcourir la sortie page par page.

source: You may now remove the log file.
fr: Vous pouvez supprimer maintenant le fichier journal.

source: The last example will use the _C2090_ command in combination with output redirection to bypass having to page through the output and then provide a
fr: Le dernier exemple utilisera la commande _C2090_ associée à la redirection de sortie pour éviter de naviguer page par page dans la sortie, puis de fournir un

source: to a prompt.
fr: à l"invite.

source: do you accept the above?
fr: Acceptez-vous ce qui précède?

source: For this example, another short _A292_ script is required:
fr: Pour cet exemple, on a besoin d"un autre petit script _A292_ :

source: This script can be used to simulate a program that requires you to read a license agreement, then respond appropriately to accept the agreement before the program will install anything.
fr: On peut utiliser ce script pour simuler un programme qui demande que vous lisiez un accord de licence et que vous acceptiez le contrat avant que le programme n"installe quoique ce soit.

source: First, run the script without any automation techniques by issuing _C2093_ .
fr: Lancez d"abord le script sans techniques d"automatisation en exécutant _C2093_.

source: Now issue the following command which uses two automation techniques, making it suitable for use in an automated build script:
fr: Maintenant lancez la commande suivante qui utilise les techniques d"automatisation, rendant l"utilisation convenable dans un script de construction automatisé :

source: If desired, issue _C2094_ to see the end of the paged output, and confirmation that
fr: Si vous le désirez, lancez _C2094_ pour voir la fin de la sortie paginée et la confirmation que

source: was passed through to the script.
fr: a été passé au script.

source: Once satisfied that it works as it should, you may remove the script and log file.
fr: Une fois que cela marche comme cela devrait, vous pouvez supprimer le script et le fichier journal.

source: Finally, keep in mind that there are many ways to automate and/or script the build commands.
fr: Enfin, gardez à l"esprit qu"il y a de nombreux moyens d"automatiser et/ou de scripter les commandes de construction.

source: There is not a single
fr: Il n"y a pas

source: correct
fr: une seule

source: way to do it.
fr: manière de procéder.

source: Your imagination is the only limit.
fr: Votre imagination est la seule limite.

source: Dependencies
fr: Dépendances

source: For each package described, BLFS lists the known dependencies.
fr: Pour chaque paquet décrit, BLFS liste les dépendances connues.

source: These are listed under several headings, whose meaning is as follows:
fr: Elles sont listées sous plusieurs en-têtes, dont la signification est la suivante :

source: Required
fr: Requises

source: means that the target package cannot be correctly built without the dependency having first been installed.
fr: signifie que le paquet cible ne peut pas se construire correctement sans avoir d'abord installé la dépendance.

source: Recommended
fr: Recommandées

source: The instructions in the book assume these packages are installed.
fr: Les instructions dans le livre considèrent que ses paquets sont installés.

source: Some changes or workarounds may be required if these packages are not installed.
fr: Des modifications ou contournements peuvent être requis si ces paquets ne sont pas installés.

source: Optional
fr: Optionnelles

source: means that this package might be installed for added functionality.
fr: signifie que ce paquet pourrait être installé pour ajouter des fonctions.

source: Often BLFS will describe the dependency to explain the added functionality that will result.
fr: BLFS décrira souvent la dépendance pour expliquer la fonctionnalité supplémentaire résultante.

source: Using the Most Current Package Sources
fr: Utilisation de paquets sources plus récents

source: On occasion you may run into a situation in the book when a package will not build or work properly.
fr: Occasionnellement, dans le livre, vous pourrez être dans la situation ou un paquet ne se construit pas ou ne fonctionne pas correctement.

source: Though the Editors attempt to ensure that every package in the book builds and works properly, sometimes a package has been overlooked or was not tested with this particular version of BLFS.
fr: Bien que les éditeurs tentent de faire en sorte que chaque paquet dans le livre se construise et fonctionne correctement, parfois un paquet a été oublié ou n'a pas été testé avec cette version particulière de BLFS.

source: If you discover that a package will not build or work properly, you should see if there is a more current version of the package.
fr: Si vous découvrez un paquet qui ne se construit pas ou ne fonctionne pas correctement, vous pouvez regarder s'il s'agit de la version la plus récente du paquet.

source: For example, in the Google search bar type:
fr: Par exemple, dans la barre de recherche de Google tapez :

source: Sometimes typing:
fr: Parfois en tapant :

source: Stripping One More Time
fr: Nettoyage une fois de plus

source: In LFS, stripping of debugging symbols was discussed a couple of times.
fr: Dans LFS, le nettoyage des symboles de deboguage a été discuté de nombreuses fois.

source: When building BLFS packages, there are generally no special instructions that discuss stripping again.
fr: Pour la construction des paquets BLFS, il n'y a généralement pas d'instructions qui discute de nouveau du nettoyage.

source: It is probably not a good idea to strip an executable or a library while it is in use, so exiting any windowing environment is a good idea.
fr: Ce n'est probablement pas une bonne idée de nettoyer un exécutable ou une bibliothèque tant qu'ils sont utilisés, alors sortir des environnements de fenètrage est une bonne idée.

source: Then you can do:
fr: Ensuite vous pouvez faire :

source: If you install programs in other directories such as /opt or /usr/local, you may want to strip the files there too.
fr: Si vous installez des programmes dans d'autres répertoires tels que /opt ou /usr/local, vous pouvez vouloir nettoyer les fichiers ici aussi.
