Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/important/locale-issues.xml.1.chaine.po
Languages: fr

source: Locale Related Issues
fr: Problèmes liées aux locales

source: This page contains information about locale related problems and issues.
fr: Cette page contient des informations sur les problèmes liées aux locales.

source: Many (but not all) existing locale related problems can be classified and fall under one of the headings below.
fr: Beaucoup (mais pas tous) des problèmes existants liés aux locales peuvent être classés et rangés sous une des en-têtes ci-dessous.

source: The severity ratings below use the following criteria:
fr: Les niveaux de sévérité indiqués ci-dessous utilisent les critères suivants :

source: Critical:
fr: Critique :

source: High:
fr: Haute :

source: Part of the functionality that the program provides is not usable.
fr: Une partie des fonctionnalités fournies par le programme n'est pas utilisable.

source: Low:
fr: Basse :

source: The program works in all typical use cases, but lacks some functionality normally provided by its equivalents.
fr: Le programme fonctionne dans tous les cas d'utilisation classiques, mais il manque de certaines fonctionnalités normalement fournies par ses équivalents.

source: For the most recent information about locale related issues for individual packages, check the _L2925_ in the BLFS Wiki.
fr: Pour les informations les plus récentes sur les problèmes liés aux locales pour des paquets individuels, vérifiez les _L2925_ sur le Wiki de BLFS.

source: The Needed Encoding is Not a Valid Option in the Program
fr: L'encodage nécessaire n'est pas une option valide du programme

source: Severity:
fr: Sévérité :

source: Critical
fr: Critique

source: Some programs require the user to specify the character encoding for their input or output data and present only a limited choice of encodings.
fr: Certains programmes exigent que l'utilisateur spécifie l'encodage de caractères pour leurs données d'entrée et de sortie et ils ne présentent qu'un choix limité d'encodages.

source: If the required encoding is not in the list, the program usually becomes completely unusable.
fr: Si l'encodage désiré n'est pas dans la liste, le programme devient en général totalement inutilisable.

source: For non-interactive programs, it may be possible to work around this by converting the document to a supported input character set before submitting to the program.
fr: Pour les programmes non interactifs, on peut contourner cela en convertissant le document dans un encodage d'entrée supporté avant de le soumettre au programme.

source: A solution to this type of problem is to implement the necessary support for the missing encoding as a patch to the original program or to find a replacement.
fr: Une solution à ce type de problème consiste à implémenter le support nécessaire de l'encodage manquant avec un correctif du programme d'origine ou un remplaçant.

source: The Program Assumes the Locale-Based Encoding of External Documents
fr: Le programme suppose l'encodage basé sur la locale de documents externes

source: High for non-text documents, low for text documents
fr: Haute pour des documents non textes, basse pour des documents textes

source: Some programs, _X455_ or _X456_ for example, assume that documents are always in the encoding implied by the current locale.
fr: Certains programmes, _X455_ ou _X456_ par exemple, supposent que les documents sont toujours dans l'encodage impliqué par la locale actuelle.

source: While this assumption may be valid for the user-created documents, it is not safe for external ones.
fr: Si cette supposition peut être valide pour les documents créés par l'utilisateur, ce n'est pas sûr pour ceux externes.

source: When this assumption fails, non-ASCII characters are displayed incorrectly, and the document may become unreadable.
fr: Quand cette supposition échoue, les caractères non ASCII s'affichent mal et le document peut devenir illisible.

source: If the external document is entirely text based, it can be converted to the current locale encoding using the _C2085_ program.
fr: Si le document externe est entièrement basé sur du texte, il peut être converti dans l'encodage de la locale actuelle en utilisant le programme _C2085_.

source: For documents that are not text-based, this is not possible.
fr: Pour les documents non basés sur du texte, ce n'est pas possible.

source: In fact, the assumption made in the program may be completely invalid for documents where the Microsoft Windows operating system has set de facto standards.
fr: En fait, la supposition du programme peut être complètement invalide pour les documents où le système d'exploitation Microsoft Windows a de facto réglé les standards.

source: An example of this problem is ID3v1 tags in MP3 files (see the _L2926_ for more details).
fr: Un exemple de ce problème réside dans les drapeaux ID3v1 des fichiers MP3 (voir _L2926_ pour plus de détails).

source: Among BLFS packages, this problem applies to _X455_ , _X456_ , and all media players except _X457_ .
fr: Au sein des paquets BLFS, ce problème s'applique à _X455_ , _X456_ et à tous les lecteurs multimédias, sauf _X457_.

source: This can happen often when the other person is using Microsoft Windows, which only provides one character encoding for a given country.
fr: Cela peut se produire souvent quand l'autre personne utilise Microsoft Windows, qui ne fournit qu'un encodage de caractère par pays donné.

source: For example, this causes problems with UTF-8 encoded TeX documents created in Linux.
fr: Par exemple, cela pose des problèmes avec les documents TeX encodés en UTF-8 créés sous Linux.

source: On Windows, most applications will assume that these documents have been created using the default Windows 8-bit encoding.
fr: Sur Windows, la plupart des applications supposeront que ces documents ont été créés en utilisant l'encodage 8 bits de Windows par défaut.

source: In extreme cases, Windows encoding compatibility issues may be solved only by running Windows programs under _L1498_.
fr: Dans les cas extrêmes, les problèmes de compatibilité d'encodages de Windows ne peuvent être résolus qu'en lançant des programmes Windows sous _L1498_.

source: The Program Uses or Creates Filenames in the Wrong Encoding
fr: Le programme utilise ou crée des noms de fichiers dans un mauvais encodage

source: The POSIX standard mandates that the filename encoding is the encoding implied by the current LC_CTYPE locale category.
fr: Le standard POSIX suppose que l'encodage des noms de fichiers est l'encodage impliqué par la catégorie de locale LC_CTYPE actuelle.

source: This information is well-hidden on the page which specifies the behavior of _A230_ and _A769_ programs.
fr: Ces informations sont bien cachées sur la page qui spécifie le comportement des programmes _A230_ et _A769_.

source: The result is that they create filenames which are not subsequently shown correctly by _C1540_ , or they refuse to accept filenames that _C1540_ shows properly.
fr: Il en résulte qu'ils créent des noms de fichiers qui sont ensuite mal affichés par _C1540_ , ou ils refusent d'accepter des noms de fichiers affichés correctement par _C1540_.

source: For the _X26_ library, the problem can be corrected by setting the _E43_ environment variable to the special "@locale" value.
fr: Pour la bibliothèque _X26_ , on peut corriger le problème en réglant la variable d'environnement _E43_ sur la valeur spéciale "@locale".

source: The _X118_ and _X176_ have this problem because they hard-code the expected filename encoding.
fr: _X118_ , _X176_ ont ce problème car ils ont en dur l'encodage accepté du nom de fichier.

source: However, this assumption only works for those in the US and not for anyone using a UTF-8 locale.
fr: Cette supposition ne marche cependant que pour les États-Unis et pas pour tous ceux qui utilisent une locale UTF-8.

source: Non-ASCII characters will be mangled in the extracted filenames.
fr: Les caractères non ASCII seront rognés dans les noms de fichiers extraits.

source: The general rule for avoiding this class of problems is to avoid installing broken programs.
fr: La règle générale pour éviter ce type de problème est d'éviter d'installer des programmes cassés.

source: If this is impossible, the _L2927_ command-line tool can be used to fix filenames created by these broken programs, or intentionally mangle the existing filenames to meet the broken expectations of such programs.
fr: Si c'est impossible, vous pouvez utiliser l'outil _L2927_ en ligne de commande pour corriger les noms de fichiers créés par ces programmes cassés, ou rogner volontairement les noms de fichiers existants pour satisfaire les présupposés casses de tels programmes.

source: In other cases, a similar problem is caused by importing filenames from a system using a different locale with a tool that is not locale-aware (e.g., _X49_ ).
fr: Dans d'autres cas, un problème similaire vient de l'importation de noms de fichiers d'un système utilisant une locale différente avec un outil non conscient de la locale (comme_X49_).

source: In order to avoid mangling non-ASCII characters when transferring files to a system with a different locale, any of the following methods can be used:
fr: Pour éviter de rogner les caractères non ASCII lors du transfert de fichiers vers un système ayant une locale différente, vous pouvez utiliser une des méthodes suivantes :

source: Transfer anyway, fix the damage with _C531_ .
fr: Transférer malgré tout, réparer les dommages avec _C531_.

source: On the sending side, create a tar archive with the _P276_ switch passed to _C830_ (this will be the default in a future version of _C830_ ).
fr: Côté expéditeur, créer une archive tar en passant le paramètre _P276_ à _C830_ (cela sera le réglage par défaut dans une version à venir de _C830_).

source: Mail the files as attachments.
fr: Envoyer les fichiers en pièces jointes d'un message électronique.

source: Mail clients specify the encoding of attached filenames.
fr: Les clients de messagerie spécifient l'encodage des noms de fichiers joints.

source: Write the files to a removable disk formatted with a FAT or FAT32 filesystem.
fr: Écrire les fichiers sur un disque amovible formaté avec un système de fichiers FAT ou FAT32.

source: Transfer the files using Samba.
fr: Transférer les fichiers en utilisant Samba.

source: Transfer the files via FTP using RFC2640-aware server (this currently means only wu-ftpd, which has bad security history) and client (e.g., lftp).
fr: Transférer les fichiers par FTP en utilisant un serveur (cela signifie actuellement seulement wu-ftpd, qui a une mauvaise histoire question sécurité) et un client conscients RFC2640 (comme lftp).

source: High or critical
fr: Haute ou critique

source: Many programs were written in an older era where multibyte locales were not common.
fr: De nombreux programmes ont été écrits dans une ère ancienne où les locales multioctets n'étaient pas courantes.

source: Such programs assume that C "char" data type, which is one byte, can be used to store single characters.
fr: De tels programmes supposent que les types de données C "char", qui sont un des octets, peuvent être utilisés pour stocker des caractères uniques.

source: Further, they assume that any sequence of characters is a valid string and that every character occupies a single character cell.
fr: De plus, ils supposent que n'importe quelle séquence de caractères est une chaîne valide et que chaque caractère occupe une seule cellule de caractère.

source: Such assumptions completely break in UTF-8 locales.
fr: De telles suppositions échouent complètement dans les locales UTF-8.

source: The visible manifestation is that the program truncates strings prematurely (i.e., at 80 bytes instead of 80 characters).
fr: La manifestation visible est que le programme tronque les chaînes de façon prématurée (c'est-à-dire aux octets 80 au lieu des caractères 80).

source: In this case, one has to redesign all data structures in order to accommodate to the fact that a complete character may span a variable number of "char"s (or switch to wchar_t and convert as needed).
fr: Dans ce cas, il faut reconcevoir toutes les structures de données pour s'accomoder du fait qu'un caractère complet peut s'étendre sur un nombre variable de "char"s (ou basculer sur wchar_t et convertir comme nécessaire).

source: Also, for every call to the "strlen" and similar functions, find out whether a number of bytes, a number of characters, or the width of the string was really meant.
fr: Pour chaque appel aux fonctions "strlen" et équivalent, il faut aussi trouver ce que voulait vraiment dire un nombre d'octets, de caractères ou la largeur de la chaîne.

source: Sometimes it is faster to write a program with the same functionality from scratch.
fr: Il est parfois plus rapide d'écrire depuis zéro un programme ayant la même fonctionnalité.

source: Among BLFS packages, this problem applies to _X458_ and all the shells.
fr: Au sein des paquets de BLFS, ce problème s'applique à _X458_ et tous les shells.

source: The Package Installs Manual Pages in Incorrect or Non-Displayable Encoding
fr: Le paquet installe des pages de manuel dans un mauvais encodage ou dans un non affichable

source: Low
fr: Basse

source: However, some packages install translated manual pages in UTF-8 encoding (e.g., Shadow, already dealt with), or manual pages in languages not in the table.
fr: Cependant, certains paquets installent des pages de manuel traduites dans l'encodage UTF-8 (comme Shadow, déjà traité), ou des pages de manuel dans des langues non présentes dans la table.

source: Not all BLFS packages have been audited for conformance with the requirements put in LFS (the large majority have been checked, and fixes placed in the book for packages known to install non-conforming manual pages).
fr: Tous les paquets BLFS n'ont pas fait l'objet d'une évaluation de leur respect des exigences de LFS (la grande majorité a été vérifiée et des corrections ont été mises dans le livre pour les paquets connus pour installer des pages de manuel non conformes).

source: If you find a manual page installed by any of BLFS packages that is obviously in the wrong encoding, please remove or convert it as needed, and report this to BLFS team as a bug.
fr: Si vous trouvez une page de manuel installée par un paquet BLFS qui est dans un mauvais encodage, merci de la supprimer ou de la convertir selon vos besoins et de le signaler à l'équipe BLFS comme un bogue.

source: You can easily check your system for any non-conforming manual pages by copying the following short shell script to some accessible location,
fr: Vous pouvez facilement vérifier le respect par toutes les pages de man de votre système en copiant le petit script shell suivant à un endroit accessible,

source: and then issuing the following command (modify the command below if the _C2087_ script is not in your _E16_ environment variable):
fr: puis en lançant la commande suivante (modifiez la commande ci-dessous si le script _C2087_ n'est pas dans votre variable d'environnement _E16_) :

source: Note that if you have manual pages installed in any location other than _F873_ (e.g., _F874_ ), you must modify the above command to include this additional location.
fr: Remarquez que si vous avez des pages de manuel installées ailleurs que dans _F873_ (comme dans _F874_), vous devez modifier la commande ci-dessus pour inclure cet emplacement supplémentaire.
