Repository: espindula/br-lfs
Catalog: blfs/traduc/po/introduction/important/pkgmgt.xml.1.chaine.po
Languages: fr

source: Package Management Techniques
fr: Techniques de gestion de paquets

source: The following are some common package management techniques.
fr: Ce qui suit est une liste de techniques habituelles de gestion de paquets.

source: Before making a decision on a package manager, do some research on the various techniques, particularly the drawbacks of the particular scheme.
fr: Avant de prendre une décision sur un gestionnaire de paquets, faites une recherche sur les différentes techniques et notamment leurs faiblesses.

source: It is All in My Head!
fr: Tout est dans ma tête!

source: Yes, this is a package management technique.
fr: Oui, c'est une technique de gestion de paquets.

source: Some folks do not find the need for a package manager because they know the packages intimately and know what files are installed by each package.
fr: Certains n'éprouvent pas le besoin d'un gestionnaire de paquets parce qu'ils connaissent très bien les paquets et connaissent les fichiers installés par chaque paquet.

source: Some users also do not need any package management because they plan on rebuilding the entire system when a package is changed.
fr: Certains utilisateurs n'en ont pas besoin parce qu'ils planifient la reconstruction entière de LFS lorsqu'un paquet est modifié.

source: Install in Separate Directories
fr: Installer dans des répertoires séparés

source: This is a simplistic package management that does not need any extra package to manage the installations.
fr: C'est une gestion des paquets tellement simple qu'elle ne nécessite aucun paquet supplémentaire pour gérer les installations.

source: Each package is installed in a separate directory.
fr: Chaque paquet est installé dans un répertoire séparé.

source: For example, package foo-1.1 is installed in _F882_ and a symlink is made from _F883_ to _F882_ .
fr: Par exemple, le paquet foo-1.1 est installé dans _F883_ et un lien symbolique est créé de _F882_ vers _F882_.

source: When installing a new version foo-1.2, it is installed in _F884_ and the previous symlink is replaced by a symlink to the new version.
fr: Lors de l'installation de la nouvelle version foo-1.2, elle est installée dans _F884_ et l'ancien lien symbolique est remplacé par un lien symbolique vers la nouvelle version.

source: The environment variables such as those mentioned in
fr: Les variables d'environnement telles que celles indiquées à la

source: need to be expanded to include _F883_ .
fr: ont besoin d'être étendues pour inclure _F883_.

source: For more than a few packages, this scheme becomes unmanageable.
fr: Pour plus que quelques paquets, ce schéma devient ingérable.

source: Symlink Style Package Management
fr: Gestion de paquet par lien symbolique

source: This is a variation of the previous package management technique.
fr: C'est une variante de la technique précédente.

source: Each package is installed similar to the previous scheme.
fr: Chaque paquet est installé de façon similaire au schéma précédent.

source: But instead of making the symlink, each file is symlinked into the _F190_ hierarchy.
fr: Mais au lieu de réaliser le lien symbolique, chaque fichier dispose d'un lien symbolique vers son équivalent dans la hiérarchie _F190_.

source: This removes the need to expand the environment variables.
fr: Ceci supprime le besoin d'étendre les variables d'environnement.

source: Though the symlinks can be created by the user to automate the creation, many package managers have been written using this approach.
fr: Bien que les liens symboliques peuvent être créés par l'utilisateur, pour automatiser la création, certains gestionnaires de paquets ont été écrit avec cette approche.

source: A few of the popular ones are Stow, Epkg, Graft, and Depot.
fr: Parmi les plus populaires se trouvent Stow, Epkg, Graft et Depot.

source: The installation needs to be faked, so that the package thinks that it is installed in _F291_ though in reality it is installed in the _F885_ hierarchy.
fr: L'installation doit être faussée, de façon à ce que chaque paquet pense qu'il est installé dans _F291_ alors qu'en réalité il est installé dans la hiérarchie _F885_.

source: Installing in this manner is not usually a trivial task.
fr: Installer de cette manière n'est généralement pas une tâche triviale.

source: For example, consider that you are installing a package libfoo-1.1.
fr: Par exemple, considérez que vous installez un paquet libfoo-1.1.

source: The following instructions may not install the package properly:
fr: Les instructions suivantes pourraient ne pas installer correctement le paquet :

source: The installation will work, but the dependent packages may not link to libfoo as you would expect.
fr: L'installation fonctionnera mais les paquets dépendants pourraient ne pas lier libfoo comme vous vous y attendriez.

source: If you compile a package that links against libfoo, you may notice that it is linked to _F886_ instead of _F887_ as you would expect.
fr: Si vous compilez un paquet qui se lie à _F886_ au lieu de _F887_ comme vous le prévoyez.

source: The correct approach is to use _E44_ strategy to fake installation of the package.
fr: La bonne approche est d'utiliser la stratégie _E44_ pour fausser l'installation du paquet.

source: This approach works as follows:
fr: Cette approche fonctionne ainsi :

source: Most of the packages do support this approach, but there are some which do not.
fr: La plupart des paquets supportent cette approche mais elle pose problème à certains.

source: For the non-compliant packages, you may either need to manually install the package, or you may find that it is easier to install some problematic packages into _F685_ .
fr: Pour les paquets non compatibles, vous pouvez soit les installer manuellement soit trouver plus simple d'installer les paquets problématiques dans _F685_.

source: Timestamp Based
fr: Basé sur le temps

source: In this technique, a file is timestamped before the installation of the package.
fr: Avec cette technique, un fichier est balisé avec l'heure avant l'installation du paquet.

source: After the installation, a simple use of the _C2096_ command with the appropriate options can generate a log of all the files installed after the timestamp file was created.
fr: Après l'installation, une simple utilisation de la commande _C2096_ avec les options appropriées peut générer une trace de tous les fichiers installés après que le fichier temps ne soit créé.

source: A package manager written with this approach is install-log.
fr: install-log est un gestionnaire de paquets écrit avec cette approche.

source: Though this scheme has the advantage of being simple, it has two drawbacks.
fr: Bien que ce schéma a l'avantage d'être simple, il a deux inconvénients.

source: If during installation, the files are installed with any timestamp other than the current time, those files will not be tracked by the package manager.
fr: Si à l'installation, les fichiers sont installés sans balise de temps autre que l'heure actuelle, ces fichiers ne seront pas suivis par le gestionnaire de paquets.

source: Also, this scheme can only be used when one package is installed at a time.
fr: De plus, ce schéma peut seulement être utilisé lorsqu'un seul paquet est installé à la fois.

source: The logs are not reliable if two packages are being installed on two different consoles.
fr: Les traces ne sont pas fiables si deux paquets sont installés dans deux consoles différentes.

source: LD_PRELOAD Based
fr: Basé sur LD_PRELOAD

source: In this approach, a library is preloaded before installation.
fr: Avec cette approche, une bibliothèque est préchargée avant l'installation.

source: During installation, this library tracks the packages that are being installed by attaching itself to various executables such as _C2095_ , _C907_ , _C2097_ and tracking the system calls that modify the filesystem.
fr: Pendant l'installation, cette bibliothèque poursuit les paquets qui sont installés en s'attachant à divers exécutables tels que _C2095_ , _C907_ , _C2097_ et la poursuite des appels système qui modifient le système de fichiers.

source: For this approach to work, all the executables need to be dynamically linked without the suid or sgid bit.
fr: Pour que cette approche fonctionne, tous les exécutables doivent être liés de façon dynamique sans le bit suid ou sgid.

source: Preloading the library may cause some unwanted side-effects during installation.
fr: Le préchargement de la bibliothèque peut provoquer des effets indésirables pendant l'installation.

source: Therefore, do perform some tests to ensure that the package manager does not break anything and logs all the appropriate files.
fr: Effectuez donc des tests pour vous assurer que le gestionnaire de paquets ne casse rien et journalisés tous les fichiers adéquats.

source: Creating Package Archives
fr: Créer des archives de paquets

source: In this scheme, the package installation is faked into a separate tree as described in the Symlink style package management.
fr: Dans ce schéma, l'installation d'un paquet est faussée dans un répertoire séparé comme décrit plus haut.

source: After the installation, a package archive is created using the installed files.
fr: Après l'installation, une archive du paquet est créée en utilisant les fichiers installés.

source: This archive is then used to install the package either on the local machine or can even be used to install the package on other machines.
fr: L'archive est ensuite utilisée pour installer le paquet soit sur la machine locale soit même sur d'autres machines.

source: This approach is used by most of the package managers found in the commercial distributions.
fr: Cette approche est utilisée par la plupart des gestionnaires de paquets trouvés dans les distributions commerciales.

source: User Based Management
fr: Gestion basée sur les utilisateurs

source: This scheme, unique to LFS, was devised by Matthias Benkmann, and is available from the _L3912_.
fr: Ce schéma, unique à LFS, a été décrit par Matthias Benkmann et est disponible sur le _L3912_.

source: In this scheme, each package is installed as a separate user into the standard locations.
fr: Dans ce schéma, chaque paquet est installé en tant qu'utilisateur séparé dans les emplacements standards.

source: Files belonging to a package are easily identified by checking the user ID.
fr: Les fichiers appartenant à un paquet sont facilement identifiés grâce à l'identifiant de l'utilisateur.

source: The features and shortcomings of this approach are too complex to describe in this section.
fr: Les fonctionnalités et avantages de cette approche sont trop complexes pour les décrire dans cette section.

source: For the details please see the hint at _L3913_ .
fr: Pour plus de détails, voir l'astuce sur _L3913_.
