Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/clock.po
Languages: pt_br

source: Configuring the system clock
pt_br: Configurando o relógio do sistema

source: clock
pt_br: relógio

source: configuring
pt_br: configurando

source: This section discusses how to configure the <command>systemd-timedated</command> system service, which configures the system clock and timezone.
pt_br: Esta seção discute como configurar o serviço de sistema <command>systemd-timedated</command>, o qual configura o relógio e fuso horário do sistema.

source: If you cannot remember whether or not the hardware clock is set to UTC, find out by running the <userinput>hwclock --localtime --show</userinput> command. This will display what the current time is according to the hardware clock. If this time matches whatever your watch says, then the hardware clock is set to local time. If the output from <command>hwclock</command> is not local time, chances are it is set to UTC time. Verify this by adding or subtracting the proper amount of hours for the timezone to the time shown by <command>hwclock</command>. For example, if you are currently in the MST timezone, which is also known as GMT -0700, add seven hours to the local time.
pt_br: Se você não conseguir se lembrar se ou não o relógio do hardware está configurado para UTC, [então] descubra executando o comando <userinput>hwclock --localtime --show</userinput>. Isso mostrará o que a hora atual é de acordo com o relógio do hardware. Se essa hora corresponder à que o seu relógio diz, então o relógio do hardware está configurado para hora local. Se a saída gerada originária do <command>hwclock</command> não for a hora local, [então] as chances são as de que ele esteja configurado para hora UTC. Verifique isso adicionando ou subtraindo a quantidade apropriada de horas para o fuso horário à (da) hora mostrada pelo <command>hwclock</command>. Por exemplo, se você estiver atualmente no fuso horário MST, o qual é conhecido também como GMT -0700, [então] adicione sete horas à hora local.

source: <command>systemd-timedated</command> reads <filename>/etc/adjtime</filename>, and depending on the contents of the file, sets the clock to either UTC or local time.
pt_br: O <command>systemd-timedated</command> lê <filename>/etc/adjtime</filename> e, dependendo do conteúdo do arquivo, configura o relógio para ou UTC ou hora local.

source: Create the <filename>/etc/adjtime</filename> file with the following contents if your hardware clock is set to local time:
pt_br: Crie o arquivo <filename>/etc/adjtime</filename> com o seguinte conteúdo se seu relógio do hardware estiver configurado para hora local:

source: If <filename>/etc/adjtime</filename> isn't present at first boot, <command>systemd-timedated</command> will assume that hardware clock is set to UTC and adjust the file according to that.
pt_br: Se <filename>/etc/adjtime</filename> não estiver presente na primeira inicialização, [então] <command>systemd-timedated</command> assumirá que o relógio do hardware está configurado para UTC e ajustará o arquivo de acordo com isso.

source: You can also use the <command>timedatectl</command> utility to tell <command>systemd-timedated</command> if your hardware clock is set to UTC or local time:
pt_br: Você também pode usar o utilitário <command>timedatectl</command> para dizer ao <command>systemd-timedated</command> se o seu relógio do hardware está configurado para UTC ou hora local:

source: <command>timedatectl</command> can also be used to change system time and time zone.
pt_br: O <command>timedatectl</command> também pode ser usado para mudar a hora e fuso horário do sistema.

source: To change your current system time, issue:
pt_br: Para mudar sua atual hora do sistema, emita:

source: The hardware clock will also be updated accordingly.
pt_br: O relógio do hardware também será atualizado de acordo.

source: To change your current time zone, issue:
pt_br: Para mudar seu fuso horário atual, emita:

source: <userinput>timedatectl set-timezone TIMEZONE</userinput>
pt_br: <userinput>timedatectl set-timezone FUSO_HORÁRIO</userinput>

source: You can get a list of available time zones by running:
pt_br: Você consegue obter uma lista dos fusos horários disponíveis executando:

source: Please note that the <command>timedatectl</command> command doesn't work in the chroot environment. It can only be used after the LFS system is booted with systemd.
pt_br: Por favor, observe que o comando <command>timedatectl</command> não funciona no ambiente chroot. Ele somente pode ser usado depois que o sistema LFS for inicializado com o systemd.

source: Network Time Synchronization
pt_br: Sincronização da Hora da Rede de Comunicação

source: Starting with version 213, systemd ships a daemon called <command>systemd-timesyncd</command> which can be used to synchronize the system time with remote NTP servers.
pt_br: Iniciando com a versão 213, o systemd embarca um processo de segundo plano chamado <command>systemd-timesyncd</command> o qual pode ser usado para sincronizar a hora do sistema com servidores remotos do NTP.

source: The daemon is not intended as a replacement for the well established NTP daemon, but as a client only implementation of the SNTP protocol which can be used for less advanced tasks and on resource limited systems.
pt_br: O processo de segundo plano não é destinado como um substituto para o bem estabelecido processo de segundo plano do NTP, porém como uma implementação somente cliente do protocolo SNTP, o qual pode ser usado para tarefas menos avançadas e em sistemas de recurso limitado.

source: Starting with systemd version 216, the <command>systemd-timesyncd</command> daemon is enabled by default. If you want to disable it, issue the following command:
pt_br: Iniciando com o systemd versão 216, o processo de segundo plano <command>systemd-timesyncd</command> está habilitado por padrão. Se você desejar desabilitá-lo, [então] emita o seguinte comando:

source: The <filename>/etc/systemd/timesyncd.conf</filename> file can be used to change the NTP servers that <command>systemd-timesyncd</command> synchronizes with.
pt_br: O arquivo <filename>/etc/systemd/timesyncd.conf</filename> pode ser usado para mudar os servidores do NTP que o <command>systemd-timesyncd</command> sincroniza com.

source: Please note that when system clock is set to Local Time, <command>systemd-timesyncd</command> won't update hardware clock.
pt_br: Por favor, observe que, quando o relógio do sistema estiver configurado para Hora Local, [então] o <command>systemd-timesyncd</command> não atualizará o relógio do hardware.
