Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/introduction.po
Languages: pt_br

source: Introduction
pt_br: Introdução

source: Booting a Linux system involves several tasks. The process must mount both virtual and real file systems, initialize devices, check file systems for integrity, mount and activate any swap partitions or files, set the system clock, bring up networking, start any daemons required by the system, and accomplish any other custom tasks specified by the user. This process must be organized to ensure the tasks are performed in the correct order and executed as quickly as possible.
pt_br: Inicializar um sistema Linux envolve várias tarefas. O processo precisa montar ambos sistemas de arquivos virtual e real, inicializar dispositivos, verificar sistemas de arquivos para integridade, montar e ativar quaisquer partições ou arquivos de troca, configurar o relógio do sistema, ativar a rede de comunicação, iniciar quaisquer processos de segundo plano exigidos pelo sistema e realizar quaisquer outras tarefas personalizadas especificadas pelo(a) usuário(a). Esse processo precisa estar organizado para garantir que as tarefas sejam realizadas na ordem correta e executadas o mais rápido possível.

source: System V is the classic boot process that has been used in Unix and Unix-like systems such as Linux since about 1983. It consists of a small program, <command>init</command>, that sets up basic processes such as <command>login</command> (via getty) and runs a script. This script, usually named <command>rc</command>, controls the execution of a set of additional scripts that perform the tasks required to initialize the system.
pt_br: System V é o processo clássico de inicialização que tem sido usado em sistemas Unix e semelhantes a Unix, tais como o Linux, desde cerca de 1983. Ele consiste de um aplicativo pequeno, <command>init</command>, que configura processos básicos, tais como <command>login</command> (via getty), e executa um script. Esse script, usualmente chamado de <command>rc</command>, controla a execução de um conjunto de scripts adicionais que realizam as tarefas exigidas para inicializar o sistema.

source: The <command>init</command> program is controlled by the <filename>/etc/inittab</filename> file and is organized into run levels that can be chosen by the user. In LFS, they are used as follows:
pt_br: O aplicativo <command>init</command> é controlado pelo arquivo <filename>/etc/inittab</filename> e está organizado em níveis de execução que podem ser escolhidos pelo(a) usuário(a). No LFS, eles são usados como segue:

source: 0 &mdash; halt 1 &mdash; Single user mode 2 &mdash; User definable 3 &mdash; Full multiuser mode 4 &mdash; User definable 5 &mdash; Full multiuser mode with display manager 6 &mdash; reboot
pt_br: 0 &mdash; parar 1 &mdash; Modo de usuário(a) único(a) 2 &mdash; Definível pelo(a) usuário(a) 3 &mdash; Modo de multi usuário(a) completo 4 &mdash; Definível pelo(a) usuário(a) 5 &mdash; Modo de multi usuário(a) completo com gerenciador de tela 6 &mdash; reinicializar

source: The usual default run level is 3 or 5.
pt_br: O nível de execução padrão usual é 3 ou 5.

source: Advantages
pt_br: Vantagens

source: Established, well understood system.
pt_br: Sistema estabelecido, bem compreendido.

source: Easy to customize.
pt_br: Fácil de personalizar.

source: Disadvantages
pt_br: Desvantagens

source: May be slower to boot. A medium speed base LFS system takes 8-12 seconds where the boot time is measured from the first kernel message to the login prompt. Network connectivity is typically established about 2 seconds after the login prompt.
pt_br: Possivelmente seja mais lento inicializar. Um sistema LFS básico de velocidade média toma de 8 a 12 segundos, onde o tempo de inicialização é medido desde a primeira mensagem do núcleo até o prompt de login. A conectividade da rede de comunicação tipicamente é estabelecida cerca de 2 segundos depois do prompt de login.

source: Serial processing of boot tasks. This is related to the previous point. A delay in any process, such as a file system check, will delay the entire boot process.
pt_br: Processamento em série de tarefas de inicialização. Isso está relacionado ao ponto anterior. Um atraso em qualquer processo, tal como uma verificação de sistema de arquivos, atrasará o processo inteiro de inicialização.

source: Does not directly support advanced features like control groups (cgroups) and per-user fair share scheduling.
pt_br: Não suporta diretamente recursos avançados, como grupos de controle (cgroups) e agendamento de compartilhamento justo por usuário(a).

source: Adding scripts requires manual, static sequencing decisions.
pt_br: Adicionar scripts exige decisões de sequenciamento estático, manuais.
