Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/locale.po
Languages: fr, pt_br

source: Configuring the System Locale
fr: Configuration des paramètres régionaux du système
pt_br: Configurando o Locale do Sistema

source: The <filename>/etc/locale.conf</filename> file below sets some environment variables necessary for native language support. Setting them properly results in:
fr: Le fichier <filename>/etc/locale.conf</filename> ci-dessous défini certaines variables d'environnement nécessaires pour la prise en charge native des langues. Les configurer a pour résultat&nbsp;:
pt_br: O arquivo <filename>/etc/locale.conf</filename> abaixo configura algumas variáveis de ambiente necessárias para suporte ao idioma nativo. Configurá-las adequadamente resulta em:

source: The output of programs being translated into your native language
fr: La sortie des programmes est traduite dans votre langue maternelle
pt_br: A saída gerada de aplicativos sendo traduzida para seu idioma nativo

source: The correct classification of characters into letters, digits and other classes. This is necessary for <command>bash</command> to properly accept non-ASCII characters in command lines in non-English locales
fr: Le classement correct des caractères en lettres, chiffres et autres classes. Cela est nécessaire pour <command>bash</command> pour accepter correctement les caractères non-ASCII pour les paramètres linguistiques non anglais
pt_br: A classificação correta dos caracteres em letras, dígitos e outras classes. Isso é necessário para o <command>bash</command> aceitar adequadamente caracteres não ASCII em linhas de comando em locales não ingleses

source: The correct alphabetical sorting order for the country
fr: Le classement alphabétique correct pour les autres pays
pt_br: A sequência de ordenação alfabética correta para o país

source: The appropriate default paper size
fr: La taille de papier par défaut appropriée
pt_br: O apropriado tamanho padrão de papel

source: The correct formatting of monetary, time, and date values
fr: Le formatage correct de la monnaie, du temps et de la date
pt_br: A formatação correta dos valores monetário, hora e data

source: Replace <replaceable>&lt;ll&gt;</replaceable> below with the two-letter code for your desired language (e.g., <quote>en</quote>) and <replaceable>&lt;CC&gt;</replaceable> with the two-letter code for the appropriate country (e.g., <quote>GB</quote>). <replaceable>&lt;charmap&gt;</replaceable> should be replaced with the canonical charmap for your chosen locale. Optional modifiers such as <quote>@euro</quote> may also be present.
fr: Remplacez <replaceable>&lt;ll&gt;</replaceable> ci-dessous par les deux lettres de la langue désirée (par exemple <quote>fr</quote>) et remplacez <replaceable>&lt;CC&gt;</replaceable> par les deux lettres du pays approprié (par exemple <quote>FR</quote>). <replaceable>&lt;charmap&gt;</replaceable> doit être remplacé par la table de caractères classique pour le paramètre linguistique choisi. On peut aussi ajouter des modificateurs facultatifs comme <quote>@euro</quote>.
pt_br: Substitua <replaceable>&lt;ll&gt;</replaceable> abaixo pelo código de duas letras para seu idioma desejado (por exemplo, <quote>en</quote>) e <replaceable>&lt;CC&gt;</replaceable> pelo código de duas letras para o país apropriado (por exemplo, <quote>GB</quote>). <replaceable>&lt;charmap&gt;</replaceable> deveria ser substituído pelo mapa de caracteres canônico para seu locale escolhido. Modificadores opcionais, tais como <quote>@euro</quote>, possivelmente também estejam presentes.

source: The list of all locales supported by Glibc can be obtained by running the following command:
fr: La liste des paramètre régionaux pris en charge par Glibc peut être obtenue en lançant la commande suivante&nbsp;:
pt_br: A lista de todos os locales suportados pela Glibc pode ser obtida executando-se o seguinte comando:

source: Charmaps can have a number of aliases, e.g., <quote>ISO-8859-1</quote> is also referred to as <quote>iso8859-1</quote> and <quote>iso88591</quote>. Some applications cannot handle the various synonyms correctly (e.g., require that <quote>UTF-8</quote> is written as <quote>UTF-8</quote>, not <quote>utf8</quote>), so it is the safest in most cases to choose the canonical name for a particular locale. To determine the canonical name, run the following command, where <replaceable>&lt;locale name&gt;</replaceable> is the output given by <command>locale -a</command> for your preferred locale (<quote>en_GB.iso88591</quote> in our example).
fr: Les tables de caractères peuvent aussi avoir certains alias, par exemple <quote>ISO-8859-1</quote> est aussi référencé comme <quote>iso8859-1</quote> et <quote>iso88591</quote>. Certaines applications ne peuvent pas gérer les différents synonymes (il est par exemple requis que <quote>UTF-8</quote> soit écrit <quote>UTF-8</quote> et pas <quote>utf8</quote>), il est donc plus sur de choisir le nom classique pour un paramètre linguistique particulier. Pour déterminer le nom classique, lancez la commande suivante, où <replaceable>&lt;nom du paramètre linguistique&gt;</replaceable> est la sortie donnée par <command>locale -a</command> pour votre langue préférée (<quote>fr_FR.iso88591</quote> dans notre exemple).
pt_br: Mapas de caracteres podem ter um número de apelidos, por exemplo, <quote>ISO-8859-1</quote> também é referenciado como <quote>iso8859-1</quote> e <quote>iso88591</quote>. Alguns aplicativos não conseguem lidar com os vários sinônimos corretamente (por exemplo, exigem que <quote>UTF-8</quote> seja escrito como <quote>UTF-8</quote>, não <quote>utf8</quote>), de forma que é mais seguro, na maioria dos casos, escolher o nome canônico para um locale específico. Para determinar o nome canônico, execute o seguinte comando, onde <replaceable>&lt;nome do locale&gt;</replaceable> é a saída gerada dada por <command>locale -a</command> para seu locale preferido (<quote>en_GB.iso88591</quote> no nosso exemplo).

source: <userinput>LC_ALL=<replaceable>&lt;locale name&gt;</replaceable> locale charmap</userinput>
fr: <userinput>LC_ALL=<replaceable>&lt;nom du paramètre linguistique&gt;</replaceable> locale charmap</userinput>
pt_br: <userinput>LC_ALL=<replaceable>&lt;nome do locale&gt;</replaceable> mapa de caracteres do locale</userinput>

source: For the <quote>en_GB.iso88591</quote> locale, the above command will print:
fr: Pour le paramètre <quote>fr_FR.iso885915</quote>, la commande va renvoyer&nbsp;:
pt_br: Para o locale <quote>en_GB.iso88591</quote>, o comando acima imprimirá:

source: This results in a final locale setting of <quote>en_GB.ISO-8859-1</quote>. It is important that the locale found using the heuristic above is tested prior to it being added to the Bash startup files:
fr: Cela résulte en un paramètre de régionalisation final de <quote>fr_FR.ISO-8859-15</quote>. Il est important que le paramètre trouvé en utilisant la syntaxe précédente soit testée avant d'être ajoutée aux fichiers de démarrage de bash&nbsp;:
pt_br: Isso resulta em uma configuração final de locale de <quote>en_GB.ISO-8859-1</quote>. É importante que o locale encontrado usando-se a heurística acima seja testado antes que ele seja adicionado aos arquivos de inicialização do Bash:

source: <userinput>LC_ALL=&lt;locale name&gt; locale language LC_ALL=&lt;locale name&gt; locale charmap LC_ALL=&lt;locale name&gt; locale int_curr_symbol LC_ALL=&lt;locale name&gt; locale int_prefix</userinput>
fr: <userinput>LC_ALL=&lt;nom du paramètre linguistique&gt; locale language LC_ALL=&lt;nom du paramètre linguistique&gt; locale charmap LC_ALL=&lt;nom du paramètre linguistique&gt; locale int_curr_symbol LC_ALL=&lt;nom du paramètre linguistique&gt; locale int_prefix</userinput>
pt_br: <userinput>LC_ALL=&lt;nome do locale&gt; locale language LC_ALL=&lt;nome do locale&gt; locale charmap LC_ALL=&lt;nome do locale&gt; locale int_curr_symbol LC_ALL=&lt;nome do locale&gt; locale int_prefix</userinput>

source: The above commands should print the language name, the character encoding used by the locale, the local currency, and the prefix to dial before the telephone number in order to get into the country. If any of the commands above fail with a message similar to the one shown below, this means that your locale was either not installed in Chapter&nbsp;8 or is not supported by the default installation of Glibc.
pt_br: Os comandos acima deveriam imprimir o nome do idioma, a codificação de caracteres usada pelo locale, a moeda local, e o prefixo para discar antes do número de telefone para a finalidade de se alcançar o país. Se quaisquer dos comandos acima falhar com uma mensagem similar àquela mostrada abaixo, [então] isso significa que seu locale ou não foi instalado no Capítulo&nbsp;8 ou não é suportado pela instalação padrão da Glibc.

source: If this happens, you should either install the desired locale using the <command>localedef</command> command, or consider choosing a different locale. Further instructions assume that there are no such error messages from Glibc.
fr: Si cela arrive, vous devez soit installer le paramètre régional désiré en utilisant la commande <command>localedef</command>, ou en utilisant un autre paramètre. Les instructions suivantes supposent qu'il n'y a pas de tels message d'erreur de Glibc.
pt_br: Se isso acontecer, [então] você deveria ou instalar o locale desejado usando o comando <command>localedef</command>, ou considerar escolher um locale diferente. As instruções posteriores assumem que não existem tais mensagens de erro originárias da Glibc.

source: Some packages beyond LFS may also lack support for your chosen locale. One example is the X library (part of the X Window System), which outputs the following error message if the locale does not exactly match one of the character map names in its internal files:
fr: Certains paquets au-delà de LFS peuvent ne pas prendre en charge le paramètre linguistique que vous avez choisi. Un exemple est la bibliothèque X (partie du système X Window), qui renvoie les messages suivant si le paramètre ou que le nom de jeu de caractères ne correspond pas exactement à ses fichiers internes&nbsp;:
pt_br: Alguns pacotes além do LFS também possivelmente careçam de suporte para seu locale escolhido. Um exemplo é a biblioteca do X (parte do X Window System), a qual externaliza a seguinte mensagem de erro se o locale não corresponder exatamente a um dos nomes de mapa de carácter nos arquivos internos dela:

source: In several cases Xlib expects that the character map will be listed in uppercase notation with canonical dashes. For instance, "ISO-8859-1" rather than "iso88591". It is also possible to find an appropriate specification by removing the charmap part of the locale specification. This can be checked by running the <command>locale charmap</command> command in both locales. For example, one would have to change "de_DE.ISO-8859-15@euro" to "de_DE@euro" in order to get this locale recognized by Xlib.
fr: Dans plusieurs cas Xlib s'attend à ce que le jeu de caractère soit inscrit en notation majuscule avec les tirets classiques. Par exemple «&nbsp;ISO-8859-1&nbsp;» plutôt que «&nbsp;iso88591&nbsp;». Il est aussi possible de trouver la spécification appropriée en retirant la partie correspondant au jeu de caractères de la spécification du paramètre régional. Cela peut être testé en lançant la commande <command>locale charmap</command> des deux paramètres. Par exemple, il faudra changer «&nbsp;de_DE.ISO-8859-15@euro&nbsp;» en «&nbsp;de_DE@euro&nbsp;» pour que ce paramètre soit reconnu par Xlib.
pt_br: Em vários casos, a Xlib espera que o mapa de carácter será listado em notação de letras maiúsculas com hifens canônicos. Por exemplo, "ISO-8859-1" em vez de "iso88591". Também é possível encontrar uma especificação apropriada removendo-se a parte do mapa de carácter da especificação de locale. Isso pode ser verificado executando-se o comando <command>locale charmap</command> em ambos os locales. Por exemplo, alguém poderia ter que mudar "de_DE.ISO-8859-15@euro" para "de_DE@euro" para a finalidade de conseguir que esse locale fosse reconhecido pela Xlib.

source: Other packages can also function incorrectly (but may not necessarily display any error messages) if the locale name does not meet their expectations. In those cases, investigating how other Linux distributions support your locale might provide some useful information.
fr: D'autres programmes ne vont aussi pas fonctionner correctement (mais ne vont pas nécessairement afficher un message d'erreur) si le nom du paramètre régional ne rencontre pas leurs attentes. Dans d'autres cas, rechercher comment d'autres distributions Linux prennent en charge votre paramètre régional peut fournir des informations utiles.
pt_br: Outros pacotes também podem funcionar incorretamente (mas, possivelmente não necessariamente exibam quaisquer mensagens de erro) se o nome do locale não corresponder às expectativas deles. Nesses casos, investigar-se como outras distribuições do Linux suportam seu locale poderia fornecer alguma informação útil.

source: Once the proper locale settings have been determined, create the <filename>/etc/locale.conf</filename> file:
fr: Une fois que les bonnes configurations de paramètres linguistiques ont été effectuées, créez le fichier <filename>/etc/locale.conf</filename>&nbsp;:
pt_br: Uma vez que as configurações adequadas de locale tenham sido determinadas, crie o arquivo <filename>/etc/locale.conf</filename>:

source: <userinput>cat &gt; /etc/locale.conf &lt;&lt; "EOF" <literal>LANG=<replaceable>&lt;ll&gt;_&lt;CC&gt;.&lt;charmap&gt;&lt;@modifiers&gt;</replaceable></literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/locale.conf &lt;&lt; "EOF" <literal>LANG=<replaceable>&lt;ll&gt;_&lt;CC&gt;.&lt;mapa_caracteres&gt;&lt;@modificadores&gt;</replaceable></literal> EOF</userinput>

source: Note that you can modify <filename>/etc/locale.conf</filename> with the systemd <command>localectl</command> utility. To use <command>localectl</command> for the example above, run:
fr: Notez que vous devez modifier <filename>/etc/locale.conf</filename> avec l'utilitaire systemd <command>localectl</command>. Pour utiliser <command>localectl</command> avec l'exemple précédent, lancez&nbsp;:
pt_br: Observe que você consegue modificar o <filename>/etc/locale.conf</filename> com o utilitário <command>localectl</command> do systemd. Para usar o <command>localectl</command> para o exemplo acima, execute:

source: <userinput>localectl set-locale LANG="<replaceable>&lt;ll&gt;_&lt;CC&gt;.&lt;charmap&gt;&lt;@modifiers&gt;</replaceable>"</userinput>
pt_br: <userinput>localectl set-locale LANG="<replaceable>&lt;ll&gt;_&lt;CC&gt;.&lt;mapa_caracteres&gt;&lt;@modificadores&gt;</replaceable>"</userinput>

source: You can also specify other language specific environment variables such as <envar>LANG</envar>, <envar>LC_CTYPE</envar>, <envar>LC_NUMERIC</envar> or any other environment variable from <command>locale</command> output. Just separate them with a space. An example where <envar>LANG</envar> is set as en_US.UTF-8 but <envar>LC_CTYPE</envar> is set as just en_US is:
fr: Vous pouvez aussi spécifier d'autres variables d'environnement comme <envar>LANG</envar>, <envar>LC_CTYPE</envar>, <envar>LC_NUMERIC</envar> ou n'importe quel autre varable de la sortie de <command>locale</command>. Un exemple où <envar>LANG</envar> est définie à en_US.UTF-8 mais <envar>LC_CTYPE</envar> est défini juste à en_US est&nbsp;:
pt_br: Você também pode especificar outras variáveis de ambiente específicas de idioma, tais como <envar>LANG</envar>; <envar>LC_CTYPE</envar>; <envar>LC_NUMERIC</envar>; ou qualquer outra variável de ambiente oriunda da saída gerada de <command>locale</command>. Apenas separe-as com um espaço. Um exemplo onde <envar>LANG</envar> é configurada como en_US.UTF-8, porém <envar>LC_CTYPE</envar> é configurada apenas como en_US é:

source: Please note that the <command>localectl</command> command doesn't work in the chroot environment. It can only be used after the LFS system is booted with systemd.
pt_br: Por favor, observe que o comando <command>localectl</command> não funciona no ambiente chroot. Ele somente pode ser usado depois que o sistema LFS for inicializado com o systemd.

source: The <quote>C</quote> (default) and <quote>en_US</quote> (the recommended one for United States English users) locales are different. <quote>C</quote> uses the US-ASCII 7-bit character set, and treats bytes with the high bit set as invalid characters. That's why, e.g., the <command>ls</command> command substitutes them with question marks in that locale. Also, an attempt to send mail with such characters from Mutt or Pine results in non-RFC-conforming messages being sent (the charset in the outgoing mail is indicated as <quote>unknown 8-bit</quote>). It's suggested that you use the <quote>C</quote> locale only if you are certain that you will never need 8-bit characters.
fr: Les paramètres <quote>C</quote> (défaut) et <quote>en_US</quote> (recommandé pour les utilisateurs anglophones des États-Unis) sont différents. <quote>C</quote> utilise le jeu de caractères US-ASCII 7-bit et traite les octets avec le bit de point fort à 1 comme des caractères invalides. C'est pourquoi, par exemple, la commande <command>ls</command> les remplace par des points d'interrogation sous ce paramètre. En outre, les messages contenant ces caractères envoyés avec Mutt ou Pine ne sont pas conformes aux RFC (le jeu de caractères dans le mail sortant est indiqué comme <quote>unknown 8-bit</quote>). Vous ne pouvez donc utiliser le paramètre régional <quote>C</quote> que si vous êtes sûr que vous n'aurez jamais besoins de caractère 8 bits.
pt_br: Os locales <quote>C</quote> (padrão) e <quote>en_US</quote> (aquele recomendado para usuários(as) do inglês dos Estados Unidos da América do Norte) são diferentes. <quote>C</quote> usa o conjunto de caracteres de 7 bits US-ASCII e trata bytes com o bit de ordem alta configurado como caracteres inválidos. Esse é o porquê, por exemplo, do comando <command>ls</command> substitui-los por pontos de interrogação nesse locale. Também, uma tentativa de enviar correio com tais caracteres a partir do Mutt ou do Pine resulta em mensagens de não conformidade com RFC sendo enviadas (o conjunto de caracteres no correio de saída é indicado como <quote>unknown 8-bit</quote>). É sugerido que você use o locale <quote>C</quote> somente se tiver certeza de que nunca precisará de caracteres de 8 bits.

source: <computeroutput>ISO-8859-1</computeroutput>
fr: <computeroutput>ISO-8859-15</computeroutput>

source: Please note that the <command>localectl</command> command can be used only on a system booted with systemd.
fr: Notez que la commande <command>localectl</command> ne peut-être lancée que sur un système lancé avec systemd.
