Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/symlinks.po
Languages: pt_br

source: Managing Devices
pt_br: Gerenciando Dispositivos

source: Network Devices
pt_br: Dispositivos da Rede de Comunicação

source: Udev, by default, names network devices according to Firmware/BIOS data or physical characteristics like the bus, slot, or MAC address. The purpose of this naming convention is to ensure that network devices are named consistently, not based on when the network card was discovered. In older versions of Linux&mdash;on a computer with two network cards made by Intel and Realtek, for instance&mdash;the network card manufactured by Intel might have become eth0 while the Realtek card became eth1. After a reboot, the cards would sometimes get renumbered the other way around.
pt_br: O Udev, por padrão, nomeia dispositivos da rede de comunicação de acordo com dados de Firmware/BIOS ou características físicas, como o barramento, slot ou endereço MAC. O propósito dessa convenção de nomenclatura é o de garantir que dispositivos da rede de comunicação sejam nomeados consistentemente e não baseados em quando a placa de rede de comunicação foi descoberta. Em versões mais antigas do Linux&mdash;em um computador com duas placas de rede de comunicação feitas por Intel e Realtek, por exemplo&mdash;a placa de rede de comunicação fabricada pela Intel talvez se torne eth0, enquanto que e a placa Realtek se tornou eth1. Depois de uma reinicialização, as placas poderiam, às vezes, serem renumeradas da maneira inversa.

source: In the new naming scheme, typical network device names are something like enp5s0 or wlp3s0. If this naming convention is not desired, the traditional naming scheme, or a custom scheme, can be implemented.
pt_br: No novo esquema de nomenclatura, nomes típicos de dispositivo da rede de comunicação são alguma coisa como enp5s0 ou wlp3s0. Se essa convenção de nomenclatura não for desejada, [então] o esquema de nomenclatura tradicional, ou um esquema personalizado, pode ser implementado.

source: Disabling Persistent Naming on the Kernel Command Line
pt_br: Desabilitando Nomenclatura Persistente na Linha de Comando do Núcleo

source: The traditional naming scheme using eth0, eth1, etc. can be restored by adding <userinput>net.ifnames=0</userinput> on the kernel command line. This is most appropriate for systems that have just one ethernet device of a particular type. Laptops often have two ethernet connections named eth0 and wlan0; such laptops can also use this method. The command line is in the GRUB configuration file. See <xref linkend="grub-cfg"/>.
pt_br: O esquema tradicional de nomenclatura usando eth0, eth1, etc., pode ser restaurado adicionando-se <userinput>net.ifnames=0</userinput> na linha de comando do núcleo. Isso é mais apropriado para sistemas que tenham apenas um dispositivo ethernet de um tipo específico. Laptops frequentemente tem duas conexões ethernet nomeadas de eth0 e wlan0; tais laptops também conseguem usar esse método. A linha de comando está no arquivo de configuração do GRUB. Veja-se <xref linkend="grub-cfg"/>.

source: Creating Custom Udev Rules
pt_br: Criando Regras Personalizadas do Udev

source: The naming scheme can be customized by creating custom udev rules. A script has been included that generates the initial rules. Generate these rules by running:
pt_br: O esquema de nomenclatura pode ser personalizado criando-se regras personalizadas do Udev. Um script foi incluído que gera as regras iniciais. Gere essas regras executando:

source: Now, inspect the <filename>/etc/udev/rules.d/70-persistent-net.rules</filename> file, to find out which name was assigned to which network device:
pt_br: Agora, inspecione o arquivo <filename>/etc/udev/rules.d/70-persistent-net.rules</filename>, para descobrir qual nome foi atribuído a qual dispositivo da rede de comunicação:

source: In some cases, such as when MAC addresses have been assigned to a network card manually, or in a virtual environment such as Qemu or Xen, the network rules file may not be generated because addresses are not consistently assigned. In these cases, this method cannot be used.
pt_br: Em alguns casos, tais como quando endereços MAC tenham sido atribuídos para uma placa de rede de comunicação manualmente, ou em um ambiente virtual, como Qemu ou Xen, o arquivo das regras da rede de comunicação possivelmente não seja gerado, pois endereços não são atribuídos consistentemente. Nesses casos, esse método não pode ser usado.

source: The file begins with a comment block, followed by two lines for each NIC. The first line for each NIC is a commented description showing its hardware IDs (e.g. its PCI vendor and device IDs, if it's a PCI card), along with its driver (in parentheses, if the driver can be found). Neither the hardware ID nor the driver is used to determine which name to give an interface; this information is only for reference. The second line is the udev rule that matches this NIC and actually assigns it a name.
pt_br: O arquivo começa com um bloco de comentário seguido por duas linhas para cada NIC. A primeira linha para cada NIC é uma descrição comentada mostrando os IDs de hardware delas (por exemplo, fornecedor(a) de PCI delas e IDs de dispositivo, se ela for uma placa PCI), juntamente com o controlador delas (entre parênteses, se o controlador puder ser encontrado). Nem o ID de hardware, nem o controlador, é usado para determinar quais nomes dar para uma interface; essa informação é somente para referência. A segunda linha é a regra do Udev que corresponde a essa NIC e atualmente atribui a ela um nome.

source: All udev rules are made up of several keywords, separated by commas and optional whitespace. Here are the keywords, and an explanation of each one:
pt_br: Todas as regras do Udev são compostas de várias palavras chave, separadas por vírgulas e espaços em branco opcionais. Aqui estão as palavras chave e uma explicação de cada uma:

source: <literal>SUBSYSTEM=="net"</literal> - This tells udev to ignore devices that are not network cards.
pt_br: <literal>SUBSYSTEM=="net"</literal> - Isso diz ao Udev para ignorar dispositivos que não sejam placas da rede de comunicação.

source: <literal>ACTION=="add"</literal> - This tells udev to ignore this rule for a uevent that isn't an add ("remove" and "change" uevents also happen, but don't need to rename network interfaces).
pt_br: <literal>ACTION=="add"</literal> - Isso diz ao Udev para ignorar essa regra para um uevent que não seja um adicionar (uevents "remover" e "mudar" também acontecem, porém não precisam renomear interfaces da rede de comunicação).

source: <literal>DRIVERS=="?*"</literal> - This exists so that udev will ignore VLAN or bridge sub-interfaces (because these sub-interfaces do not have drivers). These sub-interfaces are skipped because the name that would be assigned would collide with the parent devices.
pt_br: <literal>DRIVERS=="?*"</literal> - Isso existe, de forma que o Udev ignorará sub-interfaces VLAN ou bridge (pois essas sub-interfaces não tem controladores). Essas sub-interfaces são puladas, pois o nome que seria atribuído conflitaria com os dispositivos ancestrais delas.

source: <literal>ATTR{address}</literal> - The value of this keyword is the NIC's MAC address.
pt_br: <literal>ATTR{address}</literal> - O valor dessa palavra chave é o endereço MAC da NIC.

source: <literal>ATTR{type}=="1"</literal> - This ensures the rule only matches the primary interface in the case of certain wireless drivers which create multiple virtual interfaces. The secondary interfaces are skipped for the same reason that VLAN and bridge sub-interfaces are skipped: there would be a name collision otherwise.
pt_br: <literal>ATTR{type}=="1"</literal> - Isso garante que a regra corresponda somente à interface primária no caso de certos controladores sem fios os quais criam múltiplas interfaces virtuais. As interfaces secundárias são puladas pela mesma razão que sub-interfaces VLAN e bridge são puladas: existiria um conflito de nome do contrário.

source: <literal>NAME</literal> - The value of this keyword is the name that udev will assign to this interface.
pt_br: <literal>NAME</literal> - O valor dessa palavra chave é o nome que o Udev atribuirá para essa interface.

source: The value of <literal>NAME</literal> is the important part. Make sure you know which name has been assigned to each of your network cards before proceeding, and be sure to use that <literal>NAME</literal> value when creating your network configuration files.
pt_br: O valor de <literal>NAME</literal> é a parte importante. Assegure-se de que você sabe qual nome foi atribuído para cada uma das suas placas da rede de comunicação antes de prosseguir, e tenha certeza de usar esse valor <literal>NAME</literal> quando criar seus arquivos de configuração da rede de comunicação.

source: CD-ROM Symlinks
pt_br: Links Simbólicos de CD-ROM

source: Some software that you may want to install later (e.g., various media players) expects the <filename class="symlink">/dev/cdrom</filename> and <filename class="symlink">/dev/dvd</filename> symlinks to exist, and to point to a CD-ROM or DVD-ROM device. Also, it may be convenient to put references to those symlinks into <filename>/etc/fstab</filename>. Udev comes with a script that will generate rules files to create these symlinks for you, depending on the capabilities of each device, but you need to decide which of two modes of operation you wish to have the script use.
pt_br: Alguns aplicativos que você possivelmente queira instalar posteriormente (por exemplo, vários reprodutores de mídia) esperam que os links simbólicos <filename class="symlink">/dev/cdrom</filename> e <filename class="symlink">/dev/dvd</filename> existam, e apontem para um dispositivo de CD-ROM ou de DVD-ROM. Também, possivelmente seja conveniente colocar referências a esses links simbólicos em <filename>/etc/fstab</filename>. O Udev vem com um script que gerará arquivos de regras para criar esses links simbólicos para você, dependendo dos recursos de cada dispositivo, mas você precisa decidir qual dos dois modos de operação você deseja ter para o script usar.

source: First, the script can operate in <quote>by-path</quote> mode (used by default for USB and FireWire devices), where the rules it creates depend on the physical path to the CD or DVD device. Second, it can operate in <quote>by-id</quote> mode (default for IDE and SCSI devices), where the rules it creates depend on identification strings stored on the CD or DVD device itself. The path is determined by udev's <command>path_id</command> script, and the identification strings are read from the hardware by its <command>ata_id</command> or <command>scsi_id</command> programs, depending on which type of device you have.
pt_br: Primeiro, o script pode operar em modo <quote>por-caminho</quote> (usado por padrão para dispositivos USB e FireWire), onde as regras que ele cria dependem do caminho físico para o dispositivo de CD ou de DVD. Segundo, ele pode operar em modo <quote>por-id</quote> (padrão para dispositivos IDE e SCSI), onde as regras que ele cria dependem das sequências de caracteres de identificação armazenadas no próprio dispositivo de CD ou de DVD. O caminho é determinado pelo script <command>path_id</command> do Udev, e as sequências de caracteres de identificação são lidas a partir do hardware pelos aplicativos <command>ata_id</command> ou <command>scsi_id</command> dele, dependendo de qual tipo de dispositivo você tenha.

source: There are advantages to each approach; the correct approach depends on what kinds of device changes may happen. If you expect the physical path to the device (that is, the ports and/or slots that it plugs into) to change, for example because you plan on moving the drive to a different IDE port or a different USB connector, then you should use the <quote>by-id</quote> mode. On the other hand, if you expect the device's identification to change, for example because it may die, and you intend to replace it with a different device that plugs into the same connectors, then you should use the <quote>by-path</quote> mode.
pt_br: Existem vantagens para cada abordagem; a abordagem correta depende de que tipos de mudanças de dispositivo possivelmente aconteçam. Se você espera o caminho físico para o dispositivo (isto é, as portas e (ou) slots aos quais ele se pluga) mudar, por exemplo porque você planeja mover a unidade para uma porta IDE diferente ou um conector USB diferente, então você deveria usar o modo <quote>por-id</quote>. Por outro lado, se você espera que a identificação do dispositivo mude, por exemplo porque ele possivelmente morra, e você pretende substitui-lo por um dispositivo diferente que pluga nos mesmos conectores, então você deveria usar o modo <quote>por-caminho</quote>.

source: If either type of change is possible with your drive, then choose a mode based on the type of change you expect to happen more often.
pt_br: Se ambos os tipos de mudanças são possíveis com a sua unidade, então escolha um modo baseado no tipo de mudança que você espera acontecer mais frequentemente.

source: External devices (for example, a USB-connected CD drive) should not use by-path persistence, because each time the device is plugged into a new external port, its physical path will change. All externally-connected devices will have this problem if you write udev rules to recognize them by their physical path; the problem is not limited to CD and DVD drives.
pt_br: Dispositivos externos (por exemplo, uma unidade de CD conectada via USB) não deveria usar persistência por caminho, porque cada vez que o dispositivo for plugado em uma nova porta externa, o caminho físico dele mudará. Todos os dispositivos conectados externamente terão esse problema se você escrever regras do Udev para reconhecê-los pelo caminho físico deles; o problema não está limitado a unidades de CD e de DVD.

source: If you wish to see the values that the udev scripts will use, then for the appropriate CD-ROM device, find the corresponding directory under <filename class="directory">/sys</filename> (e.g., this can be <filename class="directory">/sys/block/hdd</filename>) and run a command similar to the following:
pt_br: Se você deseja ver os valores que os scripts do Udev usarão, então para o dispositivo apropriado de CD-ROM, encontre o diretório correspondente sob <filename class="directory">/sys</filename> (por exemplo, isso pode ser <filename class="directory">/sys/block/hdd</filename>) e execute um comando similar ao seguinte:

source: Look at the lines containing the output of various *_id programs. The <quote>by-id</quote> mode will use the ID_SERIAL value if it exists and is not empty, otherwise it will use a combination of ID_MODEL and ID_REVISION. The <quote>by-path</quote> mode will use the ID_PATH value.
pt_br: Olhe para as linhas contendo a saída gerada de vários aplicativos *_id. O modo <quote>por-id</quote> usará o valor ID_SERIAL se ele existir e não estiver vazio; do contrário ele usará uma combinação de ID_MODEL e ID_REVISION. O modo <quote>por-caminho</quote> usará o valor ID_PATH.

source: If the default mode is not suitable for your situation, then the following modification can be made to the <filename>/etc/udev/rules.d/83-cdrom-symlinks.rules</filename> file, as follows (where <replaceable>mode</replaceable> is one of <quote>by-id</quote> or <quote>by-path</quote>):
pt_br: Se o modo padrão não for adequado para a sua situação, então a seguinte modificação pode ser feita para o arquivo <filename>/etc/udev/rules.d/83-cdrom-symlinks.rules</filename>, como se segue (onde <replaceable>mode</replaceable> é um de <quote>por-id</quote> ou <quote>por-caminho</quote>):

source: Note that it is not necessary to create the rules files or symlinks at this time because you have bind-mounted the host's <filename class="directory">/dev</filename> directory into the LFS system and we assume the symlinks exist on the host. The rules and symlinks will be created the first time you boot your LFS system.
pt_br: Observe que não é necessário criar os arquivos de regras ou links simbólicos neste momento, porque você montou vinculadamente o diretório do sistema anfitrião <filename class="directory">/dev</filename> dentro do sistema LFS, e nós assumimos que os links simbólicos existem no anfitrião. As regras e links simbólicos serão criados na primeira vez que você inicializar seu sistema LFS.

source: However, if you have multiple CD-ROM devices, then the symlinks generated at that time may point to different devices than they point to on your host because devices are not discovered in a predictable order. The assignments created when you first boot the LFS system will be stable, so this is only an issue if you need the symlinks on both systems to point to the same device. If you need that, then inspect (and possibly edit) the generated <filename>/etc/udev/rules.d/70-persistent-cd.rules</filename> file after booting, to make sure the assigned symlinks match your needs.
pt_br: Entretanto, se você tiver múltiplos dispositivos de CD-ROM, então os links simbólicos gerados naquele momento possivelmente apontem para dispositivos diferentes dos que eles apontam em seu anfitrião, porque os dispositivos não são descobertos em uma ordem previsível. As atribuições criadas quando você inicializar o sistema LFS pela primeira vez serão estáveis, de forma que isso é um problema somente se você precisar dos links simbólicos em ambos os sistemas para apontarem para o mesmo dispositivo. Se você precisar disso, então inspecione (e possivelmente edite) o arquivo <filename>/etc/udev/rules.d/70-persistent-cd.rules</filename> gerado após a inicialização, para ter certeza que os links simbólicos atribuídos correspondem às suas necessidades.

source: Dealing with Duplicate Devices
pt_br: Lidando com Dispositivos Duplicados

source: As explained in <xref linkend="ch-config-udev"/>, the order in which devices with the same function appear in <filename class="directory">/dev</filename> is essentially random. E.g., if you have a USB web camera and a TV tuner, sometimes <filename>/dev/video0</filename> refers to the camera and <filename>/dev/video1</filename> refers to the tuner, and sometimes after a reboot the order changes. For all classes of hardware except sound cards and network cards, this is fixable by creating udev rules to create persistent symlinks. The case of network cards is covered separately in <xref linkend="ch-config-network"/>, and sound card configuration can be found in <ulink url="&blfs-book;postlfs/devices.html">BLFS</ulink>.
pt_br: Como explicado na <xref linkend="ch-config-udev"/>, a ordem na qual dispositivos com a mesma função aparecem em <filename class="directory">/dev</filename> é essencialmente aleatória. Por exemplo, se você tiver uma câmera web USB e um sintonizador de TV, às vezes <filename>/dev/video0</filename> se refere à câmera e <filename>/dev/video1</filename> se refere ao sintonizador; e às vezes depois de uma reinicialização a ordem muda. Para todas as classes de hardware, exceto placas de som e placas de rede de comunicação, isso é corrigível criando-se regras do Udev para criar links simbólicos persistentes. O caso das placas da rede de comunicação é coberto separadamente na <xref linkend="ch-config-network"/>, e configuração de placa de som pode ser encontrado em <ulink url="&blfs-book;postlfs/devices.html">BLFS</ulink>.

source: For each of your devices that is likely to have this problem (even if the problem doesn't exist in your current Linux distribution), find the corresponding directory under <filename class="directory">/sys/class</filename> or <filename class="directory">/sys/block</filename>. For video devices, this may be <filename class="directory">/sys/class/video4linux/video<replaceable>X</replaceable></filename>. Figure out the attributes that identify the device uniquely (usually, vendor and product IDs and/or serial numbers work):
pt_br: Para cada um dos seus dispositivos que é provável ter esse problema (mesmo que o problema não exista em sua distribuição atual Linux), encontre o diretório correspondente sob <filename class="directory">/sys/class</filename> ou <filename class="directory">/sys/block</filename>. Para dispositivos de vídeo, isso possivelmente seja <filename class="directory">/sys/class/video4linux/video<replaceable>X</replaceable></filename>. Descubra os atributos que identificam o dispositivo de maneira única (geralmente, IDs de fornecedor(a) e produto e (ou) números seriais funcionam):

source: Then write rules that create the symlinks, e.g.:
pt_br: Então escreva regras que criam os links simbólicos, por exemplo:

source: <userinput>cat &gt; /etc/udev/rules.d/83-duplicate_devs.rules &lt;&lt; "EOF" <literal> # Persistent symlinks for webcam and tuner KERNEL=="video*", ATTRS{idProduct}=="1910", ATTRS{idVendor}=="0d81", SYMLINK+="webcam" KERNEL=="video*", ATTRS{device}=="0x036f", ATTRS{vendor}=="0x109e", SYMLINK+="tvtuner" </literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/udev/rules.d/83-duplicate_devs.rules &lt;&lt; "EOF" <literal> # Links simbólicos persistentes para webcam e sintonizador KERNEL=="video*", ATTRS{idProduct}=="1910", ATTRS{idVendor}=="0d81", SYMLINK+="webcam" KERNEL=="video*", ATTRS{device}=="0x036f", ATTRS{vendor}=="0x109e", SYMLINK+="tvtuner" </literal> EOF</userinput>

source: The result is that <filename>/dev/video0</filename> and <filename>/dev/video1</filename> devices still refer randomly to the tuner and the web camera (and thus should never be used directly), but there are symlinks <filename>/dev/tvtuner</filename> and <filename>/dev/webcam</filename> that always point to the correct device.
pt_br: O resultado é que os dispositivos <filename>/dev/video0</filename> e <filename>/dev/video1</filename> ainda se referem aleatoriamente ao sintonizador e à câmera web (e, portanto, nunca deveriam ser usados diretamente), mas existem links simbólicos <filename>/dev/tvtuner</filename> e <filename>/dev/webcam</filename> que sempre apontam para o dispositivo correto.
