Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/systemd-custom.po
Languages: pt_br

source: Systemd Usage and Configuration
pt_br: Uso e Configuração do Systemd

source: Systemd Customization
pt_br: Personalização do Systemd

source: Basic Configuration
pt_br: Configuração Básica

source: The <filename>/etc/systemd/system.conf</filename> file contains a set of options to control basic systemd operations. The default file has all entries commented out with the default settings indicated. This file is where the log level may be changed as well as some basic logging settings. See the <filename>systemd-system.conf(5)</filename> manual page for details on each configuration option.
pt_br: O arquivo <filename>/etc/systemd/system.conf</filename> contém um conjunto de opções para controlar as operações básicas do systemd. O arquivo padrão tem todas as entradas comentadas com as configurações padrão indicadas. Esse arquivo é onde o nível de registro possivelmente seja mudado, bem como algumas configurações básicas de registro. Veja-se a página de manual <filename>systemd-system.conf(5)</filename> para detalhes a respeito de cada opção de configuração.

source: Disabling Screen Clearing at Boot Time
pt_br: Desabilitando a Limpeza da Tela em Tempo de Inicialização

source: The normal behavior for systemd is to clear the screen at the end of the boot sequence. If desired, this behavior may be changed by running the following command:
pt_br: O comportamento normal para o systemd é o de limpar a tela ao final da sequência de inicialização. Se desejado, esse comportamento possivelmente seja mudado executando o seguinte comando:

source: The boot messages can always be reviewed by using the <userinput>journalctl -b</userinput> command as the <systemitem class="username">root</systemitem> user.
pt_br: As mensagens de inicialização sempre podem ser revistas usando-se o comando <userinput>journalctl -b</userinput> como o(a) usuário(a) <systemitem class="username">root</systemitem>.

source: Disabling tmpfs for /tmp
pt_br: Desabilitando tmpfs para /tmp

source: By default, <filename class="directory">/tmp</filename> is created as a tmpfs. If this is not desired, it can be overridden by executing the following command:
pt_br: Por padrão, <filename class="directory">/tmp</filename> é criado como um tmpfs. Se isso não for desejado, [então] ele pode ser sobreposto executando-se o seguinte comando:

source: Alternatively, if a separate partition for <filename class="directory">/tmp</filename> is desired, specify that partition in a <filename>/etc/fstab</filename> entry.
pt_br: Alternativamente, se uma partição separada para <filename class="directory">/tmp</filename> for desejada, [então] especifique essa partição em uma entrada do <filename>/etc/fstab</filename>.

source: Do not create the symbolic link above if a separate partition is used for <filename class="directory">/tmp</filename>. This will prevent the root file system (/) from being remounted r/w and make the system unusable when booted.
pt_br: Não crie o link simbólico acima se uma partição separada for usada para o <filename class="directory">/tmp</filename>. Isso impedirá o sistema de arquivos raiz (/) de ser remontado leitura/escrita e tornará o sistema inutilizável quando inicializado.

source: Configuring Automatic File Creation and Deletion
pt_br: Configurando a Criação e Deleção Automática de Arquivo

source: There are several services that create or delete files or directories:
pt_br: Existem vários serviços que criam ou deletam arquivos ou diretórios:

source: The system location for the configuration files is <filename>/usr/lib/tmpfiles.d/*.conf</filename>. The local configuration files are in <filename class="directory">/etc/tmpfiles.d</filename>. Files in <filename class="directory">/etc/tmpfiles.d</filename> override files with the same name in <filename class="directory">/usr/lib/tmpfiles.d</filename>. See <filename>tmpfiles.d(5)</filename> manual page for file format details.
pt_br: O local de sistema para os arquivos de configuração é <filename>/usr/lib/tmpfiles.d/*.conf</filename>. Os arquivos locais de configuração estão em <filename class="directory">/etc/tmpfiles.d</filename>. Os arquivos em <filename class="directory">/etc/tmpfiles.d</filename> sobrepõem os arquivos com o mesmo nome em <filename class="directory">/usr/lib/tmpfiles.d</filename>. Veja-se a página de manual <filename>tmpfiles.d(5)</filename> para detalhes do formato do arquivo.

source: Note that the syntax for the <filename>/usr/lib/tmpfiles.d/*.conf</filename> files can be confusing. For example, the default deletion of files in the /tmp directory is located in <filename>/usr/lib/tmpfiles.d/tmp.conf</filename> with the line: <placeholder type="screen" id="0"/> The type field, q, discusses creating a subvolume with quotas which is really only applicable to btrfs filesystems. It references type v which in turn references type d (directory). This then creates the specified directory if it is not present and adjusts the permissions and ownership as specified. Contents of the directory will be subject to time based cleanup if the age argument is specified.
pt_br: Observe que a sintaxe para os arquivos <filename>/usr/lib/tmpfiles.d/*.conf</filename> pode ser confusa. Por exemplo, a deleção padrão de arquivos no diretório /tmp está localizada em <filename>/usr/lib/tmpfiles.d/tmp.conf</filename> com a linha: <placeholder type="screen" id="0"/> O campo tipo, q, discute criar um sub-volume com cotas, o qual realmente é aplicável somente para sistemas de arquivos btrfs. Ele referencia tipo v, o qual sequencialmente referencia tipo d (diretório). Isso então cria o diretório especificado se ele não estiver presente e ajusta as permissões e propriedade como especificado. O conteúdo do diretório estará sujeito a limpeza baseada em hora se o argumento idade for especificado.

source: If the default parameters are not desired, then the file should be copied to <filename class="directory">/etc/tmpfiles.d</filename> and edited as desired. For example: <placeholder type="screen" id="0"/>
pt_br: Se os parâmetros padrão não forem desejados, então o arquivo deveria ser copiado para <filename class="directory">/etc/tmpfiles.d</filename> e editado conforme desejado. Por exemplo: <placeholder type="screen" id="0"/>

source: Overriding Default Services Behavior
pt_br: Sobrepondo o Comportamento Padrão de Serviços

source: The parameters of a unit can be overridden by creating a directory and a configuration file in <filename class="directory">/etc/systemd/system</filename>. For example:
pt_br: Os parâmetros de uma unidade podem ser sobrepostos criando-se um diretório e um arquivo de configuração em <filename class="directory">/etc/systemd/system</filename>. Por exemplo:

source: See <filename>systemd.unit(5)</filename> manual page for more information. After creating the configuration file, run <userinput>systemctl daemon-reload</userinput> and <userinput>systemctl restart foobar</userinput> to activate the changes to a service.
pt_br: Veja-se a página de manual <filename>systemd.unit(5)</filename> para mais informação. Depois de criar o arquivo de configuração, execute <userinput>systemctl daemon-reload</userinput> e <userinput>systemctl restart foobar</userinput> para ativar as mudanças para um serviço.

source: Debugging the Boot Sequence
pt_br: Depurando a Sequência de Inicialização

source: Rather than plain shell scripts used in SysVinit or BSD style init systems, systemd uses a unified format for different types of startup files (or units). The command <command>systemctl</command> is used to enable, disable, control state, and obtain status of unit files. Here are some examples of frequently used commands:
pt_br: Em vez de scripts planos de shell usados nos sistemas de inicialização estilo SysVinit ou BSD, o systemd usa um formato unificado para tipos diferentes dos arquivos de inicialização (ou unidades). O comando <command>systemctl</command> é usado para habilitar; desabilitar; controlar estado; e obter a situação dos arquivos de unidade. Aqui estão alguns exemplos dos comandos frequentemente usados:

source: <command>systemctl list-units -t <replaceable>&lt;service&gt;</replaceable> [--all]</command>: lists loaded unit files of type service.
pt_br: <command>systemctl list-units -t <replaceable>&lt;serviço&gt;</replaceable> [--all]</command>: lista os arquivos carregados de unidade do tipo serviço.

source: <command>systemctl list-units -t <replaceable>&lt;target&gt;</replaceable> [--all]</command>: lists loaded unit files of type target.
pt_br: <command>systemctl list-units -t <replaceable>&lt;alvo&gt;</replaceable> [--all]</command>: lista os arquivos carregados de unidade do tipo alvo.

source: <command>systemctl show -p Wants <replaceable>&lt;multi-user.target&gt;</replaceable></command>: shows all units that depend on the multi-user target. Targets are special unit files that are analogous to runlevels under SysVinit.
pt_br: <command>systemctl show -p Wants <replaceable>&lt;multi-user.target&gt;</replaceable></command>: mostra todas as unidades que dependem do alvo multi-user. Alvos são arquivos especiais de unidade que são análogos a níveis de execução sob o SysVinit.

source: <command>systemctl status <replaceable>&lt;servicename.service&gt;</replaceable></command>: shows the status of the servicename service. The .service extension can be omitted if there are no other unit files with the same name, such as .socket files (which create a listening socket that provides similar functionality to inetd/xinetd).
pt_br: <command>systemctl status <replaceable>&lt;nome_serviço.service&gt;</replaceable></command>: mostra a situação do serviço nome_serviço. A extensão .service pode ser omitida se não existirem outros arquivos de unidade com o mesmo nome, tais como arquivos .socket (os quais criam um soquete de escuta que fornece funcionalidade similar ao inetd/xinetd).

source: Working with the Systemd Journal
pt_br: Trabalhando com o Diário do Systemd

source: Logging on a system booted with systemd is handled with systemd-journald (by default), rather than a typical unix syslog daemon. You can also add a normal syslog daemon and have both operate side by side if desired. The systemd-journald program stores journal entries in a binary format rather than a plain text log file. To assist with parsing the file, the command <command>journalctl</command> is provided. Here are some examples of frequently used commands:
pt_br: O registro em um sistema inicializado com o systemd é manuseado com o systemd-journald (por padrão), em vez de um processo de segundo plano típico do Unix syslog. Você também pode adicionar um processo de segundo plano normal syslog e ter ambos operando lado a lado se desejado. O aplicativo systemd-journald armazena entradas de diário em um formato binário, em vez de um arquivo plano de registro de texto. Para auxiliar na análise do arquivo, o comando <command>journalctl</command> é fornecido. Aqui estão alguns exemplos dos comandos frequentemente usados:

source: <command>journalctl -r</command>: shows all contents of the journal in reverse chronological order.
pt_br: <command>journalctl -r</command>: mostra todo o conteúdo do diário em ordem cronológica reversa.

source: <command>journalctl -u <replaceable>UNIT</replaceable></command>: shows the journal entries associated with the specified UNIT file.
pt_br: <command>journalctl -u <replaceable>UNIDADE</replaceable></command>: mostra as entradas de diário associadas com o arquivo especificado de UNIDADE.

source: <command>journalctl -b[=ID] -r</command>: shows the journal entries since last successful boot (or for boot ID) in reverse chronological order.
pt_br: <command>journalctl -b[=ID] -r</command>: mostra as entradas de diário desde a mais recente inicialização bem sucedida (ou para a ID de inicialização) em ordem cronológica reversa.

source: <command>journalctl -f</command>: provides functionality similar to tail -f (follow).
pt_br: <command>journalctl -f</command>: fornece funcionalidade similar ao tail -f (seguir).

source: Working with Core Dumps
pt_br: Trabalhando com Despejos de Núcleo

source: Core dumps are useful to debug crashed programs, especially when a daemon process crashes. On systemd booted systems the core dumping is handled by <command>systemd-coredump</command>. It will log the core dump in the journal and store the core dump itself in <filename class="directory">/var/lib/systemd/coredump</filename>. To retrieve and process core dumps, the <command>coredumpctl</command> tool is provided. Here are some examples of frequently used commands:
pt_br: Despejos de núcleo são úteis para depurar aplicativos quebrados, especialmente quando um processo de aplicativo de segundo plano quebra. Em sistemas inicializados do systemd, o despejamento de núcleo é manuseado pelo <command>systemd-coredump</command>. Ele registrará o despejo de núcleo no diário e armazenará o próprio despejo de núcleo em <filename class="directory">/var/lib/systemd/coredump</filename>. Para recuperar e processar despejos de núcleo, a ferramenta <command>coredumpctl</command> é fornecida. Aqui estão alguns exemplos de comandos frequentemente usados:

source: <command>coredumpctl -r</command>: lists all core dumps in reverse chronological order.
pt_br: <command>coredumpctl -r</command>: lista todos os despejos de núcleo em ordem cronológica reversa.

source: <command>coredumpctl -1 info</command>: shows the information from the last core dump.
pt_br: <command>coredumpctl -1 info</command>: mostra a informação a partir do mais recente despejo de núcleo.

source: <command>coredumpctl -1 debug</command>: loads the last core dump into <ulink url="&blfs-book;general/gdb.html">GDB</ulink>.
pt_br: <command>coredumpctl -1 debug</command>: carrega o mais recente despejo de núcleo no <ulink url="&blfs-book;general/gdb.html">GDB</ulink>.

source: Core dumps may use a lot of disk space. The maximum disk space used by core dumps can be limited by creating a configuration file in <filename class="directory">/etc/systemd/coredump.conf.d</filename>. For example:
pt_br: Despejos de núcleo possivelmente usem um monte de espaço em disco. O espaço máximo em disco usado por despejos de núcleo pode ser limitado criando-se um arquivo de configuração em <filename class="directory">/etc/systemd/coredump.conf.d</filename>. Por exemplo:

source: See the <filename>systemd-coredump(8)</filename>, <filename>coredumpctl(1)</filename>, and <filename>coredump.conf.d(5)</filename> manual pages for more information.
pt_br: Vejam-se as páginas de manual <filename>systemd-coredump(8)</filename>; <filename>coredumpctl(1)</filename>; e <filename>coredump.conf.d(5)</filename> para mais informação.

source: Long Running Processes
pt_br: Processos de Execução Longa

source: Beginning with systemd-230, all user processes are killed when a user session is ended, even if nohup is used, or the process uses the <function>daemon()</function> or <function>setsid()</function> functions. This is a deliberate change from a historically permissive environment to a more restrictive one. The new behavior may cause issues if you depend on long running programs (e.g., <command>screen</command> or <command>tmux</command>) to remain active after ending your user session. There are three ways to enable lingering processes to remain after a user session is ended.
pt_br: Iniciando com o systemd-230, todos os processos de usuário(a) são finalizados quando uma sessão de usuário(a) for terminada, mesmo se nohup for usado ou o processo usar as funções <function>daemon()</function> ou <function>setsid()</function>. Isso é uma mudança deliberada de um ambiente historicamente permissivo para um mais restritivo. O novo comportamento possivelmente cause problemas se você depender de aplicativos de execução longa (por exemplo, <command>screen</command> ou <command>tmux</command>) para continuarem ativos depois de terminar sua sessão de usuário(a). Existem três maneiras de habilitar processos persistentes para continuarem depois que uma sessão de usuário(a) for terminada.

source: <emphasis>Enable process lingering for only selected users</emphasis>: Normal users have permission to enable process lingering with the command <command>loginctl enable-linger</command> for their own user. System administrators can use the same command with a <parameter>user</parameter> argument to enable for a user. That user can then use the <command>systemd-run</command> command to start long running processes. For example: <command>systemd-run --scope --user /usr/bin/screen</command>. If you enable lingering for your user, the user@.service will remain even after all login sessions are closed, and will automatically start at system boot. This has the advantage of explicitly allowing and disallowing processes to run after the user session has ended, but breaks backwards compatibility with tools like <command>nohup</command> and utilities that use <function>daemon()</function>.
pt_br: <emphasis>Habilitar persistência de processo somente para usuários(as) selecionados(as)</emphasis>: Usuários(as) normais tem permissão para habilitar persistência de processo com o comando <command>loginctl enable-linger</command> para os(as) próprios(as) usuários(as) deles(as). Administradores(as) do sistema podem usar o mesmo comando com um argumento <parameter>user</parameter> ao habilitar para um(a) usuário(a). Esse(a) usuário(a) consegue então usar o comando <command>systemd-run</command> para iniciar processos de execução longa. Por exemplo: <command>systemd-run --scope --user /usr/bin/screen</command>. Se você habilitar a persistência para seu(ua) usuário(a), [então] a user@.service continuará, mesmo depois que todas as sessões de login forem fechadas e automaticamente iniciará na inicialização do sistema. Isso tem a vantagem de explicitamente permitir e proibir processos para execução depois que a sessão de usuário(a) tenha terminado, porém quebra retrocompatibilidade com ferramentas como <command>nohup</command> e utilitários que usam <function>daemon()</function>.

source: <emphasis>Enable system-wide process lingering</emphasis>: You can set <parameter>KillUserProcesses=no</parameter> in <filename>/etc/systemd/logind.conf</filename> to enable process lingering globally for all users. This has the benefit of leaving the old method available to all users at the expense of explicit control.
pt_br: <emphasis>Habilitar persistência de processo abrangente ao sistema</emphasis>: Você pode configurar <parameter>KillUserProcesses=no</parameter> em <filename>/etc/systemd/logind.conf</filename> para habilitar a persistência de processo globalmente para todos(as) os(as) usuários(as). Isso tem o benefício de deixar o método antigo disponível para todos(as) os(as) usuários(as) à custa do controle explícito.

source: <emphasis>Disable at build-time</emphasis>: You can disable lingering by default while building systemd by adding the switch <parameter>-Ddefault-kill-user-processes=false</parameter> to the <command>meson</command> command for systemd. This completely disables the ability of systemd to kill user processes at session end.
pt_br: <emphasis>Desabilitar em tempo de construção</emphasis>: Você pode desabilitar a persistência por padrão enquanto construir o systemd adicionando a chave <parameter>-Ddefault-kill-user-processes=false</parameter> ao comando <command>meson</command> para o systemd. Isso desabilita completamente a habilidade do systemd para finalizar processos de usuário(a) ao fim da sessão.
