Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/theend.po
Languages: fr

source: The End
fr: Fin

source: Well done! The new LFS system is installed! We wish you much success with your shiny new custom-built Linux system.
fr: Bien joué&nbsp;! Le nouveau système LFS est installé&nbsp;! Nous vous souhaitons de bien vous amuser avec votre tout nouveau système Linux fabriqué sur mesure.

source: It may be a good idea to create an <filename>/etc/lfs-release</filename> file. By having this file, it is very easy for you (and for us if you need to ask for help at some point) to find out which LFS version is installed on the system. Create this file by running:
fr: Il est recommandé de créer le fichier <filename>/etc/lfs-release</filename>. Avec ce fichier, il vous est très facile (ainsi que pour nous si vous avez besoin de demander de l'aide) de savoir quelle version de LFS vous avez installé sur votre système. Créez ce fichier en lançant&nbsp;:

source: Two files describing the installed system may be used by packages that will be installed on the system, either in binary form or by building them.
fr: Certains paquets que vous installerez sur votre système pourront utiliser deux fichiers décrivant le système installé, soit sous forme binaire, soit à la construction.

source: The first one shows the status of your new system with respect to the Linux Standards Base (LSB). To create this file, run:
fr: Le premier affiche l'état de votre nouveau système, en respectant la Linux Standards Base (LSB). Pour créer ce fichier, lancez&nbsp;:

source: <userinput>cat &gt; /etc/lsb-release &lt;&lt; "EOF" DISTRIB_ID="Linux From Scratch" DISTRIB_RELEASE="&version;" DISTRIB_CODENAME="&lt;your name here&gt;" DISTRIB_DESCRIPTION="Linux From Scratch" EOF</userinput>
fr: <userinput>cat &gt; /etc/lsb-release &lt;&lt; "EOF" DISTRIB_ID="Linux From Scratch" DISTRIB_RELEASE="&version;" DISTRIB_CODENAME="&lt;votre nom ici&gt;" DISTRIB_DESCRIPTION="Linux From Scratch" EOF</userinput>

source: <userinput>cat &gt; /etc/lsb-release &lt;&lt; "EOF" DISTRIB_ID="Linux From Scratch" DISTRIB_RELEASE="&versiond;" DISTRIB_CODENAME="&lt;your name here&gt;" DISTRIB_DESCRIPTION="Linux From Scratch" EOF</userinput>
fr: <userinput>cat &gt; /etc/lsb-release &lt;&lt; "EOF" DISTRIB_ID="Linux From Scratch" DISTRIB_RELEASE="&versiond;" DISTRIB_CODENAME="&lt;votre nom ici&gt;" DISTRIB_DESCRIPTION="Linux From Scratch" EOF</userinput>

source: The second one contains roughly the same information, and is used by systemd and some graphical desktop environments. To create this file, run:
fr: Le deuxième contient à peu près les mêmes informations et est utilisé par systemd et certains environnements de bureau. Pour créer ce fichier, lancez&nbsp;:

source: <userinput>cat &gt; /etc/os-release &lt;&lt; "EOF" NAME="Linux From Scratch" VERSION="&version;" ID=lfs PRETTY_NAME="Linux From Scratch &version;" VERSION_CODENAME="&lt;your name here&gt;" EOF</userinput>
fr: <userinput>cat &gt; /etc/os-release &lt;&lt; "EOF" NAME="Linux From Scratch" VERSION="&version;" ID=lfs PRETTY_NAME="Linux From Scratch &version;" VERSION_CODENAME="&lt;votre nom ici&gt;" EOF</userinput>

source: <userinput>cat &gt; /etc/os-release &lt;&lt; "EOF" NAME="Linux From Scratch" VERSION="&versiond;" ID=lfs PRETTY_NAME="Linux From Scratch &versiond;" VERSION_CODENAME="&lt;your name here&gt;" EOF</userinput>
fr: <userinput>cat &gt; /etc/os-release &lt;&lt; "EOF" NAME="Linux From Scratch" VERSION="&versiond;" ID=lfs PRETTY_NAME="Linux From Scratch &versiond;" VERSION_CODENAME="&lt;votre nom ici&gt;" EOF</userinput>

source: Be sure to put some sort of customization for the fields 'DISTRIB_CODENAME' and 'VERSION_CODENAME' to make the system uniquely yours.
fr: Assurez-vous de personnaliser les champs «&nbsp;DISTRIB_CODENAME&nbsp;» et «&nbsp;VERSION_CODENAME&nbsp;» pour que ce système ne soit que le vôtre.
