Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/udev.po
Languages: fr, pt_br

source: Udev will only load a module if it has a bus-specific alias and the bus driver properly exports the necessary aliases to <systemitem class="filesystem">sysfs</systemitem>. In other cases, one should arrange module loading by other means. With Linux-&linux-version;, udev is known to load properly-written drivers for INPUT, IDE, PCI, USB, SCSI, SERIO, and FireWire devices.
fr: Udev ne chargera un module que s'il possède un alias spécifique au bus et que le pilote du bus envoie correctement les alias nécessaires vers <systemitem class="filesystem">sysfs</systemitem>. Autrement, il faut organiser le chargement des modules par d'autres moyens. Avec Linux-&linux-version;, udev est connu pour charger les pilotes correctement écrits pour les périphériques INPUT, IDE, PCI, USB, SCSI, SERIO et FireWire.
pt_br: O Udev só carregará um módulo se ele tiver um apelido específico de barramento e o controlador de barramento exportar adequadamente os apelidos necessários para <systemitem class="filesystem">sysfs</systemitem>. Em outros casos, deve-se organizar o carregamento de módulo por outros meios. Com o Linux-&linux-version;, o Udev é conhecido por carregar controladores escritos adequadamente para dispositivos INPUT, IDE, PCI, USB, SCSI, SERIO e FireWire.

source: To determine if the device driver you require has the necessary support for udev, run <command>modinfo</command> with the module name as the argument. Now try locating the device directory under <filename class="directory">/sys/bus</filename> and check whether there is a <filename>modalias</filename> file there.
fr: Pour déterminer si le pilote du périphérique dont vous avez besoin prend en charge udev, lancez <command>modinfo</command> avec le nom du module en argument. Puis, essayez de localiser le répertoire du périphérique sous <filename class="directory">/sys/bus</filename> et vérifiez s'il y a un fichier <filename>modalias</filename>.
pt_br: Para determinar se o controlador de dispositivo que você exige tem o suporte necessário para o Udev, execute <command>modinfo</command> com o nome do módulo como o argumento. Agora tente localizar o diretório do dispositivo sob <filename class="directory">/sys/bus</filename> e verifique se existe um arquivo <filename>modalias</filename> lá.

source: If the <filename>modalias</filename> file exists in <systemitem class="filesystem">sysfs</systemitem>, the driver supports the device and can talk to it directly, but doesn't have the alias, it is a bug in the driver. Load the driver without the help from udev and expect the issue to be fixed later.
fr: Si le fichier <filename>modalias</filename> existe dans <systemitem class="filesystem">sysfs</systemitem>, alors le pilote prend en charge le périphérique et peut lui parler directement, mais s'il n'a pas d'alias, c'est un bogue dans le pilote. Chargez le pilote sans l'aide d'udev et attendez que le problème soit corrigé ultérieurement.
pt_br: Se o arquivo <filename>modalias</filename> existir em <systemitem class="filesystem">sysfs</systemitem>, [então] o controlador suporta o dispositivo e pode falar com ele diretamente, mas não tem o apelido, isso é um defeito no controlador. Carregue o controlador sem a ajuda do Udev e espere que o problema seja corrigido posteriormente.

source: If there is no <filename>modalias</filename> file in the relevant directory under <filename class="directory">/sys/bus</filename>, this means that the kernel developers have not yet added modalias support to this bus type. With Linux-&linux-version;, this is the case with ISA busses. Expect this issue to be fixed in later kernel versions.
fr: S'il n'y a pas de fichier <filename>modalias</filename> dans le bon répertoire sous <filename class="directory">/sys/bus</filename>, cela signifie que les développeurs du noyau n'ont pas encore ajouté de prise en charge de modalias à ce type de bus. Avec Linux-&linux-version;, c'est le cas pour les bus ISA. Attendez que ce problème soit corrigé dans les versions ultérieures du noyau.
pt_br: Se não existir arquivo <filename>modalias</filename> no diretório relevante sob <filename class="directory">/sys/bus</filename>, [então] isso significa que os(as) desenvolvedores(as) do núcleo ainda não adicionaram suporte modalias para esse tipo de barramento. Com o Linux-&linux-version;, esse é o caso com barramentos ISA. Espere que esse problema seja corrigido em versões posteriores do núcleo.

source: Udev is not intended to load <quote>wrapper</quote> drivers such as <emphasis>snd-pcm-oss</emphasis> and non-hardware drivers such as <emphasis>loop</emphasis> at all.
fr: Udev n'a pas du tout pour but de charger des pilotes <quote>wrapper</quote> (qui emballent un autre pilote) comme <emphasis>snd-pcm-oss</emphasis> et des pilotes non matériels comme <emphasis>loop</emphasis>.
pt_br: O Udev não é destinado para carregar controladores <quote>encapsuladores</quote>, tais como <emphasis>snd-pcm-oss</emphasis>, e controladores de não hardware, tais como <emphasis>loop</emphasis>, de maneira alguma.

source: A Kernel Module Is Not Loaded Automatically, and Udev Is Not Intended to Load It
fr: Un module du noyau n'est pas chargé automatiquement et udev n'est pas prévu pour le charger
pt_br: Um Módulo do Núcleo Não é Carregado Automaticamente e o Udev Não é Destinado para Carregá-lo

source: If the <quote>wrapper</quote> module only enhances the functionality provided by some other module (e.g., <emphasis>snd-pcm-oss</emphasis> enhances the functionality of <emphasis>snd-pcm</emphasis> by making the sound cards available to OSS applications), configure <command>modprobe</command> to load the wrapper after udev loads the wrapped module. To do this, add a <quote>softdep</quote> line to the corresponding <filename>/etc/modprobe.d/<replaceable>&lt;filename&gt;</replaceable>.conf</filename> file. For example:
fr: Si le module <quote>enveloppe</quote> n'améliore que la fonctionnalité fournie par un autre module (comme <emphasis>snd-pcm-oss</emphasis> améliore la fonctionnalité de <emphasis>snd-pcm</emphasis> en rendant les cartes son disponibles pour les applications OSS), configurez <command>modprobe</command> pour charger l'enveloppe après qu'udev a chargé le module enveloppé. Pour cela, ajoutez une ligne <quote>softdep</quote> dans tous les fichiers <filename>/etc/modprobe.d/<replaceable>&lt;filename&gt;</replaceable>.conf</filename>. Par exemple&nbsp;:
pt_br: Se o módulo <quote>encapsulador</quote> somente aprimora a funcionalidade fornecida por algum outro módulo (por exemplo, <emphasis>snd-pcm-oss</emphasis> aprimora a funcionalidade de <emphasis>snd-pcm</emphasis> tornando as placas de som disponíveis para aplicações OSS), [então] configure o <command>modprobe</command> para carregar o encapsulador depois que o Udev carregar o módulo encapsulado. Para fazer isso, adicione uma linha <quote>softdep</quote> ao arquivo <filename>/etc/modprobe.d/<replaceable>&lt;nome_arquivo&gt;</replaceable>.conf</filename> correspondente. Por exemplo:

source: Note that the <quote>softdep</quote> command also allows <literal>pre:</literal> dependencies, or a mixture of both <literal>pre:</literal> and <literal>post:</literal> dependencies. See the <filename>modprobe.d(5)</filename> manual page for more information on <quote>softdep</quote> syntax and capabilities.
fr: Remarquez que la commande <quote>softdep</quote> autorise aussi les dépendances <literal>pre:</literal>, ou un mélange de <literal>pre:</literal> et de <literal>post:</literal>. Voir la page de manuel de <filename>modprobe.d(5)</filename> pour plus d'informations sur la syntaxe et les possibilités de <quote>softdep</quote>.
pt_br: Observe que o comando <quote>softdep</quote> também permite dependências <literal>pre:</literal>, ou uma mistura de ambas as dependências <literal>pre:</literal> e <literal>post:</literal>. Veja-se a página de manual <filename>modprobe.d(5)</filename> para mais informação a respeito da sintaxe e recursos <quote>softdep</quote>.

source: If the module in question is not a wrapper and is useful by itself, configure the <command>modules</command> bootscript to load this module on system boot. To do this, add the module name to the <filename>/etc/sysconfig/modules</filename> file on a separate line. This works for wrapper modules too, but is suboptimal in that case.
fr: Si le module en question n'est pas un emballage et s'avère utile en tant que tel, configurez le script de démarrage <command>modules</command> pour charger ce module sur le système de démarrage. Pour cela, ajoutez le nom du module au fichier <filename>/etc/sysconfig/modules</filename> sur une ligne séparée. Ceci fonctionne aussi pour les modules d'emballage, mais sans être optimal.
pt_br: Se o módulo em questão não é um encapsulador e é útil por ele próprio, [então] configure o script de inicialização <command>modules</command> para carregar esse módulo na inicialização do sistema. Para fazer isso, adicione o nome do módulo ao arquivo <filename>/etc/sysconfig/modules</filename> em uma linha separada. Isso funciona para módulos encapsuladores também, mas é abaixo do ideal nesse caso.

source: Udev Loads Some Unwanted Module
fr: Udev charge un module indésirable
pt_br: O Udev Carrega Algum Módulo Indesejado

source: Either don't build the module, or blacklist it in a <filename>/etc/modprobe.d/blacklist.conf</filename> file as done with the <emphasis>forte</emphasis> module in the example below:
fr: Ne compilez pas le module, ou mettez-le en liste noire dans un fichier <filename>/etc/modprobe.d/blacklist.conf</filename> comme réalisé avec le module <emphasis>forte</emphasis> dans l'exemple ci-dessous&nbsp;:
pt_br: Ou não construa o módulo, ou coloque-o na lista negra em um arquivo <filename>/etc/modprobe.d/blacklist.conf</filename> como feito com o módulo <emphasis>forte</emphasis> no exemplo abaixo:

source: Blacklisted modules can still be loaded manually with the explicit <command>modprobe</command> command.
fr: Les modules en liste noire peuvent toujours être chargés manuellement avec la commande explicite <command>modprobe</command>.
pt_br: Módulos em listas negras ainda podem ser carregados manualmente com o comando explícito <command>modprobe</command>.

source: Udev Creates a Device Incorrectly, or Makes the Wrong Symlink
fr: Udev crée un périphérique incorrect, ou un mauvais lien symbolique
pt_br: O Udev Cria um Dispositivo Incorretamente ou Faz o Link Simbólico Errado

source: This usually happens if a rule unexpectedly matches a device. For example, a poorly-written rule can match both a SCSI disk (as desired) and the corresponding SCSI generic device (incorrectly) by vendor. Find the offending rule and make it more specific, with the help of the <command>udevadm info</command> command.
fr: Cela se produit habituellement si une règle correspond à un périphérique de façon imprévue. Par exemple, une règle lacunaire peut correspondre à un disque SCSI (comme désiré) et au périphérique SCSI générique du même fabricant (de façon incorrecte). Trouvez la règle défectueuse et affinez-la, à l'aide de la commande <command>udevadm info</command>.
pt_br: Isso geralmente acontece se uma regra inesperadamente corresponder com um dispositivo. Por exemplo, uma regra mal escrita pode corresponder com ambos um disco SCSI (como desejado) e o dispositivo genérico SCSI correspondente (incorretamente) por fornecedor(a). Encontre a regra infratora e torne-a mais específica, com a ajuda do comando <command>udevadm info</command>.

source: Udev Rule Works Unreliably
fr: Une règle Udev fonctionne de manière non fiable
pt_br: Regra do Udev Funciona de Forma Não Confiável

source: This may be another manifestation of the previous problem. If not, and your rule uses <systemitem class="filesystem">sysfs</systemitem> attributes, it may be a kernel timing issue, to be fixed in later kernels. For now, you can work around it by creating a rule that waits for the used <systemitem class="filesystem">sysfs</systemitem> attribute and appending it to the <filename>/etc/udev/rules.d/10-wait_for_sysfs.rules</filename> file (create this file if it does not exist). Please notify the LFS Development list if you do so and it helps.
fr: Cela peut être une autre manifestation du problème précédent. Si ce n'est pas le cas, et si votre règle utilise les attributs de <systemitem class="filesystem">sysfs</systemitem>, il se peut que ce soit un problème de timing du noyau, sur le point d'être corrigé dans les noyaux ultérieurs. Pour le moment, vous pouvez contourner cela en créant une règle qui attend l'attribut <systemitem class="filesystem">sysfs</systemitem> utilisé et en le mettant dans le fichier <filename>/etc/udev/rules.d/10-wait_for_sysfs.rules</filename> (créez ce fichier s'il n'existe pas). Merci d'informer la liste de développement de LFS si vous faites ainsi et que cela vous aide.
pt_br: Isso possivelmente seja outra manifestação do problema anterior. Se não, e sua regra usar atributos do <systemitem class="filesystem">sysfs</systemitem>, [então] isso possivelmente seja um problema de temporização do núcleo, a ser corrigido em núcleos posteriores. Por hora, você pode contorná-lo criando uma regra que aguarda o atributo usado do <systemitem class="filesystem">sysfs</systemitem> e o adiciona ao arquivo <filename>/etc/udev/rules.d/10-wait_for_sysfs.rules</filename> (crie esse arquivo se ele não existir). Por favor, notifique a lista LFS Development se você o fizer e isso ajudar.

source: Udev Does Not Create a Device
fr: Udev ne crée pas de périphérique
pt_br: O Udev Não Cria um Dispositivo

source: First, be certain that the driver is built into the kernel or already loaded as a module, and that udev isn't creating a misnamed device.
fr: Les textes suivants supposent que le pilote est compilé statiquement dans le noyau ou bien déjà chargé comme module et que vous avez vérifié que udev ne crée pas de périphérique mal nommé.
pt_br: Primeiro, esteja certo(a) de que o driver está construído internamente no núcleo ou já carregado como um módulo e que o Udev não está criando um dispositivo mal nomeado.

source: If a kernel driver does not export its data to <systemitem class="filesystem">sysfs</systemitem>, udev lacks the information needed to create a device node. This is most likely to happen with third party drivers from outside the kernel tree. Create a static device node in <filename>/usr/lib/udev/devices</filename> with the appropriate major/minor numbers (see the file <filename>devices.txt</filename> inside the kernel documentation or the documentation provided by the third party driver vendor). The static device node will be copied to <filename class="directory">/dev</filename> by <command>udev</command>.
fr: Udev n'a pas les informations pour créer un nœud si un pilote noyau n'exporte pas ses informations vers <systemitem class="filesystem">sysfs</systemitem>. C'est le plus souvent le cas des pilotes tiers ne provenant pas du noyau. Créez un nœud de périphérique statique dans <filename>/usr/lib/udev/devices</filename> avec les numéros majeurs/mineurs appropriés (regardez le fichier <filename>devices.txt</filename> dans la documentation du noyau du vendeur du pilote tiers). Le nœud statique sera copié dans <filename class="directory">/dev</filename> par <command>udev</command>.
pt_br: Se um controlador do núcleo não exportar os dados dele para o <systemitem class="filesystem">sysfs</systemitem>, [então] o Udev carece da informação necessária para criar um nó de dispositivo. Isso é mais provável de acontecer com controladores terceirizados oriundos de fora da árvore do núcleo. Crie um nó de dispositivo estático em <filename>/usr/lib/udev/devices</filename> com os números maior/menor apropriados (veja-se o arquivo <filename>devices.txt</filename> dentro da documentação do núcleo ou a documentação fornecida pelo(a) fornecedor(a) do controlador terceirizado). O nó de dispositivo estático será copiado para <filename class="directory">/dev</filename> pelo <command>udev</command>.

source: Device Naming Order Changes Randomly After Rebooting
fr: L'ordre de nommage des périphériques change de manière aléatoire après le redémarrage
pt_br: A Ordem de Nomenclatura do Dispositivo Muda Aleatoriamente Depois de Reinicializar

source: This is due to the fact that udev, by design, handles uevents and loads modules in parallel, and thus in an unpredictable order. This will never be <quote>fixed</quote>. You should not rely upon the kernel device names being stable. Instead, create your own rules that make symlinks with stable names based on some stable attributes of the device, such as a serial number or the output of various *_id utilities installed by udev. See <xref linkend="ch-config-symlinks"/> and <xref linkend="ch-config-network"/> for examples.
fr: Cela est dû au fait qu'udev, par nature, gère les uevents et charge les modules en parallèle, donc dans un ordre imprévisible. Cela ne sera jamais <quote>corrigé</quote>. Vous ne devriez pas supposer que les noms des périphériques du noyau sont stables. Créez plutôt vos propres règles qui rendent les liens symboliques stables basés sur des attributs stables du périphérique, comme une série de nombres ou la sortie de divers utilitaires *_id installés par udev. Voir la <xref linkend="ch-config-symlinks"/> et la <xref linkend="ch-config-network"/> pour des exemples.
pt_br: Isso é devido ao fato de o Udev, pelo projeto, lidar com uevents e carregar módulos em paralelo e, assim, em uma ordem imprevisível. Isso nunca será <quote>corrigido</quote>. Você não deveria confiar nos nomes de dispositivos do núcleo sendo estáveis. Em vez disso, crie suas próprias regras que fazem links simbólicos com nomes estáveis baseados em alguns atributos estáveis do dispositivo, tais como um número de série ou a saída gerada dos vários utilitários *_id instalados pelo Udev. Veja-se a <xref linkend="ch-config-symlinks"/> e <xref linkend="ch-config-network"/> para exemplos.

source: Useful Reading
fr: Lecture utile
pt_br: Leitura Útil

source: Additional helpful documentation is available at the following sites:
fr: Des documentations supplémentaires sont disponibles sur les sites suivants&nbsp;:
pt_br: Documentação útil adicional está disponível nos seguintes sítios:

source: A Userspace Implementation of <systemitem class="filesystem">devfs</systemitem> <ulink url="http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf"/>
fr: A Userspace Implementation of <systemitem class="filesystem">devfs</systemitem> <ulink url="http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf"/> (NdT&nbsp;: Une implémentation en espace utilisateur de devfs)
pt_br: Uma implementação de espaço de usuário(a) do <systemitem class="filesystem">devfs</systemitem> <ulink url="http://www.kroah.com/linux/talks/ols_2003_udev_paper/Reprint-Kroah-Hartman-OLS2003.pdf"/>

source: The <systemitem class="filesystem">sysfs</systemitem> Filesystem <ulink url="https://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf"/>
fr: The <systemitem class="filesystem">sysfs</systemitem> Filesystem <ulink url="https://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf"/> (NdT&nbsp;: Le système de fichiers <systemitem class="filesystem">sysfs</systemitem>)
pt_br: O Sistema de Arquivos <systemitem class="filesystem">sysfs</systemitem> <ulink url="http://www.kernel.org/pub/linux/kernel/people/mochel/doc/papers/ols-2005/mochel.pdf"/>

source: In <xref linkend="chapter-building-system"/>, we installed the udev daemon when <phrase revision="sysv">eudev</phrase> <phrase revision="systemd">systemd</phrase> was built. Before we go into the details regarding how udev works, a brief history of previous methods of handling devices is in order.
pt_br: No <xref linkend="chapter-building-system"/>, nós instalamos o processo de segundo plano Udev quando <phrase revision="sysv">eudev</phrase> <phrase revision="systemd">systemd</phrase> foi construído. Antes de entrarmos nos detalhes referentes a como o Udev funciona, um histórico breve dos métodos anteriores de manuseio de dispositivos é oportuno.
