Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/udev.po
Languages: fr, pt_br

source: Overview of Device and Module Handling
fr: Manipulation des périphériques et modules
pt_br: Visão Geral do Manuseio de Dispositivo e de Módulo

source: usage
fr: utilisation
pt_br: uso

source: In <xref linkend="chapter-building-system"/>, we installed the udev daemon when <phrase revision="sysv">udev</phrase> <phrase revision="systemd">systemd</phrase> was built. Before we go into the details regarding how udev works, a brief history of previous methods of handling devices is in order.
fr: Au <xref linkend="chapter-building-system"/>, nous avons installé le paquet udev en construisant <phrase revision="sysv">udev</phrase> <phrase revision="systemd">systemd</phrase>. Avant d'entrer dans les détails concernant son fonctionnement, un bref historique des méthodes précédentes de gestion des périphériques est nécessaire.

source: Linux systems in general traditionally used a static device creation method, whereby a great many device nodes were created under <filename class="directory">/dev</filename> (sometimes literally thousands of nodes), regardless of whether the corresponding hardware devices actually existed. This was typically done via a <command>MAKEDEV</command> script, which contained a number of calls to the <command>mknod</command> program with the relevant major and minor device numbers for every possible device that might exist in the world.
fr: Traditionnellement, les systèmes Linux utilisaient une méthode de création de périphériques statiques avec laquelle un grand nombre de nœuds de périphériques étaient créés sous <filename class="directory">/dev</filename> (quelques fois littéralement des milliers de nœuds), que le matériel correspondant existe ou non. Ceci était le plus souvent réalisé avec un script <command>MAKEDEV</command>, qui contient des appels au programme <command>mknod</command> avec les numéros de périphériques majeurs et mineurs pour chaque périphérique possible qui pourrait exister dans le monde.
pt_br: Sistemas Linux em geral tradicionalmente usavam um método estático de criação de dispositivo, pelo qual um grande número de nós de dispositivo era criado sob <filename class="directory">/dev</filename> (às vezes literalmente milhares de nós), independente de se os dispositivos de hardware correspondentes atualmente existissem. Isso tipicamente era feito via um script <command>MAKEDEV</command>, o qual continha um número de chamadas ao aplicativo <command>mknod</command> com os números relevantes de dispositivo maior e menor para cada dispositivo possível que pudesse existir no mundo.

source: Using the udev method, device nodes are only created for those devices which are detected by the kernel. These device nodes are created each time the system boots; they are stored in a <systemitem class="filesystem">devtmpfs</systemitem> file system (a virtual file system that resides entirely in system memory). Device nodes do not require much space, so the memory that is used is negligible.
fr: En utilisant la méthode udev, seuls les nœuds des périphériques détectés par le noyau sont créés. Comme ces n&oelig;uds de périphériques sont créés à chaque lancement du système, ils sont stockés dans un système de fichiers <systemitem class="filesystem">devtmpfs</systemitem> (un système de fichiers virtuel qui réside entièrement dans la mémoire du système). Les n&oelig;uds de périphériques ne requièrent pas beaucoup d'espace, donc la mémoire utilisée est négligeable.
pt_br: Usando o método Udev, nós de dispositivo somente são criados para aqueles dispositivos que são detectados pelo núcleo. Esses nós de dispositivo são criados a cada vez que o sistema inicializa; eles serão armazenados em um sistema de arquivos <systemitem class="filesystem">devtmpfs</systemitem> (um sistema de arquivos virtuais que reside inteiramente na memória do sistema). Nós de dispositivo não exigem muito espaço, de forma que a memória que é usada é insignificante.

source: History
fr: Historique
pt_br: Histórico

source: In February 2000, a new filesystem called <systemitem class="filesystem">devfs</systemitem> was merged into the 2.3.46 kernel and was made available during the 2.4 series of stable kernels. Although it was present in the kernel source itself, this method of creating devices dynamically never received overwhelming support from the core kernel developers.
fr: En février&nbsp;2000, un nouveau système de fichiers appelé <systemitem class="filesystem">devfs</systemitem> a été intégré au noyau 2.3.46 et rendu disponible pour la série 2.4 des noyaux stables. Bien qu'il soit présent dans les sources du noyau, cette méthode de création dynamique des périphériques n'a jamais reçu un support inconditionnel des développeurs du noyau.
pt_br: Em fevereiro de 2000, um novo sistema de arquivos chamado <systemitem class="filesystem">devfs</systemitem> foi mesclado no núcleo 2.3.46 e foi tornado disponível durante as séries 2.4 de núcleos estáveis. Embora ele estivesse presente no próprio fonte do núcleo, esse método de criar dispositivos dinamicamente nunca recebeu suporte decisivo dos(as) desenvolvedores(as) centrais do núcleo.

source: The main problem with the approach adopted by <systemitem class="filesystem">devfs</systemitem> was the way it handled device detection, creation, and naming. The latter issue, that of device node naming, was perhaps the most critical. It is generally accepted that if device names are configurable, the device naming policy should be chosen by system administrators, and not imposed on them by the developer(s). The <systemitem class="filesystem">devfs</systemitem> file system also suffered from race conditions that were inherent in its design; these could not be fixed without a substantial revision of the kernel. <systemitem class="filesystem">devfs</systemitem> was marked as deprecated for a long time, and was finally removed from the kernel in June, 2006.
fr: Le principal problème de l'approche adopté par <systemitem class="filesystem">devfs</systemitem> était la façon dont il gérait la détection, la création et le nommage des périphériques. Ce dernier problème, le nommage des périphériques, était peut-être le plus critique. Il est généralement entendu que s'il est possible de configurer les noms des périphériques, alors la politique de nommage des périphériques revient à l'administrateur du système, et non imposée par quelque développeur. Le système de fichiers <systemitem class="filesystem">devfs</systemitem> souffrait aussi de restrictions particulières inhérentes à sa conception et qui ne pouvaient être corrigées sans une revue importante du noyau. <systemitem class="filesystem">devfs</systemitem> a aussi été marqué comme obsolète pendant une longue période, à cause d'un manque de maintenance, et a finalement été supprimé du noyau en juin&nbsp;2006.
pt_br: O problema principal com a abordagem adotada pelo <systemitem class="filesystem">devfs</systemitem> era a maneira como ele lidava com detecção, criação e nomenclatura de dispositivo. O último problema, esse da nomenclatura de nó de dispositivo, era talvez o mais crítico. Geralmente é aceito que, se nomes de dispositivo forem configuráveis, [então] a política de nomenclatura de dispositivo deveria ser escolhida pelos(as) administradores(as) do sistema e não imposta a eles(as) pelos(as) desenvolvedores(as). O sistema de arquivos <systemitem class="filesystem">devfs</systemitem> também sofria com algumas condições que eram inerentes ao projeto dele; essas não poderiam ser corrigidas sem uma revisão substancial do núcleo. O <systemitem class="filesystem">devfs</systemitem> ficou marcado como obsoleto por um longo tempo, e finalmente foi removido do núcleo em junho de 2006.

source: With the development of the unstable 2.5 kernel tree, later released as the 2.6 series of stable kernels, a new virtual filesystem called <systemitem class="filesystem">sysfs</systemitem> came to be. The job of <systemitem class="filesystem">sysfs</systemitem> is to provide information about the system's hardware configuration to userspace processes. With this userspace-visible representation, it became possible to develop a userspace replacement for <systemitem class="filesystem">devfs</systemitem>.
fr: Avec le développement de la branche instable 2.5 du noyau, sortie ensuite avec la série 2.6 des noyaux stables, un nouveau système de fichiers virtuel appelé <systemitem class="filesystem">sysfs</systemitem> est arrivé. Le rôle de <systemitem class="filesystem">sysfs</systemitem> est d'exporter une vue de la configuration matérielle du système pour les processus en espace utilisateur. Avec cette représentation visible en espace utilisateur, la possibilité de développer un remplacement en espace utilisateur de <systemitem class="filesystem">devfs</systemitem> est devenu beaucoup plus réaliste.
pt_br: Com o desenvolvimento da árvore do núcleo instável 2.5, liberada posteriormente como a série 2.6 dos núcleos estáveis, um novo sistema de arquivos virtuais chamado <systemitem class="filesystem">sysfs</systemitem> veio a existir. O trabalho do <systemitem class="filesystem">sysfs</systemitem> é o de fornecer informação a respeito da configuração de hardware do sistema para processos do espaço de usuário(a). Com essa representação visível ao espaço de usuário(a), tornou-se possível desenvolver um substituto de espaço de usuário(a) para o <systemitem class="filesystem">devfs</systemitem>.

source: Udev Implementation
fr: Implémentation d'Udev
pt_br: Implementação do Udev

source: The <systemitem class="filesystem">sysfs</systemitem> filesystem was mentioned briefly above. One may wonder how <systemitem class="filesystem">sysfs</systemitem> knows about the devices present on a system and what device numbers should be used for them. Drivers that have been compiled into the kernel register their objects in <systemitem class="filesystem">sysfs</systemitem> (devtmpfs internally) as they are detected by the kernel. For drivers compiled as modules, registration happens when the module is loaded. Once the <systemitem class="filesystem">sysfs</systemitem> filesystem is mounted (on <filename class="directory">/sys</filename>), data which the drivers have registered with <systemitem class="filesystem">sysfs</systemitem> are available to userspace processes and to udevd for processing (including modifications to device nodes).
fr: Le système de fichiers <systemitem class="filesystem">sysfs</systemitem> a été brièvement mentionné ci-dessus. On pourrait se demander comment <systemitem class="filesystem">sysfs</systemitem> connaît les périphériques présents sur un système et quels numéros de périphériques devraient être utilisés. Les pilotes qui ont été compilés directement dans le noyau enregistrent leurs objets avec le <systemitem class="filesystem">sysfs</systemitem> (en interne, devtmpfs) quand ils sont détectés par le noyau. Pour les pilotes compilés en tant que modules, cet enregistrement surviendra quand le module sera chargé. Une fois que le système de fichier <systemitem class="filesystem">sysfs</systemitem> est monté (sur <filename class="directory">/sys</filename>), les données enregistrées par les pilotes avec <systemitem class="filesystem">sysfs</systemitem> sont disponibles pour les processus en espace utilisateur ainsi que pour udevd pour traitement (y compris des modifications aux n&oelig;uds de périphériques).
pt_br: O sistema de arquivos <systemitem class="filesystem">sysfs</systemitem> foi brevemente mencionado acima. Alguém possivelmente questione como o <systemitem class="filesystem">sysfs</systemitem> sabe a respeito dos dispositivos presentes em um sistema e quais números de dispositivo deveriam ser usados para eles. Controladores que tenham sido compilados internamente no núcleo registram os objetos deles em <systemitem class="filesystem">sysfs</systemitem> (devtmpfs internamente) assim que são detectados pelo núcleo. Para controladores compilados como módulos, o registro acontece quando o módulo for carregado. Assim que o sistema de arquivos <systemitem class="filesystem">sysfs</systemitem> for montado (em <filename class="directory">/sys</filename>), os dados os quais os controladores tenham registrado com <systemitem class="filesystem">sysfs</systemitem> ficam disponíveis para os processos de espaço de usuário(a) e para o udevd para processamento (incluindo modificações para nós de dispositivo).

source: Device Node Creation
fr: Création de n&oelig;uds de périphérique
pt_br: Criação de Nó de Dispositivo

source: Device files are created by the kernel in the <systemitem class="filesystem">devtmpfs</systemitem> file system. Any driver that wishes to register a device node will use the <systemitem class="filesystem">devtmpfs</systemitem> (via the driver core) to do it. When a <systemitem class="filesystem">devtmpfs</systemitem> instance is mounted on <filename class="directory">/dev</filename>, the device node will initially be exposed to userspace with a fixed name, permissions, and owner.
fr: Les fichiers de périphérique sont créés par le noyau avec le système de fichiers <systemitem class="filesystem">devtmpfs</systemitem>. Tout pilote souhaitant enregistrer un nœud de périphérique ira dans le <systemitem class="filesystem">devtmpfs</systemitem> (par le cœur du pilote) pour le faire. Quand une instance <systemitem class="filesystem">devtmpfs</systemitem> est montée sur <filename class="directory">/dev</filename>, le nœud de périphérique sera créé dès le départ avec un nom, des droits et un propriétaire figés.
pt_br: Arquivos de dispositivo são criados pelo núcleo no sistema de arquivos <systemitem class="filesystem">devtmpfs</systemitem>. Qualquer controlador que deseje registrar um nó de dispositivo usará o <systemitem class="filesystem">devtmpfs</systemitem> (via núcleo do controlador) para fazê-lo. Quando uma instância do <systemitem class="filesystem">devtmpfs</systemitem> é montada em <filename class="directory">/dev</filename>, o nó de dispositivo inicialmente será exposto para o espaço de usuário(a) com um nome, permissões e proprietário(a) fixos.

source: A short time later, the kernel will send a uevent to <command> udevd</command>. Based on the rules specified in the files within the <filename class="directory">/etc/udev/rules.d</filename>, <filename class="directory">/usr/lib/udev/rules.d</filename>, and <filename class="directory">/run/udev/rules.d</filename> directories, <command> udevd</command> will create additional symlinks to the device node, or change its permissions, owner, or group, or modify the internal <command>udevd</command> database entry (name) for that object.
fr: Peu de temps après, le noyau enverra un uevent à <command>udevd</command>. À partir des règles indiquées dans les fichiers contenus dans les répertoires <filename class="directory">/etc/udev/rules.d</filename>, <filename class="directory">/usr/lib/udev/rules.d</filename> et <filename class="directory">/run/udev/rules.d</filename>, <command> udevd</command> créera les liens symboliques supplémentaires vers le nœud de périphérique, ou bien il modifiera ses droits, son propriétaire ou son groupe, ou l'entrée dans la base de données interne d'<command>udevd</command> concernant cet objet.
pt_br: Pouco tempo depois, o núcleo enviará um uevent para <command>udevd</command>. Baseado nas regras especificadas nos arquivos dentro dos diretórios <filename class="directory">/etc/udev/rules.d</filename>, <filename class="directory">/usr/lib/udev/rules.d</filename> e <filename class="directory">/run/udev/rules.d</filename>, <command>udevd</command> criará links simbólicos adicionais para o nó de dispositivo ou mudará as permissões, proprietário(a) ou grupo deles, ou modificará a entrada interna (nome) de base de dados do <command>udevd</command> para aquele objeto.

source: The rules in these three directories are numbered and all three directories are merged together. If <command>udevd</command> can't find a rule for the device it is creating, it will leave the permissions and ownership at whatever <systemitem class="filesystem">devtmpfs</systemitem> used initially.
fr: Les règles de ces trois répertoires sont numérotées et les trois répertoires sont fusionnés. Si <command>udevd</command> ne peut pas trouver de règles pour le périphérique qu'il crée, il en donnera la propriété et les droits à n'importe quel <systemitem class="filesystem">devtmpfs</systemitem> utilisé au départ.
pt_br: As regras nesses três diretórios são numeradas e todos os três diretórios são mesclados. Se <command>udevd</command> não puder encontrar uma regra para o dispositivo que ele esteja criando, [então] ele deixará as permissões e propriedade no que <systemitem class="filesystem">devtmpfs</systemitem> usou inicialmente.

source: Module Loading
fr: Chargement d'un module
pt_br: Carregamento de Módulo

source: Device drivers compiled as modules may have aliases built into them. Aliases are visible in the output of the <command>modinfo</command> program and are usually related to the bus-specific identifiers of devices supported by a module. For example, the <emphasis>snd-fm801</emphasis> driver supports PCI devices with vendor ID 0x1319 and device ID 0x0801, and has an alias of <quote>pci:v00001319d00000801sv*sd*bc04sc01i*</quote>. For most devices, the bus driver exports the alias of the driver that would handle the device via <systemitem class="filesystem">sysfs</systemitem>. E.g., the <filename>/sys/bus/pci/devices/0000:00:0d.0/modalias</filename> file might contain the string <quote>pci:v00001319d00000801sv00001319sd00001319bc04sc01i00</quote>. The default rules provided with udev will cause <command>udevd</command> to call out to <command>/sbin/modprobe</command> with the contents of the <envar>MODALIAS</envar> uevent environment variable (which should be the same as the contents of the <filename>modalias</filename> file in sysfs), thus loading all modules whose aliases match this string after wildcard expansion.
fr: Il se peut que les pilotes des périphériques compilés en module aient aussi des alias compilés. Les alias sont visibles dans la sortie du programme <command>modinfo</command> et sont souvent liés aux identifiants de bus spécifiques des périphériques pris en charge par un module. Par exemple, le pilote <emphasis>snd-fm801</emphasis> prend en charge les périphériques PCI ayant l'ID fabricant 0x1319 et l'ID de périphérique 0x0801 a aussi un alias <quote>pci:v00001319d00000801sv*sd*bc04sc01i*</quote>. Pour la plupart des périphériques, le pilote du bus définit l'alias du pilote qui gérerait le périphérique via <systemitem class="filesystem">sysfs</systemitem>. Par exemple, le fichier <filename>/sys/bus/pci/devices/0000:00:0d.0/modalias</filename> pourrait contenir la chaîne <quote>pci:v00001319d00000801sv00001319sd00001319bc04sc01i00</quote>. Les règles par défaut fournies par Udev feront que <command>udevd</command> appellera <command>/sbin/modprobe</command> avec le contenu de la variable d'environnement de l'uevent <envar>MODALIAS</envar> (qui devrait être la même que le contenu du fichier <filename>modalias</filename> dans sysfs), donc chargera tous les modules dont les alias correspondent à cette chaîne après les expansions génériques.
pt_br: Controladores de dispositivo compilados como módulos possivelmente tenham apelidos construídos dentro deles. Apelidos são visíveis na saída gerada do aplicativo <command>modinfo</command> e geralmente estão relacionados aos identificadores específicos ao barramento dos dispositivos suportados por um módulo. Por exemplo, o controlador <emphasis>snd-fm801</emphasis> suporta dispositivos PCI com ID de fornecedor 0x1319 e ID de dispositivo 0x0801 e tem um apelido de <quote>pci:v00001319d00000801sv*sd*bc04sc01i*</quote>. Para a maioria dos dispositivos, o controlador de barramento exporta o apelido do controlador que lidaria com o dispositivo via <systemitem class="filesystem">sysfs</systemitem>. Por exemplo, o arquivo <filename>/sys/bus/pci/devices/0000:00:0d.0/modalias</filename> pode conter a sequência de caracteres <quote>pci:v00001319d00000801sv00001319sd00001319bc04sc01i00</quote>. As regras padrão fornecidas com o Udev causarão <command>udevd</command> chamar <command>/sbin/modprobe</command> com o conteúdo da variável de ambiente do uevent <envar>MODALIAS</envar> (o qual deveria ser o mesmo que o conteúdo do arquivo <filename>modalias</filename> em sysfs), dessa forma carregando todos os módulos cujos apelidos correspondem a essa sequência de caracteres depois da expansão de carácter curinga.

source: In this example, this means that, in addition to <emphasis>snd-fm801</emphasis>, the obsolete (and unwanted) <emphasis>forte</emphasis> driver will be loaded if it is available. See below for ways in which the loading of unwanted drivers can be prevented.
fr: Dans cet exemple, cela signifie que, outre <emphasis>snd-fm801</emphasis>, le pilote obsolète (et non désiré) <emphasis>forte</emphasis> sera chargé s'il est disponible. Voir ci-dessous les moyens d'empêcher le chargement des modules indésirables.
pt_br: Nesse exemplo, isso significa que, em adição a <emphasis>snd-fm801</emphasis>, o obsoleto (e indesejado) controlador <emphasis>forte</emphasis> será carregado se ele estiver disponível. Veja-se abaixo para maneiras nas quais o carregamento de controladores indesejados pode ser evitado.

source: The kernel itself is also able to load modules for network protocols, filesystems, and NLS support on demand.
fr: Le noyau lui-même est aussi capable de charger des modules de protocole réseau, de prise en charge pour des systèmes de fichiers et de prise en charge native des langues sur demande.
pt_br: O próprio núcleo também é capaz de carregar módulos para protocolos de rede de comunicação, sistemas de arquivos e suporte NLS sob demanda.

source: Handling Hotpluggable/Dynamic Devices
fr: Gestion des périphériques dynamiques ou montables à chaud
pt_br: Lidando com Dispositivos Plugáveis a Quente/Dinâmicos

source: When you plug in a device, such as a Universal Serial Bus (USB) MP3 player, the kernel recognizes that the device is now connected and generates a uevent. This uevent is then handled by <command>udevd</command> as described above.
fr: Lorsque vous connectez un périphérique, comme un lecteur MP3 USB, le noyau reconnaît que le périphérique est maintenant connecté et génère un uevent. Cet uevent est alors géré par <command>udevd</command> comme décrit ci-dessus.
pt_br: Quando você pluga um dispositivo, como um reprodutor de MP3 Universal Serial Bus (USB), o núcleo reconhece que o dispositivo agora está conectado e gera um uevent. Esse uevent é então tratado pelo <command>udevd</command> como descrito acima.

source: Problems with Loading Modules and Creating Devices
fr: Problèmes avec le chargement des modules et la création des périphériques
pt_br: Problemas ao Carregar Módulos e Criar Dispositivos

source: There are a few possible problems when it comes to automatically creating device nodes.
fr: Il existe quelques problèmes connus pour la création automatique des n&oelig;uds de périphériques.
pt_br: Existem uns poucos possíveis problemas quando se trata de criar automaticamente nós de dispositivos.

source: A Kernel Module Is Not Loaded Automatically
fr: Un module noyau n'est pas chargé automatiquement
pt_br: Um Módulo do Núcleo Não é Carregado Automaticamente
