Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/usage.po
Languages: pt_br

source: System V Bootscript Usage and Configuration
pt_br: Uso e Configuração do Script de Inicialização do System V

source: Bootscripts
pt_br: Scripts de inicialização

source: usage
pt_br: uso

source: How Do the System V Bootscripts Work?
pt_br: Como os Scripts de Inicialização do System V funcionam?

source: This version of LFS uses a special booting facility named SysVinit, based on a series of <emphasis>run levels</emphasis>. The boot procedure can be quite different from one system to another; the fact that things worked one way in a particular Linux distribution does not guarantee they will work the same way in LFS. LFS has its own way of doing things, but it does respect generally accepted standards.
pt_br: Esta versão do LFS usa um aparato especial de inicialização chamado SysVinit, baseado em uma série de <emphasis>níveis de execução</emphasis>. O procedimento de inicialização pode ser bem diferente de um sistema para outro; o fato de que as coisas funcionam de uma maneira em uma distribuição específica do Linux não garante que elas funcionarão da mesma forma no LFS. O LFS tem a própria maneira de fazer as coisas, mas ele respeita os padrões geralmente aceitos.

source: There is an alternative boot procedure called <command>systemd</command>. We will not discuss that boot process any further here. For a detailed description visit <ulink url="https://www.linux.com/training-tutorials/understanding-and-using-systemd/"/>.
pt_br: Existe um procedimento alternativo de inicialização chamado <command>systemd</command>. Nós não mais discutiremos esse processo de inicialização aqui. Para uma descrição detalhada, visite-se <ulink url="https://www.linux.com/training-tutorials/understanding-and-using-systemd/"/>.

source: SysVinit (which will be referred to as <quote>init</quote> from now on) uses a run levels scheme. There are seven run levels, numbered 0 to 6. (Actually, there are more run levels, but the others are for special cases and are generally not used. See <filename>init(8)</filename> for more details.) Each one of the seven corresponds to actions the computer is supposed to perform when it starts up or shuts down. The default run level is 3. Here are the descriptions of the different run levels as they are implemented in LFS:
pt_br: O SysVinit (o qual será referido como <quote>init</quote> daqui pra frente) usa um esquema de níveis de execução. Existem sete níveis de execução, numerados de 0 a 6. (Atualmente, existem mais níveis de execução, mas os outros são para casos especiais e geralmente não são usados. Veja-se <filename>init(8)</filename> para mais detalhes). Cada um dos sete corresponde às ações que o computador é suposto realizar quando ele inicia ou desliga. O nível de execução padrão é o 3. Aqui estão as descrições dos diferentes níveis de execução conforme eles estão implementados no LFS:

source: 0: halt the computer 1: single-user mode 2: reserved for customization, otherwise the same as 3 3: multi-user mode with networking 4: reserved for customization, otherwise the same as 3 5: same as 4, it is usually used for GUI login (like GNOME's <command>gdm</command> or LXDE's <command>lxdm</command>) 6: reboot the computer
pt_br: 0: parar o computador 1: Modo de usuário(a) único(a) 2: Reservado para personalização, do contrário faz o mesmo que 3 3: Modo de multi-usuário(a), com rede de comunicação 4: Reservado para personalização, do contrário faz o mesmo que 3 5: Mesmo que 4, ele é usado usualmente para login GUI (como o <command>gdm</command> do GNOME ou o <command>lxdm</command> do LXDE) 6: reinicializar o computador

source: Classically, run level 2 above was defined as "multi-user mode without networking", but this was only the case many years ago when multiple users could connect to a system via serial ports. In today's environment it makes no sense, and we now say it is "reserved".
pt_br: Classicamente, o nível de execução 2 acima era definido como "modo de multi-usuário(a), sem rede de comunicação", porém isso somente foi o caso muitos anos atrás quando múltiplos(as) usuários(as) podiam se conectar a um sistema via portas seriais. No ambiente da atualidade isso não faz sentido e agora nós dizemos que ele está "reservado".

source: Configuring Sysvinit
pt_br: Configurando o Sysvinit

source: configuring
pt_br: configurando

source: During kernel initialization, the first program that is run (if not overridden on the command line) is <command>init</command>. This program reads the initialization file <filename>/etc/inittab</filename>. Create this file with:
pt_br: Durante a inicialização do núcleo, o primeiro aplicativo que é executado (se não substituído na linha de comando) é o <command>init</command>. Esse aplicativo lê o arquivo de inicialização <filename>/etc/inittab</filename>. Crie esse arquivo com:

source: <userinput>cat &gt; /etc/inittab &lt;&lt; "EOF" <literal># Begin /etc/inittab id:3:initdefault: si::sysinit:/etc/rc.d/init.d/rc S l0:0:wait:/etc/rc.d/init.d/rc 0 l1:S1:wait:/etc/rc.d/init.d/rc 1 l2:2:wait:/etc/rc.d/init.d/rc 2 l3:3:wait:/etc/rc.d/init.d/rc 3 l4:4:wait:/etc/rc.d/init.d/rc 4 l5:5:wait:/etc/rc.d/init.d/rc 5 l6:6:wait:/etc/rc.d/init.d/rc 6 ca:12345:ctrlaltdel:/sbin/shutdown -t1 -a -r now su:S06:once:/sbin/sulogin s1:1:respawn:/sbin/sulogin 1:2345:respawn:/sbin/agetty --noclear tty1 9600 2:2345:respawn:/sbin/agetty tty2 9600 3:2345:respawn:/sbin/agetty tty3 9600 4:2345:respawn:/sbin/agetty tty4 9600 5:2345:respawn:/sbin/agetty tty5 9600 6:2345:respawn:/sbin/agetty tty6 9600 # End /etc/inittab</literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/inittab &lt;&lt; "EOF" <literal># Início do /etc/inittab id:3:initdefault: si::sysinit:/etc/rc.d/init.d/rc S l0:0:wait:/etc/rc.d/init.d/rc 0 l1:S1:wait:/etc/rc.d/init.d/rc 1 l2:2:wait:/etc/rc.d/init.d/rc 2 l3:3:wait:/etc/rc.d/init.d/rc 3 l4:4:wait:/etc/rc.d/init.d/rc 4 l5:5:wait:/etc/rc.d/init.d/rc 5 l6:6:wait:/etc/rc.d/init.d/rc 6 ca:12345:ctrlaltdel:/sbin/shutdown -t1 -a -r now su:S06:once:/sbin/sulogin s1:1:respawn:/sbin/sulogin 1:2345:respawn:/sbin/agetty --noclear tty1 9600 2:2345:respawn:/sbin/agetty tty2 9600 3:2345:respawn:/sbin/agetty tty3 9600 4:2345:respawn:/sbin/agetty tty4 9600 5:2345:respawn:/sbin/agetty tty5 9600 6:2345:respawn:/sbin/agetty tty6 9600 # Fim do /etc/inittab</literal> EOF</userinput>

source: An explanation of this initialization file is in the man page for <emphasis>inittab</emphasis>. In LFS, the key command is <command>rc</command>. The initialization file above instructs <command>rc</command> to run all the scripts starting with an S in the <filename class="directory">/etc/rc.d/rcS.d</filename> directory followed by all the scripts starting with an S in the <filename class="directory">/etc/rc.d/rc?.d</filename> directory where the question mark is specified by the initdefault value.
pt_br: Uma explicação desse arquivo de inicialização está na página de manual para <emphasis>inittab</emphasis>. No LFS, o comando chave é <command>rc</command>. O arquivo de inicialização acima instrui <command>rc</command> a executar todos os scripts começando com um S no diretório <filename class="directory">/etc/rc.d/rcS.d</filename> seguido por todos os scripts começando com um S no diretório <filename class="directory">/etc/rc.d/rc?.d</filename> onde o ponto de interrogação é especificado pelo valor de initdefault.

source: As a convenience, the <command>rc</command> script reads a library of functions in <filename class="directory">/lib/lsb/init-functions</filename>. This library also reads an optional configuration file, <filename>/etc/sysconfig/rc.site</filename>. Any of the system configuration parameters described in subsequent sections can be placed in this file, allowing consolidation of all system parameters in this one file.
pt_br: Como uma conveniência, o script <command>rc</command> lê uma biblioteca de funções em <filename class="directory">/lib/lsb/init-functions</filename>. Essa biblioteca também lê um arquivo de configuração opcional, <filename>/etc/sysconfig/rc.site</filename>. Quaisquer dos parâmetros de configuração do sistema descritos em seções subsequentes podem ser colocados nesse arquivo, permitindo a consolidação de todos os parâmetros do sistema nesse único arquivo.

source: As a debugging convenience, the functions script also logs all output to <filename>/run/var/bootlog</filename>. Since the <filename class="directory">/run</filename> directory is a tmpfs, this file is not persistent across boots; however, it is appended to the more permanent file <filename>/var/log/boot.log</filename> at the end of the boot process.
pt_br: Como uma conveniência de depuração, o script de funções também registra todas as saídas geradas em <filename>/run/var/bootlog</filename>. Dado que o diretório <filename class="directory">/run</filename> é um tmpfs, esse arquivo não é persistente ao longo de inicializações; entretanto, ele é adicionado ao arquivo mais permanente <filename>/var/log/boot.log</filename> ao final do processo de inicialização.

source: Changing Run Levels
pt_br: Mudando Níveis de Execução

source: Changing run levels is done with <command>init <replaceable>&lt;runlevel&gt;</replaceable></command>, where <replaceable>&lt;runlevel&gt;</replaceable> is the target run level. For example, to reboot the computer, a user could issue the <command>init 6</command> command, which is an alias for the <command>reboot</command> command. Likewise, <command>init 0</command> is an alias for the <command>halt</command> command.
pt_br: A mudança de níveis de execução é feita com <command>init <replaceable>&lt;runlevel&gt;</replaceable></command>, onde <replaceable>&lt;runlevel&gt;</replaceable> é o nível de execução alvo. Por exemplo, para reinicializar o computador, um(a) usuário(a) poderia emitir o comando <command>init 6</command>, o qual é um apelido para o comando <command>reboot</command>. Da mesma forma, <command>init 0</command> é um apelido para o comando <command>halt</command>.

source: There are a number of directories under <filename class="directory">/etc/rc.d</filename> that look like <filename class="directory">rc?.d</filename> (where ? is the number of the run level) and <filename class="directory">rcS.d</filename>, all containing a number of symbolic links. Some links begin with a <emphasis>K</emphasis>; the others begin with an <emphasis>S</emphasis>, and all of them have two numbers following the initial letter. The K means to stop (kill) a service and the S means to start a service. The numbers determine the order in which the scripts are run, from 00 to 99&mdash;the smaller the number, the sooner tht script runs. When <command>init</command> switches to another run level, the appropriate services are either started or stopped, depending on the run level chosen.
pt_br: Existe um número de diretórios sob <filename class="directory">/etc/rc.d</filename> que se parecem com <filename class="directory">rc?.d</filename> (onde ? é o número do nível de execução) e <filename class="directory">rcS.d</filename>, todos contendo um número de links simbólicos. Alguns links começam com um <emphasis>K</emphasis>, os outros começam com um <emphasis>S</emphasis>, e todos eles tem dois números seguindo a letra inicial. O K significa parar (kill) um serviço e o S significa iniciar um serviço. Os números determinam a ordem na qual os scripts são executados, de 00 a 99&mdash;quanto menor o número, mais cedo o script executa. Quando <command>init</command> alterna para outro nível de execução, os serviços adequados são tanto iniciados quanto parados, dependendo do nível de execução escolhido.

source: The real scripts are in <filename class="directory">/etc/rc.d/init.d</filename>. They do the actual work, and the symlinks all point to them. K links and S links point to the same script in <filename class="directory">/etc/rc.d/init.d</filename>. This is because the scripts can be called with different parameters like <parameter>start</parameter>, <parameter>stop</parameter>, <parameter>restart</parameter>, <parameter>reload</parameter>, and <parameter>status</parameter>. When a K link is encountered, the appropriate script is run with the <parameter>stop</parameter> argument. When an S link is encountered, the appropriate script is run with the <parameter>start</parameter> argument.
pt_br: Os scripts reais estão em <filename class="directory">/etc/rc.d/init.d</filename>. Eles fazem o trabalho atual e os links simbólicos todos apontam para eles. Os links K e os links S apontam para o mesmo script em <filename class="directory">/etc/rc.d/init.d</filename>. Isso é porque os scripts podem ser chamados com parâmetros diferentes como <parameter>start</parameter>, <parameter>stop</parameter>, <parameter>restart</parameter>, <parameter>reload</parameter> e <parameter>status</parameter>. Quando um link K é encontrado, o script apropriado é executado com o argumento <parameter>stop</parameter>. Quando um link S é encontrado, o script apropriado é executado com o argumento <parameter>start</parameter>.

source: These are descriptions of what the arguments make the scripts do:
pt_br: Estas são descrições do que os argumentos fazem os scripts fazer:

source: The service is started.
pt_br: O serviço é iniciado.

source: The service is stopped.
pt_br: O serviço é parado.

source: The service is stopped and then started again.
pt_br: O serviço é parado e então iniciado novamente.

source: The configuration of the service is updated. This is used after the configuration file of a service was modified, when the service does not need to be restarted.
pt_br: A configuração do serviço é atualizada. Isso é usado depois que o arquivo de configuração de um serviço foi modificado, quando o serviço não precisa ser reiniciado.

source: Tells if the service is running and with which PIDs.
pt_br: Diz se o serviço está executando e com quais PIDs.

source: Feel free to modify the way the boot process works (after all, it is your own LFS system). The files given here are an example of how it can be done.
pt_br: Sinta-se livre para modificar a maneira como o processo de inicialização funciona (afinal de contas, este é seu próprio sistema LFS). Os arquivos dados aqui são um exemplo de como isso pode ser feito.

source: Udev Bootscripts
pt_br: Scripts de Inicialização do Udev

source: The <filename>/etc/rc.d/init.d/udev</filename> initscript starts <command>udevd</command>, triggers any "coldplug" devices that have already been created by the kernel, and waits for any rules to complete. The script also unsets the uevent handler from the default of <filename>/sbin/hotplug </filename>. This is done because the kernel no longer needs to call an external binary. Instead, <command>udevd</command> will listen on a netlink socket for uevents that the kernel raises.
pt_br: O script de iniciação <filename>/etc/rc.d/init.d/udev</filename> inicia o <command>udevd</command>, aciona quaisquer dispositivos "plugue frio" que já tenham sido criados pelo núcleo e aguarda por quaisquer regras para completar. O script também desconfigura o manuseador do uevent do padrão do <filename>/sbin/hotplug</filename>. Isso é feito, pois o núcleo não mais precisa chamar um binário externo. Em vez disso, o <command>udevd</command> escutará em um soquete de link de rede os uevents que o núcleo gera.

source: The <command>/etc/rc.d/init.d/udev_retry</command> script takes care of re-triggering events for subsystems whose rules may rely on file systems that are not mounted until the <command>mountfs</command> script is run (in particular, <filename class="directory">/usr</filename> and <filename class="directory">/var</filename> may cause this). This script runs after the <command>mountfs</command> script, so those rules (if re-triggered) should succeed the second time around. It is configured by the <filename>/etc/sysconfig/udev_retry</filename> file; any words in this file other than comments are considered subsystem names to trigger at retry time. To find the subsystem of a device, use <command>udevadm info --attribute-walk &lt;device&gt;</command> where &lt;device&gt; is an absolute path in /dev or /sys, such as /dev/sr0, or /sys/class/rtc.
pt_br: O script <command>/etc/rc.d/init.d/udev_retry</command> se ocupa de re-acionar eventos para subsistemas cujas regras possivelmente dependam de sistemas de arquivos que não estão montados até que o script <command>mountfs</command> seja executado (em particular, <filename class="directory">/usr</filename> e <filename class="directory">/var</filename> possivelmente causem isso). Esse script executa depois do script <command>mountfs</command>, de forma que aquelas regras (se re-acionadas) deveriam prosperar na segunda vez. Ele é configurado pelo arquivo <filename>/etc/sysconfig/udev_retry</filename>; quaisquer palavras nesse arquivo outras que comentários são consideradas nomes de subsistema para acionar ao tempo de re-tentativa. Para encontrar o subsistema de um dispositivo, use <command>udevadm info --attribute-walk &lt;dispositivo&gt;</command>, onde &lt;dispositivo&gt; é um caminho absoluto em /dev ou /sys, tais como /dev/sr0 ou /sys/class/rtc.

source: For information on kernel module loading and udev, see <xref linkend="module-loading"/>.
pt_br: Para informação acerca de carregamento de módulo do núcleo e Udev, veja-se <xref linkend="module-loading"/>.

source: Configuring the System Clock
pt_br: Configurando o Relógio do Sistema

source: setclock
pt_br: configura relógio

source: The <command>setclock</command> script reads the time from the hardware clock, also known as the BIOS or Complementary Metal Oxide Semiconductor (CMOS) clock. If the hardware clock is set to UTC, this script will convert the hardware clock's time to the local time using the <filename>/etc/localtime</filename> file (which tells the <command>hwclock</command> program which time zone to use). There is no way to detect whether or not the hardware clock is set to UTC, so this must be configured manually.
pt_br: O script <command>setclock</command> lê a hora a partir do relógio do hardware, também conhecido como relógio do BIOS ou do Complementary Metal Oxide Semiconductor (CMOS). Se o relógio do hardware estiver configurado para UTC, [então] esse script converterá a hora do relógio do hardware para a hora local usando o arquivo <filename>/etc/localtime</filename> (o qual diz ao aplicativo <command>hwclock</command> qual fuso horário usar). Não existe maneira de detectar se o relógio do hardware está ou não configurado para UTC, de forma que isso precisa ser configurado manualmente.

source: The <command>setclock</command> program is run via <application>udev</application> when the kernel detects the hardware capability upon boot. It can also be run manually with the stop parameter to store the system time to the CMOS clock.
pt_br: O aplicativo <command>setclock</command> é executado via <application>udev</application> quando o núcleo detecta o recurso do hardware em consequência da inicialização. Ele também pode ser executado manualmente com o parâmetro pare para armazenar a hora do sistema para o relógio CMOS.

source: If you cannot remember whether or not the hardware clock is set to UTC, find out by running the <userinput>hwclock --localtime --show</userinput> command. This will display what the current time is according to the hardware clock. If this time matches whatever your watch says, then the hardware clock is set to local time. If the output from <command>hwclock</command> is not local time, chances are it is set to UTC time. Verify this by adding or subtracting the proper number of hours for your time zone to the time shown by <command>hwclock</command>. For example, if you are currently in the MST time zone, which is also known as GMT -0700, add seven hours to the local time.
pt_br: Se você não conseguir lembrar se o relógio do hardware está ou não configurado para UTC, [então] descubra executando o comando <userinput>hwclock --localtime --show</userinput>. Isso mostrará o que é a hora atual de acordo com o relógio do hardware. Se essa hora corresponder à que o seu relógio diz, então o relógio do hardware está configurado para hora local. Se a saída gerada originária do <command>hwclock</command> não for a hora local, [então] as chances são as de que ele esteja configurado para hora UTC. Verifique isso adicionando ou subtraindo a número apropriado de horas para o seu fuso horário à (da) hora mostrada pelo <command>hwclock</command>. Por exemplo, se você estiver atualmente no fuso horário MST, o qual é conhecido também como GMT -0700, [então] adicione sete horas à hora local.

source: Change the value of the <envar>UTC</envar> variable below to a value of <parameter>0</parameter> (zero) if the hardware clock is <emphasis>NOT</emphasis> set to UTC time.
pt_br: Mude o valor da variável <envar>UTC</envar> abaixo para um valor de <parameter>0</parameter> (zero) se o relógio do hardware <emphasis>NÃO</emphasis> estiver configurado para hora UTC.

source: Create a new file <filename>/etc/sysconfig/clock</filename> by running the following:
pt_br: Crie um novo arquivo <filename>/etc/sysconfig/clock</filename> executando o seguinte:

source: <userinput>cat &gt; /etc/sysconfig/clock &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/clock UTC=1 # Set this to any options you might need to give to hwclock, # such as machine hardware clock type for Alphas. CLOCKPARAMS= # End /etc/sysconfig/clock</literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/sysconfig/clock &lt;&lt; "EOF" <literal># Início do /etc/sysconfig/clock UTC=1 # Configure isto para quaisquer opções que você pudesse precisar dar para hwclock, # tais como tipo do relógio de hardware de máquina para Alphas. CLOCKPARAMS= # Fim do /etc/sysconfig/clock</literal> EOF</userinput>

source: A good hint explaining how to deal with time on LFS is available at <ulink url="&hints-root;time.txt"/>. It explains issues such as time zones, UTC, and the <envar>TZ</envar> environment variable.
pt_br: Uma boa dica explicando como lidar com hora no LFS está disponível em <ulink url="&hints-root;time.txt"/>. Ela explica problemas como fusos horários, UTC e a variável de ambiente <envar>TZ</envar>.

source: The CLOCKPARAMS and UTC parameters may also be set in the <filename>/etc/sysconfig/rc.site</filename> file.
pt_br: Os parâmetros CLOCKPARAMS e UTC também possivelmente sejam configurados no arquivo <filename>/etc/sysconfig/rc.site</filename>.

source: Configuring the Linux Console
pt_br: Configurando o Console do Linux

source: This section discusses how to configure the <command>console</command> bootscript that sets up the keyboard map, console font, and console kernel log level. If non-ASCII characters (e.g., the copyright sign, the British pound sign, and the Euro symbol) will not be used and the keyboard is a U.S. one, much of this section can be skipped. Without the configuration file, (or equivalent settings in <filename>rc.site</filename>), the <command>console</command> bootscript will do nothing.
pt_br: Esta seção discute como configurar o script de inicialização <command>console</command> que configura o mapa de teclado, fonte do console e nível de registro do núcleo do console. Se caracteres não-ASCII (por exemplo, o sinal de direitos autorais, o sinal da libra britânica e o símbolo do Euro) não serão usados e o teclado for um dos Estados Unidos da América do Norte, [então] muito desta seção pode ser pulada. Sem o arquivo de configuração, (ou configurações equivalentes em <filename>rc.site</filename>), o script de inicialização <command>console</command> não fará nada.
