Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/usage.po
Languages: pt_br

source: During shutdown, the <command>init</command> program sends a TERM signal to each program it has started (e.g. agetty), waits for a set time (default 3 seconds), then sends each process a KILL signal and waits again. This process is repeated in the <command>sendsignals</command> script for any processes that are not shut down by their own scripts. The delay for <command>init</command> can be set by passing a parameter. For example to remove the delay in <command>init</command>, pass the -t0 parameter when shutting down or rebooting (e.g. <command>/sbin/shutdown -t0 -r now</command>). The delay for the <command>sendsignals</command> script can be skipped by setting the parameter KILLDELAY=0.
pt_br: Durante o desligamento, o aplicativo <command>init</command> envia um sinal TERM para cada aplicativo que ele tenha iniciado (por exemplo agetty), espera um tempo configurado (padrão 3 segundos), então envia a cada processo um sinal KILL e aguarda novamente. Esse processo é repetido no script <command>sendsignals</command> para quaisquer processos que não sejam desligados pelos scripts próprios deles. O atraso para <command>init</command> pode ser configurado passando-se um parâmetro. Por exemplo, para remover o atraso no <command>init</command>, passe o parâmetro -t0 quando desligar ou reinicializar (por exemplo <command>/sbin/shutdown -t0 -r now</command>). O atraso para o script <command>sendsignals</command> pode ser pulado configurando-se o parâmetro KILLDELAY=0.
