Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/usage.po
Languages: pt_br

source: The <command>console</command> script reads the <filename>/etc/sysconfig/console</filename> file for configuration information. Decide which keymap and screen font will be used. Various language-specific HOWTOs can also help with this; see <ulink url="https://tldp.org/HOWTO/HOWTO-INDEX/other-lang.html"/>. If still in doubt, look in the <filename class="directory">/usr/share/keymaps</filename> and <filename class="directory">/usr/share/consolefonts</filename> directories for valid keymaps and screen fonts. Read the <filename>loadkeys(1)</filename> and <filename>setfont(8)</filename> manual pages to determine the correct arguments for these programs.
pt_br: O script <command>console</command> lê o arquivo <filename>/etc/sysconfig/console</filename> para informação de configuração. Decida qual mapa de teclas e fonte de tela serão usados. Vários HOWTOs específicos de idiomas também podem ajudar com isso; veja-se <ulink url="https://tldp.org/HOWTO/HOWTO-INDEX/other-lang.html"/>. Se ainda em dúvida, [então] olhe nos diretórios <filename class="directory">/usr/share/keymaps</filename> e <filename class="directory">/usr/share/consolefonts</filename> para mapas de teclas válidos e fontes de tela. Leiam-se as páginas de manual <filename>loadkeys(1)</filename> e <filename>setfont(8)</filename> para determinar os argumentos corretos para esses aplicativos.

source: The <filename>/etc/sysconfig/console</filename> file should contain lines of the form: VARIABLE="value". The following variables are recognized:
pt_br: O arquivo <filename>/etc/sysconfig/console</filename> deveria conter linhas da forma: VARIÁVEL="valor". As seguintes variáveis são reconhecidas:

source: This variable specifies the log level for kernel messages sent to the console as set by <command>dmesg -n</command>. Valid levels are from "1" (no messages) to "8". The default level is "7".
pt_br: Essa variável especifica o nível de registro para mensagens do núcleo enviadas para o console, conforme configurado por <command>dmesg -n</command>. Níveis válidos são de "1" (sem mensagens) até "8". O nível padrão é "7".

source: This variable specifies the arguments for the <command>loadkeys</command> program, typically, the name of the keymap to load, e.g., <quote>it</quote>. If this variable is not set, the bootscript will not run the <command>loadkeys</command> program, and the default kernel keymap will be used. Note that a few keymaps have multiple versions with the same name (cz and its variants in qwerty/ and qwertz/, es in olpc/ and qwerty/, and trf in fgGIod/ and qwerty/). In these cases the parent directory should also be specified (e.g. qwerty/es) to ensure the proper keymap is loaded.
pt_br: Essa variável especifica os argumentos para o aplicativo <command>loadkeys</command>, tipicamente, o nome do mapa de teclas a carregar, por exemplo, <quote>it</quote>. Se essa variável não estiver configurada, [então] o script de inicialização não executará o aplicativo <command>loadkeys</command> e o mapa padrão de teclas do núcleo será usado. Observe que uns poucos mapas de teclas tem múltiplas versões com o mesmo nome (cz e variantes dele em qwerty/ e qwertz/; es em olpc/ e qwerty/; e trf em fgGIod/ e qwerty/). Nesses casos, o diretório ancestral também deveria ser especificado (por exemplo, qwerty/es) para garantir que o mapa de teclas adequado seja carregado.

source: This (rarely used) variable specifies the arguments for the second call to the <command>loadkeys</command> program. This is useful if the stock keymap is not completely satisfactory and a small adjustment has to be made. E.g., to include the Euro sign into a keymap that normally doesn't have it, set this variable to <quote>euro2</quote>.
pt_br: Essa (raramente usada) variável especifica os argumentos para a segunda chamada ao aplicativo <command>loadkeys</command>. Isso é útil se o mapa padrão de teclas não for completamente satisfatório e um pequeno ajuste tenha que ser feito. Por exemplo, para incluir o símbolo do Euro em um mapa de teclas que normalmente não o tem, configure essa variável para <quote>euro2</quote>.

source: This variable specifies the arguments for the <command>setfont</command> program. Typically, this includes the font name, <quote>-m</quote>, and the name of the application character map to load. E.g., in order to load the <quote>lat1-16</quote> font together with the <quote>8859-1</quote> application character map (appropriate in the USA), set this variable to <quote>lat1-16 -m 8859-1</quote>. In UTF-8 mode, the kernel uses the application character map to convert 8-bit key codes to UTF-8. Therefore the argument of the "-m" parameter should be set to the encoding of the composed key codes in the keymap.
pt_br: Essa variável especifica os argumentos para o aplicativo <command>setfont</command>. Tipicamente, isso inclui o nome da fonte, <quote>-m</quote>, e o nome do mapa de caracteres de aplicação a carregar. Por exemplo, para a finalidade de carregar a fonte <quote>lat1-16</quote> juntamente com o mapa de caracteres de aplicação <quote>8859-1</quote> (apropriado nos Estados Unidos da América do Norte), configure essa variável para <quote>lat1-16 -m 8859-1</quote>. Em modo UTF-8, o núcleo usa o mapa de caracteres de aplicação para converter os códigos de tecla de 8 bits para UTF-8. Dessa maneira, o argumento do parâmetro "-m" deveria ser configurado para a codificação dos códigos compostos de tecla no mapa de teclas.

source: Set this variable to <quote>1</quote>, <quote>yes</quote>, or <quote>true</quote> in order to put the console into UTF-8 mode. This is useful in UTF-8 based locales and harmful otherwise.
pt_br: Configure essa variável para <quote>1</quote>, <quote>yes</quote> ou <quote>true</quote> para a finalidade de colocar o console em modo UTF-8. Isso é útil em locales baseados em UTF-8 e danoso de outra forma.

source: For many keyboard layouts, there is no stock Unicode keymap in the Kbd package. The <command>console</command> bootscript will convert an available keymap to UTF-8 on the fly if this variable is set to the encoding of the available non-UTF-8 keymap.
pt_br: Para muitos esquemas de teclado, não existe mapa padrão de teclado Unicode no pacote Kbd. O script de inicialização <command>console</command> converterá um mapa de teclas disponível para UTF-8 em tempo real se essa variável estiver configurada para a codificação do mapa disponível de teclas não-UTF-8.

source: Some examples:
pt_br: Alguns exemplos:

source: For a non-Unicode setup, only the KEYMAP and FONT variables are generally needed. E.g., for a Polish setup, one would use:
pt_br: Para uma configuração não-Unicode, somente as variáveis KEYMAP e FONT geralmente são necessárias. Por exemplo, para uma configuração em polonês, alguém usaria:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console KEYMAP="pl2" FONT="lat2a-16 -m 8859-2" # End /etc/sysconfig/console</literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Início do /etc/sysconfig/console KEYMAP="pl2" FONT="lat2a-16 -m 8859-2" # Fim do /etc/sysconfig/console</literal> EOF</userinput>

source: As mentioned above, it is sometimes necessary to adjust a stock keymap slightly. The following example adds the Euro symbol to the German keymap:
pt_br: Como mencionado acima, às vezes é necessário ajustar um mapa padrão de teclas um pouco. O exemplo seguinte adiciona o símbolo do Euro ao mapa de teclas alemão:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console KEYMAP="de-latin1" KEYMAP_CORRECTIONS="euro2" FONT="lat0-16 -m 8859-15" UNICODE="1" # End /etc/sysconfig/console</literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Início do /etc/sysconfig/console KEYMAP="de-latin1" KEYMAP_CORRECTIONS="euro2" FONT="lat0-16 -m 8859-15" UNICODE="1" # Fim do /etc/sysconfig/console</literal> EOF</userinput>

source: The following is a Unicode-enabled example for Bulgarian, where a stock UTF-8 keymap exists:
pt_br: O seguinte é um exemplo habilitado para Unicode para búlgaro, onde um mapa padrão de teclas UTF-8 existe:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console UNICODE="1" KEYMAP="bg_bds-utf8" FONT="LatArCyrHeb-16" # End /etc/sysconfig/console</literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Início do /etc/sysconfig/console UNICODE="1" KEYMAP="bg_bds-utf8" FONT="LatArCyrHeb-16" # Fim do /etc/sysconfig/console</literal> EOF</userinput>

source: Due to the use of a 512-glyph LatArCyrHeb-16 font in the previous example, bright colors are no longer available on the Linux console unless a framebuffer is used. If one wants to have bright colors without a framebuffer and can live without characters not belonging to his language, it is still possible to use a language-specific 256-glyph font, as illustrated below:
pt_br: Devido ao uso de uma fonte LatArCyrHeb-16 de 512 glifos no exemplo anterior, cores brilhantes não mais estão disponíveis no console do Linux, a menos que uma parte da RAM usada para armazenamento temporário de dados que estão esperando para serem enviados para um dispositivo e que armazene o conteúdo de uma imagem pixel por pixel seja usada. Se alguém quiser ter cores brilhantes sem uma parte da RAM usada para armazenamento temporário de dados que estão esperando para serem enviados para um dispositivo e que armazene o conteúdo de uma imagem pixel por pixel e puder viver sem caracteres que não pertencem a seu idioma, [então] ainda é possível usar uma fonte de 256 glifos específica para o idioma, conforme ilustrado abaixo:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console UNICODE="1" KEYMAP="bg_bds-utf8" FONT="cyr-sun16" # End /etc/sysconfig/console</literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Início do /etc/sysconfig/console UNICODE="1" KEYMAP="bg_bds-utf8" FONT="cyr-sun16" # Fim do /etc/sysconfig/console</literal> EOF</userinput>

source: The following example illustrates keymap autoconversion from ISO-8859-15 to UTF-8 and enabling dead keys in Unicode mode:
pt_br: O seguinte exemplo ilustra conversão automática de mapa de teclas de ISO-8859-15 para UTF-8 e habilitação de teclas mortas em modo Unicode:

source: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Begin /etc/sysconfig/console UNICODE="1" KEYMAP="de-latin1" KEYMAP_CORRECTIONS="euro2" LEGACY_CHARSET="iso-8859-15" FONT="LatArCyrHeb-16 -m 8859-15" # End /etc/sysconfig/console</literal> EOF</userinput>
pt_br: <userinput>cat &gt; /etc/sysconfig/console &lt;&lt; "EOF" <literal># Início do /etc/sysconfig/console UNICODE="1" KEYMAP="de-latin1" KEYMAP_CORRECTIONS="euro2" LEGACY_CHARSET="iso-8859-15" FONT="LatArCyrHeb-16 -m 8859-15" # Fim do /etc/sysconfig/console</literal> EOF</userinput>

source: Some keymaps have dead keys (i.e., keys that don't produce a character by themselves, but put an accent on the character produced by the next key) or define composition rules (such as: <quote>press Ctrl+. A E to get &AElig;</quote> in the default keymap). Linux-&linux-version; interprets dead keys and composition rules in the keymap correctly only when the source characters to be composed together are not multibyte. This deficiency doesn't affect keymaps for European languages, because there accents are added to unaccented ASCII characters, or two ASCII characters are composed together. However, in UTF-8 mode it is a problem; e.g., for the Greek language, where one sometimes needs to put an accent on the letter <quote>alpha</quote>. The solution is either to avoid the use of UTF-8, or to install the X window system, which doesn't have this limitation, in its input handling.
pt_br: Alguns mapas de teclas tem teclas mortas (isto é, teclas que não produzem um carácter por elas próprias, mas põem um acento no carácter produzido pela próxima tecla) ou definem regras de composição (tais como: <quote>press Ctrl+. A E para obter &AElig;</quote> no mapa de teclas padrão). O Linux-&linux-version; interpreta teclas mortas e regras de composição no mapa de teclas corretamente somente quando os caracteres fonte a serem compostos juntos não são multi-byte. Essa deficiência não afeta mapas de teclas para idiomas europeus, pois lá acentos são adicionados a caracteres ASCII não acentuados, ou dois caracteres ASCII são compostos juntos. Entretanto, em modo UTF-8 isso é um problema; por exemplo, para o idioma grego, onde alguém de vez em quando precisa colocar um acento na letra <quote>alpha</quote>. A solução é ou evitar o uso de UTF-8, ou instalar o sistema de janelas X que não tem essa limitação no manuseio de entradas geradas dele.

source: For Chinese, Japanese, Korean, and some other languages, the Linux console cannot be configured to display the needed characters. Users who need such languages should install the X Window System, fonts that cover the necessary character ranges, and the proper input method (e.g., SCIM supports a wide variety of languages).
pt_br: Para chinês, japonês, coreano e alguns outros idiomas, o console do Linux não pode ser configurado para exibir os caracteres necessários. Usuários(as) que precisam de tais idiomas deveriam instalar o Sistema de Janelas X, fontes que cobrem os intervalos necessários de caracteres, e o método de entrada adequado (por exemplo, SCIM, suporta uma ampla variedade de idiomas).

source: The <filename>/etc/sysconfig/console</filename> file only controls the Linux text console localization. It has nothing to do with setting the proper keyboard layout and terminal fonts in the X Window System, with ssh sessions, or with a serial console. In such situations, limitations mentioned in the last two list items above do not apply.
pt_br: O arquivo <filename>/etc/sysconfig/console</filename> somente controla a localização do console de texto do Linux. Ele não tem nada a ver com configurar o esquema adequado de teclado e fontes de terminal no Sistema de Janelas X; com sessões do ssh; ou com um console serial. Em tais situações, as limitações mencionadas nos últimos dois itens de lista acima não se aplicam.

source: Creating Files at Boot
pt_br: Criando Arquivos na Inicialização

source: File creation at boot
pt_br: Criação de arquivo na inicialização

source: At times, it is desirable to create files at boot time. For instance, the <filename class="directory">/tmp/.ICE-unix</filename> directory is often needed. This can be done by creating an entry in the <filename>/etc/sysconfig/createfiles</filename> configuration script. The format of this file is embedded in the comments of the default configuration file.
pt_br: De vez em quando, é desejável criar arquivos em tempo de inicialização. Por exemplo, o diretório <filename class="directory">/tmp/.ICE-unix</filename> frequentemente é necessário. Isso pode ser feito criando-se uma entrada no script de configuração <filename>/etc/sysconfig/createfiles</filename>. O formato desse arquivo está embutido nos comentários do arquivo padrão de configuração.

source: Configuring the Sysklogd Script
pt_br: Configurando o Script Sysklogd

source: The <filename>sysklogd</filename> script invokes the <command>syslogd</command> program as a part of System V initialization. The <parameter>-m 0</parameter> option turns off the periodic timestamp mark that <command>syslogd</command> writes to the log files every 20 minutes by default. If you want to turn on this periodic timestamp mark, edit <filename>/etc/sysconfig/rc.site</filename> and define the variable SYSKLOGD_PARMS to the desired value. For instance, to remove all parameters, set the variable to a null value:
pt_br: O script <filename>sysklogd</filename> invoca o aplicativo <command>syslogd</command> como uma parte da inicialização do System V. A opção <parameter>-m 0</parameter> desliga a marca de carimbo de tempo periódica que o <command>syslogd</command> escreve nos arquivos de registro a cada 20 minutos por padrão. Se você quiser ligar essa marca de carimbo de tempo periódica, [então] edite <filename>/etc/sysconfig/rc.site</filename> e defina a variável SYSKLOGD_PARMS para o valor desejado. Por exemplo, para remover todos os parâmetros, configure a variável para um valor nulo:

source: See <userinput>man syslogd</userinput> for more options.
pt_br: Veja-se <userinput>man syslogd</userinput> para mais opções.

source: The rc.site File
pt_br: O Arquivo rc.site

source: The optional <filename>/etc/sysconfig/rc.site</filename> file contains settings that are automatically set for each SystemV boot script. It can alternatively set the values specified in the <filename>hostname</filename>, <filename>console</filename>, and <filename>clock</filename> files in the <filename class='directory'>/etc/sysconfig/</filename> directory. If the associated variables are present in both these separate files and <filename>rc.site</filename>, the values in the script-specific files take effect.
pt_br: O arquivo opcional <filename>/etc/sysconfig/rc.site</filename> contém configurações que são automaticamente configuradas para cada script de inicialização do SystemV. Ele pode alternativamente configurar os valores especificados nos arquivos <filename>hostname</filename>, <filename>console</filename> e <filename>clock</filename> no diretório <filename class='directory'>/etc/sysconfig/</filename>. Se as variáveis associadas estiverem presentes em ambos desses arquivos separados e <filename>rc.site</filename>, [então] os valores nos arquivos específicos de script tem precedência.

source: <filename>rc.site</filename> also contains parameters that can customize other aspects of the boot process. Setting the IPROMPT variable will enable selective running of bootscripts. Other options are described in the file comments. The default version of the file is as follows:
pt_br: <filename>rc.site</filename> também contém parâmetros que podem personalizar outros aspectos do processo de inicialização. Configurar a variável IPROMPT habilitará a execução seletiva de scripts de inicialização. Outras opções estão descritas nos comentários de arquivo. A versão padrão do arquivo é como se segue:

source: Customizing the Boot and Shutdown Scripts
pt_br: Personalizando os Scripts de Inicialização e Desligamento

source: The LFS boot scripts boot and shut down a system in a fairly efficient manner, but there are a few tweaks you can make in the rc.site file to improve speed even more, and to adjust messages according to your preferences. To do this, adjust the settings in the <filename>/etc/sysconfig/rc.site</filename> file above.
pt_br: Os scripts de inicialização do LFS inicializam e desligam um sistema de uma maneira bastante eficiente, porém existem uns poucos ajustes que você pode fazer no arquivo rc.site para aumentar a velocidade ainda mais e ajustar mensagens de acordo com suas preferências. Para fazer isso, ajuste as configurações no arquivo <filename>/etc/sysconfig/rc.site</filename> acima.

source: During the boot script <filename>udev</filename>, there is a call to <command>udev settle</command> that requires some time to complete. This time may or may not be required depending on the devices in the system. If you only have simple partitions and a single ethernet card, the boot process will probably not need to wait for this command. To skip it, set the variable OMIT_UDEV_SETTLE=y.
pt_br: Durante o script de inicialização <filename>udev</filename>, existe uma chamada para <command>udev settle</command> que exige algum tempo para completar. Esse tempo possivelmente ou possivelmente não seja exigido dependendo dos dispositivos no sistema. Se você tiver somente partições simples e uma placa ethernet, [então] o processo de inicialização provavelmente não precisará esperar por esse comando. Para pulá-lo, configure a variável OMIT_UDEV_SETTLE=y.

source: The boot script <filename>udev_retry</filename> also runs <command>udev settle</command> by default. This command is only needed if the <filename class='directory'>/var</filename> directory is separately mounted, because the clock needs the <filename>/var/lib/hwclock/adjtime</filename> file. Other customizations may also need to wait for udev to complete, but in many installations it is not necessary. Skip the command by setting the variable OMIT_UDEV_RETRY_SETTLE=y.
pt_br: O script de inicialização <filename>udev_retry</filename> também executa <command>udev settle</command> por padrão. Esse comando é necessário somente se o diretório <filename class='directory'>/var</filename> for montado separadamente, pois o relógio precisa do arquivo <filename>/var/lib/hwclock/adjtime</filename>. Outras personalizações possivelmente também precisem esperar que o Udev complete, porém em muitas instalações ele não é necessário. Pule o comando configurando a variável OMIT_UDEV_RETRY_SETTLE=y.

source: By default, the file system checks are silent. This can appear to be a delay during the bootup process. To turn on the <command>fsck</command> output, set the variable VERBOSE_FSCK=y.
pt_br: Por padrão, as verificações do sistema de arquivos são silenciosas. Isso pode parecer um atraso durante o processo de inicialização. Para ligar a saída gerada do <command>fsck</command>, configure a variável VERBOSE_FSCK=y.

source: When rebooting, you may want to skip the filesystem check, <command>fsck</command>, completely. To do this, either create the file <filename>/fastboot</filename> or reboot the system with the command <command>/sbin/shutdown -f -r now</command>. On the other hand, you can force all file systems to be checked by creating <filename>/forcefsck</filename> or running <command>shutdown</command> with the <parameter>-F</parameter> parameter instead of <parameter>-f</parameter>.
pt_br: Quando reinicializar, você possivelmente queira pular a verificação do sistema de arquivos, <command>fsck</command>, completamente. Para fazer isso, ou crie o arquivo <filename>/fastboot</filename> ou reinicialize o sistema com o comando <command>/sbin/shutdown -f -r now</command>. Por outro lado, você pode forçar que todos os sistemas de arquivos sejam verificados criando <filename>/forcefsck</filename> ou executando <command>shutdown</command> com o parâmetro <parameter>-F</parameter> em vez de <parameter>-f</parameter>.

source: Setting the variable FASTBOOT=y will disable <command>fsck</command> during the boot process until it is removed. This is not recommended on a permanent basis.
pt_br: Configurar a variável FASTBOOT=y desabilitará <command>fsck</command> durante o processo de inicialização até que ela seja removida. Isso não é recomendado em uma base permanente.

source: Normally, all files in the <filename class='directory'>/tmp</filename> directory are deleted at boot time. Depending on the number of files or directories present, this can cause a noticeable delay in the boot process. To skip removing these files set the variable SKIPTMPCLEAN=y.
pt_br: Normalmente, todos os arquivos no diretório <filename class='directory'>/tmp</filename> são deletados em tempo de inicialização. Dependendo do número de arquivos ou diretórios presentes, isso pode causar um atraso notável no processo de inicialização. Para pular a remoção desses arquivos configure a variável SKIPTMPCLEAN=y.
