Repository: espindula/br-lfs
Catalog: lfs/*/chapter09/whatnow.po
Languages: fr

source: What Now?
fr: Et maintenant&nbsp;?

source: Thank you for reading this LFS book. We hope that you have found this book helpful and have learned more about the system creation process.
fr: Merci d'avoir lu le livre LFS. Nous espérons que vous l'avez trouvé utile et que vous en avez appris davantage sur le processus de création d'un système.

source: Now that the LFS system is installed, you may be wondering <quote>What next?</quote> To answer that question, we have compiled a list of resources for you.
fr: Maintenant que le système LFS est installé, vous vous demandez peut-être <quote>Et ensuite&nbsp;?</quote> Pour répondre à cette question, nous vous avons préparé une liste de ressources.

source: Bugs and security notices are reported regularly for all software. Since an LFS system is compiled from source, it is up to you to keep abreast of such reports. There are several online resources that track such reports, some of which are shown below:
fr: Les bogues et informations de sécurité sont rapportés régulièrement pour tous les logiciels. Comme un système LFS est compilé à partir des sources, c'est à vous de prendre en compte ces rapports. Il existe plusieurs ressources en ligne pour garder trace de tels rapports. On va en indiquer quelques-unes ci-dessous&nbsp;:

source: CERT has a mailing list that publishes security alerts concerning various operating systems and applications. Subscription information is available at <ulink url="http://www.us-cert.gov/cas/signup.html"/>.
fr: CERT a une liste de diffusion publiant les alertes de sécurité concernant différents systèmes d'exploitation et applications. Les informations de souscription sont disponibles sur <ulink url="http://www.us-cert.gov/cas/signup.html"/>.

source: Bugtraq is a full-disclosure computer security mailing list. It publishes newly discovered security issues, and occasionally potential fixes for them. Subscription information is available at <ulink url="http://www.securityfocus.com/archive"/>.
fr: Bugtraq est une liste de diffusion divulguant tous les problèmes de sécurité informatique. Elle publie les problèmes de sécurité qui viennent d'être découverts et occasionnellement des corrections potentielles. Les informations de souscription sont disponibles sur <ulink url="http://www.securityfocus.com/archive"/>.

source: Beyond Linux From Scratch
fr: Beyond Linux From Scratch (au-delà de Linux From Scratch)

source: The Beyond Linux From Scratch book covers installation procedures for a wide range of software beyond the scope of the LFS Book. The BLFS project is located at <ulink url="&blfs-root;"/>.
fr: Le livre Beyond Linux From Scratch (au-delà de Linux From Scratch) couvre les procédures d'installation d'un grand nombre de logiciels en dehors du livre LFS. Le projet BLFS est disponible sur <ulink url="&blfs-root;"/>.

source: LFS Hints
fr: Astuces LFS

source: The LFS Hints are a collection of educational documents submitted by volunteers in the LFS community. The hints are available at <ulink url="&hints-index;"/>.
fr: Les astuces LFS sont une collection de documents éducatifs soumis par des volontaires de la communauté LFS. Ces astuces sont disponibles sur <ulink url="&hints-index;"/>.

source: Mailing lists
fr: Listes de diffusion

source: There are several LFS mailing lists you may subscribe to if you are in need of help, want to stay current with the latest developments, want to contribute to the project, and more. See <xref linkend="ch-intro-maillists"/> for more information.
fr: Il existe plusieurs listes de diffusion LFS auxquelles vous pouvez vous abonner si vous cherchez de l'aide, voulez suivre les derniers développements, voulez contribuer au projet et plus. Consultez le <xref linkend="ch-intro-maillists"/> pour plus d'informations.

source: The Linux Documentation Project
fr: Le projet de documentation Linux

source: The goal of The Linux Documentation Project (TLDP) is to collaborate on all of the issues of Linux documentation. The TLDP features a large collection of HOWTOs, guides, and man pages. It is located at <ulink url="http://www.tldp.org/"/>.
fr: Le projet de documentation Linux (TLDP) a pour but de favoriser la collaboration concernant la documentation de Linux. Le TLDP offre une large collection de guides pratiques, livres et pages de manuel. Il est disponible sur <ulink url="http://fr.tldp.org/"/>.
