Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/other/balsa.xml.1.chaine.po
Languages: fr

source: 3.9 MB
fr: 3.9 Mo

source: 78 MB
fr: 78 Mo

source: Introduction to Balsa
fr: Introduction à Balsa

source: The _A711_ package contains a _A96_ -2 based mail client.
fr: Le paquet _A711_ contient un client de messagerie basé sur _A96_ -2.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Balsa Dependencies
fr: Dépendances de Balsa

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: Optional to Build S/MIME Support
fr: Facultatives to Build S/MIME Support

source: User Notes:
fr: Notes utilisateur :

source: Installation of Balsa
fr: Installation de Balsa

source: Install _A711_ by running the following commands:
fr: Installez _A711_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This parameter is used to provide Rubrica2 address book support.
fr: Ce paramètre est utilisé pour fournir le support du carnet d'adresses Rubrica2.

source: Use this option to enable SSL support if _A587_ is installed.
fr: Utilisez cette option pour activer le support SSL si _A587_ est installé.

source: Use this option to enable LDAP address book support if _A578_ is installed.
fr: Utilisez cette option pour activer le support de l'annuaire LDAP si _A578_ est installé.

source: Use this option to enable SQLite address book support if _A713_ is installed.
fr: Utilisez cette option pour activer le support de l'annuaire SQLite si _A713_ est installé.

source: Use this option to enable GPG support if
fr: Utilisez cette option pour activer le supportde GPG si

source: (_A586_ ) is installed.
fr: (_A586_) est installé.

source: Use this option to enable S/MIME support if _A714_ is installed.
fr: Utilisez cette option pour activer le support S/MIME si _A714_ est installé.

source: Configuring Balsa
fr: Configuration de Balsa

source: Configuration Information
fr: Informations de configuration

source: All configuration of _A711_ is done through the _A711_ menu system, with mailbox configuration done with the Settings&mdash;&gt;Preferences menu.
fr: Toute la configuration de _A711_ se fait par le système de menu de _A711_ , avec la configuration des boîtes aux lettres qui se fait dans le menu Paramètres&mdash;&gt;Préférences.

source: Disable it in Settings/Preferences/POP3/advanced.
fr: Désactivez-le dans Paramètres/Préférences/POP3/Avancé.

source: If you enable filters for your incoming POP3 mail, you must have _X430_ installed, as the incoming mail will be handed off to _C1744_ for processing.
fr: Si vous activez des filtres pour votre courrier POP3 entrant, vous devez avoir installé _X430_ car le courrier entrant sera envoyé à _C1744_ pour être traité.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: balsa and balsa-ab
fr: balsa et balsa-ab

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a glib based mail client.
fr: est un client mail basé sur glib.

source: is the address-book application used by _C1745_ .
fr: est l'application de répertoire d'adresse utilisée par _C1745_.
