Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/other/ekiga.xml.1.chaine.po
Languages: fr

source: 8.0 MB
fr: 8.0 Mo

source: 315 MB
fr: 315 Mo

source: Introduction to Ekiga
fr: Introduction à Ekiga

source: It supports many audio and video codecs and all modern VoIP features for both SIP and H.323.
fr: Il supporte plusieurs codecs audio et vidéo et toutes les possibilités moderne de la VoIP pour SIP et H.323.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Ekiga Dependencies
fr: Dépendances de Ekiga

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Ekiga
fr: Installation de Ekiga

source: Install _A697_ by running the following commands:
fr: Installez _A697_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch disables support for the _A698_ .
fr: Ce paramètre désactive le support pour _A698_.

source: Remove if you have installed _A698_ .
fr: Effacez le si vous avez installé _A698_.

source: This switch disables documentation generation using _A124_ .
fr: Ce paramètre désactive la génération de la documentation en utilisant _A124_.

source: Remove if you have installed _A124_ .
fr: Effacez le si vous avez installé _A124_.

source: This switch disables LDAP support in _A697_ .
fr: Ce paramètre désactive le support LDAP dans _A697_.

source: Remove if you have installed _A578_ .
fr: Effacez le si vous avez installé _A578_.

source: This switch disables _A5_ support.
fr: Ce paramètre désactive le support _A5_.

source: Use if you have not installed _A5_ .
fr: Utilisez si vous n'avez pas installé _A5_.

source: This switch enables use of the _A699_ with _A697_ .
fr: Ce paramètre active l'utilisation de _A699_ avec _A697_.

source: Use if you have installed _A699_ .
fr: A utiliser si vous avez installé _A699_.

source: If you have not installed recommended dependencies you will need additional switches passed to _C121_ .
fr: Si vous n'avez pas installé les dépendances recommandées vous devrez passer des paramètres supplémentaires à _C121_.

source: Examine _C276_ output to see all available switches.
fr: Etudiez _C276_ pour voir tous les paramètres disponibles.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: ekiga, ekiga-config-tool and ekiga-helper
fr: ekiga, ekiga-config-tool et ekiga-helper

source: None
fr: Aucun

source: /usr/lib/ekiga, /usr/share/gnome/help/ekiga, /usr/share/omf/ekiga, /usr/share/pixmaps/ekiga and /usr/share/sounds/ekiga
fr: /usr/lib/ekiga, /usr/share/gnome/help/ekiga, /usr/share/omf/ekiga, /usr/share/pixmaps/ekiga et /usr/share/sounds/ekiga

source: Short Descriptions
fr: Descriptions courtes

source: is a SIP and H.323 VoIP, IP Telephony and Video Conferencing application which complies to the SIP and H.323 protocols.
fr: est une application de SIP et H.323 VoIP, IP Telephony et Video Conférence qui est compatibles avec les protocoles SIP et H.323.

source: fixes problems with the Ekiga settings.
fr: corrige les problèmes avec les paramètres Ekiga.
