Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/other/gparted.xml.1.chaine.po
Languages: fr

source: 3.1 MB
fr: 3.1 Mo

source: 111 MB
fr: 111 Mo

source: Introduction to Gparted
fr: Introduction à Gparted

source: Gparted is the Gnome Partition Editor, a Gtk 2 GUI for other command line tools that can create, reorganise or delete disk partitions.
fr: Gparted est l'éditeur de partitions de Gnome, un GUI Gtk 2 pour d'autres outils en ligne de commande qui peut créer, réorganiser ou effacer des partitions de disques.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Gparted Dependencies
fr: Dépendances de Gparted

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Install _A692_ by running the following commands:
fr: Installez _A692_ en lançant les commandes suivantes :

source: This package does not come with a testsuite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch disables building of the optional documentation.
fr: Cette option désactive la construction optionnelle de la documentation.

source: Remove it if you have installed _A124_ .
fr: Enlevez la si vous avez installé _A124_.

source: Using Gparted
fr: utilisation de gparted

source: To manipulate file systems Gparted has a run time dependency on various file system tools (you only need to install the tools for file systems you actually use):
fr: Pour manipuler les systèmes de fichiers, Gparted a des dépendances d'exécutions à différents outils de systèmes de fichiers () :

source: Root privileges are required to run Gparted.
fr: Les privilèges Root sont requis pour lancer Gparted.

source: If you wish to run the application from the menu, further applications and configurations are necessary.
fr: Si vous souhaitez lancer l'application depuis le menu, des applications et des configurations supplémentaire sont nécessaires.

source: Examples of applications that may be used:
fr: Exemples d'applications qui peuvent être utilisées :

source: Other solution is to use _A693_ , from _X187_ , but some configuration is necessary.
fr: Une autre solution est d'utiliser _A693_ , de _X187_ , mais un peu de configuration est nécessaire.

source: Another simple solution is _X418_ .
fr: Une autre solution simple est _X418_.

source: Below, we describe these two alternatives:
fr: A la suite, nous décrivons ces deux alternatives :

source: "ssh-askpass" and "pkexec".
fr: "ssh-askpass" et "pkexec".

source: To optionally use _X418_ if it is installed in your system, run the following commands as the _U1_ user:
fr: Pour utiliser facultativement _X418_ s'il est installé sur votre système, lancez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Now, clicking in the menu item for Gparted, a dialog appears in the screen, asking for the administrator password.
fr: Maintenant, en cliquant dans le menu de Gparted, une boite de dialogues apparaît à l'écran, demandant le mot de passe de l'administrateur.

source: and _X187_ .
fr: et _X187_.

source: Still as the _U1_ user, configure _X187_ and _X419_ to use _A693_ :
fr: Restez en tant qu'utilisateur _U1_, configurez _X187_ et _X419_ pour utiliser _A693_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: gparted, gpartedbin and gparted_polkit (optional)
fr: gparted, gpartedbin et gparted_polkit (facultatif)

source: None
fr: Aucun

source: /usr/share/gnome/help/gparted and /usr/share/omf/gparted
fr: /usr/share/gnome/help/gparted et /usr/share/omf/gparted

source: Short Descriptions
fr: Descriptions courtes

source: is a shell script which sets up the environment before calling _C1687_ .
fr: est un script shell qui initialise l'environnement avant d'appeler _C1687_.

source: is the Gparted binary.
fr: est le binaire de Gparted.

source: is an optional script which can be used to run gparted with polkit, from a menu.
fr: est un script facultatif qui peut être utilisé pour lancer gparted avec polkit, depuis un menu.
