Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/other/icedtea-web.xml.1.chaine.po
Languages: fr

source: 1.7 MB
fr: 1.7 Mo

source: 40 MB
fr: 40 Mo

source: Introduction to IcedTea-Web
fr: Introduction à IcedTea-Web

source: The _A695_ package contains both a _A287_ browser plugin, and a new webstart implementation, licensed under GPLV3.
fr: Le paquet _A695_ contient un plugin _A287_ de navigateur, et une novuelle implémentation webstart, sous licence GPLV3.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: IcedTea-Web Dependencies
fr: Dépendances de IcedTea-Web

source: Required
fr: Requises

source: Required at runtime, a web browser, such as:
fr: Requis pour l'éxécution, un navigateur web, comme :

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of IcedTea-Web
fr: Installation à IcedTea-Web

source: Install _A695_ by running the following commands:
fr: Installez _A695_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: To test the man pages are correctly installed, issue _C1697_ to display the respective man page.
fr: Pour tester que les pages de man sont correctement installées, tapez _C1697_ pour afficher la page de man.

source: If desired, you may install a .desktop file corresponding to an entry in a desktop menu for _C1698_ , as _U1_ user:
fr: si vous le souhaitez, vous pouvez installer un fichier .desktop correspondant à une entrée dans un menu de bureau pour _C1698_ , en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch provides the location of the installed _A251_ .
fr: Ce paramètre fourni l'emplacement d'installation de _A251_.

source: This switch disables installation of additional developer-related documentation.
fr: Ce paramètre désactive l'installation de documentations supplémentaires liées au developpement.

source: Omit this switch if you would like to do development work on _A695_ .
fr: Omettre ce paramètre si vous voulez faire des travaux de developpement sous _A695_.

source: Configuration Information
fr: Informations de configuration

source: The plugin must be a symlink for it to work.
fr: Le plugin doit être un lien symbolique pour qu'il fonctionne.

source: If not, the browsers will crash when you attempt to load a _A287_ application.
fr: Sinon, le navigateur pourra crasher quand vous voudrez charger une application _A287_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: itweb-settings, javaws and policyeditor
fr: itweb-settings, javaws et policyeditor

source: Short Descriptions
fr: Descriptions courtes

source: allows customization of the browser plugin and _A696_ .
fr: autorise la personalisation des plugins du navigateur et _A696_.

source: launches Java application/applets hosted on a network.
fr: lance les applications/applets Java situées sur un réseau.

source: view and modify security policy settings, including certificates, for javaws and the browser plugin.
fr: affiche et modifie les paramètres de sécurité , incluant les certificats, pour javaws et les greffons de navigateur.

source: is the _A287_ browser plugin.
fr: est le plugin de navigation _A287_.

source: contains functions for the about dialog boxes.
fr: contient les fonctions pour les boites de dialogue a propos.

source: contains functions for the _A695_ webstart implementation (NetX).
fr: contient les fonctions pour l'implementation webstart _A695_ (NetX).

source: contains functions for the _A695_ _A287_ plugin.
fr: contient les fonctions pour le plugin _A695_ 287_A_.
