Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/other/pidgin.xml.1.chaine.po
Languages: fr

source: 9.0 MB
fr: 9.0 Mo

source: 215 MB (additional 2 MB for the tests and 91 MB for API docs)
fr: 215 Mo (additional 2 Mo for the tests and 91 Mo for API docs)

source: Introduction to Pidgin
fr: Introduction à Pidgin

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Recommended patch:
fr: Correctif recommandé :

source: Pidgin Dependencies
fr: Dépendances de Pidgin

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: SSL support is required for the MSN Messenger, Yahoo!, Novel Groupwise and Google Talk protocol plugins.
fr: Le support SSL est requis pour les plugins des protocoles MSN Messenger, Yahoo!, Novel Groupwise et Google Talk.

source: Optional
fr: Optionnelles

source: Optional (runtime)
fr: Optionnelles (exécution)

source: User Notes:
fr: Notes utilisateur :

source: Installation of Pidgin
fr: Installation de Pidgin

source: First apply a patch to allow the package to build with the current _A701_ framework:
fr: Commencez par appliquer un correctif pour permettre au paquet de ce construire avec la version actuelle de _A701_ :

source: Compile _A700_ by running the following commands:
fr: Compilez _A700_ en lançant les commandes suivantes :

source: If you have _X68_ installed (_X85_ can be used also) and you wish to create the API documentation, issue:
fr: Si vous avez installé _X68_ , (on peut aussi utiliser _X85_) et si vous souhaitez créer la documentation de l'API, lancez :

source: Remember the remarks before _C121_ .
fr: Rapplez vous la remarque avant _C121_.

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you created the API documentation, install it using the following commands as the _U1_ user:
fr: Si vous avez créé la documentation de l'API, installez-la en utilisant les commandes suivantes en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Spellchecking.
fr: correction orthographique.

source: Video and voice.
fr: vidéo et voix.

source: Configuring Pidgin
fr: Configuration de Pidgin

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Most configuration can be accomplished by using the various preference settings inside the programs.
fr: La plupart de la configuration peut se faire en utilisant les divers paramètres de préférences dans les programmes.

source: Additionally, you can create a _F705_ file which can store gtk+-2 theme settings that affect _A700_ and other Gtk+ 2 applications.
fr: Vous pouvez créer aussi un fichier _F705_ qui stocke les réglages des thèmes Gtk+-2 touchant l'application _A700_ et les autres applications Gtk+-2.

source: Note that an example _F706_ file was installed during the package installation and can be used as a starting point or reference.
fr: Remarquez qu'un fichier exemple _F706_ a été installé lors de l'installation du paquet et il peut être utilisé comme point de départ ou de référence.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: libgnt.so, libpurple.so, and libpurple-client.so
fr: libgnt.so, libpurple.so, et libpurple-client.so

source: Short Descriptions
fr: Descriptions courtes

source: is a text-based instant messaging client.
fr: est un client de messagerie instantanée texte.

source: is a _A188_ 2 instant messaging client.
fr: est un client de messagerie instantanée _A188_ 2.

source: is an example that demonstrate how to use libpurple-client to communicate with purple.
fr: est un exemple qui démontre comment utiliser libpurple-client pour communiquer avec purple.

source: send remote commands to Pidgin/Finch.
fr: envoit des commandes distantes à Pidgin/Finch.

source: calls purple API functions using DBus and prints the return value.
fr: appelle des fonctions de l'API de purple en utilisant DBus et affiche la valeur de retour.

source: calls purple API functions using DBus.
fr: appelle les fonctions de l'API de purple en utilisant DBUS.

source: As opposed to _C1713_ , it does not print the return value.
fr: A l'opposé de _C1713_ , il n'affiche pas la valeur de retour.

source: is a python script to handle URL with purple.
fr: est un script python pour gérer les URL avec purple.
