Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/other/rox-filer.xml.1.chaine.po
Languages: fr

source: 1.8 MB
fr: 1.8 Mo

source: 19 MB
fr: 19 Mo

source: Introduction to Rox-Filer
fr: Introduction à rox-filer

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: rox-filer Dependencies
fr: Dépendances de rox-filer

source: Required
fr: Requises

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: If you want _A1720_ to be able to update the contents of a directory when changes are made to the files by other applications (eg, if a script is running) you will need to enable dnotify support in your kernel.
fr: Si vous souhaitez que _A1720_ puisse mettre à jour le contenu d'un répertoire quand des changements sont faits dans les fichiers par d'autres applications (par example, si un script est lancé) vous devez activer le support dnotify dans votre noyau.

source: In _C2091_ :
fr: Dans _C2091_ :

source: Save the new _F1648_ and then compile the kernel.
fr: Sauvegardez le nouveau _F1648_ et ensuite compiler le noyau.

source: Installation of Rox-Filer
fr: Installation de rox-filer

source: Compile _A1720_ with the following commands:
fr: Compile _A1720_ avec les commandes suivantes :

source: Now install it as the _U2_ user:
fr: Maintenant installez le en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This command hard codes /usr/share/rox as the directory for _A1720_ 's private files.
fr: Cette commande code en dur /usr/share/rox comme le répertoire pour les fichiers privés de _A1720_.

source: Without this sed rox needs the environment variable ${APP_DIR} to be set.
fr: Sans cela sed rox a besoin de la variable d'environnement ${APP_DIR} pour être initialisé.

source: These commands duplicate the icons for some common mime types.
fr: Ces commandes recopient les icônes pour quelques types mime connus.

source: Without these links _A1720_ would just display the default "unknown binary blob" icon.
fr: Sans ces liens _A1720_ affichera seulement l'icône par défaut "une goutte binaire inconnu".

source: Configuring RoxFiler
fr: Configuration de rox-filer

source: Configuration Information
fr: Informations de configuration

source: Most of the configuration of _A1720_ is achieved by right clicking on a _A1720_ window and choosing "Options" from the menu.
fr: La plus grande partie de la configuration de _A1720_ est réalisée en faisant des clics droits sur une fenêtre _A1720_ et en choisissant "Options" dans le menu.

source: It stores its settings in _F857_ .
fr: Cela enregistrera les paramètres initialisés dans _F857_.

source: A _A1720_ feature is that if there is an executable file called _F1649_ in a directory _A1720_ will first run _C3204_ before it opens the folder.
fr: Une possibilité de _A1720_ est que si il y a une fichier exécutable appelé _F1649_ dans un répertoire _A1720_ lancera en premier _C3204_ avant d'ouvrir le dossier.

source: As an example of how this may be used, if you have ssh access to another computer (perhaps another computer on you local network) with ssh configured for passwordless logins and you have _X676_ installed you can use AppRun to mount the remote computer in a local folder using _C1697_ .
fr: Par exemple cela peut servir a, si vous avez un accès ssh vers un autre ordinateur (peut être un autre ordinateur de votre réseau local) avec ssh configuré pour un accès sans mot de passe et que vous avez installé _X676_ , vous pouvez utiliser AppRun pour monter l'ordinateur distant dans un dossier local en utilisant _C1697_.

source: For this example AppRun script to work the folder must have the same name as the hostname of the remote computer:
fr: Pour cet exemple, le script AppRun fonctionne si le dossier à le même nom que le nom d'hôte de l'ordinateur distant :

source: That works fine for mounting, but to unmount it the command _C3598_ is ran.
fr: Cela fonctionne correctement pour le montage, mais pour le démontage la commande _C3601_ est lancé.

source: You could set that as your default umount command in your rox preferences, but you would then be unable to unmount any normal mountpoints (that need umount).
fr: Vous pouvez l'initialiser comme votre commande de démontage par défaut dans vos préférences de rox, mais vous ne pourrez plus démonter des points de montage normaux (qui utilise umount).

source: A script is needed that will unmount a Fuse mountpoint with _C3599_ and everything else with _C3207_ .
fr: Un script est utilisé pour démonter les points de montage Fuse avec _C3602_ et le reste avec _C3207_.

source: As the _U2_ user:
fr: En tant qu'utilisateur _U2_ :

source: Now, to make Rox use this simple script, open a Rox window, right click on it and choose Options from the menu.
fr: Maintenant, pour faire que Rox utilise ce script simple, ouvrez une fenêtre Rox, clic droit sur elle et choisissez Options dans le menu.

source: In the left hand list choose "Action windows" and then on the right hand side, where it says "Unmount command" change _C3207_ to _C3208_ .
fr: Dans la liste de choix prenez "Action windows" et ensuite dans le coté droit, ou il est dit "Unmount command" changez _C3207_ par _C3208_.

source: If you use a desktop environment like _A381_ or _A225_ you may like to create a _F1650_ file so that _A1720_ appears in the panel's menus.
fr: Si vous utilisez un environnement de bureau comme _A381_ ou _A225_ vous devez créer un fichier _F1650_ pour que _A1720_ apparaissent dans les panneaux de menu.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is the rox file manager.
fr: est le gestionnaire de fichiers rox.
