Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/other/rxvt-unicode.xml.1.chaine.po
Languages: fr

source: Introduction to rxvt-unicode
fr: Introduction à rxvt-unicode

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: rxvt-unicode Dependencies
fr: Dépendances de rxvt-unicode

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of rxvt-unicode
fr: Installation de rxvt-unicode

source: Install _A709_ by running the following commands:
fr: Installez _A709_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Add support for all non-multichoice options.
fr: Ajoute le support de toutes les options sans choix multiples.

source: Details about the different options can be found in the file _F709_ .
fr: Vous pouvez trouver des détails sur les différentes options dans le fichier _F709_.

source: Remove support for Xft fonts.
fr: Supprime le support pour les polices Xft.

source: Disable the embedded _A107_ interpreter.
fr: Désactive l'interpréteur _A107_ embarqué.

source: Remove support for libAfterImage.
fr: Supprime le support pour libAfterImage.

source: Configuring rxvt-unicode
fr: Configuration de rxvt-unicode

source: The _A709_ terminal emulator uses the resource class
fr: L'émulateur de terminal _A709_ utilise la classe de ressources

source: and the resource name
fr: et le nom de ressource

source: The following example will load the
fr: L'exemple suivant va charger l'extension _A_

source: In order to view the defined X resources, issue:
fr: Afin de voir les ressources X définies, tapez :

source: In order to add the modifications of the new user configuration file, keeping previously X configurations (of course, unless you are changing any on previously define), issue:
fr: Afin d'ajouter les modifications du nouveau fichier de configuration de l'utilisateur, en laissant les configurations X faites précédement (sauf si biensur vous avez changé les valeurs dans la nouvelle définition), tapez :

source: The _A709_ application can also run in a daemon mode, which makes it possible to open multiple terminal windows within the same process.
fr: Vous pouvez aussi lancer l'application _A709_ en mode démon, ce qui rend possible l'ouverture de plusieurs fenêtres de terminal dans un même processus.

source: The _C1740_ client then connects to the _C1741_ daemon and requests a new terminal window.
fr: Le client _C1740_ se connecte alors au démon _C1741_ et demande une nouvelle fenêtre de terminal.

source: Use this option with caution.
fr: Utilisez prudemment cette option.

source: If the daemon crashes, all the running processes in the terminal windows are terminated.
fr: Si le démon tombe, tous les processus lancés dans les fenêtres de terminal seront terminés.

source: You can start the _C1741_ daemon in the system or personal startup _C1742_ session script (e.g., _F283_ ) by adding the following lines near the top of the script:
fr: Vous pouvez lancer le démon _C1741_ dans le système ou dans le script de démarrage de la session _C1742_ personnelle (comme dans _F283_) en ajoutant les lignes suivantes vers le début du script :

source: For more information, examine the _C1743_ , _C1741_ , _C1740_ , and _F713_ man pages.
fr: Pour plus d'informations, consultez les pages de man de _C1743_ , _C1741_ , _C1740_ et de _F713_.

source: If you use a Desktop Environment, a menu entry can be included, issuing, as the _U1_ user:
fr: Si vous utilisez un environnement du bureau, une entrée de menu peut être ajoutées, en tapant, en tant qu'utilisateur _U1_ :

source: For that, you need _X41_ and at least one of _X28_ , _X405_ and _X29_ .
fr: Pour cela, vous avez besoin de _X41_ et au moins _X28_ ou _X405_ ou _X29_.

source: Uncomment the line with
fr: Décommentez la ligne avec

source: if _X34_ is installed.
fr: si _X34_ est installé.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: urxvt, urxvtd, and urxvtc
fr: urxvt, urxvtd, et urxvtc

source: Many _A107_ extensions located under _F714_
fr: Beaucoup d'extensions _A107_ situées sous _F714_

source: Short Descriptions
fr: Descriptions courtes

source: is a terminal emulator for the X Window System.
fr: est un émulateur de terminal pour le système X Window.

source: is the _C1743_ terminal daemon.
fr: est le démon de terminal _C1743_.

source: controls the _C1741_ daemon.
fr: contrôle le démon _C1741_.
