Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/other/tigervnc.xml.1.chaine.po
Languages: fr

source: 171 MB
fr: 171 Mo

source: Introduction to Tigervnc
fr: Introduction à Tigervnc

source: It allows creation of an Xorg server not tied to a physical console and also provides a client for viewing of the remote graphical desktop.
fr: Il permet la création d'un serveur Xorg non lié à une console physique et fournit également un client pour la visualisation des bureaux graphiques distants.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required file:
fr: Fichier requis :

source: Required patch:
fr: Correctif requis :

source: The version of _A200_ may eventually be a few versions out of date, but is required for the customizations needed for this package.
fr: La version de _A200_ peut être ancienne de quelques versions, mais est requise pour les personalisations nécessaire pour ce paquet.

source: Tigervnc Dependencies
fr: Dépendances de Tigervnc

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: User Notes:
fr: Notes utilisateur :

source: Installation of Tigervnc
fr: Installation de Tigervnc

source: Install _A703_ by running the following commands:
fr: Installez _A703_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Finally, create a menu entry.
fr: Finallement, créez une entrée de menu.

source: As the _U1_ user:
fr: En tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This set of patches modifies the standard Xorg server so that the Xvnc command can be built.
fr: Cet ensemble de correctif modifie le serveur Xorg Standard pour que la commande Xvnc puisse être construite.

source: This command extracts the standard Xorg packages into the tree in a location needed for modification.
fr: Cette commande extrait les paquets standard de Xorg dans une arborescence utilisée pour les modifications.

source: Most options that are usually needed for the standard Xorg server are not needed fror the Xvnc instance being built.
fr: La plupart des options que sont habituellement utilisées pour le serveur Xorg stanrd ne sont pas utile pour l'instance Xvnc qui est construite.

source: If the Xvnc server is not installed in the _F655_ directory, then create a link so the _C1718_ script can find it.
fr: Si le serveur Xvnc n'est pas installé dans le répertoire _F655_ , ensuite créez un lien afin que le script _C1718_ puisse le trouver.

source: Configuring Tigervnc
fr: Configuration de Tigervnc

source: The _F708_ file in that directory is a script specifying what commands to be run when a VNC desktop is started.
fr: Le fichier _F708_ dasn ce répertoire est un script spécifiant quelle commande doit être lancée quand un bureau VNC est démarré.

source: If no _F708_ file exists, _C1718_ will try to start an xterm in a twm session.
fr: Si le fichier _F708_ existe, _C1718_ essayera de démarrer un xterm dans une session twm.

source: An example _F708_ would be:
fr: Un exemple de _F708_ peut être :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Xvnc, vncconfig, vncpasswd, vncserver, vncviewer, and x0vncserver
fr: Xvnc, vncconfig, vncpasswd, vncserver, vncviewer, et x0vncserver

source: Short Descriptions
fr: Descriptions courtes

source: is a X VNC (Virtual Network Computing) server.
fr: est un serveur X VNC (Virtual Network Computing) server.

source: It is based on a standard X server, but it has a "virtual" screen rather than a physical one.
fr: Il est basé sur un serveur X standard, mais il a un écran "virtuel" plutot qu'un écran physique.

source: is a program to configure and control a VNC server.
fr: est un programme pour configurer et contrôler un serveur VNC.

source: allows you to set the password used to access VNC desktops.
fr: vous permet d'initialiser le mot de passe utilisé pour accéder aux bureaux VNC.

source: is a perl script used to start or stop a VNC server.
fr: est un script perl utilisé pour démarrer ou stopper un serveur VNC.

source: is a client used to access VNC desktops.
fr: est un client utilisé pour accéder aux bureaux VNC.

source: is a program to make an X display on a physical terminal accessible via TigerVNC or compatible viewers.
fr: est un programme pour rendre accessible un affichage X sur un terminal physique via TigerVNC ou un visualisateur compatible.
