Repository: espindula/br-lfs
Catalog: clfs/*/network/common/sysconfig-network.po
Languages: fr

source: Static Networking Configuration
fr: Configuration réseau statique

source: Creating the Static Network Interface Configuration Files
fr: Création de fichiers de configuration d'interface réseau statique

source: Which interfaces are brought up and down by the network script depends on the files and directories in the <filename class="directory">/etc/sysconfig</filename> hierarchy. This directory should contain a sub-directory for each interface to be configured, such as <filename>ifconfig.xyz</filename>, where <quote>xyz</quote> is a network interface name. Inside this directory would be files defining the attributes to this interface, such as its IP address(es), subnet masks, and so forth.
fr: Les interfaces qui sont activées et désactivées par le script réseau dépendent des fichiers et des répertoires dans la hiérarchie <filename class="directory">/etc/sysconfig</filename>. Ce répertoire devrait contenir un sous-répertoire par interface à configurer, comme <filename>infconf.xyz</filename>, où <quote>xyz</quote> est le nom de l'interface réseau. Dans ce répertoire se trouvent les fichiers définissant les attributs de cette interface, comme ses adresses IP, ses masques de sous-réseau etc.

source: Udev may assign random Network Card Interface names for some network cards such as enp2s1. If you are not sure what your Network Card Interface name is, you can always run <command>ip l</command> after you have booted your system. Again, it is important that <filename>ifconfig.xyz</filename> is named after correct Network Card Interface name (e.g. <filename>ifconfig.enp2s1</filename> or <filename>ifconfig.eth0</filename>) or systemd will fail to bring up your network interface.
fr: Udev peut assigner des noms arbitraires aux interfaces des cartes réseau pour certaines cartes réseau comme enp2s1. Si vous n'êtes pas sûr du nom de l'interface de votre carte réseau, vous pouvez toujours lancez <command>ip l</command> après avoir redémarré votre système. Il est important que <filename>ifconfig.xyz</filename> soit nommé d'après le bon nom d'interface (par exemple, <filename>ifconfig.enp2s1</filename> ou <filename>ifconfig.eth0</filename>) ou systemd n'arrivera pas à initialiser l'interface réseau.

source: The following command creates a sample <filename>ipv4</filename> file for the <emphasis>eth0</emphasis> device:
fr: La commande suivante crée un fichier <filename>ipv4</filename> d'exemple pour l'interface <emphasis>eth0</emphasis>&nbsp;:

source: The values of these variables must be changed in every file to match the proper setup.
fr: Les valeurs de ces variables doivent être changées dans chaque fichier pour correspondre à la bonne configuration.

source: The <envar>IFACE</envar> variable defines the interface name, for example, eth0. It is required for all network device configuration files.
fr: La variable <envar>IFACE</envar> définie le nom de l'interface, par exemple eth0. Elle est nécessaire pour chaque fichier de configuration de périphérique réseau.

source: The <envar>SERVICE</envar> variable defines the method used for obtaining the IP address. The CLFS-Network-Scripts package has a modular IP assignment format, and creating additional files in the <filename class="directory">/lib/services</filename> directory allows other IP assignment methods.
fr: La variable <envar>SERVICE</envar> définie la méthode utilisée pour obtenir l'adresse IP. Le paquet CLFS-Network-Scripts a un format d'assignation d'IP modulaire, et créer des fichiers complémentaires dans le répertoire <filename class="directory">/lib/services</filename> permet d'autres méthodes d'assignation d'IP.

source: The <envar>GATEWAY</envar> variable should contain the default gateway IP address, if one is present. If not, then comment out the variable entirely.
fr: La variable <envar>GATEWAY</envar> contient l'adresse IP de la passerelle par défaut, s'il y en a une. Sinon, commentez la variable.

source: The <envar>PREFIX</envar> variable needs to contain the number of bits used in the subnet. Each octet in an IP address is 8 bits. If the subnet's netmask is 255.255.255.0, then it is using the first three octets (24 bits) to specify the network number. If the netmask is 255.255.255.240, it would be using the first 28 bits. Prefixes longer than 24 bits are commonly used by DSL and cable-based Internet Service Providers (ISPs). In this example (PREFIX=24), the netmask is 255.255.255.0. Adjust the <envar>PREFIX</envar> variable according to your specific subnet.
fr: La variable <envar>PREFIX</envar> doit contenir le nombre de bit utilisé par le sous-réseau. Chaque octet dans une adresse IP fait 8 bits. Si le masque de sous-réseau est 255.255.255.0, alors il utilise les trois premiers octets (24 bits) pour spécifier le numéro de réseau. Si le masque est 255.255.255.240, il nécessite 28 bits. Les préfixes plus longs que 24 bits sont souvent utilisés par les fournisseurs d'accès internet (FAI) par câble et DSL. Dans cette exemple (PREFIX=24), le masque de sous-réseau est 255.255.255.0. Ajustez la variable <envar>PREFIX</envar> conformément à votre sous-réseau spécifique.

source: For more information see the <command>ifup</command> man page.
fr: Pour plus d'information voir la page de manuel de <command>ifup</command>.

source: To configure another DHCP Interface, Follow <xref linkend="ch-network-dhcpcd"/>.
fr: Pour configurer une autre interface DHCP, voir <xref linkend="ch-network-dhcpcd"/>.

source: Configuring the Network Interface at boot
fr: Configuration de l'interface réseau au démarrage

source: Enabling of the Network Interface configuration is done per interface. To enable Network Interface configuration at boot, run:
fr: Activer la configuration de l'interface réseau au démarrage se fait par interface. Pour activer la configuration de l'interface au démarrage, lancez&nbsp;:

source: To disable previously enabled Network Interface configuration at boot, run:
fr: Pour désactiver une configuration précédemment activée, lancez&nbsp;:

source: To manually start the Network Interface configuration, run:
fr: Pour démarrer manuellement une configuration d'interface, lancez&nbsp;:

source: Replace eth0 with the correct Network Interface name as described on the beginning of this page.
fr: Remplacez eth0 avec le bon nom de l'interface réseau, comme décrit au début de cette page.
