Repository: espindula/br-lfs
Catalog: clfs/*/network/common/systemd-network.po
Languages: fr

source: Networking Configuration with Systemd-networkd
fr: Configuration réseau avec systemd-networkd

source: Network Interface Configuration
fr: Configuration de l'interface réseau

source: Udev may assign random Network Card Interface names for some network cards such as enp2s1. If you are not sure what your Network Card Interface name is, you can always run <command>ip l</command> after you have booted your system. It is important that the <envar>Name</envar> variable in <filename>/etc/systemd/network</filename> contain the correct Network Card Interface name (e.g. <envar>Name=enp2s1</envar> or <envar>Name=eth0</envar>) or systemd will fail to bring up your network interface.
fr: Udev peut assigner des noms arbitraires aux interfaces des cartes réseau pour certaines cartes réseau comme enp2s1. Si vous n'êtes pas sûr du nom de l'interface de votre carte réseau, vous pouvez toujours lancez <command>ip l</command> après avoir redémarré votre système. Il est important que la variable <envar>Name</envar> dans <filename>/etc/systemd/network</filename> contienne le bon nom d'interface (par exemple, <envar>Name=enp2s1</envar> ou <envar>Name=eth0</envar>) ou systemd n'arrivera pas à initialiser l'interface réseau.

source: Static Network Interface Configuration
fr: Configuration statique de l'interface réseau

source: <command>systemd-networkd</command> uses <filename>/etc/systemd/network</filename> for configuration files. Refer to systemd.network(5) and systemd.netdev(5). Configure a network interface with a config file. Adjust Name= as required:
fr: <command>systemd-networkd</command> utilise <filename>/etc/systemd/network</filename> comme fichier de configuration. Référez-vous à systemd.network(5) et systemd.netdev(5). Configurez une interface réseau avec un fichier de configuration. Ajustez Name= comme requis&nbsp;:

source: The values of these variables must be changed in every file to match the proper setup.
fr: Les valeurs de ces variables doivent être changées dans chaque fichier pour correspondre à la bonne configuration.

source: The <envar>Name</envar> variable defines the interface name, for example, eth0. It is required for all network device configuration files.
fr: La variable <envar>Name</envar> définie le nom de l'interface, par exemple, eth0. Elle est requise pour tous les fichiers de configuration de périphériques réseau.

source: The <envar>Gateway</envar> variable should contain the default gateway IP address, if one is present. If not, then comment out the variable entirely.
fr: La variable <envar>Gateway</envar> devrait contenir l'adresse IP de la passerelle par défaut, s'il y en a une. Sinon, commentez cette variable.

source: For more information see the <command>systemd.netdev</command> man page.
fr: Pour plus d'informations, regardez la page de manuel de <command>systemd.netdev</command>.

source: Connecting to a network with DHCP
fr: Connection à un réseau avec DHCP

source: <command>systemd-networkd</command> uses <filename>/etc/systemd/network</filename> for configuration files. Refer to <filename>systemd.network(5)</filename> and <filename>systemd.netdev(5)</filename>. Configure a network interface with a config file. Adjust Name= as required:
fr: <command>systemd-networkd</command> utilise <filename>/etc/systemd/network</filename> comme fichier de configuration. Référez-vous à <filename>systemd.network(5)</filename> et <filename>systemd.netdev(5)</filename>. Configurez une interface réseau avec un fichier de configuration. Ajustez Name= comme requis&nbsp;:

source: <command>systemd-networkd</command> will automatically configure <filename>/run/systemd/network/resolv.conf</filename> when using DHCP. If you did not manually create <filename>/etc/resolv.conf</filename>, create a symlink:
fr: <command>systemd-networkd</command> configurera automatiquement <filename>/run/systemd/network/resolv.conf</filename> quand il utilise DHCP. Si vous n'avez pas créé manuellement de fichier <filename>/etc/resolv.conf</filename>, créez un lien symbolique&nbsp;:

source: Using Timesyncd
fr: Utiliser Timesyncd

source: Systemd includes a simple NTP client daemon, <command>systemd-timesyncd</command>, though it is disabled by default. If you want to enable it, you will first need to add a required user and group:
fr: Systemd inclus un démon client NTP simple, <command>systemd-timesyncd</command>, bien qu'il soit désactivé par défaut. Si vous souhaitez l'activer, vous devrez d'abord ajouter un utilisateur et un groupe requis&nbsp;:

source: Then, actually enable <command>systemd-timesyncd</command> so that it will run on system boot:
fr: Ensuite, activez <command>systemd-timesyncd</command> pour qu'il démarre au démarrage du système&nbsp;:

source: You can configure <command>systemd-timesyncd</command> by editing <filename>/etc/systemd/timesyncd.conf</filename>.
fr: Vous pouvez configurer <command>systemd-timesyncd</command> en modifiant <filename>/etc/systemd/timesyncd.conf</filename>.

source: Continue to <xref linkend="chapter-bootable"/>.
fr: Continuez avec <xref linkend="chapter-bootable"/>.
