Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/filesystems/aboutlvm.xml.1.chaine.po
Languages: fr

source: About Logical Volume Management (LVM)
fr: A propos de la gestion des volumes logiques (LVM)

source: LVM manages disk drives.
fr: LVM gères les disques durs.

source: It allows multiple drives and partitions to be combined into larger
fr: Il permet que de multiples disques et partitions soient combinés dans de gros

source: volume groups
fr: groupes de volumes

source: , assists in making backups through a
fr: , assiste la création de sauvegardes au travers de

source: , and allows for dynamic volume resizing.
fr: , et permet le redimensionnement dynamique des volumes.

source: It can also provide mirroring similar to a RAID 1 array.
fr: Il peut également fournir une fonction de miroir similaire à une grappe de RAID 1.

source: A complete discussion of LVM is beyond the scope of this introduction, but basic concepts are presented below.
fr: Une présentation complète de LVM est au-delà de la portée de cette introduction, mais les concepts de base sont présentés ci-dessous.

source: All commands must be run as the _U1_ user.
fr: toutes les commandes doivent être lancées en tant qu'utilisateur _U1_.

source: Management of disks with lvm is accomplished using the following concepts:
fr: La gestion des disques avec LVM est accomplie en utilisant les concepts suivants :

source: physical volumes
fr: Volumes physiques

source: These are physical disks or partitions such as /dev/sda3 or /dev/sdb.
fr: Il y a des disques ou des partitions physiques comme /dev/sda3 ou /dev/sdb.

source: These are named groups of physical volumes that can be manipulated by the administrator.
fr: On appelle groupes de volumes physiques ce qui peut être manipulées par l'administrateur.

source: The number of physical volumes that make up a volume group is arbitrary.
fr: Le nombre de volumes physiques qui constituent un groupe de volumes est arbitraire.

source: Physical volumes can be dynamically added or removed from a volume group.
fr: Les volumes physiques peuvent être dynamiquement ajoutés ou supprimés à partir d'un groupe de volumes.

source: logical volumes
fr: Volumes logique

source: Volume groups may be subdivided into logical volumes.
fr: Les groupes de volume peuvent être divisés en volumes logiques.

source: Each logical volume can then be individually formatted as if it were a regular Linux partition.
fr: Chaque volume logique peut être ainsi formaté individuellement comme s'il s'agissait d'une partition linux normal.

source: Logical volumes may be dynamically resized by the administrator according to need.
fr: Les volumes logiques peuvent être redimensionné dynamiquement par l'administrateur en fonction des besoins.

source: To give a concrete example, suppose that you have two 2 TB disks.
fr: Pour donner un exemple concret, supposez que vous avez deux disques de 2 To.

source: Also suppose a really large amount of space is required for a very large database, mounted on _F624_ .
fr: Supposons également qu'une grande quantité d'espace est nécessaire pour une très grosse base de données, monté en _F624_.

source: This is what the initial set of partitions would look like:
fr: Voila à quoi rassemblerait l'ensemble des initialisations des partitions :

source: First initialize the physical volumes:
fr: En premier initialisez les volumes physiques :

source: Next create a volume group named lfs-lvm:
fr: Ensuite créez un groupe de volume appelé lfs-lvm :

source: The status of the volume group can be checked by running the command _C1436_ .
fr: L'état du groupe de volumes peut être vérifiés en lançant la commande _C1436_.

source: Now create the logical volumes.
fr: Maintenant créez les volumes logiques.

source: Since there is about 3900 GB available, leave about 900 GB free for expansion.
fr: Comme il y a environ 3900 Go d'espace disponible, laissez environ 900 Go d'espace libre pour l'expansion.

source: Note that the logical volume named
fr: Notez que le volume logique appelé

source: is larger than any physical disk.
fr: est plus grand que chacun des disques physiques.

source: Finally the logical volumes can be formatted and mounted.
fr: Finallement les volumes logiques peuvent être formatés et montés.

source: In this example, the jfs file system (
fr: Dans cet exemple, Le système de fichier jfs (

source: ) is used for demonstration purposes.
fr: ) est utilisé pour la démonstration.

source: The LFS boot scripts automatically make these file systems available to the system in the checkfs script.
fr: Les scripts de démarrage de LFS rendront automatiquement ces systèmes de fichiers disponible pour les scripts checkfs.

source: Edit the _F625_ file as required to automatically mount them.
fr: L'édition du fichier _F625_ est nécessaire pour automatiquement le monter.

source: A LVM logical volume can host a root filesystem, but requires the use of an initramfs (initial RAM file system) and is not discussed here.
fr: Un volume logique peut acceuillir un système de fichier racine, mais nécessite l'utilisation d'un initramfs (initial RAM file system) et cela n'est pas présenté ici.

source: For a more information about LVM, see the _L113_ and the lvm man pages.
fr: Pour plus d'information sur LVM, voir le _L113_ et les pages de manuel lvm.
