Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/filesystems/ext3.xml.1.chaine.po
Languages: fr

source: Ext3 is a journaling file system that is an extension to the ext2 file system.
fr: Ext3 est un système de fichiers journalisé qui est une extension du système de fichiers ext2.

source: It is backward compatible with ext2 and the conversion from ext2 to ext3 is trivial.
fr: Sa compatibilité est rétroactive avec l'ext2 et la conversion de l'ext2 en ext3 est facile.

source: You don't need to install anything to use ext3, all the required packages are available with a bare LFS system.
fr: Vous n'avez pas besoin d'installer quoique ce soit pour utiliser l'ext3, tous les paquets nécessaires sont disponibles avec un système LFS de base.

source: When building the kernel, ensure that you have compiled in ext3 support.
fr: Lors de la construction du noyau, assurez-vous de compiler le support ext3.

source: If you want your root partition to be ext3, then compile the ext3 support in the kernel, else you may compile it as a module.
fr: Si vous voulez que votre partition racine soit en ext3, compilez le support ext3 en dur, sinon vous pouvez le compiler en module.

source: Recompile the kernel if needed.
fr: Recompilez le noyau si besoin.

source: Edit your _F984_ .
fr: Éditr votre _F984_.

source: For each partition that you want to convert into ext3, edit the entry so that it looks similar to the following line.
fr: Pour chaque partition que vous voulez convertir en ext3, éditez l'entrée pour la faire ressembler à la ligne suivante.

source: In the above line, replace _F855_ by the partition (e.g., _F1694_ ), _F877_ by the mount point (e.g., _F255_ ).
fr: Dans la ligne ci-dessus, remplacez _F855_ par la partition (comme dans _F1694_), _F877_ par le point de montage (comme dans _F255_).

source: The _O441_ in the last field ensures that the partition will be checked for consistency during the boot process by the _C3293_ script as recommended by the maintainer.
fr: Le _O441_ du dernier champ garantit que la cohérence de la partition sera vérifiée pendant le processus de démarrage par le script _C3293_ comme le recommande le mainteneur.

source: You may replace the _O442_ fs type in the above by _O443_ if you want to ensure that the partition is mounted even if you accidentally disable ext3 support in the kernel.
fr: Vous pouvez remplacer le type de système de fichiers _O443_ si vous voulez vous assurer que la partition sera montée même si vous désactivez accidentellement le support ext3 du noyau.

source: For each partition that you have converted to ext3 in _F1695_ , enable the journal for the partition by running the following command.
fr: Pour chaque partition convertie en ext3 dans _F1695_ , activer le journal de la partition en lançant la commande suivante.

source: Remount the concerned partitions, or simply reboot if you have recompiled the kernel to enable ext3 support.
fr: Remontez les partitions concernées ou redémarrez simplement si vous avez recompilé le noyau pour activer le support ext3.

source: More information is available at _L3758_ .
fr: Plus d'informations sont disponibles sur _L3758_.

source: This information is still relevant to the 2.6 kernels.
fr: Ces informations sont encore pertinentes pour les noyaux 2.6.
