Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/filesystems/fuse.xml.1.chaine.po
Languages: fr

source: 552 KB
fr: 552 Ko

source: 8.2 MB (9.8 MB with API documentation)
fr: 8.2 Mo (9.8 Mo with API documentation)

source: Introduction to Fuse
fr: Introduction à Fuse

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Fuse Dependencies
fr: Dépendances de Fuse

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: Enable the following options in the kernel configuration and recompile the kernel if necessary:
fr: Activez les options suivantes dans la configuration du noyau et recompilez le noyau si nécessaire :

source: Installation of Fuse
fr: Installation de Fuse

source: After the _C121_ script has finished you will see a warning shown below.
fr: Après que le script _C121_ soit terminé, vous pourrez voir l'avertissement ci-dessous.

source: You can safely disregard this warning.
fr: Vous pouvez ignorer cet avertissement.

source: Install _A612_ by running the following commands:
fr: Installez _A612_ en lançant les commandes suivantes :

source: If you have _X68_ installed and wish to build the API documentation, issue _C1448_ .
fr: Si vous avez installé _X68_ et si vous souhaitez construire la documentation de l'API, exécutez _C1448_.

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you built the API documentation, install it as the _U1_ user by issuing the following commands:
fr: Si vous construisez la documentation de l'API, installez la en tant qu'utilisateur _U1_ en tapant les commandes suivantes :

source: Command Explanations
fr: Explications des commandes

source: This parameter installs the bootscript into _F626_ as a bootscript is not required.
fr: Ce paramètre installe les scripts de démarrage dans _F626_ quand un script de démarrage n'est pas utile.

source: This moves the _A611_ library to the root filesystem so that it is available early in the boot process in case _F291_ is mounted on a separate partition and _X230_ is built with a system-installed version of _A611_ .
fr: Ceci déplace la bibliothèque _A291_ vers le système de fichiers racine afin qu'il soit disponible très tôt lors du démarrage au cas où _F230_ se trouve sur une partition séparée et où _X611_ est construit avec une version du système de _A611_.

source: This removes the unneeded bootscript.
fr: Cela efface les scripts de démarrage inutiles.

source: Config Files
fr: Fichiers de configuration

source: Some options regarding mount policy can be set in the file _F627_ .
fr: Quelques options au regard de la gestion du montage peuvent être utilisées dans le fichier _F627_.

source: To install the file run the following command as the _U1_ user:
fr: Pour installer le fichier lancez la commande suivante en tant qu'utilisateur _U1_ :

source: Additional information about the meaning of the configuration options are found in the man page.
fr: Des informations supplémentaires à propos de la signification des options de configuration peuvent être trouvées sur la page de manuel.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: fusermount, mount.fuse, and ulockmgr_server
fr: fusermount, mount.fuse et ulockmgr_server.

source: libfuse.so and libulockmgr.so
fr: libfuse.so et libulockmgr.so

source: /usr/include/fuse and /usr/share/doc/fuse-&fuse-version;
fr: /usr/include/fuse

source: Short Descriptions
fr: Descriptions courtes

source: is a set users ID root program to mount and unmount Fuse filesystems.
fr: est un programme d'initialisation des ID utilisateurs pour monter et démonter les systèmes de fichiers Fuse.

source: is the command _C1454_ would call to mount a Fuse filesystem.
fr: est la commande _C1454_ à appeler pour monter un système de fichiers Fuse.

source: is the Userspace Lock Manager Server for Fuse filesystems.
fr: est le serveur de gestion pour le verrouillage de l'espace utilisateur pour les systèmes de fichiers Fuse.

source: contains the _A611_ API functions.
fr: contient les fonctions de l'API de _A611_.

source: contains the Userspace Lock Manager API functions.
fr: contient les fonctions de l'API de la gestion du verrouillage de l'espace utilisateur.
