Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/filesystems/initramfs.xml.1.chaine.po
Languages: fr

source: About initramfs
fr: A propos de initramfs

source: The only purpose of an initramfs is to mount the root filesystem.
fr: La seule fonction d'un initramfs est de monter le système de fichier racine.

source: The initramfs is a complete set of directories that you would find on a normal root filesystem.
fr: L'initramfs est un ensemble complet de répertoires que vous pouvez trouver dans un système de fichiers racine normal.

source: It is bundled into a single cpio archive and compressed with one of several compression algorithms.
fr: Il est regroupé dans une seule archive cpio et compressé avec l'un des nombreux algorithmes de compression.

source: At boot time, the boot loader loads the kernel and the initramfs image into memory and starts the kernel.
fr: Au moment du démarrage, le chargeur de démarrage charge le noyau et l'image initramfs dans la mémoire et démarre le noyau.

source: The kernel checks for the presence of the initramfs and, if found, mounts it as / and runs /init.
fr: Le noyau vérifie la présence d'un initramfs et, s'il le trouve, le monte sur / et lance /init.

source: The init program is typically a shell script.
fr: Le programme init est typiquement un script shell.

source: Note that the boot process takes longer, possibly significantly longer, if an initramfs is used.
fr: Notez que le processus de démarrage est plus long, même significativement plus long, si un initramfs est utilisé.

source: For most distributions, kernel modules are the biggest reason to have an initramfs.
fr: Pour la plupart des distributions, les modules du noyau sont la plus importante raison d'avoir un initramfs.

source: In a general distribution, there are many unknowns such as file system types and disk layouts.
fr: Dans une distribution générale, il y a beaucoup d'inconnues comme les types de systèmes de fichiers et les couches des disques.

source: In a way, this is the opposite of LFS where the system capabilities and layout are known and a custom kernel is normally built.
fr: Dans un sens, c'est l'opposé de LFS où les capacités et les couches du systèmes sont connus et un noyau personnalisé est normallement construit.

source: In this situation, an initramfs is rarely needed.
fr: Dans cette situation, un initramfs est rarement nécessaire.

source: There are only four primary reasons to have an initramfs in the LFS environment:
fr: Il y a seulement quatre raison d'avoir un initramfs dans un environnement LFS :

source: loading the rootfs from a network, loading it from an LVM logical volume, having an encrypted rootfs where a password is required, or for the convenience of specifying the rootfs as a LABEL or UUID.
fr: le chargement du rootfs depuis le réseau, son chargement depuis un volume logique LVM, avoir un rootfs chiffré où un mot de passe est requis, ou pour le confort d'un rootfs spécifié par un LABEL ou un UUID.

source: Anything else usually means that the kernel was not configured properly.
fr: Les autres cas signifient souvent que le noyau n'est pas configuré correctement.

source: Building an initramfs
fr: Construire un initramfs

source: If you do decide to build an initramfs, the following scripts will provide a basis to do it.
fr: Si vous décidez de construire un initramfs, les scripts suivants fourniront les bases pour le faire.

source: The scripts will allow specifying a rootfs via partition UUID or partition LABEL or a rootfs on an LVM logical volume.
fr: Les scripts autoriseront la spécification du rootfs via un UUID de partition ou un LABEL de partition ou un rootfs dans un volume logique LVM.

source: They do not support an encrypted root file system or mounting the rootfs over a network card.
fr: Ils ne supportent pas les systèmes de fichier racine chiffrés ou le montage des rootfs par des cartes réseaux.

source: To install these scripts, run the following commands as the _U1_ user:
fr: Pour installer ces scripts, lancez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Using an initramfs
fr: Utilisation d'un initramfs

source: Required Runtime Dependency
fr: Dépendance d'exécution requise

source: User Notes:
fr: Notes utilisateur :

source: To build an initramfs, run the following as the _U1_ user:
fr: Pour construire un initramfs, lancer ce qui suit en tant qu'utilisateur _U1_ :

source: The optional argument is the directory where the appropriate kernel modules are located.
fr: L'argument facultatif est le répertoire ou les modules appropriés du noyau sont enregistrés.

source: This must be a subdirectory of _F641_ .
fr: Cela peut être un sous-répertoire de _F641_.

source: If no modules are specified, then the initramfs is named
fr: Si aucun modules n'est spécifié, alors l'initramfs est appelé

source: If a kernel version is specified, the initrd is named
fr: Si une version du noyau est précisé, le fichier initrd est appelé

source: and is only appropriate for the specific kernel specified.
fr: et est seulement destiné pour le noyau spécifiquement précisé.

source: The output file will be placed in the current directory.
fr: Les fichiers de sortie seront enregistré dans le répertoire courant.

source: After generating the initrd, copy it to the _F642_ directory.
fr: Après avoir généré le fichier initrd, copiez le dans le répertoire _F642_.

source: Now edit _F232_ and add a new menuentry.
fr: Maintenant éditez _F232_ et ajoutez une nouvelle entrée dans le menu.

source: Below are several examples.
fr: En dessous, plusieurs exemples sont présentés.

source: Finally, reboot the system and select the desired system.
fr: Finalement, redémarrez le système et sélectionnez le système désiré.
