Repository: espindula/br-lfs
Catalog: blfs/*/archive/lxde/lxpolkit.po
Languages: fr

source: 200 KB
fr: 200 Kio

source: 2.7 MB
fr: 2.7 Mio

source: Introduction to LXPolkit
fr: Introduction à LXPolkit

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&lxpolkit-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&lxpolkit-download-http;"/>

source: Download (FTP): <ulink url="&lxpolkit-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&lxpolkit-download-ftp;"/>

source: Download MD5 sum: &lxpolkit-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &lxpolkit-md5sum;

source: Download size: &lxpolkit-size;
fr: Taille du téléchargement&nbsp;: &lxpolkit-size;

source: Estimated disk space required: &lxpolkit-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &lxpolkit-buildsize;

source: Estimated build time: &lxpolkit-time;
fr: Estimation du temps de construction&nbsp;: &lxpolkit-time;

source: LXPolkit Dependencies
fr: Dépendances de LXPolkit

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/lxpolkit"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/lxpolkit"/>

source: Installation of LXPolkit
fr: Installation de LXPolkit

source: Install <application>LXPolkit</application> by running the following commands:
fr: Installez <application>LXPolkit</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
