Repository: espindula/br-lfs
Catalog: blfs/*/x/icons/gnome-themes-extra.po
Languages: fr

source: 2.8 MB
fr: 2.8 Mo

source: 40 MB
fr: 40 Mo

source: Introduction to GNOME Themes Extra
fr: Introduction à GNOME Themes Extra

source: The <application>GNOME Themes Extra</application> package, formerly known as <application>GNOME Themes Standard</application>, contains various components of the default <application>GNOME</application> theme.
fr: Le paquet <application>GNOME Themes Extra</application>, précédemment connu sous le nom de <application>GNOME Themes Standard</application>, contient divers composants du thème <application>GNOME</application> par défaut.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-themes-extra-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-themes-extra-download-http;"/>

source: Download (FTP): <ulink url="&gnome-themes-extra-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-themes-extra-download-ftp;"/>

source: Download MD5 sum: &gnome-themes-extra-md5sum;
fr: Somme de contrôle MD5&nbsp;: &gnome-themes-extra-md5sum;

source: Download size: &gnome-themes-extra-size;
fr: Taille du téléchargement&nbsp;: &gnome-themes-extra-size;

source: Estimated disk space required: &gnome-themes-extra-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-themes-extra-buildsize;

source: Estimated build time: &gnome-themes-extra-time;
fr: Estimation du temps de construction&nbsp;: &gnome-themes-extra-time;

source: GNOME Themes Extra Dependencies
fr: Dépendances de GNOME Themes Extra

source: Required
fr: Requises

source: <xref role="nodep" linkend="gtk2"/> or <xref linkend="gtk3"/> with <xref linkend="librsvg"/> or both
fr: <xref role="nodep" linkend="gtk2"/> ou <xref linkend="gtk3"/> with <xref linkend="librsvg"/> ou les deux

source: Installation of GNOME Themes Extra
fr: Installation de GNOME Themes Extra

source: Install <application>GNOME Themes Extra</application> by running the following commands:
fr: Installez <application>GNOME Themes Extra</application> en exécutant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <option>--disable-gtk2-engine</option>: This switch disables the GTK+-2 theming engine.
fr: <option>--disable-gtk2-engine</option>&nbsp;: Ce paramètre désactive le moteur de thème GTK+-2.

source: <option>--disable-gtk3-engine</option>: This switch disables the GTK+-3 theming engine.
fr: <option>--disable-gtk3-engine</option>&nbsp;: Ce paramètre désactive le moteur de thème GTK+-3.

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: is the Adwaita <application>GTK+-2</application> engine theme
fr: est le moteur de thème Adwaita pour <application>GTK+-2</application>
