Repository: espindula/br-lfs
Catalog: blfs/*/x/icons/gnome-icon-theme-extras.po
Languages: fr

source: 1.7 MB
fr: 1.7 Mo

source: 12 MB
fr: 12 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to GNOME Icon Theme Extras
fr: Introduction à GNOME Icon Theme Extras

source: The <application>GNOME Icon Theme Extras</application> package contains extra icons for the <application>GNOME</application> Desktop.
fr: Le paquet <application>GNOME Icon Theme Extras</application> contient un thème d'icônes pour le bureau <application>GNOME</application>.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&gnome-icon-theme-extras-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&gnome-icon-theme-extras-download-http;"/>

source: Download (FTP): <ulink url="&gnome-icon-theme-extras-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&gnome-icon-theme-extras-download-ftp;"/>

source: Download MD5 sum: &gnome-icon-theme-extras-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &gnome-icon-theme-extras-md5sum;

source: Download size: &gnome-icon-theme-extras-size;
fr: Taille du téléchargement&nbsp;: &gnome-icon-theme-extras-size;

source: Estimated disk space required: &gnome-icon-theme-extras-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &gnome-icon-theme-extras-buildsize;

source: Estimated build time: &gnome-icon-theme-extras-time;
fr: Estimation du temps de construction&nbsp;: &gnome-icon-theme-extras-time;

source: GNOME Icon Theme Extras Dependencies
fr: Dépendances de GNOME Icon Theme Extras

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: <xref linkend="git"/> and <xref linkend="inkscape"/>
fr: <xref linkend="git"/> et <xref linkend="inkscape"/>

source: User Notes: <ulink url="&blfs-wiki;/gnome-icon-theme-extras"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/gnome-icon-theme-extras"/>

source: Installation of GNOME Icon Theme Extras
fr: Installation de GNOME Icon Theme Extras

source: Install <application>GNOME Icon Theme Extras</application> by running the following commands:
fr: Installez <application>GNOME Icon Theme Extras</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:
