Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xsoft/graphweb/seamonkey.xml.1.chaine.po
Languages: fr

source: 175 MB
fr: 175 Mo

source: 4.3 GB (84 MB installed)
fr: 4.3 Go (84 Mo installé)

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: They might be tested to work, but they can be out of date or contain security holes.
fr: Elles peuvent être testées pour fonctionner, mais elles peuvent être obsolètes ou contenir des failles de sécurité.

source: If you are in any doubt about this (e.g.
fr: Si vous avez le moindre doute à propos de cela (e.g.

source: currently maintained
fr: actuellement maintenue

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of SeaMonkey
fr: Installation de SeaMonkey

source: The configuration of _A1095_ is accomplished by creating a _F1002_ file containing the desired configuration options.
fr: La configuration de _A1095_ est réalisée en créant un fichier _F1002_ contenant les options de configurations désirées.

source: A default _F1002_ file is created below.
fr: Un fichier _F1002_ par défaut est créé ci-dessous.

source: To see the entire list of available configuration options (and an abbreviated description of each one), issue _C320_ .
fr: Pour voir la liste complète des options de configuration disponibles (et une description abrégée de chacune), taper _C320_.

source: You may also wish to review the entire file and uncomment any other desired options.
fr: Il se peut que vous vouliez aussi relire tout le fichier et décommenter d'autres options souhaitées.

source: Create the file by issuing the following command:
fr: Créez le fichier en lançant la commande suivante :

source: First, fix building with system freetype-2.6 or later:
fr: Pour commencer, corrigez la construction avec freetype-2.6 ou supérieur :

source: If you are compiling _A1095_ in chroot, make sure you have the _E151_ environment variable set or prepend _E16_ to the first make command below.
fr: Si vous compilez _A1095_ dans un chroot, soyez certain que vous avez la variable d'environnement _E151_ initialisée ou déclarez _E16_ avant le premier make suivant.

source: The moz-build-dir directory needs to exist and match the value used in mozconfig (above) for the object directory (MOZ_OBJDIR):
fr: Le répertoire moz-build-dir doit exister et correspondre à la valeur utilisée dans mozconfig (aprés) pour le répertoire des objets (MOZ_OBJDIR) :

source: Compile _A1095_ by running the following command:
fr: Compilez _A1095_ en lançant la commande suivante :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Install _A1095_ by issuing the following commands as the _U2_ user:
fr: Installez _A1095_ en lançant les commandes suivantes en tant qu'utilisateur _U2_ :

source: All the Development Libraries and Headers
fr: Toutes les bibliothèques et les entêtes de développement

source: If you want to install the full _A1095_ development environment, as the _U2_ user:
fr: Si vous souhaitez installer l'environnement complet de développement de _A1095_ , en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: Mozilla products are packaged to allow the use of a configuration file which can be used to pass the configuration settings to the _C101_ command.
fr: Les produits Mozilla sont empaquetés pour permettre d'utiliser un fichier de configuration qui peut être utilisé pour passer les paramètres de configuration à la commande _C101_.

source: Configuring SeaMonkey
fr: Configuration de SeaMonkey

source: For installing various _A1095_ plugins, refer to _L2684_ .
fr: Pour installer des plugins _A1095_ , reportez-vous au _L2684_.

source: Along with using the
fr: Tout en utilisant le menu

source: Preferences
fr: Préférences

source: menu to configure _A1095_ 's options and preferences to suit individual tastes, finer grain control of many options is only available using a tool not available from the general menu system.
fr: pour configurer les options et les préférences de _A1095_ pour les adapter à vos propres goûts, un contrôle bien plus approfondi de nombreuses options n'est disponible qu'en utilisant un outil non disponible depuis le système de menu général.

source: To access this tool, you'll need to open a browser window and enter _U20_ in the address bar.
fr: Pour accéder à cet outil, vous devrez ouvrir une fenêtre du navigateur et entrer _U20_ dans la barre d'adresse.

source: This will display a list of the configuration preferences and information related to each one.
fr: Cela affichera une liste des préférences de configuration et des informations liées à chacune.

source: You can use the
fr: Vous pouvez utiliser la barre de

source: Filter:
fr: Filtre :

source: bar to enter search criteria and narrow down the listed items.
fr: pour entrer des critères de recherche et réduire les éléments listés.

source: Changing a preference can be done using two methods.
fr: La modification d'une préférence se fait en utilisant deux méthodes.

source: One, if the preference has a boolean value (True/False), simply double-click on the preference to toggle the value and two, for other preferences simply right-click on the desired line, choose
fr: L'une, si la préférence a une valeur boléenne (True/False, Vrai/Faux), double-cliquez simplement sur la préférence pour basculer la valeur, et l'autre, pour les préférences, faites simplement un clic droit sur la ligne désirée, choisissez

source: Modify
fr: Modifier

source: from the menu and change the value.
fr: dans le menu et modifiez la valeur.

source: Creating new preference items is accomplished in the same way, except choose
fr: La création de nouveaux éléments de préférence se fait de la même façon, sauf qu'il faut choisir

source: New
fr: Nouveau

source: from the menu and provide the desired data into the fields when prompted.
fr: du menu et fournir les données désirées dans les champs quand on vous le demande.

source: There is a multitude of configuration parameters you can tweak to customize _A1095_ .
fr: Il y a énormément de paramètres de configuration que vous pouvez bidouiller pour personnaliser _A1095_.

source: A very extensive list of these parameters can be found at _L175_ .
fr: Vous pouvez trouver une liste très complète de ces paramètres sur _L175_.

source: If you use a desktop environment like _A381_ or _A225_ you may wish to create a _F1456_ file so that _A1095_ appears in the panel's menus.
fr: Si vous utilisez un environnement de bureau comme _A381_ ou _A225_ vous pourriez souhaiter créer un fichier _F1456_ pour que _A242_ apparaisse dans les menus du bureau.

source: If you didn't enable _A1097_ in your mozconfig change the StartupNotify line to false.
fr: Si vous n'avez pas activé _A1097_.

source: As the _U2_ user:
fr: En tant qu'utilisateur _U2_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directory
fr: Répertoire installé

source: Short Descriptions
fr: Descriptions courtes

source: is the Mozilla browser/email/newsgroup/chat client suite.
fr: est une suite client de navigateur/messagerie/nouvelles/groupe/chat.
