Repository: espindula/br-lfs
Catalog: book/*/chapter02/mounting.po
Languages: fr

source: Mounting the New Partition
fr: Monter la nouvelle partition

source: Now that a file system has been created, the partition needs to be made accessible. In order to do this, the partition needs to be mounted at a chosen mount point. For the purposes of this book, it is assumed that the file system is mounted under the directory specified by the <envar>LFS</envar> environment variable as described in the previous section.
fr: Maintenant qu'un système de fichiers a été créé, la partition doit être accessible. Pour cela, la partition a besoin d'être montée sur un point de montage choisi. Pour ce livre, il est supposé que le système de fichiers est monté sur le répertoire spécifié par la variable d'environnement <envar>LFS</envar> comme décrit dans la section précédente.

source: Create the mount point and mount the LFS file system by running:
fr: Créez le point de montage et montez le système de fichiers LFS en lançant&nbsp;:

source: Replace <replaceable>&lt;xxx&gt;</replaceable> with the designation of the LFS partition.
fr: Remplacez <replaceable>&lt;xxx&gt;</replaceable> par la désignation de la partition LFS.

source: If using multiple partitions for LFS (e.g., one for <filename class="directory">/</filename> and another for <filename class="directory">/usr</filename>), mount them using:
fr: Si vous utilisez plusieurs partitions pour LFS (par exemple une pour <filename class="directory">/</filename> et une autre pour <filename class="directory">/usr</filename>), montez-les en utilisant&nbsp;:

source: Replace <replaceable>&lt;xxx&gt;</replaceable> and <replaceable>&lt;yyy&gt;</replaceable> with the appropriate partition names.
fr: Remplacez <replaceable>&lt;xxx&gt;</replaceable> et <replaceable>&lt;yyy&gt;</replaceable> par les noms de partition appropriés.

source: Ensure that this new partition is not mounted with permissions that are too restrictive (such as the <option>nosuid</option> or <option>nodev</option> options). Run the <command>mount</command> command without any parameters to see what options are set for the mounted LFS partition. If <option>nosuid</option> and/or <option>nodev</option> are set, the partition will need to be remounted.
fr: Assurez-vous que cette nouvelle partition n'est pas montée avec des droits trop restrictifs (tels que les options <option>nosuid</option> ou <option>nodev</option>). Lancez la commande <command>mount</command> sans aucun paramètre pour voir les options configurées pour la partition LFS montée. Si les options <option>nosuid</option> et/ou <option>nodev</option> sont configurées, la partition devra être remontée.

source: If you are using a <systemitem class="filesystem">swap</systemitem> partition, ensure that it is enabled using the <command>swapon</command> command:
fr: Si vous utilisez une partition de <systemitem class="filesystem">swap</systemitem>, assurez-vous qu'elle est activée en lançant la commande <command>swapon</command>&nbsp;:

source: Replace <replaceable>&lt;zzz&gt;</replaceable> with the name of the <systemitem class="filesystem">swap</systemitem> partition.
fr: Remplacez <replaceable>&lt;zzz&gt;</replaceable> par le nom de la partition de <systemitem class="filesystem">swap</systemitem>.

source: Now that there is an established place to work, it is time to download the packages.
fr: Maintenant qu'il existe un endroit établi pour travailler, il est temps de télécharger les paquets.
