Repository: espindula/br-lfs
Catalog: blfs/*/networking/mailnews/alpine.po
Languages: fr

source: 4.6 MB
fr: 4.6 Mo

source: 122 MB
fr: 122 Mo

source: Introduction to Alpine
fr: Introduction à Alpine

source: <application>Alpine</application> is a text-based email client developed by the University of Washington.
fr: <application>Alpine</application> est un client de courriel textuel développé par l'université de Washington.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&alpine-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&alpine-download-http;"/>

source: Download (FTP): <ulink url="&alpine-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&alpine-download-ftp;"/>

source: Download MD5 sum: &alpine-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &alpine-md5sum;

source: Download size: &alpine-size;
fr: Taille du téléchargement&nbsp;: &alpine-size;

source: Estimated disk space required: &alpine-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &alpine-buildsize;

source: Estimated build time: &alpine-time;
fr: Estimation du temps de construction&nbsp;: &alpine-time;

source: Alpine Dependencies
fr: Dépendances de Alpine

source: Recommended
fr: Recommandées

source: Optional
fr: Facultatives

source: <xref linkend="openldap"/>, <xref linkend="mitkrb"/>, <xref linkend="aspell"/>, <xref linkend="tcl"/>, and <xref linkend="linux-pam"/>
fr: <xref linkend="openldap"/>, <xref linkend="mitkrb"/>, <xref linkend="aspell"/>, <xref linkend="tcl"/> et <xref linkend="linux-pam"/>

source: User Notes: <ulink url="&blfs-wiki;/alpine"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/alpine"/>

source: Installation of Alpine
fr: Installation de Alpine

source: Install <application>Alpine</application> by running the following commands:
fr: Installez <application>Alpine</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <command>LIBS+="-lcrypto"</command>: Enable linking to <xref linkend="openssl"/>. Additional linker flags are required for <xref linkend="linux-pam"/>, <option>-lpam</option>, and for <xref linkend="mitkrb"/>, <option>-lkrb5</option>.
fr: <command>LIBS+="-lcrypto"</command>&nbsp;: Active la liaison à <xref linkend="openssl"/>. Des drapeaux de l'éditeur de lien supplémentaires sont requis pour <xref linkend="linux-pam"/>, <option>-lpam</option> et pour <xref linkend="mitkrb"/>, <option>-lkrb5</option>.

source: <parameter>--without-ldap</parameter>: Disables LDAP support.
fr: <parameter>--without-ldap</parameter>&nbsp;: Désactive le support de LDAP.

source: <parameter>--without-krb5</parameter>: Disables Kerberos support.
fr: <parameter>--without-krb5</parameter>&nbsp;: Désactive le support de Kerberos.

source: <parameter>--without-pam</parameter>: Disables Linux-PAM support.
fr: <parameter>--without-pam</parameter>&nbsp;: Désactive le support de Linux-PAM.

source: <parameter>--without-tcl</parameter>: Disables TCL support.
fr: <parameter>--without-tcl</parameter>&nbsp;: Désactive le support de TCL.

source: <parameter>--with-ssl-dir=/usr</parameter>: Sets the root path to OpenSSL libraries and include files.
fr: <parameter>--with-ssl-dir=/usr</parameter>&nbsp;: Initialise le chemin de la racine vers les bibliothèques et les fichiers d'en-tête de OpenSSL.

source: <parameter>--with-passfile=.pine-passfile</parameter>: Sets the password cache file.
fr: <parameter>--with-passfile=.pine-passfile</parameter>&nbsp;: Initialise le fichier de cache de mots de passe.

source: <option>--without-ssl</option>: Disables OpenSSL support.
fr: <option>--without-ssl</option>&nbsp;: Désactive le support d'OpenSSL.

source: Configuring Alpine
fr: Configuration de Alpine

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations sur la configuration

source: It is not required to manually edit any configuration files to use the <application>Alpine</application> email client. Users can configure <application>Alpine</application> using the graphical configuration menu, which stores the changes in <filename>~/.pinerc</filename>.
fr: Il n'est pas nécessaire de modifier manuellement aucun fichier de configuration pour utiliser le client de courriel <application>Alpine</application>. Les utilisateurs peuvent configurer <application>Alpine</application> avec le menu de configuration graphique, qui enregistre les changements dans <filename>~/.pinerc</filename>.

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: alpine, pico, pilot, rpdump, and rpload
fr: alpine, pico, pilot, rpdump et rpload

source: Short Descriptions
fr: Descriptions courtes

source: is the Alpine mailer.
fr: est le courrielleur Alpine.

source: is a standalone text editor similar to the Alpine message composer.
fr: est un éditeur de texte autonome similaire au compositeur de message d'Alpine.

source: is a standalone file system navigator.
fr: est un navigateur du système de fichiers autonome.

source: is a utility for downloading a pinerc or address book to the local machine.
fr: est un utilitaire pour télécharger un pinerc ou un carnet d'adresses sur la machine locale.

source: is a utility for uploading a local pinerc or address book to an IMAP server.
fr: est un utilitaire pour téléverser un pinerc ou un carnet d'adresseslocal version un serveur IMAP.
