Repository: espindula/br-lfs
Catalog: clfs/*/materials/common/patches.po
Languages: fr

source: Needed Patches
fr: Correctifs nécessaires

source: In addition to the packages, several patches are also required. These patches correct any mistakes in the packages that should be fixed by the maintainer. The patches also make small modifications to make the packages easier to work with. The following patches will be needed to build a CLFS system:
fr: En plus des paquets, quelques correctifs sont aussi requis. Ces correctifs corrigent certaines erreurs contenues dans les paquets, ces erreurs devraient être corrigées par le mainteneur. Les correctifs font aussi quelques modifications pour faciliter l'utilisation des paquets. Les correctifs suivants seront nécessaires pour construire un système CLFS&nbsp;:

source: Automake Perl Patch - <token>&automake-perl-patch-size;</token>:
fr: Automake Correctif Perl - <token>&automake-perl-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&automake-perl-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&automake-perl-patch;"/>

source: MD5 sum: <literal>&automake-perl-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&automake-perl-patch-md5;</literal>

source: Bash Branch Update Patch - <token>&bash-branch_update-patch-size;</token>:
fr: Bash Correctif de mise à jour de branche - <token>&bash-branch_update-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&bash-branch_update-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&bash-branch_update-patch;"/>

source: MD5 sum: <literal>&bash-branch_update-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&bash-branch_update-patch-md5;</literal>

source: Coreutils Uname Patch - <token>&coreutils-uname-patch-size;</token>:
fr: Coreutils Correctif Uname - <token>&coreutils-uname-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&coreutils-uname-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&coreutils-uname-patch;"/>

source: MD5 sum: <literal>&coreutils-uname-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&coreutils-uname-patch-md5;</literal>

source: Iana-Etc Protocol and Port Numbers Update - <token>&iana-etc-numbers_update-patch-size;</token>:
fr: Mise à jour des numéros de protocole et de port d'Iana-Etc - <token>&iana-etc-numbers_update-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&iana-etc-numbers_update-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&iana-etc-numbers_update-patch;"/>

source: MD5 sum: <literal>&iana-etc-numbers_update-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&iana-etc-numbers_update-patch-md5;</literal>

source: Intool Perl Fix - <token>&intltool-perl-patch-size;</token>:
fr: Intool Correction Perl - <token>&intltool-perl-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&intltool-perl-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&intltool-perl-patch;"/>

source: MD5 sum: <literal>&intltool-perl-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&intltool-perl-patch-md5;</literal>

source: IPUtils Fixes Patch - <token>&iputils-build-patch-size;</token>:
fr: IPUtils Correctif - <token>&iputils-build-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&iputils-build-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&iputils-build-patch;"/>

source: MD5 sum: <literal>&iputils-build-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&iputils-build-patch-md5;</literal>

source: Linux Sublevel Patch - <token>&linux-sublevel-patch-size;</token>:
fr: Linux Correctif de sous-niveau - <token>&linux-sublevel-patch-size;</token>&nbsp;:

source: Download: <ulink url="&kernel;linux/kernel/v&linux-dl-version;/&linux-sublevel-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&kernel;linux/kernel/v&linux-dl-version;/&linux-sublevel-patch;"/>

source: MD5 sum: <literal>&linux-sublevel-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&linux-sublevel-patch-md5;</literal>

source: MPFR Fixes Patch - <token>&mpfr-fixes-patch-size;</token>:
fr: MPFR Correctif - <token>&mpfr-fixes-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&mpfr-fixes-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&mpfr-fixes-patch;"/>

source: MD5 sum: <literal>&mpfr-fixes-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&mpfr-fixes-patch-md5;</literal>

source: Ncurses Bash Patch - <token>&ncurses-bashfix-patch-size;</token>:
fr: Ncurses Correctif Bash - <token>&ncurses-bashfix-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&ncurses-bashfix-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&ncurses-bashfix-patch;"/>

source: MD5 sum: <literal>&ncurses-bashfix-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&ncurses-bashfix-patch-md5;</literal>

source: Readline Branch Update - <token>&readline-branch_update-patch-size;</token>:
fr: Readline mise à jour de la branche - <token>&readline-branch_update-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&readline-branch_update-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&readline-branch_update-patch;"/>

source: MD5 sum: <literal>&readline-branch_update-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&readline-branch_update-patch-md5;</literal>

source: Sysvinit Tools Updates Patch - <token>&sysvinit-tools_updates-patch-size;</token>:
fr: Sysvinit Correctif de mise à jour des outils - <token>&sysvinit-tools_updates-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&sysvinit-tools_updates-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&sysvinit-tools_updates-patch;"/>

source: MD5 sum: <literal>&sysvinit-tools_updates-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&sysvinit-tools_updates-patch-md5;</literal>

source: Vim Branch Update Patch - <token>&vim-branch_update-patch-size;</token>:
fr: Vim Correctif de mise à jour de la branche - <token>&vim-branch_update-patch-size;</token>&nbsp;:

source: Download: <ulink url="&patches-root;&vim-branch_update-patch;"/>
fr: Téléchargement&nbsp;: <ulink url="&patches-root;&vim-branch_update-patch;"/>

source: MD5 sum: <literal>&vim-branch_update-patch-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&vim-branch_update-patch-md5;</literal>

source: Total size of these patches: about <returnvalue/>
fr: Taille totale de ces correctifs&nbsp;: environ <returnvalue/>

source: In addition to the above required patches, there exist a number of optional patches created by the CLFS community. These optional patches solve minor problems or enable functionality that is not enabled by default. Feel free to peruse the patches database located at <ulink url="&patches-root;"/> and acquire any additional patches to suit the system needs.
fr: En plus des correctifs requis ci-dessus, il existe un certain nombre de correctifs optionnels créés par la communauté CLFS. Ces correctifs résolvent des problèmes mineurs ou activent des fonctionnalités qui ne sont pas disponibles par défaut. Vous pouvez consulter la base de données des correctifs à loisir sur <ulink url="&patches-root;"/> et vous pouvez récupérer tout correctif supplémentaire correspondant aux besoins de votre système.
