Repository: espindula/br-lfs
Catalog: lfs/*/prologue/organization.po
Languages: fr, pt_br

source: Structure
pt_br: Estrutura

source: This book is divided into the following parts.
fr: Ce livre est divisé en plusieurs parties.
pt_br: Este livro é dividido nas seguintes partes.

source: Part I - Introduction
fr: Partie I — Introduction
pt_br: Parte I – Introdução

source: Part I explains a few important notes on how to proceed with the LFS installation. This section also provides meta-information about the book.
fr: La première partie donne quelques informations importantes, comme la façon d'installer LFS. Cette section fournit aussi des méta-informations sur le livre.
pt_br: A Parte I explica umas poucas observações importantes a respeito do como proceder com a instalação do LFS. Essa seção também fornece metainformação a respeito do livro.

source: Part II - Preparing for the Build
fr: Partie II — Préparation de la construction
pt_br: Parte II – Preparando para a Construção

source: Part II describes how to prepare for the building process&mdash;making a partition, downloading the packages, and compiling temporary tools.
fr: La deuxième partie décrit comment préparer le processus de construction&nbsp;: création d'une partition, téléchargement des paquets et compilation d'outils temporaires.
pt_br: A Parte II descreve como se preparar para o processo de construção&mdash;criando uma partição, baixando os pacotes e compilando as ferramentas temporárias.

source: Part III - Building the LFS Cross Toolchain and Temporary Tools
fr: Partie III — Construction des outils croisés LFS et des outils temporaires
pt_br: Parte III – Construindo o Conjunto de Ferramentas Cruzadas e Ferramentas Temporárias do LFS

source: Part III provides instructions for building the tools needed for constructing the final LFS system.
fr: La troisième partie fournit des instructions pour construire les outils requis pour la construction du système LFS final.
pt_br: A Parte III fornece instruções para a construção das ferramentas necessárias para construir o sistema LFS final.

source: Part IV - Building the LFS System
fr: Partie IV — Construction du système LFS
pt_br: Parte IV - Construindo o Sistema LFS

source: Part IV guides the reader through the building of the LFS system&mdash;compiling and installing all the packages one by one, setting up the boot scripts, and installing the kernel. The resulting Linux system is the foundation on which other software can be built to expand the system as desired. At the end of this book, there is an easy to use reference listing all of the programs, libraries, and important files that have been installed.
fr: La quatrième partie guide le lecteur tout au long de la construction du système LFS&nbsp;: compilation et installation de tous les paquets un par un, mise en place des scripts de démarrage et installation du noyau. Le système Linux basique résultant est la fondation à partir de laquelle d'autres logiciels peuvent être construits pour étendre le système de la façon désirée. À la fin du livre se trouve une référence facile à utiliser et listant tous les programmes, bibliothèques et fichiers importants qui ont été installés.
pt_br: A Parte IV guia o(a) leitor(a) ao longo da construção do sistema LFS&mdash;compilando e instalando todos os pacotes, um por um, configurando os scripts de inicialização e instalando o núcleo. O sistema Linux resultante é a fundação sobre a qual outros aplicativos podem ser construídos para expandir o sistema conforme desejado. No final deste livro, existe uma referência fácil de usar listando todos os aplicativos, bibliotecas e arquivos importantes que tenham sido instalados.

source: Part V - Appendices
fr: Partie V — Annexes
pt_br: Parte V - Anexos

source: Part V provides information about the book itself including acronyms and terms, acknowledgments, package dependencies, a listing of LFS boot scripts, licenses for the distribution of the book, and a comprehensive index of packages, programs, libraries, and scripts.
fr: La cinquième partie fournit des informations sur le livre lui-même, en particulier les acronymes et les termes utilisés, les remerciements, les dépendances des paquets, une liste des scripts de démarrage de LFS, la licence pour redistribuer ce livre et un catalogue complet des paquets, des programmes, des bibliothèques et des scripts.
pt_br: A Parte V fornece informação acerca do próprio livro incluindo acrônimos e termos, reconhecimentos, dependências de pacotes, uma listagem dos scripts de inicialização do LFS, licenças para a distribuição do livro e um índice compreensível dos pacotes, aplicativos, bibliotecas e scripts.
