Repository: espindula/br-lfs
Catalog: lfs/*/prologue/standards.po
Languages: fr, pt_br

source: LFS and Standards
fr: LFS et les standards
pt_br: O LFS e os Padrões

source: The structure of LFS follows Linux standards as closely as possible. The primary standards are:
fr: La structure de LFS suit les standards Linux aussi fidèlement que possible. Les principaux standards sont&nbsp;:
pt_br: A estrutura do LFS segue os padrões do Linux tão rigorosamente quanto possível. Os padrões primários são:

source: <ulink url="https://pubs.opengroup.org/onlinepubs/9699919799/"> POSIX.1-2008</ulink>.
pt_br: <ulink url="http://pubs.opengroup.org/onlinepubs/9699919799/"> POSIX.1-2008</ulink>.

source: <ulink url="https://refspecs.linuxfoundation.org/FHS_3.0/fhs/index.html"> Filesystem Hierarchy Standard (FHS) Version 3.0</ulink>
fr: <ulink url="https://refspecs.linuxfoundation.org/FHS_3.0/fhs/index.html"> <foreignphrase>Filesystem Hierarchy Standard</foreignphrase> (FHS) version 3.0</ulink>
pt_br: <ulink url="http://refspecs.linuxfoundation.org/FHS_3.0/fhs/index.html"> Filesystem Hierarchy Standard (FHS) Version 3.0</ulink>

source: <ulink url="https://refspecs.linuxfoundation.org/lsb.shtml">Linux Standard Base (LSB) Version 5.0 (2015)</ulink>
fr: <ulink url="https://refspecs.linuxfoundation.org/lsb.shtml"><foreignphrase>Linux Standard Base</foreignphrase> (LSB) version 5.0 (2015)</ulink>
pt_br: <ulink url="http://refspecs.linuxfoundation.org/lsb.shtml">Linux Standard Base (LSB) Version 5.0 (2015)</ulink>

source: The LSB has four separate specifications: Core, Desktop, Runtime Languages, and Imaging. Some parts of Core and Desktop specifications are architecture specific. There are also two trial specifications: Gtk3 and Graphics. LFS attempts to conform to the LSB specifications for the IA32 (32-bit x86) or AMD64 (x86_64) architectures discussed in the previous section.
fr: La LSB comporte quatre spécifications distinctes&nbsp;: le cœur, le bureau, les langages à l'exécution et l'impression. Certaines parties des spécifications du cœur et du bureau comportent des exigences qui s'appliquent à la construction. Il y a aussi deux spécifications pour l'évaluation&nbsp;: Gtk3 et les graphismes. LFS s'applique à respecter les constructions IA32 (32-bit x86) ou AMD64 (x86_64) qui ont été évoquées dans la section précédente.
pt_br: O LSB tem quatro especificações separadas: Core, Desktop, Runtime Languages e Imaging. Algumas partes das especificações Core e Desktop são específicas de arquitetura. Existem também duas especificações experimentais: Gtk3 e Graphics. O LFS tenta obedecer às especificações LSB para as arquiteturas IA32 (x86 de 32 bits) ou AMD64 (x86_64) discutidas na sessão anterior.

source: Many people do not agree with these requirements. The main purpose of the LSB is to ensure that proprietary software can be installed and run on a compliant system. Since LFS is source based, the user has complete control over what packages are desired; you may choose not to install some packages that are specified by the LSB.
fr: Les exigences de la LSB ne font pas l'unanimité. Leur objectif principal est de s'assurer que les logiciels propriétaires pourront être installés et lancés correctement sur un système conforme. Comme LFS est basée sur le code source, les utilisateurs ont un contrôle total des paquets qui les intéressent et certains choisissent de ne pas installer certains paquets qui sont cités dans la LSB.
pt_br: Muitas pessoas não concordam com essas exigências. O principal propósito do LSB é o de garantir que software proprietário consiga ser instalado e execute em um sistema compatível. Dado que o LFS é baseado no fonte, o(a) usuário(a) tem total controle sobre quais pacotes são desejados; você possivelmente escolha não instalar alguns pacotes que são especificados pelo LSB.

source: While it is possible to create a complete system that will pass the LSB certification tests "from scratch", this can't be done without many additional packages that are beyond the scope of the LFS book. Installation instructions for these additional packages can be found in BLFS.
fr: Il est possible de créer de toute pièce un système complet qui soit capable de réussir les tests de certification LSB, mais cela requiert des paquets supplémentaires qui vont au-delà des objectifs de LFS. Vous trouverez les instructions d'installation de ces paquets supplémentaires dans BLFS.
pt_br: Ao tempo em que é possível criar um sistema completo que passará nos testes de certificação do LSB "desde o zero", isso não pode ser feito sem muitos pacotes adicionais que estão além do escopo do livro LFS. Instruções de instalação para esses pacotes adicionais podem ser encontradas no BLFS.

source: Packages supplied by LFS needed to satisfy the LSB Requirements
fr: Paquets fournis par LFS requis pour satisfaire les exigences de la LSB
pt_br: Pacotes fornecidos pelo LFS necessários para satisfazer as Exigências do LSB

source: <emphasis>LSB Core:</emphasis>
fr: <emphasis>C&oelig;ur de la LSB&nbsp;:</emphasis>
pt_br: <emphasis>Núcleo do LSB:</emphasis>

source: Bash, Bc, Binutils, Coreutils, Diffutils, File, Findutils, Gawk, Grep, Gzip, M4, Man-DB, Ncurses, Procps, Psmisc, Sed, Shadow, Tar, Util-linux, Zlib
pt_br: Bash, Bc, Binutils, Coreutils, Diffutils, File, Findutils, Gawk, Grep, Gzip, M4, Man-DB, Ncurses, Procps, Psmisc, Sed, Shadow, Tar, Util-linux e Zlib

source: <emphasis>LSB Desktop:</emphasis>
fr: <emphasis>LSB pour les bureaux&nbsp;:</emphasis>
pt_br: <emphasis>Área de trabalho do LSB:</emphasis>

source: None
fr: Aucun
pt_br: Nenhum

source: <emphasis>LSB Runtime Languages:</emphasis>
fr: <emphasis>LSB pour les langages à l'exécution&nbsp;:</emphasis>
pt_br: <emphasis>Linguagens de Tempo de Execução do LSB:</emphasis>

source: Perl, Python
pt_br: Perl e Python

source: <emphasis>LSB Imaging:</emphasis>
fr: <emphasis>LSB pour l'impression&nbsp;:</emphasis>
pt_br: <emphasis>Imagem no LSB:</emphasis>

source: <emphasis>LSB Gtk3 and LSB Graphics (Trial Use):</emphasis>
fr: <emphasis>LSB pour Gtk3 et LSB pour les graphismes (évaluation):</emphasis>
pt_br: <emphasis>LSB Gtk3 e Gráficos LSB (Uso Experimental):</emphasis>

source: Packages supplied by BLFS needed to satisfy the LSB Requirements
fr: Paquets fournis par BLFS requis pour satisfaire les exigences de la LSB
pt_br: Pacotes fornecidos pelo BLFS necessários para satisfazer as Exigências do LSB

source: At, Batch (a part of At), Cpio, Ed, Fcrontab, LSB-Tools, NSPR, NSS, PAM, Pax, Sendmail (or Postfix or Exim), time
fr: At, Batch (partie d'At), Cpio, Ed, Fcrontab, LSB-Tools, NSPR, NSS, PAM, Pax, Sendmail (ou Postfix ou Exim), time
pt_br: At, Batch (uma parte de At), Cpio, Ed, Fcrontab, LSB-Tools, NSPR, NSS, PAM, Pax, Sendmail (ou Postfix ou Exim), time

source: Alsa, ATK, Cairo, Desktop-file-utils, Freetype, Fontconfig, Gdk-pixbuf, Glib2, GTK+2, Icon-naming-utils, Libjpeg-turbo, Libpng, Libtiff, Libxml2, MesaLib, Pango, Xdg-utils, Xorg
pt_br: Alsa, ATK, Cairo, Desktop-file-utils, Freetype, Fontconfig, Gdk-pixbuf, Glib2, GTK+2, Icon-naming-utils, Libjpeg-turbo, Libpng, Libtiff, Libxml2, MesaLib, Pango, Xdg-utils e Xorg

source: Libxml2, Libxslt
pt_br: Libxml2 e Libxslt

source: CUPS, Cups-filters, Ghostscript, SANE
pt_br: CUPS, Cups-filters, Ghostscript e SANE

source: Packages not supplied by LFS or BLFS needed to satisfy the LSB Requirements
fr: Paquets fournis ni par LFS ni par BLFS mais qui sont requis pour satisfaire les exigences de la LSB
pt_br: Pacotes não fornecidos pelo LFS ou pelo BLFS necessários para satisfazer as Exigências do LSB

source: Qt4 (but Qt5 is provided)
fr: Qt4 (mais Qt5 est disponible)
pt_br: Qt4 (mas Qt5 é fornecido)
