Repository: espindula/br-lfs
Catalog: lfs/*/prologue/typography.po
Languages: fr, pt_br

source: Typography
fr: Typographie
pt_br: Tipografia

source: To make things easier to follow, there are a few typographical conventions used throughout this book. This section contains some examples of the typographical format found throughout Linux From Scratch.
fr: Pour faciliter ce qui suit, voici quelques conventions typographiques suivies tout au long de ce livre. Cette section contient quelques exemples du format typographique trouvé dans Linux From Scratch.
pt_br: Para tornar as coisas mais fáceis de serem seguidas, existem umas poucas convenções tipográficas usadas ao longo deste livro. Esta seção contém alguns exemplos do formato tipográfico encontrado ao longo do Linux From Scratch.

source: This form of text is designed to be typed exactly as seen unless otherwise noted in the surrounding text. It is also used in the explanation sections to identify which of the commands is being referenced.
fr: Ce style de texte est conçu pour être tapé exactement de la même façon qu'il est vu sauf si le texte indique le contraire. Il est aussi utilisé dans les sections d'explications pour identifier les commandes référencées.
pt_br: Essa forma de texto é projetada para ser digitada exatamente como vista, a menos que seja dito o contrário no texto que a envolve. Também é usada nas seções de explicação para identificar quais dos comandos estão sendo referenciados.

source: In some cases, a logical line is extended to two or more physical lines with a backslash at the end of the line.
fr: Dans certains cas, une ligne logique s'étend sur deux lignes physiques voire plus avec un antislash à la fin de la ligne.
pt_br: Em alguns casos, uma linha lógica é estendida em duas ou mais linhas físicas com uma barra invertida no final da linha.

source: Note that the backslash must be followed by an immediate return. Other whitespace characters like spaces or tab characters will create incorrect results.
fr: Remarquez que l'antislash doit être suivi d'un retour chariot immédiat. Tout autre caractère blanc comme des espaces ou des tabulations donnera des résultats incorrects.
pt_br: Observe que a barra invertida precisa ser seguida por uma quebra de linha imediata. Outros caracteres de espaço em branco, como caracteres de espaços ou de tabulação criarão resultados incorretos.

source: This form of text (fixed-width text) shows screen output, usually as the result of commands issued. This format is also used to show filenames, such as <filename>/etc/ld.so.conf</filename>.
fr: Ce style de texte (texte à largeur fixe) montre une sortie d'écran, généralement le résultat de commandes. Ce format est aussi utilisé pour afficher des noms de fichiers, comme <filename>/etc/ld.so.conf</filename>.
pt_br: Essa forma de texto (de largura fixa) mostra a saída gerada em tela, geralmente como o resultado de comandos emitidos. Esse formato também é usado para mostrar nomes de arquivos, tais como <filename>/etc/ld.so.conf</filename>.

source: Please configure your browser to display fixed-width text with a good monospaced font, with which you can distinguish the glyphs of <literal>Il1</literal> or <literal>O0</literal> clearly.
fr: Configurez votre navigateur pour afficher les textes à chasse fixe avec une bonne police à chasse fixe, avec laquelle vous pouvez clairement distinguer les caractères dans <literal>Il1</literal> ou <literal>O0</literal>.
pt_br: Por favor, configure o seu navegador para exibir texto de largura fixa com uma boa fonte mono espaçada, com a qual você possa distinguir claramente os glifos de <literal>Il1</literal> ou <literal>O0</literal>.

source: <emphasis>Emphasis</emphasis>
fr: <emphasis>Mise en évidence</emphasis>
pt_br: <emphasis>Ênfase</emphasis>

source: This form of text is used for several purposes in the book. Its main purpose is to emphasize important points or items.
fr: Ce style de texte est utilisé dans différents buts dans ce livre. Son but principal est de mettre en évidence les points importants.
pt_br: Essa forma de texto é usada para vários propósitos no livro. O propósito principal dela é o de enfatizar pontos ou itens importantes.

source: This format is used for hyperlinks both within the LFS community and to external pages. It includes HOWTOs, download locations, and websites.
fr: Ce format est utilisé pour les liens, ceux de la communauté LFS et ceux référençant des pages externes. Cela inclut les guides pratiques, les emplacements de téléchargement et des sites web.
pt_br: Esse formato é usado para hiperlinks tanto dentro da comunidade do LFS, quanto para páginas externas. Inclui HOWTOs, locais de download e páginas da Internet.

source: This format is used when creating configuration files. The first command tells the system to create the file <filename>$LFS/etc/group</filename> from whatever is typed on the following lines until the sequence End Of File (EOF) is encountered. Therefore, this entire section is generally typed as seen.
fr: Ce format est utilisé principalement lors de la création de fichiers de configuration. La première commande indique au système de créer le fichier <filename>$LFS/etc/group</filename> à partir de ce qui est saisi jusqu'à ce que la séquence de fin de fichier (<foreignphrase>End Of File</foreignphrase>) (EOF) soit rencontrée. Donc, cette section entière est généralement saisie de la même façon.
pt_br: Esse formato é usado quando da criação de arquivos de configuração. O primeiro comando diz ao sistema para criar o arquivo <filename>$LFS/etc/group</filename> a partir do que seja digitado nas linhas seguintes até que a sequência “End Of File” (EOF) seja encontrada. Portanto, essa seção inteira geralmente é digitada como é vista.

source: <replaceable>&lt;REPLACED TEXT&gt;</replaceable>
fr: <replaceable>&lt;TEXTE À REMPLACER&gt;</replaceable>
pt_br: <replaceable>&lt;TEXTO SUBSTITUÍDO&gt;</replaceable>

source: This format is used to encapsulate text that is not to be typed as seen or for copy-and-paste operations.
fr: Ce format est utilisé pour intégrer du texte qui ne devra pas être saisi tel quel et qui ne devra pas être copié/collé.
pt_br: Esse formato é usado para encapsular texto que não é para ser digitado como visto ou para operações de “copiar-e-colar”.

source: <replaceable>[OPTIONAL TEXT]</replaceable>
fr: <replaceable>[TEXTE FACULTATIF]</replaceable>
pt_br: <replaceable>[TEXTO OPCIONAL]</replaceable>

source: This format is used to encapsulate text that is optional.
fr: Ce format est utilisé pour intégrer du texte qui est facultatif.
pt_br: Esse formato é usado para encapsular texto que é opcional.

source: This format is used to refer to a specific manual (man) page. The number inside parentheses indicates a specific section inside the manuals. For example, <command>passwd</command> has two man pages. Per LFS installation instructions, those two man pages will be located at <filename>/usr/share/man/man1/passwd.1</filename> and <filename>/usr/share/man/man5/passwd.5</filename>. When the book uses <filename>passwd(5)</filename> it is specifically referring to <filename>/usr/share/man/man5/passwd.5</filename>. <command>man passwd</command> will print the first man page it finds that matches <quote>passwd</quote>, which will be <filename>/usr/share/man/man1/passwd.1</filename>. For this example, you will need to run <command>man 5 passwd</command> in order to read the page being specified. Note that most man pages do not have duplicate page names in different sections. Therefore, <command>man <replaceable>&lt;program name&gt;</replaceable></command> is generally sufficient.
fr: Ce format est utilisé pour faire référence à une page de manuel (man) spécifique. Le nombre entre parenthèses indique une section spécifique à l'intérieur des manuels. Par exemple, <command>passwd</command> a deux pages de manuel. Pour les instructions d'installation de LFS, ces deux pages de manuels seront situées dans <filename>/usr/share/man/man1/passwd.1</filename> et <filename>/usr/share/man/man5/passwd.5</filename>. Quand le livre utilise <filename>passwd(5)</filename>, il fait spécifiquement référence à <filename>/usr/share/man/man5/passwd.5</filename>. <command>man passwd</command> affichera la première page de manuel qu'il trouvera et qui correspond à <quote>passwd</quote>, <filename>/usr/share/man/man1/passwd.1</filename>. Dans cet exemple, vous devrez exécuter <command>man 5 passwd</command> pour lire cette page spécifique. Il devrait être noté que la plupart des pages de man n'ont pas de nom de page dupliqué dans les différentes sections. Du coup, <command>man <replaceable>&lt;nom du programme&gt;</replaceable></command> est généralement suffisant.
pt_br: Esse formato é usado para referir-se a uma página de manual (man) específica. O número dentro dos parênteses indica uma seção específica dentro dos manuais. Por exemplo, <command>passwd</command> tem duas páginas de manual. Conforme as instruções de instalação do LFS, essas duas páginas de manual estarão localizadas em <filename>/usr/share/man/man1/passwd.1</filename> e <filename>/usr/share/man/man5/passwd.5</filename>. Quando o livro usa <filename>passwd(5)</filename> ele está se referindo especificamente a <filename>/usr/share/man/man5/passwd.5</filename>. <command>man passwd</command> exibirá a primeira página de manual que achar que corresponde a <quote>passwd</quote>, a qual será <filename>/usr/share/man/man1/passwd.1</filename>. Para esse exemplo, você precisará executar <command>man 5 passwd</command> para a finalidade de ler a página sendo especificada. Observe que a maioria das páginas de manual não tem nomes duplicados de páginas em diferentes seções. Portanto, <command>man <replaceable>&lt;nome do aplicativo&gt;</replaceable></command> geralmente é suficiente.
