Repository: espindula/br-lfs
Catalog: book/*/chapter07/sysd-custom.po
Languages: fr

source: Systemd Usage and Confiuration
fr: Utilisation et configuration de Systemd

source: Systemd Customization
fr: Personnalisation de Systemd

source: Basic Configuration
fr: Configuration de base

source: The <filename>/etc/systemd/system.conf</filename> file contains a set of items to control basic operations. The default file has all entries commented out with the default settings indicated. This file is where the log level may be changed as well as some basic journal settings.
fr: Le fichier <filename>/etc/systemd/system.conf</filename> contient un ensemble d'éléments de contrôle des opérations de base. Le fichier contient par toutes les entrées mises en commentaire avec leurs paramètres par défaut qui est indiqué. Ce fichier est l'endroit où vous pouvez changer le niveau de journalisation ainsi que certains paramètres de base du journal.

source: Disabling Screen Clearing at Boot Time
fr: Désactiver le nettoyage de l'écran lors du démarrage

source: The normal behavior for systemd is to clear the secreen at the end of the boot sequence. If desired, this behavior may be changed by the following:
fr: Le comportement normal de systemd est de vider l'écran à la fin de la séquence de démarrage. Si vous le souhaitez, vous pouvez changer ce comportement avec ce qui suit&nbsp;:

source: The boot messages can always be revied by using the <userinput>journalctl -b</userinput> command as the root user.
fr: Vous pouvez toujours relire les messages du démarrage en utilisant la commande <userinput>journalctl -b</userinput> en tant qu'utilisateur root.

source: Disabling tmpfs for /tmp
fr: Désactiver tmpfs pour /tmp

source: By default, <filename class="directory">/tmp</filename> is created as a tmpfs. If this is not desired, it can be overridden by the following:
fr: Par défaut, <filename class="directory">/tmp</filename> se crée comme un tmpfs. Si vous ne le souhaitez pas, vous pouvez changer cela par ce qui suit&nbsp;:

source: This is not necessary if there is a separate partition for /tmp specified in <filename>/etc/fstab</filename>.
fr: Cela n'est pas nécessaire s'il existe une partition /tmp à part indiqué dans <filename>/etc/fstab</filename>.

source: Configuring Automatic File Creation and Deletion
fr: Configurer la création et l'effacement automatique des fichiers

source: There are several services that create or delete files or directories:
fr: Plusieurs services créent ou effacent des fichiers ou des répertoires&nbsp;:

source: The system location for the configuration files is <filename>/usr/lib/tmpfiles.d/*.conf</filename>. The local configuration files are in <filename>/etc/tmpfiles.d/*.conf</filename>. Files in /etc/tmpfiles.d override files with the same name in /usr/lib/tmpfiles.d. See <userinput>man tmpfiles.d</userinput> for file format details.
fr: L'emplacement sur le système pour les fichiers de configuration est <filename>/usr/lib/tmpfiles.d/*.conf</filename>. Les fichiers de configuration locaux sont dans <filename>/etc/tmpfiles.d/*.conf</filename>. Les fichiers de /etc/tmpfiles.d écrasent ceux du même nom situés dans /usr/lib/tmpfiles.d. Voir <userinput>man tmpfiles.d</userinput> pour des détails sur le format des fichiers.

source: Adding Custom Units and Services
fr: Ajout personnalisé de services et d'unités

source: A custom service can be added by creating a directory and configuration file in <filename class="directory">/etc/systemd/system/</filename>. For example:
fr: Vous pouvez ajouter un service personnalisé en créant un répertoire et un fichier de configuration dans <filename class="directory">/etc/systemd/system/</filename>. Par exemple&nbsp;:

source: See the man page for systemd.unit for more information. After creating the configuration file, run <userinput>systemctl daemon-reload</userinput> and <userinput>systemctl restart foobar</userinput> to activate a service or changes to a service.
fr: Voir la page de man de systemd.unit pour plus d'informations. Après avoir créé le fichier de configuration, lancez <userinput>systemctl daemon-reload</userinput> et <userinput>systemctl restart foobar</userinput> pour activer un service ou des changements sur un service.

source: Setting Console Fonts and Keyboard
fr: Configurer les polices de la console Linux et le clavier

source: configuring
fr: configuration

source: This section discusses how to configure the <command>systemd-vconsole-setup</command> system service, which configures the virtual console font and console keymap.
fr: Cette section traite de la manière de configurer le service système <command>systemd-vconsole-setup</command> qui configure la police de la console virtuelle et la disposition du clavier dans la console.

source: The <command>systemd-vconsole-setup</command> service reads the <filename>/etc/vconsole.conf</filename> file for configuration information. Decide which keymap and screen font will be used. Various language-specific HOWTOs can also help with this, see <ulink url="http://www.tldp.org/HOWTO/HOWTO-INDEX/other-lang.html"/>. Examine <command>localectl list-keymaps</command> output for a list of valid console keymaps. Look in <filename class="directory">/usr/share/consolefonts</filename> directory for valid screen fonts.
fr: Le service <command>systemd-vconsole-setup</command> lit les informations de configuration dans le fichier <filename>/etc/vconsole.conf</filename>. Décidez de la disposition du clavier et de la police à l'écran qui seront utilisées. Il existe divers guides pratiques spécifiques à chaque langue qui peuvent vous aider. Voir <ulink url="http://www.tldp.org/HOWTO/HOWTO-INDEX/other-lang.html"/>. Observez la sortie de <command>localectl list-keymaps</command> pour une liste des dispositions de clavier valides sur la console. Regardez le répertoire <filename class="directory">/usr/share/consolefonts</filename> pour une liste des polices d'écran valides.

source: The <filename>/etc/vconsole.conf</filename> file should contain lines of the form: VARIABLE="value". The following variables are recognized:
fr: Le fichier <filename>/etc/vconsole.conf</filename> devrait contenir des lignes de la forme&nbsp;: VARIABLE="valeur". Les variables suivantes sont reconnues&nbsp;:

source: This variable specifies the key mapping table for the keyboard. If unset, it defaults to <literal>us</literal>.
fr: Cette variable spécifie la table de disposition du clavier. Si vous ne la définissez pas, elle est par défaut <literal>us</literal>.

source: This variable can be used to configure a second toggle keymap and is unset by default.
fr: Vous pouvez utiliser cette variable pour configurer une disposition alternative où vous pouvez basculer et elle n'est pas définie par défaut.

source: This variable specifies the font used by the virtual console.
fr: Cette variable spécifie la police utilisée par la console virtuelle.

source: This variable specifies the console map to be used.
fr: Cette variable spécifie la présentation de la console.

source: This variable specifies the unicode font map.
fr: Cette variable spécifie la police de l'unicode.

source: An example for a German keyboard and console is given below:
fr: Voici un exemple pour un clavier allemand&nbsp;:

source: You can change KEYMAP value at runtime by using the <command>localectl</command> utility:
fr: Vous pouvez modifier la valeur de KEYMAP lors de l'exécution en utilisant l'outil <command>localectl</command>&nbsp;:

source: Please note that <command>localectl</command> command can be used only on a system booted with Systemd.
fr: Merci de remarquer que la commande <command>localectl</command> n'est utilisable que sur un système démarré avec Systemd.

source: Clock Configuration
fr: Configurer l'horloge

source: This section discusses how to configure the <command>systemd-timedated</command> system service, which configures system clock and timezone.
fr: Cette section explique comment configurer le service système <command>systemd-timedated</command>, qui configure l'horloge système et le fuseau horaire.

source: <command>systemd-timedated</command> reads <filename>/etc/adjtime</filename>, and depending on the contents of the file, it sets the clock to either UTC or local time. Create the <filename>/etc/adjtime</filename> file with the following contents <emphasis>if your hardware clock is set to local time</emphasis>:
fr: <command>systemd-timedated</command> lit <filename>/etc/adjtime</filename>, et selon le contenu du fichier, il met l'horloge en UTC ou en heure locale. Créez le fichier <filename>/etc/adjtime</filename> ayant le contenu suivant <emphasis>si votre horloge matérielle est en heure locale</emphasis>&nbsp;:

source: If <filename>/etc/adjtime</filename> isn't present at first boot, <command>systemd-timedated</command> will assume that hardware clock is set to UTC and create the file using that setting.
fr: Si <filename>/etc/adjtime</filename> n'est pas là au démarrage, <command>systemd-timedated</command> supposera que l'horloge matérielle est en UTC et il créera le fichier en utilisant ce paramètre.

source: You can also use the <command>timedatectl</command> utility to tell <command>systemd-timedated</command> if your hardware clock is set to UTC or local time:
fr: Vous pouvez aussi utiliser l'outil <command>timedatectl</command> pour dire à <command>systemd-timedated</command> si votre horloge matérielle est en UTC ou heure locale&nbsp;:

source: <command>timedatectl</command> can also be used to change system time and time zone.
fr: Vous pouvez aussi utiliser <command>timedatectl</command> pour modifier l'heure du système et le fuseau.

source: To change your current system time, issue:
fr: Pour modifier l'heure actuelle du système, lancez&nbsp;:

source: Hardware clock will also be updated accordingly.
fr: L'horloge maérielle sera elle aussi mise à jour en conséquence.

source: To change your current time zone, issue:
fr: Pour modifier votre fuseau horaire actuel, lancez&nbsp;:

source: <userinput>timedatectl set-timezone TIMEZONE</userinput>
fr: <userinput>timedatectl set-timezone FUSEAU</userinput>

source: You can get list of available time zones by running:
fr: Vous trouvez la liste des fuseaux disponibles en lanÃ§ant&nbsp;:

source: The <command>timedatectl</command> command can be used only on a system booted with Systemd.
fr: Merci de remarquer que <command>timedatectl</command> ne peut s'utiliser que sur un système démarré avec Systemd.

source: Debugging the Boot Sequence
fr: Déboguer la séquence de démarrage

source: There are several commands that can be used to help debug the systemd boot process. Here are some examples:
fr: Vous pouvez utiliser diverses commandes pour déboguer le processus de démarrage de systemd. Voici des exemples&nbsp;:
