Repository: espindula/br-lfs
Catalog: clfs/*/chroot/x86/before-chroot.po
Languages: fr

source: Before Entering the Chroot Environment
fr: Avant d'entrer dans l'environnement chroot

source: Determining if steps need to be taken
fr: Déterminer s'il y a besoin d'étapes supplémentaires

source: Before we can enter the chroot we have to make sure that the system is in the proper state. From this point on the <envar>${CLFS_TARGET}</envar> environment variable will no longer exist, so it will have no bearing on the rest of the book - most packages will rely on <command>config.guess</command> provided by <xref linkend="ch-system-automake"/>. Packages that do not use autotools either do not care about the target triplet, or have their own means of determining its value.
fr: Avant de pouvoir entrer dans le chroot, nous devons nous assurer que le système est dans un état acceptable. À partir de maintenant, la variable d'environnement <envar>${CLFS_TARGET}</envar> n'existera plus, donc elle n'aura aucune influence sur le reste du livre — la plupart des paquets s’appuieront sur <command>config.guess</command>, fournit par <xref linkend="ch-system-automake"/>. Les paquets qui n'utilisent pas autotools soit se fichent de la triplette cible, soit ont leur propre moyen de déterminer sa valeur.

source: In both cases, the information about the host cpu used to determine the target triplet is gathered from the same place, <command>uname -m</command>. Executing this command outside of the chroot as well as inside the chroot will have the exact same output.
fr: Dans les deux cas, l'information sur le cpu hôte utilisée pour déterminer la triplette cible est récupérée à partir du même endroit, <command>uname -m</command>. L'exécution de cette commande en dehors de l'environnement chroot et à l'intérieur a exactement la même sortie.

source: If you're unsure if your host and target have the same target triplet, you can use this test to determine what the host's target triplet is and if you need to take any steps to ensure that you don't build for the wrong architecture. Extract the <xref linkend="ch-system-automake"/> tarball and <command>cd</command> into the created directory. Then execute the following to see what the detected target triplet is by <command>config.guess</command>:
fr: Si vous n'êtes pas sûr que votre hôte et votre cible ont la même triplette cible, vous pouvez utiliser ce test pour déterminer la triplette cible de l'hôte et si vous aurez besoin d'une étape supplémentaire pour s'assurer que vous ne construisez pas pour la mauvaise architecture. Extrayez l'archive <xref linkend="ch-system-automake"/> et déplacez-vous dans le répertoire créé. Ensuite, exécutez ce qui suit pour voir la triplette cible détectée par <command>config.guess</command>&nbsp;:

source: If the output of that command does not equal what is in <envar>${CLFS_TARGET}</envar> then you need to read on. If it does then you can safely continue onto <xref linkend="ch-chroot-chroot"/>.
fr: Si la sortie de cette commande n'est pas égale à ce qui se trouve dans <envar>${CLFS_TARGET}</envar> vous devez continuer à lire. Sinon, vous pouvez continuer sereinement à partir de <xref linkend="ch-chroot-chroot"/>.

source: Using Setarch
fr: Utiliser Setarch

source: If your host has a tool called <command>setarch</command>, this may solve your problems, at least if you're building for i686. On an architecture such as x86_64, using <command>setarch linux32 uname -m</command> will only ever output i686. It is not possible to get an output of i486 or i586.
fr: Si votre hôte a un outil appelé <command>setarch,</command>, cela peut régler le problème, au moins si vous construisez sur i686. Sur une architecture comme x86_64, utiliser <command>setarch linux32 uname -m</command> ne donnera jamais que i686. il n'est pas possible d'avoir une autre sortie comme i486 ou i586.

source: To test if setarch does everything you need it to, execute the following command from inside the <xref linkend="ch-system-automake"/> directory:
fr: Pour tester si setarch fait tout ce dont vous avez besoin, exécutez la commande suivante dans le répertoire d'<xref linkend="ch-system-automake"/>&nbsp;:

source: If the output of the command above equals what is in <envar>${CLFS_TARGET}</envar> then you have a viable solution. You can wrap the chroot command on the next page with <command>setarch linux32</command>. It will look like the following:
fr: Si la sortie de la commande est égale à ce qui se trouve dans <envar>${CLFS_TARGET}</envar> alors vous avez une solution viable. Vous pouvez enrober la commande chroot de la page suivante avec <command>setarch linux32</command>. Ce qui ressemblera à ceci&nbsp;:

source: If setarch works for you then you can safely continue onto <xref linkend="ch-chroot-chroot"/>. If not, there is one more option covered in this book.
fr: Si setarch fonctionne pour vous alors vous pouvez sereinement continuer par <xref linkend="ch-chroot-chroot"/>. Sinon, il y a encore une option présentée par ce livre.

source: Using a Uname Hack
fr: Utiliser un hack pour uname

source: The Uname Hack is a kernel module that modifies the output of <command>uname -m</command> by directly changing the value of the detected machine type. The kernel module will save the original value and restore it when the module is unloaded.
fr: Le hack uname est un module du noyau qui modifie la sortie de <command>uname -m</command> en changeant directement la valeur du type de machine détecté. Le module du noyau enregistrera la valeur initiale et la restaurera lorsque le module sera déchargé.

source: Uname Hack (&uname_hack-version;) - &uname_hack-size;:
fr: Hack Uname (&uname_hack-version;) - &uname_hack-size;:

source: Home page: <ulink url="&uname_hack-home;"/>
fr: Page d'accueil&nbsp;: <ulink url="&uname_hack-home;"/>

source: Download: <ulink url="&uname_hack-url;"/>
fr: Téléchargement&nbsp;: <ulink url="&uname_hack-url;"/>

source: MD5 sum: <literal>&uname_hack-md5;</literal>
fr: Somme de contrôle MD5&nbsp;: <literal>&uname_hack-md5;</literal>

source: Extract the tarball and <command>cd</command> into the created directory. To build the Uname Hack you must have the kernel sources for your currently running kernel available. Build the Uname Hack with the following or similar command:
fr: Extrayez l'archive et déplacez-vous dans le répertoire créé. Pour construire le hack uname vous devrez avoir les sources du noyau en cours d'exécution à disposition. Construisez le hack uname avec la commande suivante, ou similaire&nbsp;:

source: The meaning of the make and install options:
fr: Voici la signification des option de make et d'installation&nbsp;:

source: This parameter sets the value that the uts machine type will be changed to. Alternatively this could be set to i586 or i686.
fr: Ce paramètre initialise la valeur en laquelle sera changé le type de machine uts. Autrement, cette valeur peut être i586 ou i686.

source: In the top level directory of the Uname Hack package you should see a file named <filename>uname_hack.ko</filename>. As soon as that module is loaded into the running kernel the output of <command>uname -m</command> will be affected immediately system-wide. Load the kernel module with the following command:
fr: Dans le répertoire de plus haut niveau du paquet Uname Hack, vous devriez voir un fichier nommé <filename>uname_hack.ko</filename>. Dès que ce module est chargé dans le noyau en cours d'exécution la sortie de <command>uname -m</command> devrait être affectée immédiatement sur tout le système. Chargez le module du noyau avec la commande suivante&nbsp;:

source: To test if the Uname Hack is working properly, execute the following command from inside the <xref linkend="ch-system-automake"/> directory:
fr: Pour tester si le hack uname fonctionne correctement, exécutez la commande suivante depuis l'intérieur du répertoir d'<xref linkend="ch-system-automake"/>&nbsp;:

source: The output of the above command should be the same as the <envar>${CLFS_TARGET}</envar> environment variable. If this is not the case, you can try and get help on the CLFS Support Mailing List or the IRC Channel. See <xref linkend="ch-intro-askforhelp"/> for more information.
fr: La sortie de la commande devrait être la même que la variable d'environnement <envar>${CLFS_TARGET}</envar>. Si ce n'est pas le cas, vous pouvez essayer d'obtenir de l'aide sur la liste de diffusion de support de CLFS ou sur le canal IRC. Voyez <xref linkend="ch-intro-askforhelp"/> pour plus d'informations.
