Repository: espindula/br-lfs
Catalog: clfs/*/final-preps/common/addinguser.po
Languages: fr

source: Adding the CLFS User
fr: Ajouter l'utilisateur CLFS

source: When logged in as user <systemitem class="username">root</systemitem>, making a single mistake can damage or destroy a system. Therefore, we recommend building the packages as an unprivileged user. You could use your own user name, but to make it easier to set up a clean work environment, create a new user called <systemitem class="username">clfs</systemitem> as a member of a new group (also named <systemitem class="groupname">clfs</systemitem>) and use this user during the installation process. As <systemitem class="username">root</systemitem>, issue the following commands to add the new user:
fr: Lorsque vous êtes connecté en tant qu'utilisateur <systemitem class="username">root</systemitem>, faire une seule erreur peut endommager voire dévaster votre système. Donc, nous recommandons de construire les paquets dans ce chapitre en tant qu'utilisateur non privilégié. Vous pouvez bien sûr utiliser votre propre nom d'utilisateur mais, pour faciliter l'établissement d'un environnement de travail propre, créez un nouvel utilisateur <systemitem class="username">clfs</systemitem> comme membre d'un nouveau groupe (aussi nommé <systemitem class="groupname">clfs</systemitem>) et utilisez-le lors du processus d'installation. En tant que <systemitem class="username">root</systemitem>, lancez les commandes suivantes pour créer le nouvel utilisateur&nbsp;:

source: The meaning of the command line options:
fr: Voici la signification des options en ligne de commande&nbsp;:

source: This makes <command>bash</command> the default shell for user <systemitem class="username">clfs</systemitem>.
fr: Ceci fait de <command>bash</command> le shell par défaut de l'utilisateur <systemitem class="username">clfs</systemitem>.

source: The build instructions assume that the <command>bash</command> shell is in use.
fr: Les instructions de construction supposent que vous utilisez le shell <command>bash</command>.

source: This option adds the new user to the <systemitem class="groupname">clfs</systemitem> group.
fr: Cette option ajoute le nouvel utilisateur au groupe <systemitem class="groupname">clfs</systemitem>.

source: This option sets the user's home directory, but does not create it. We could have used <option>-m</option> to tell <command>useradd</command> to create the directory as well, but this would also copy the contents of the host system's <filename class="directory">/etc/skel</filename> directory into the new user's home. We would prefer to have a clean user environment, so we just create an empty directory after adding the user.
fr: Cette option initialise le répertoire home de l'utilisateur, mais ne le crée pas. Nous aurions pu utiliser <option>-m</option> pour dire à <command>useradd</command> de créer le répertoire, mais cela copierait aussi le contenu du répertoire <filename class="directory">/etc/skel</filename> du système hôte dans le home du nouvel utilisateur. Nous préférons avoir un environnement utilisateur propre, donc nous créons simplement un répertoire vide après avoir ajouté l'utilisateur.

source: This is the actual name for the created group and user.
fr: Ceci est le nom du groupe et de l'utilisateur.

source: To log in as <systemitem class="username">clfs</systemitem> (as opposed to switching to user <systemitem class="username">clfs</systemitem> when logged in as <systemitem class="username">root</systemitem>, which does not require the <systemitem class="username">clfs</systemitem> user to have a password), give <systemitem class="username">clfs</systemitem> a password:
fr: Pour vous connecter en tant que <systemitem class="username">clfs</systemitem> (et non pas de passer à l'utilisateur <systemitem class="username">clfs</systemitem> alors que vous êtes connecté en tant que <systemitem class="username">root</systemitem>, ce qui ne requiert pas de mot de passe pour l'utilisateur <systemitem class="username">clfs</systemitem>), donnez un mot de passe à <systemitem class="username">clfs</systemitem>&nbsp;:

source: As <systemitem class="username">root</systemitem>, grant <systemitem class="username">clfs</systemitem> full access to <filename class="directory">${CLFS}/cross-tools</filename> and <filename class="directory">${CLFS}/tools</filename> by making <systemitem class="username">clfs</systemitem> the directorys' owner:
fr: En tant que <systemitem class="username">root</systemitem>, donnez à <systemitem class="username">clfs</systemitem> un accès complet à <filename class="directory">${CLFS}/cross-tools</filename> et à <filename class="directory">$CLFS/tools</filename> en indiquant que <systemitem class="username">clfs</systemitem> est le propriétaire des répertoires&nbsp;:

source: If a separate working directory was created as suggested, run the following command as <systemitem class="username">root</systemitem> to give user <systemitem class="username">clfs</systemitem> ownership of this directory as well:
fr: Si un répertoire de travail séparé a été créé comme suggéré, lancez la commande suivante en tant que <systemitem class="username">root</systemitem> pour donner à <systemitem class="username">clfs</systemitem> la propriété de ce répertoire&nbsp;:

source: Next, login as user <systemitem class="username">clfs</systemitem>. This can be done via a virtual console, through a display manager, or with the following substitute user command:
fr: Ensuite, connectez-vous en tant que <systemitem class="username">clfs</systemitem>. Ceci peut se faire via une console virtuelle, avec le gestionnaire d'affichage ou avec la commande suivante de substitution d'utilisateur&nbsp;:

source: The <quote><parameter>-</parameter></quote> instructs <command>su</command> to start a login shell as opposed to a non-login shell. The difference between these two types of shells can be found in detail in <filename>bash(1)</filename> and <command>info bash</command>.
fr: Le <quote><parameter>-</parameter></quote> indique à <command>su</command> de démarrer un shell de connexion par opposition à un shell de non connexion. Vous trouverez la différence entre les deux types de shells dans la page man <filename>bash(1)</filename> et <command>info bash</command>.

source: Until specified otherwise, all commands from this point on should be done as the <systemitem class="username">clfs</systemitem> user.
fr: Tant que rien d'autre n'est indiqué, toutes les commandes à partir de maintenant se lancent en tant qu'utilisateur <systemitem class="username">clfs</systemitem>.
