Repository: espindula/br-lfs
Catalog: clfs/*/final-preps/common/settingenviron.po
Languages: fr

source: Setting Up the Environment
fr: Configurer l'environnement

source: Set up a good working environment by creating two new startup files for the <command>bash</command> shell. While logged in as user <systemitem class="username">clfs</systemitem>, issue the following command to create a new <filename>.bash_profile</filename>:
fr: Configurez un bon environnement de travail en créant deux nouveaux fichiers de démarrage pour le shell <command>bash</command>. En étant connecté en tant qu'utilisateur <systemitem class="username">clfs</systemitem>, lancez la commande suivante pour créer un nouveau <filename>.bash_profile</filename>&nbsp;:

source: When logged on as user <systemitem class="username">clfs</systemitem>, the initial shell is usually a <emphasis>login</emphasis> shell which reads the <filename>/etc/profile</filename> of the host (probably containing some settings and environment variables) and then <filename>.bash_profile</filename>. The <command>exec env -i.../bin/bash</command> command in the <filename>.bash_profile</filename> file replaces the running shell with a new one with a completely empty environment, except for the <envar>HOME</envar>, <envar>TERM</envar>, and <envar>PS1</envar> variables. This ensures that no unwanted and potentially hazardous environment variables from the host system leak into the build environment. The technique used here achieves the goal of ensuring a clean environment.
fr: Lorsque vous êtes connecté en tant que <systemitem class="username">clfs</systemitem>, le shell initial est habituellement un shell de <emphasis>login</emphasis> qui lit le fichier <filename>/etc/profile</filename> de l'hôte (contenant probablement quelques configurations et variables d'environnement) et puis <filename>.bash_profile</filename>. La commande <command>exec env -i.../bin/bash</command> dans le fichier <filename>.bash_profile</filename> remplace le shell en cours avec un nouveau ayant un environnement complètement vide sauf pour les variables <envar>HOME</envar>, <envar>TERM</envar>, et <envar>PS1</envar>. Ceci nous assure qu'aucune variable d'environnement non souhaitée et potentiellement dangereuse, provenant du système hôte, ne parvienne dans l'environnement de construction. La technique utilisée ici réalise le but d'avoir un environnement propre.

source: The new instance of the shell is a <emphasis>non-login</emphasis> shell, which does not read the <filename>/etc/profile</filename> or <filename>.bash_profile</filename> files, but rather reads the <filename>.bashrc</filename> file instead. Create the <filename>.bashrc</filename> file now:
fr: La nouvelle instance du shell est un shell <emphasis>non-login</emphasis>, qui ne lit donc pas les fichiers <filename>/etc/profile</filename> ou <filename>.bash_profile</filename>, mais plutôt le fichier <filename>.bashrc</filename> file. Créez maintenant le fichier <filename>.bashrc</filename>&nbsp;:

source: The <command>set +h</command> command turns off <command>bash</command>'s hash function. Hashing is ordinarily a useful feature&mdash;<command>bash</command> uses a hash table to remember the full path of executable files to avoid searching the <envar>PATH</envar> time and again to find the same executable. However, the new tools should be used as soon as they are installed. By switching off the hash function, the shell will always search the <envar>PATH</envar> when a program is to be run. As such, the shell will find the newly compiled tools in <filename class="directory">/cross-tools</filename> as soon as they are available without remembering a previous version of the same program in a different location.
fr: La commande <command>set +h</command> désactive la fonction de hachage de <command>bash</command>. D'habitude, le hachage est une fonctionnalité utile&nbsp;: <command>bash</command> utilise une table de hachage pour se rappeler le chemin complet des fichiers exécutables pour éviter d'avoir à chercher dans <envar>PATH</envar> à chaque fois qu'il doit trouver le même exécutable. Néanmoins, les nouveaux outils devraient être utilisés dès leur installation. En désactivant la fonction de hachage, le shell cherchera en permanence dans <envar>PATH</envar> lorsqu'un programme doit être exécuté. Ainsi, le shell trouvera les nouveaux outils compilés dans <filename class="directory">/cross-tools</filename> dès qu'ils sont disponibles et sans se rappeler d'une version précédente du même programme mais dans un autre emplacement.

source: Setting the user file-creation mask (umask) to 022 ensures that newly created files and directories are only writable by their owner, but are readable and executable by anyone (assuming default modes are used by the open(2) system call, new files will end up with permission mode 644 and directories with mode 755).
fr: Configurer le masque de création de fichier (umask) à 022 nous assure que les nouveaux fichiers et répertoires créés sont modifiables uniquement par leurs propriétaires mais lisibles et exécutables par tout le monde (en supposant que les modes par défaut sont utilisés par l'appel système open(2) les nouveaux fichiers finiront avec les droits 644 et les répertoires avec ceux 755).

source: The <envar>CLFS</envar> variable should be set to the chosen mount point.
fr: La variable <envar>CLFS</envar> devrait être configurée avec le point de montage choisi.

source: The <envar>LC_ALL</envar> variable controls the localization of certain programs, making their messages follow the conventions of a specified country. Setting <envar>LC_ALL</envar> to <quote>POSIX</quote> or <quote>C</quote> (the two are equivalent) ensures that everything will work as expected in the temporary build environment.
fr: La variable <envar>LC_ALL</envar> contrôle la localisation de certains programmes, faisant que leurs messages suivent les conventions d'un pays spécifié. Paramétrer <envar>LC_ALL</envar> à <quote>POSIX</quote> ou <quote>C</quote> (les deux sont équivalents) assure que tout marchera comme attendu dans l'environnement de construction temporaire.

source: By putting <filename class="directory">/cross-tools/bin</filename> at the beginning of the <envar>PATH</envar>, the cross-compiler built in <xref linkend="chapter-cross-tools"/> will be picked up by the build process for the temp-system packages before anything that may be installed on the host. This, combined with turning off hashing, helps to ensure that you will be using the cross-compile tools to build the temp-system in /tools.
fr: En plaçant <filename class="directory">/cross-tools/bin</filename> au début de <envar>PATH</envar>, le compilateur croisé construit dans <xref linkend="chapter-cross-tools"/> sera choisi par le processus de construction du système temporaire avant tout programme installé sur l'hôte. Ceci, combiné avec la désactivation du hachage, permet de s'assurer que vous utiliserez les outils de compilation croisée pour construire le système temporaire dans /tools.

source: The <envar>CFLAGS</envar>, <envar>CXXFLAGS</envar> and <envar>PKG_CONFIG_PATH</envar> variables should not be set while building the temporary system, so we unset them.
fr: Les variables <envar>CFLAGS</envar>, <envar>CXXFLAGS</envar> et <envar>PKG_CONFIG_PATH</envar> ne devraient pas être initialisée lors de la construction du système temporaire, donc nous les nettoyons.

source: Finally, to have the environment fully prepared for building the temporary tools, source the just-created user profile:
fr: Enfin, pour avoir un environnement complètement préparé pour la construction des outils temporaires, chargez le profil de l'utilisateur tout juste créé&nbsp;:
