Repository: espindula/br-lfs
Catalog: blfs/*/archive/core/akonadi.po
Languages: fr

source: 287 KB
fr: 287 Kio

source: 82 MB
fr: 82 Mio

source: 3.5 SBU, additional 1.5 SBU for tests
fr: 3.5 SBU, 1.5 SBU supplémentaires pour les tests

source: Introduction to Akonadi
fr: Introduction à Akonadi

source: <application>Akonadi</application> is an extensible cross-desktop storage service for PIM data and metadata providing concurrent read, write, and query access. It provides unique desktop-wide object identification and retrieval.
fr: <application>Akonadi</application> est un service de stockage entre bureaux extensible pour les données et méta données PIM fournissant la lecture, l'écriture et l'accès aux requêtes de manière concurrente. Il fournit l'identification unique dans tout le bureau des objets et la récupération.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&akonadi-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&akonadi-download-http;"/>

source: Download (FTP): <ulink url="&akonadi-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&akonadi-download-ftp;"/>

source: Download MD5 sum: &akonadi-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &akonadi-md5sum;

source: Download size: &akonadi-size;
fr: Taille du téléchargement&nbsp;: &akonadi-size;

source: Estimated disk space required: &akonadi-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &akonadi-buildsize;

source: Estimated build time: &akonadi-time;
fr: Estimation du temps de construction&nbsp;: &akonadi-time;

source: Akonadi Dependencies
fr: Dépendances de Akonadi

source: Required
fr: Requises

source: <xref linkend="shared-mime-info"/>, <xref linkend="libxslt"/>, <xref linkend="boost"/>, and one of: <xref linkend="sqlite"/>, <xref linkend="mariadb"/>, <ulink url="http://www.mysql.com/">MySQL</ulink>, or <xref linkend="postgresql"/>
fr: <xref linkend="shared-mime-info"/>, <xref linkend="libxslt"/>, <xref linkend="boost"/>, et un parmi&nbsp;: <xref linkend="sqlite"/>, <xref linkend="mariadb"/>, <ulink url="http://www.mysql.com/">MySQL</ulink>, ou <xref linkend="postgresql"/>

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/akonadi"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/akonadi"/>

source: Installation of Akonadi
fr: Installation de Akonadi

source: Install <application>Akonadi</application> by running the following commands:
fr: Installez <application>Akonadi</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue <command>make test</command>.
fr: Pour tester les résultats, lancez <command>make test</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <option>-DCMAKE_BUILD_TYPE=Release</option>: This switch is used to apply a higher level of compiler optimizations.
fr: <option>-DCMAKE_BUILD_TYPE=Release</option>&nbsp;: Ce paramètre est utilisé pour appliquer un plus haut niveau d'optimisation du compilateur.

source: <option>-DINSTALL_QSQLITE_IN_QT_PREFIX=TRUE</option>: This switch ensures that <application>Akonadi</application> SQLite extension is installed into the <application>Qt</application> plugins directory.
fr: <option>-DINSTALL_QSQLITE_IN_QT_PREFIX=TRUE</option>&nbsp;: Ce paramètre assure que l'extension SQLite de <application>Akonadi</application> est installé dans le répertoire des ajouts de <application>Qt</application>.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: akonadi_agent_launcher, akonadi_agent_server, akonadi_control, akonadi_rds, akonadictl, akonadiserver and asapcat
fr: akonadi_agent_launcher, akonadi_agent_server, akonadi_control, akonadi_rds, akonadictl, akonadiserver et asapcat

source: libakonadiprotocolinternals.so and libqsqlite3.so
fr: libakonadiprotocolinternals.so et libqsqlite3.so

source: &kde-dir;/include/akonadi, &kde-dir;/lib/cmake/Akonadi and &kde-dir;/share/config/akonadi
fr: &kde-dir;/include/akonadi, &kde-dir;/lib/cmake/Akonadi et &kde-dir;/share/config/akonadi
