Repository: espindula/br-lfs
Catalog: blfs/*/archive/core/attica.po
Languages: fr

source: 59 KB
fr: 59 Kio

source: 7.5 MB
fr: 7.5 Mio

source: Introduction to Attica
fr: Introduction à Attica

source: <application>Attica</application> is a library to access "Open Collaboration Service" providers.
fr: <application>Attica</application> est une bibliothèque pour accéder aux fournisseurs "Open Collaboration Service".

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&attica-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&attica-download-http;"/>

source: Download (FTP): <ulink url="&attica-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&attica-download-ftp;"/>

source: Download MD5 sum: &attica-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &attica-md5sum;

source: Download size: &attica-size;
fr: Taille du téléchargement&nbsp;: &attica-size;

source: Estimated disk space required: &attica-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &attica-buildsize;

source: Estimated build time: &attica-time;
fr: Estimation du temps de construction&nbsp;: &attica-time;

source: Attica Dependencies
fr: Dépendances de Attica

source: Required
fr: Requises

source: <xref linkend="cmake"/> and <xref linkend="qt4"/>
fr: <xref linkend="cmake"/> et <xref linkend="qt4"/>

source: User Notes: <ulink url="&blfs-wiki;/attica"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/attica"/>

source: Installation of Attica
fr: Installation de Attica

source: Install <application>Attica</application> by running the following commands:
fr: Installez <application>Attica</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue <command>make test</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make test</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <parameter>-DCMAKE_BUILD_TYPE=Release</parameter>: This switch is used to apply a higher level of compiler the optimizations.
fr: <parameter>-DCMAKE_BUILD_TYPE=Release</parameter>&nbsp;: Ce paramètre est utilisé pour appliquer un plus haut niveau d'optimisation du compilateur.

source: <parameter>-DQT4_BUILD=ON</parameter>: This switch forces the package to build against <application>Qt4</application> even if <application>Qt5</application> is present on the system.
fr: <parameter>-DQT4_BUILD=ON</parameter>&nbsp;: Ce paramètre force le paquet à ce construire contre <application>Qt4</application> seulement si <application>Qt5</application> est présent sur le système.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
