Repository: espindula/br-lfs
Catalog: blfs/*/archive/core/baloo-widgets.po
Languages: fr

source: 40 KB
fr: 40 Kio

source: 3.6 MB
fr: 3.6 Mio

source: Introduction to Baloo-widgets
fr: Introduction à Baloo-widgets

source: Baloo-widgets contains widgets for the baloo search framework.
fr: Baloo-widgets contient des gadgets pour la boite à outils de recherche baloo.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&baloo-widgets-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&baloo-widgets-download-http;"/>

source: Download (FTP): <ulink url="&baloo-widgets-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&baloo-widgets-download-ftp;"/>

source: Download MD5 sum: &baloo-widgets-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &baloo-widgets-md5sum;

source: Download size: &baloo-widgets-size;
fr: Taille du téléchargement&nbsp;: &baloo-widgets-size;

source: Estimated disk space required: &baloo-widgets-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &baloo-widgets-buildsize;

source: Estimated build time: &baloo-widgets-time;
fr: Estimation du temps de construction&nbsp;: &baloo-widgets-time;

source: Baloo-widgets Dependencies
fr: Dépendances de Baloo-widgets

source: Required
fr: Requises

source: User Notes: <ulink url="&blfs-wiki;/baloo-widgets"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/baloo-widgets"/>

source: Installation of Baloo-widgets
fr: Installation de Baloo-widgets

source: Install <application>baloo-widgets</application> by running the following commands:
fr: Installez <application>baloo-widgets</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a working test suite.
fr: Ce paquet ne contient pas de suite de tests utilisable.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés
