Repository: espindula/br-lfs
Catalog: blfs/*/archive/core/baloo.po
Languages: fr

source: 144 KB
fr: 144 Kio

source: 33 MB
fr: 33 Mio

source: Introduction to Baloo
fr: Introduction à Baloo

source: Baloo is a framework for searching and managing metadata.
fr: Baloo est une boite à outils pour chercher et gérer des méta-données.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&baloo-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&baloo-download-http;"/>

source: Download (FTP): <ulink url="&baloo-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&baloo-download-ftp;"/>

source: Download MD5 sum: &baloo-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &baloo-md5sum;

source: Download size: &baloo-size;
fr: Taille du téléchargement&nbsp;: &baloo-size;

source: Estimated disk space required: &baloo-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &baloo-buildsize;

source: Estimated build time: &baloo-time;
fr: Estimation du temps de construction&nbsp;: &baloo-time;

source: Baloo Dependencies
fr: Dépendances de Baloo

source: Required
fr: Requises

source: <xref linkend="kdepimlibs"/>, <xref linkend="kfilemetadata"/>, and <xref linkend="xapian"/>
fr: <xref linkend="kdepimlibs"/>, <xref linkend="kfilemetadata"/> et <xref linkend="xapian"/>

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/baloo"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/baloo"/>

source: Installation of Baloo
fr: Installation de Baloo

source: Install <application>baloo</application> by running the following commands:
fr: Installez <application>baloo</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a working test suite.
fr: Ce paquet ne contient pas de suite de tests utilisable.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: akonadi_baloo_indexer, baloo_file, baloo_file_cleaner, baloo_file_extractor, baloosearch and balooshow
fr: akonadi_baloo_indexer, baloo_file, baloo_file_cleaner, baloo_file_extractor, baloosearch et balooshow

source: libbaloocore.so, libbaloofiles.so, libbaloopim.so, libbalooxapian.so and several in &kde-dir;/lib/kde4
fr: libbaloocore.so, libbaloofiles.so, libbaloopim.so, libbalooxapian.so et plusieurs dans &kde-dir;/lib/kde4
