Repository: espindula/br-lfs
Catalog: blfs/*/archive/core/kde-baseapps.po
Languages: fr

source: 2.0 MB
fr: 2.0 Mio

source: 85 MB
fr: 85 Mio

source: Introduction to Kde-baseapps
fr: Introduction à Kde-baseapps

source: This package provides various applications, such as Dolphin (file manager) and Konqueror (web browser). Infrastructure files and libraries are also provided.
fr: Ce paquet fournit diverses applications, telles que Dolphin (gestionnaire de fichiers) et Konqueror (navigateur Internet). Les fichiers et les bibliothèques de l'infrastructure sont aussi fournis.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kde-baseapps-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kde-baseapps-download-http;"/>

source: Download (FTP): <ulink url="&kde-baseapps-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kde-baseapps-download-ftp;"/>

source: Download MD5 sum: &kde-baseapps-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kde-baseapps-md5sum;

source: Download size: &kde-baseapps-size;
fr: Taille du téléchargement&nbsp;: &kde-baseapps-size;

source: Estimated disk space required: &kde-baseapps-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kde-baseapps-buildsize;

source: Estimated build time: &kde-baseapps-time;
fr: Estimation du temps de construction&nbsp;: &kde-baseapps-time;

source: Kde-baseapps Dependencies
fr: Dépendances de Kde-baseapps

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: <xref linkend="kactivities"/>, <xref linkend="kfilemetadata"/>, <xref linkend="baloo"/>, and <xref linkend="baloo-widgets"/>
fr: <xref linkend="kactivities"/>, <xref linkend="kfilemetadata"/>, <xref linkend="baloo"/> et <xref linkend="baloo-widgets"/>

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/kde-baseapps"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kde-baseapps"/>

source: Installation of Kde-baseapps
fr: Installation de Kde-baseapps

source: Install <application>Kde-baseapps</application> by running the following commands:
fr: Installez <application>Kde-baseapps</application> en lançant les commandes suivantes&nbsp;:

source: To test the results, issue <command>make test</command>.
fr: Pour tester les résultats lancez&nbsp;: <command>make test</command>.

source: Now as the <systemitem class="username">root</systemitem> user:
fr: Maintenant en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: dolphin, fsview, kbookmarkmerger, kdepasswd, kdialog, keditbookmarks, kfind, kfmclient, konqueror, nspluginscan, nspluginviewer, servicemenudeinstallation and servicemenuinstallation
fr: dolphin, fsview, kbookmarkmerger, kdepasswd, kdialog, keditbookmarks, kfind, kfmclient, konqueror, nspluginscan, nspluginviewer, servicemenudeinstallation et servicemenuinstallation

source: libdolphinprivate.so, libkbookmarkmodel_private.so, libkdeinit4_dolphin.so, libkdeinit4_keditbookmarks.so, libkdeinit4_kfmclient.so, libkdeinit4_konqueror.so, libkonq.so, libkonqsidebarplugin.so, libkonquerorprivate.so and several in &kde-dir;/lib/kde4
fr: libdolphinprivate.so, libkbookmarkmodel_private.so, libkdeinit4_dolphin.so, libkdeinit4_keditbookmarks.so, libkdeinit4_kfmclient.so, libkdeinit4_konqueror.so, libkonq.so, libkonqsidebarplugin.so, libkonquerorprivate.so et plusieurs dans &kde-dir;/lib/kde4

source: several in &kde-dir;/share
fr: plusieurs dans &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: is a program for merging a given set of bookmarks into the user's set of bookmarks.
fr: est un programme pour fusionner un ensemble donné de marques-pages dans les marques pages de l'utilisateur.

source: is the file find utility for KDE.
fr: est l'utilitaire de recherche de fichiers de KDE.
