Repository: espindula/br-lfs
Catalog: blfs/*/archive/core/kde-workspace.po
Languages: fr

source: 12.9 MB
fr: 12.9 Mio

source: 304 MB
fr: 304 Mio

source: Introduction to Kde-workspace
fr: Introduction à Kde-workspace

source: The Kde-workspace package contains components that are central to providing the <application>KDE</application> desktop environment. Of particular importance are KWin, the <application>KDE</application> window manager, and Plasma, which provides the workspace interface.
fr: Le paquet Kde-workspace contient des composants centraux pour l'environnement de bureau <application>KDE</application>. Parmi ceux les plus importants, se trouvent KWin, le gestionnaire de fenêtres <application>KDE</application> et Plasma, qui fournit l'interface d'espaces de travail.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kde-workspace-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kde-workspace-download-http;"/>

source: Download (FTP): <ulink url="&kde-workspace-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kde-workspace-download-ftp;"/>

source: Download MD5 sum: &kde-workspace-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kde-workspace-md5sum;

source: Download size: &kde-workspace-size;
fr: Taille du téléchargement&nbsp;: &kde-workspace-size;

source: Estimated disk space required: &kde-workspace-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kde-workspace-buildsize;

source: Estimated build time: &kde-workspace-time;
fr: Estimation du temps de construction&nbsp;: &kde-workspace-time;

source: Kde-workspace Dependencies
fr: Dépendances de Kde-workspace

source: Required
fr: Requises

source: <xref linkend="kactivities"/>, <xref linkend="qimageblitz"/>, <xref linkend="xcb-util-image"/>, <xref linkend="xcb-util-renderutil"/>, <xref linkend="xcb-util-keysyms"/>, and <xref linkend="xcb-util-wm"/>
fr: <xref linkend="kactivities"/>, <xref linkend="qimageblitz"/>, <xref linkend="xcb-util-image"/>, <xref linkend="xcb-util-renderutil"/>, <xref linkend="xcb-util-keysyms"/> et <xref linkend="xcb-util-wm"/>

source: Recommended
fr: Recommandées

source: <xref linkend="kdepimlibs"/>, <xref linkend="boost"/>, <xref linkend="freetype2"/>, <xref linkend="pciutils"/>, and <xref linkend="consolekit"/>
fr: <xref linkend="kdepimlibs"/>, <xref linkend="boost"/>, <xref linkend="freetype2"/>, <xref linkend="pciutils"/> et <xref linkend="consolekit"/>

source: Optional
fr: Facultatives

source: <xref linkend="linux-pam"/>, <xref linkend="libusb"/>, <xref linkend="NetworkManager"/>, <xref linkend="lm_sensors"/>, <xref linkend="qjson"/>, <ulink url="&kde-download-http;&kde-version;/src/">PyKDE4</ulink>, <ulink url="http://code.google.com/p/google-gadgets-for-linux/">GoogleGadgets</ulink>, <ulink url="ftp://ftp.kde.org/pub/kde/stable/prison/1.0/src/">Prison</ulink>, <ulink url="http://sourceforge.net/projects/libraw1394/">libraw1394</ulink>, <ulink url="http://www.catb.org/gpsd/">gpsd</ulink>, <ulink url="http://www.xmms.org/">XMMS</ulink>, <ulink url="http://qalculate.sourceforge.net/">libqalculate</ulink> (wants <ulink url="http://www.ginac.de/CLN/">CLN</ulink>), and <xref linkend="wayland"/>
fr: <xref linkend="linux-pam"/>, <xref linkend="libusb"/>, <xref linkend="NetworkManager"/>, <xref linkend="lm_sensors"/>, <xref linkend="qjson"/>, <ulink url="&kde-download-http;&kde-version;/src/">PyKDE4</ulink>, <ulink url="http://code.google.com/p/google-gadgets-for-linux/">GoogleGadgets</ulink>, <ulink url="ftp://ftp.kde.org/pub/kde/stable/prison/1.0/src/">Prison</ulink>, <ulink url="http://sourceforge.net/projects/libraw1394/">libraw1394</ulink>, <ulink url="http://www.catb.org/gpsd/">gpsd</ulink>, <ulink url="http://www.xmms.org/">XMMS</ulink>, <ulink url="http://qalculate.sourceforge.net/">libqalculate</ulink> (veut <ulink url="http://www.ginac.de/CLN/">CLN</ulink>) et <xref linkend="wayland"/>

source: Kde-workspace has a run-time dependency called <application>Application menu for Qt</application> that allows the application menubar to be inserted as a single button in the titlebar. It can be found at <ulink url="https://launchpad.net/appmenu-qt">appmenu-qt</ulink>.
fr: Kde-workspace a une dépendance d'exécution appelée <application>Application menu for Qt</application> qui autorise l'application menubar à être insérée comme un simple bouton dans la bar des titres. Il peut être trouvé sur <ulink url="https://launchpad.net/appmenu-qt">appmenu-qt</ulink>.

source: User Notes: <ulink url="&blfs-wiki;/kde-workspace"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kde-workspace"/>

source: Installation of Kde-workspace
fr: Installation de Kde-workspace

source: It is recommended to have a dedicated user and group to take control of the <command>kdm</command> daemon after it is started. Issue the following commands as the <systemitem class="username">root</systemitem> user:
fr: Il est recommandé d'avoir un utilisateur et un group dédiés pour contrôler le démon <command>kdm</command> après qu'il soit démarré. Tapez les commandes suivantes en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Install <application>Kde-workspace</application> by running the following commands:
fr: Installez <application>Kde-workspace</application> en lançant les commandes suivantes&nbsp;:

source: If building KDE in /opt, then an environment variable <envar>LIBRARY_PATH=$KDE_PREFIX/lib:$LIBRARY_PATH</envar> may be needed on the <command>make</command> line.
fr: Si KDE est construit dans /opt, alors une variable d'environnement <envar>LIBRARY_PATH=$KDE_PREFIX/lib:$LIBRARY_PATH</envar> peut être nécessaire dans la ligne <command>make</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <option>-DINSTALL_PYTHON_FILES_IN_PYTHON_PREFIX=TRUE</option>: This option is set to install the KDE Python objects in the correct place.
fr: <option>-DINSTALL_PYTHON_FILES_IN_PYTHON_PREFIX=TRUE</option>&nbsp;: Cette option est initialisée pour installer les objets python de KDE à un endroit correct.

source: Configuring KDE Workspace
fr: Configurer l'espace de travail de KDE

source: Linux PAM Configuration
fr: Configuration de Linux PAM

source: If you built <application>KDE Workspace</application> with <application>Linux PAM</application> support, create necessary configuration files by running the following commands as the <systemitem class="username">root</systemitem> user:
fr: Si vous construisez <application>KDE Workspace</application> avec le support <application>Linux PAM</application>, créez les fichiers de configuration nécessaire en lançant les commandes suivantes en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: genkdmconf, kaccess, kapplymousetheme, kblankscrn.kss, kcheckrunning, kcminit, kcminit_startup, kdm, kdmctl, kdostartupconfig4, kfontinst, kfontview, kinfocenter, klipper, kmenuedit, krandom.kss, krandrstartup, krandrtray, krdb, krunner, ksmserver, ksplashqml, ksplashsimple, ksplashx, ksplashx_scale, kstartupconfig4, ksysguard, ksysguardd, ksystraycmd, kwin, kwin_gles, kwrited, oxygen-demo, oxygen-settings, oxygen-shadow-demo, plasma-desktop, plasma-netbook, plasma-overlay, plasma-windowed, solid-action-desktop-gen, solid-network, startkde and systemsettings
fr: genkdmconf, kaccess, kapplymousetheme, kblankscrn.kss, kcheckrunning, kcminit, kcminit_startup, kdm, kdmctl, kdostartupconfig4, kfontinst, kfontview, kinfocenter, klipper, kmenuedit, krandom.kss, krandrstartup, krandrtray, krdb, krunner, ksmserver, ksplashqml, ksplashsimple, ksplashx, ksplashx_scale, kstartupconfig4, ksysguard, ksysguardd, ksystraycmd, kwin, kwin_gles, kwrited, oxygen-demo, oxygen-settings, oxygen-shadow-demo, plasma-desktop, plasma-netbook, plasma-overlay, plasma-windowed, solid-action-desktop-gen, solid-network, startkde et systemsettings

source: several in &kde-dir;/lib
fr: plusieurs dans &kde-dir;/lib

source: several in &kde-dir;/include, &kde-dir;/lib and &kde-dir;/share
fr: plusieurs dans &kde-dir;/include, &kde-dir;/lib et &kde-dir;/share
