Repository: espindula/br-lfs
Catalog: blfs/*/archive/core/kfilemetadata.po
Languages: fr

source: 36 KB
fr: 36 Kio

source: 4.3 MB
fr: 4.3 Mio

source: Introduction to Kfilemetadata
fr: Introduction à Kfilemetadata

source: Kfilemetadata is a framework for searching and managing metadata.
fr: Kfilemetadata est une boîte à outils pour chercher et gérer des méta-données.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kfilemetadata-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kfilemetadata-download-http;"/>

source: Download (FTP): <ulink url="&kfilemetadata-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kfilemetadata-download-ftp;"/>

source: Download MD5 sum: &kfilemetadata-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kfilemetadata-md5sum;

source: Download size: &kfilemetadata-size;
fr: Taille du téléchargement&nbsp;: &kfilemetadata-size;

source: Estimated disk space required: &kfilemetadata-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kfilemetadata-buildsize;

source: Estimated build time: &kfilemetadata-time;
fr: Estimation du temps de construction&nbsp;: &kfilemetadata-time;

source: Kfilemetadata Dependencies
fr: Dépendances de Kfilemetadata

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: <xref linkend="taglib"/>, <xref linkend="poppler"/>, <xref linkend="exiv2"/>, <xref linkend="ffmpeg"/>, <ulink url="http://sourceforge.net/projects/ebook-tools">libepub</ulink> and <ulink url="https://projects.kde.org/projects/kde/kdegraphics/kdegraphics-mobipocket">Mobipocket</ulink>
fr: <xref linkend="taglib"/>, <xref linkend="poppler"/>, <xref linkend="exiv2"/>, <xref linkend="ffmpeg"/>, <ulink url="http://sourceforge.net/projects/ebook-tools">libepub</ulink> et <ulink url="https://projects.kde.org/projects/kde/kdegraphics/kdegraphics-mobipocket">Mobipocket</ulink>

source: User Notes: <ulink url="&blfs-wiki;/kfilemetadata"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kfilemetadata"/>

source: Installation of Kfilemetadata
fr: Installation de Kfilemetadata

source: Install <application>kfilemetadata</application> by running the following commands:
fr: Installez <application>kfilemetadata</application> en lançant les commandes suivantes&nbsp;:

source: To run the test suite, issue: <command>make test</command>.
fr: Pour lancer la suite de tests, tapez&nbsp;: <command>make test</command>.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <option>-DCMAKE_MINIMUM_REQUIRED_VERSION=3.0</option>: This switch is needed to avoid a cmake error when using cmake-3.3 and later.
fr: <option>-DCMAKE_MINIMUM_REQUIRED_VERSION=3.0</option>&nbsp;: Ce paramètre est nécessaire pour empêcher une erreur de cmake avec cmake-3.3 ou supérieur.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libkfilemetadata.so and several in &kde-dir;/lib/kde4
fr: libkfilemetadata.so et plusieurs dans &kde-dir;/lib/kde4

source: &kde-dir;/include/kfilemetadata and &kde-dir;/lib/cmake/KFileMetaData
fr: &kde-dir;/include/kfilemetadata et &kde-dir;/lib/cmake/KFileMetaData
