Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/config/bootdisk.xml.1.chaine.po
Languages: fr

source: Creating a Custom Boot Device
fr: Créer un périphérique de démarrage personnalisé

source: Decent Rescue Boot Device Needs
fr: Besoins d'un périphérique de démarrage digne de ce nom

source: This section is really about creating a
fr: Cette section concerne spécifiquement la création d'un périphérique de

source: rescue
fr: secours

source: As the name
fr: Comme le nom

source: implies, the host system has a problem, often lost partition information or corrupted file systems, that prevents it from booting and/or operating normally.
fr: l'indique, le système hôte a un problème, souvent des informations de partition perdues ou des systèmes de fichiers corrompus, ce qui l'empêche de démarrer et/ou de fonctionner normalement.

source: For this reason, you
fr: Pour cette raison, vous

source: must not
fr: ne devez pas

source: depend on resources from the host being "rescued".
fr: dépendre des ressources de l'hôte que vous "sauvez".

source: To presume that any given partition or hard drive
fr: Présumer qu'une partition ou un disque dur donné

source: will
fr: sera

source: be available is a risky presumption.
fr: disponible est une présomption risquée.

source: In a modern system, there are many devices that can be used as a rescue device:
fr: Dans un système moderne, de nombreux périphériques peuvent être utilisés comme périphériques de secours :

source: floppy, cdrom, usb drive, or even a network card.
fr: disquette, cdrom, clé usb ou même une carte réseau.

source: Which one you use depends on your hardware and your BIOS.
fr: Celui que vous utiliserez dépend de votre matériel et de votre BIOS.

source: In the past, a rescue device was thought to be a floppy disk.
fr: Autrefois, un périphérique de secours était synonyme d'une disquette.

source: Today, many systems do not even have a floppy drive.
fr: Aujourd'hui, de nombreux systèmes n'ont même pas de lecteur de disquette.

source: Building a complete rescue device is a challenging task.
fr: La construction d'un périphérique complet est un vrai défi.

source: In many ways, it is equivalent to building an entire LFS system.
fr: En quelque sorte, cela revient à construire un système LFS entier.

source: In addition, it would be a repetition of information already available.
fr: En outre, ce serait répéter des informations déjà disponibles.

source: For these reasons, the procedures for a rescue device image are not presented here.
fr: Aussi les procédures pour créer une image de périphérique de secours ne sont pas présentées ici.

source: Creating a Rescue Floppy
fr: Créer une disquette de secours

source: The software of today's systems has grown large.
fr: Les logiciels des systèmes actuels ont grossi.

source: Linux 2.6 no longer supports booting directly from a floppy.
fr: Linux 2.6 ne supporte plus le démarrage direct à partir d'une disquette.

source: In spite of this, there are solutions available using older versions of Linux.
fr: Malgré cela, il existe des solutions disponibles en utilisant d'anciennes versions de Linux.

source: One of the best is Tom's Root/Boot Disk available at _L282_ .
fr: Une des meilleures est le disque Tom's Root/Boot disponible sur _L286_.

source: This will provide a minimal Linux system on a single floppy disk and provides the ability to customize the contents of your disk if necessary.
fr: Cela fournira un système Linux minimal sur une seule disquette et cela offre la possibilité de personnaliser le contenu de votre disquette si nécessaire.

source: Creating a Bootable CD-ROM
fr: Créer un CD-ROM amorçable

source: There are several sources that can be used for a rescue CD-ROM.
fr: Vous pouvez utiliser plusieurs sources pour un CD-ROM de secours.

source: Just about any commercial distribution's installation CD-ROMs or DVDs will work.
fr: N'importe quel CD-ROMs ou DVDs d'installation d'une distribution commerciale fonctionnera.

source: These include RedHat, Mandrake, and SuSE.
fr: Il en est ainsi de RedHat, Mandrake, et SuSE.

source: One very popular option is Knoppix.
fr: Un choix très populaire est Knoppix.

source: Also, the LFS Community has developed its own LiveCD available at _L283_ .
fr: La communauté LFS a aussi développé son propre LiveCD, disponible sur _L287_.

source: This LiveCD, is no longer capable of building an entire LFS/BLFS system, but is still a good rescue CD-ROM.
fr: Ce LiveCD n'est plus capable de construire tout un système LFS/BLFS, mais il reste un bon CD-ROM de secours.

source: If you download the ISO image, use _X278_ to copy the image to a CD-ROM.
fr: Si vous téléchargez l'image ISO, utilisez _X278_ pour graver l'image sur un CD-ROM.

source: The instructions for using GRUB2 to make a custom rescue CD-ROM are also available in _L284_ .
fr: Les instructions de construction de GRUB2 visant à créer un CD-ROM personnalisé de secours sont également disponibles sur _L288_.

source: Creating a Bootable USB Drive
fr: Créer une clé USB amorçable

source: A USB Pen drive, sometimes called a Thumb drive, is recognized by Linux as a SCSI device.
fr: Une clé USB, appelée parfois lecteur Thumb, est reconnue par Linux comme un périphérique SCSI.

source: Using one of these devices as a rescue device has the advantage that it is usually large enough to hold more than a minimal boot image.
fr: L'utilisation de ce genre de périphérique comme périphérique de secours présente l'avantage d'être en général assez gros pour contenir davantage qu'une image de démarrage minimale.

source: You can save critical data to the drive as well as use it to diagnose and recover a damaged system.
fr: Vous pouvez sauvegarder des données critiques sur un lecteur ainsi que l'utiliser pour diagnostiquer et récupérer un système endommagé.

source: Booting such a drive requires BIOS support, but building the system consists of formatting the drive, adding _A451_ as well as the Linux kernel and supporting files.
fr: Le démarrage d'un tel périphérique exige un support par le BIOS, mais la construction du système consiste à formater le lecteur, ajouter _A451_ ainsi que le noyau Linux et les fichiers de support.

source: User Notes:
fr: Notes utilisateur :
