Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/config/devices.xml.1.chaine.po
Languages: fr

source: About Devices
fr: À propos des périphériques

source: Although most devices needed by packages in BLFS and beyond are set up properly by _A99_ using the default rules installed by LFS in _F719_ , there are cases where the rules must be modified or augmented.
fr: Bien que la plupart des périphériques dont ont besoin les paquets de BLFS ont été correctement paramétrés par _A99_ en utilisant les règles par défaut installées par LFS dans _F719_ , il y a des cas où il faut modifier ou ajouter des règles.

source: User Notes:
fr: Notes utilisateur :

source: USB Device Issues
fr: Problèmes sur les périphériques USB

source: USB devices usually have two kinds of device nodes associated with them.
fr: Les périphériques USB ont habituellement deux types de noeuds de périphériques associés avec eux.

source: The first kind is created by device-specific drivers (e.g., usb_storage/sd_mod or usblp) in the kernel.
fr: Le premier type est créé par le driver du périphérique spécifique (usb_storage/sd_mod ou usblp) dans le noyau.

source: For example, a USB mass storage device would be /dev/sdb, and a USB printer would be /dev/usb/lp0.
fr: Par exemple, un périphérique de stockage USB peut être /dev/sdb, et une imprimpante USB peut être /dev/usb/lp0.

source: These device nodes exist only when the device-specific driver is loaded.
fr: Ces noeuds de périphériques existent seulement quand le driver du périphérique spécifique est chargé.

source: The second kind of device nodes (/dev/bus/usb/BBB/DDD, where BBB is the bus number and DDD is the device number) are created even if the device doesn't have a kernel driver.
fr: Le second type de noeud de périphériques (/dev/bus/usb/BBB/DDD, ou BBB est le numéro du bus et DDD est le numéro du périphérique) est créé chaque fois que le périphérique n'a pas de driver dans le noyau.

source: By using these "raw" USB device nodes, an application can exchange arbitrary USB packets with the device, i.e., bypass the possibly-existing kernel driver.
fr: En utilisant ces noeuds de périphérique USB "directs", une application peut échanger arbitrairement des paquets USB avec le périphérique, c'est à dire, court-circuiter le possible driver du noyau existant.

source: Access to raw USB device nodes is needed when a userspace program is acting as a device driver.
fr: Accéder aux noeuds périphérique USB directement est nécessaire quand un programme de l'espace utilisateur est considéré comme un driver de périphérique.

source: However, for the program to open the device successfully, the permissions have to be set correctly.
fr: Sinon, pour le programme qui ouvre avec succès le périphérique les permissions sont initialisées correctement.

source: By default, due to security concerns, all raw USB devices are owned by user root and group usb, and have 0664 permissions (the read access is needed, e.g., for lsusb to work and for programs to access USB hubs).
fr: Par défaut, pour des considérations de sécurité, tous les périphériques USB directs sont propriétés de l'utilisateur root et du groupe usb, et ont la permission 0664 (l'accès en lecture est nécessaire, e.g., pour que lsusb puisse travailler et pour les programmes d'accès aux concentrateurs USB).

source: Packages (such as SANE and libgphoto2) containing userspace USB device drivers also ship udev rules that change the permissions of the controlled raw USB devices.
fr: Des paquets (comme SANE et libgphoto2) contenant un driver de périphérique USR dans l'espace utilisateur utilisent aussi les règles udev pour changer les permissions des périphériques USB contrôlés.

source: That is, rules installed by SANE change permissions for known scanners, but not printers.
fr: Ce qui fait que, les règles installées par SANE changent les permissions pour les scanners reconnus, mais pas pour les imprimantes.

source: If a package maintainer forgot to write a rule for your device, report a bug to both BLFS (if the package is there) and upstream, and you will need to write your own rule.
fr: Si le mainteneur du paquet oublie d'écrire une règle pour votre périphérique, signaler le bug à BLFS (si le paquet est ici) et upstream, et vous aurez besoin d'écrire votre propre règle.

source: There is one situation when such fine-grained access control with pre-generated udev rules doesn't work.
fr: Il y a une situation ou un contrôle d'accès fin avec des règles udev prégénérées ne marche pas.

source: patches are needed in order to get this to work without the obsolete /proc/bus/usb mount point described below).
fr: des correctifs sont nécessaires pour que cela fonctionne dans les point de montage obsolete /proc/bus/usb décris précédemment).

source: Obviously, maintainers of these packages cannot know which USB devices are going to be connected to the guest operating system.
fr: Naturellement, les mainteneurs de ces paquets ne peuvent pas connaître quels périphériques USB seront connectés sur le système d'exploitation invité.

source: You can either write separate udev rules for all needed USB devices yourself, or use the default catch-all "usb" group, members of which can send arbitrary commands to all USB devices.
fr: Vous pouvez bien écrire des règles udev séparés pour tous les périphériques USB nécessaire vous même, ou utiliser les règles par défaut du groupe "usb", les membres de celui-ci peuvent envoyé des commandes arbitraires pour tous périphériques USB.

source: Before Linux-2.6.15, raw USB device access was performed not with /dev/bus/usb/BBB/DDD device nodes, but with /proc/bus/usb/BBB/DDD pseudofiles.
fr: Avant Linux-2.6.15, l'accès direct aux périphériques USB n'était pas géré avec les noeuds de périphériques /dev/bus/usb/BBB/DDD, mais avec des pseudo-fichiers /proc/bus/usb/BBB/DDD.

source: Some applications (e.g., VMware Workstation) still use only this deprecated technique and can't use the new device nodes.
fr: Quelques applications (e.g., VMware Workstation) semblent utiliser seulement cette technique obsolète et ne peuvent pas utiliser les nouveaux noeuds de périphériques.

source: For them to work, use the "usb" group, but remember that members will have unrestricted access to all USB devices.
fr: Pour qu'elles puissent fonctionner, utiliser le groupe "usb", mais rappelez vous que les membres ont un accès complet à tous les périphériques USB.

source: To create the fstab entry for the obsolete usbfs filesystem:
fr: Pour créer l'entrée fstab pour le fichier système obsolète usbfs :

source: Adding users to the "usb" group is inherently insecure, as they can bypass access restrictions imposed through the driver-specific USB device nodes.
fr: Ajouter les utilisateurs dans le groupe "usb" est par nature insécurisé, car cela court-circuite les restrictions d'accès imposés par les drivers spécifiques des noeuds de périphérique USB.

source: For instance, they can read sensitive data from USB hard drives without being in the "disk" group.
fr: Par nature, ils peuvent lire des données sensibles des disques USB sans être dans le group "disque".

source: Avoid adding users to this group, if you can.
fr: Evitez d'ajouter des utilisateurs dans ce groupe si vous le pouvez.

source: Udev Device Attributes
fr: Attributs de périphériques d'Udev

source: Fine-tuning of device attributes such as group name and permissions is possible by creating extra _A99_ rules, matching on something like this.
fr: Le peaufinement des attributs de périphériques tels que le nom du groupe et les droits est possible en créant des règles _A99_ supplémentaires, correspondant à quelque chose de ce genre.

source: The vendor and product can be found by searching the _F720_ directory entries or using _C2578_ after the device has been attached.
fr: On peut trouver le fabricant et le produit en cherchant les entrées du répertoire _F720_ ou en utilisant _C2580_ après avoir attaché le périphérique.

source: See the documentation in the current _A99_ directory of _F285_ for details.
fr: Voir la documentation dans le répertoire d'_A99_ actuel _F285_ pour des détails.

source: The above line is used for descriptive purposes only.
fr: On n'utilise la ligne ci-dessus qu'à des fins descriptives.

source: The scanner _A99_ rules are put into place when installing _X760_ .
fr: Les règles d'analyse d'_A99_ sont mises en place lors de l'installation de _X140_.

source: Devices for Servers
fr: Périphériques pour les serveurs

source: In some cases, it makes sense to disable _A99_ completely and create static devices.
fr: Dans certains cas, il est utile de désactiver _A99_ complètement et de créer des périphériques statiques.

source: Servers are one example of this situation.
fr: Les serveurs sont un exemple de cette situation.

source: Does a server need the capability of handling dynamic devices? Only the system administrator can answer that question, but in many cases the answer will be no.
fr: Est-ce qu'un serveur a besoin de la possibilité de gérer des périphériques dynamiques? Seul l'administrateur système peut répondre à cette question, mais dans de nombreux cas, la réponse est non.

source: If dynamic devices are not desired, then static devices must be created on the system.
fr: Si vous ne désirez pas de périphériques dynamiques, vous devez créer des périphériques statiques sur le système.

source: In the default configuration, the _F1569_ boot script mounts a _U21_ partition over the _F615_ directory.
fr: Dans la configuration par défaut, le script de démarrage _F1569_ monte une partition _U21_ dans le répertoire _F615_.

source: This problem can be overcome by mounting the root partition temporarily:
fr: Ce problème peut être résolu en montant temporairement la partition racine :

source: If the instructions below are not followed carefully, your system could become unbootable.
fr: Si vous ne suivez pas rigoureusement les instructions ci-dessous, votre système pourrait ne plus pouvoir démarrer.

source: At this point, the system will use static devices upon the next reboot.
fr: Dès lors, le système utilisera des périphériques statiques lors du prochain redémarrage.

source: Create any desired additional devices using _C2579_ .
fr: Créez les périphériques supplémentaires désirés en utilisant _C2579_.

source: If you want to restore the dynamic devices, recreate the _F1570_ symbolic links and reboot again.
fr: Si vous voulez restaurer les périphériques dynamiques, recréez les liens symboliques _F1570_ et redémarrez de nouveau.

source: Static devices do not need to be removed (console and null are always needed) because they are covered by the _U21_ partition.
fr: Il n'est pas nécessaire de supprimer les périphériques statiques (console et null sont toujours nécessaires) car ils sont recouverts par la partition _U21_.

source: Disk usage for devices is negligible (about 20&ndash;30 bytes per entry. )
fr: L'utilisation du disque par des périphériques est négligeable (environ 20&ndash;30 octets par entrée)
