Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/config/firmware.xml.1.chaine.po
Languages: fr

source: About Firmware
fr: A propos des Firmwares

source: On some recent PCs it can be necessary, or desirable, to load firmware to make them work at their best.
fr: Sur certains PCs actuels il peut être nécéssaire, ou désirable, de charger des firmwares pour faire travailler les PC au maximum de leurs possibilités.

source: There is a directory, _F1476_ , where the kernel or kernel drivers look for firmware images.
fr: Il y a un répertoire, _F1476_ , ou le noyau ou les pilotes du noyau cherche des images de firmware.

source: Preparing firmware for multiple different machines, as a distro would do, is outside the scope of this book.
fr: Préparer des firmwares pour de multiples machines différente, comme les distributions le font, est en dehors du périmètre de ce livre.

source: Currently, most firmware can be found at a
fr: Actuellement, on peut trouver la plupart des firmwares sur un dépot

source: For convenience, the LFS Project has created a mirror, updated daily, where these firmware files can be accessed via
fr: Par commodité, le projet LFS a créé un mirroir, mis à jour quotidiennement, ou on peut accéder à ces fichiers de firmwares via

source: or a web browser at _L2734_ .
fr: ou un navigateur web à _L2734_.

source: and clone that repository.
fr: et cloner ce dépot.

source: For some other firmware, particularly for Intel microcode and certain wifi devices, the needed firmware is not available in the above repository.
fr: Pour certains autres firmwares, particulièrement pour les microcode d'Intel, et certains périphériques wifi, le firmware recherché n'est pas disponible dans le dépôt précédent.

source: Some of this will be addressed below, but a search of the Internet for needed firmware is sometimes necessary.
fr: Certains d'entre eux seront ajouté ensuite, mais il est parfois nécéssaire de faire une recherche sur internet pour les firmwares souhaités.

source: Firmware files are conventionally referred to as blobs because you cannot determine what they will do.
fr: Les fichiers firmwares sont par convention référencés comme des blobs car vous ne pouvez pas déterminer ce qu'ils font.

source: Note that firmware is distributed under various different licenses which do not permit disassembly or reverse-engineering.
fr: Notez que ces firmwares sont distribués sous des licences différentes et variées qui ne permettent pas le désassemblage ou la retro ingénierie.

source: Firmware for PCs falls into four categories:
fr: Les firmwares pour PC tombent dans 4 catégories :

source: Updates to the CPU to work around errata, usually referred to as microcode.
fr: Les firmwares mettant à jour le CPU pour travailler correctement, courament appelé microcode.

source: Firmware for video controllers.
fr: Les firmwares pour les controleurs vidéo.

source: On x86 machines this seems to only apply to ATI devices :
fr: Sur les machines x86 cela semble s'appliquer seulement aux périphériques ATI :

source: Radeons require firmware to be able to use KMS (kernel modesetting - the preferred option) as well as for Xorg.
fr: les Radeons demandent des firmwares pour pouvoir utiliser le KMS (kernel modesetting - option préférable) avec Xorg.

source: For earlier radeon chips (before the R600), the firmware is still in the kernel.
fr: Pour les puces radéons plus ancienne (avant R600), le firmware est resté dans le noyau.

source: Firmware updates for wired network ports.
fr: Les Firmwares mettant à jour les ports réseaux cablés.

source: Mostly they work even without the updates, but one must assume that they will work better with the updated firmware.
fr: Souvent ils fonctionnent sans les mises à jour, mais on peut penser qu'ils travaillent mieux avec les firmwares mis à jour.

source: Firmware for other devices, such as wifi.
fr: Les Firmwares pour les autres périphériques, comme le wifi.

source: These devices are not required for the PC to boot, but need the firmware before these devices can be used.
fr: Ces périphériques ne sont pas requis pour que le PC démarre, mais demande un firmware avant que ces périphériques puissent être utilisés.

source: Although not needed to load a firmware blob, the following tools may be useful for determining, obtaining, or preparing the needed firmware in order to load it into the system:
fr: Comme il n'est pas utile de charger un firmware fermé :

source: User Notes:
fr: Notes utilisateur :

source: Intel Microcode for the CPU
fr: Microcode Intel pour le CPU

source: Required Package
fr: Paquet requis

source: For intel CPUs an extra package, microcode_ctl, is required.
fr: Pour les CPU intel, un paquet supplémentaire, microcode_ctl, est requis.

source: The package chosen is the version hosted at fedora &mdash; there is an alternative version at github from the same packager, but that still includes a redundant old version of an AMD microcode container, and also requires the unzip package.
fr: Le paquet choisi est la version hébergé sur Fedora &mdash; il y a une version alternative sur github du même empaqueteur, mais qui laisse une ancienne version redondante d'un container de microcode AMD, et aussi requiert le paquet unzip.

source: Download the latest version from the link above; when last checked this was 2.1-8 and is updated when intel releases new microcode.
fr: Téléchargement de la dernière version depuis le lien précédent; à la dernière vérification, il était en version 2.1-8 et est mis à jour quand intel publie de nouveaux microcodes.

source: This package reformats the microcode supplied by intel into a format which the kernel can apply.
fr: Ce paquet reformate le microcode fourni par intel dans un format que le noyau peut appliquer.

source: The program
fr: Le programme

source: is built and invoked by the Makefile to create the individual firmware blobs, so there is no reason to install it.
fr: est construit et invoqué par le Makefile pour créer des blobs individuels de firmwares, donc il n'y a pas de raison de les installer.

source: Begin by extracting the tarball and changing to the directory it created.
fr: Commencez par extraire l'archive et allez dans le répertoire créé.

source: Then change to the source directory and run:
fr: Ensuite allez dans le répertoire des sources et lancez :

source: This creates various blobs with names in the form XX-YY-ZZ.
fr: Cela crée de nombreux blobs avec des noms de la forme XX-YY-ZZ.

source: Now you need to determine your processor's identity, to see if there is any microcode for it.
fr: Maintenant vous devez déterminer l'identité de votre processeur, pour vois s'il y a un microcode pour lui.

source: Determine the decimal values of the cpu family, model and stepping by running:
fr: Déterminez les valeurs décimales de la famille du cpu, le modèle, et le pas en lançant :

source: Now convert the cpu family, model and stepping to pairs of hexadecimal digits.
fr: Maintenant convertissez la famille du cpu, le modèle et le pas en paire de digits héxadécimal.

source: For a SandyBridge i3-2120 (described as Intel (R) Core (TM) i3-2120 CPU) the relevant values are cpu family 6, model 42, stepping 7 so in this case the required identification is 06-2a-07.
fr: Pour un SandyBridge i3-2120 (décrit comme un Intel (R) Core (TM) i3-2120 CPU) les bonnes valeurs sont famille de cpu 6, modèle 42, pas 7 donc dans ce cas l'identification requise est 06-2a-07.

source: A look at the blobs will show that there is one for this CPU (although it might have already been applied by the BIOS).
fr: Un coup d'oeil sur les blobs montrera qu'il y en a un pour ce CPU (cependant qui semble déjà appliqué par le BIOS).

source: If there is a blob for your system then test if it will be applied by copying it (replace &lt;XX-YY-ZZ&gt; by the identifier for your machine) to where the kernel can find it:
fr: S'il y a un blob pour votre système alors testez s'il peut être appliqué en le copiant (remplacez &lt;XX-YY-ZZ&gt; par l'identifiant de votre machine) ou le noyau pourra le trouver :

source: Now that the intel microcode has been prepared, use the following options when you configure the kernel to try late loading of the intel microcode:
fr: Maintenant que le microcode intel a été préparé, utilisez les options suivantes quand vous configurez le noyau pour essayer le chargement "tard" du microcode intel :

source: After you have successfully booted the new system, use the command
fr: Après que vous ayez démarré le nouveau système avec succès, utilisez la commande

source: and study the results to see if the message new patch_level appears.
fr: et étudiez les résultats pour voir si le message patch_level apparait.

source: This example from the SandyBridge i3:
fr: Voici un exemple pour le SandyBridge i3 :

source: If the microcode was not updated, there is no new microcode for this system's processor.
fr: Si le microcode n'a pas été mis à jour, il n'y a pas de nouveau microcode pour ce processeur.

source: If it did get updated, you can now proceed to _X745_ .
fr: S'il a été mis à jour, vous pouvez maintenant faire _X590_.

source: AMD Microcode for the CPU
fr: Microcode AMD pour le CPU

source: Begin by downloading a container of firmware for your CPU family from _L2739_ .
fr: Commencez par télécharger un paquet de firmware pour votre famille de CPU sur _L2742_.

source: The family is always specified in hex.
fr: La famille est toujours spécifiées en héxa.

source: Families 10h to 14h (16 to 20) are in microcode_amd.bin.
fr: Les familles 10h à 14h (16 à 20) sont dans microcode_amd.bin.

source: Families 15h and 16h have their own containers.
fr: Les familles 15h et 16h ont leur propre paquet.

source: Create the required directory and put the firmware you downloaded into it as the _U2_ user:
fr: Créez le répertoire requis et placez le firmware télécharger dedans en tant qu'utilisateur _U2_ :

source: When you configure the kernel, use the following options to try late loading of AMD microcode:
fr: Quand vous configurez le noyau, utilisez les options suivantes pour essayer un chargement "tard" du microcode AMD :

source: and study the results to see if the message new patch_level appears, as in this example from an old Athlon (tm) II X2:
fr: et study the results to see if the message new patch_level appears, as in this example from an old Athlon (tm) II X2 :

source: Early loading of microcode
fr: Chargement "tôt" du microcode

source: If you have established that updated microcode is available for your system, it is time to prepare it for early loading.
fr: Si vous avez établi d'un microcode mis à jour est disponible pour votre système, il est temps de le préparer pour un chargement "tôt".

source: This requires an additional package, _X746_ , as well as changes to the kernel config and the creation of an initrd which will need to be added to grub.cfg.
fr: Cela demande un paquet supplémentaire, _X578_ , ainsi que des modifications à la configuration du noyau et la création d"un initrd qui devra être ajouté à grub.cfg.

source: It does not matter where you prepare the initrd, and once it is working you can apply the same initrd to later LFS systems or newer kernels on this same machine, at least until any newer microcode is released.
fr: L'endroit ou vous préparez l'initrd n'est pas important, et une fois fonctionnel vous pouvez appliquer le même initrd aux versions futures de LFS ou aux nouveaux noyaux sur cette même machine, au moins jusqu'à ce qu'une nouvelle version du microcode soit publiée.

source: Use the following commands:
fr: Utiliser la suite :

source: For an AMD machine, use the following command (replace &lt;MYCONTAINER&gt; with the name of the container for your CPU's family):
fr: Pour une machine AMD, utilisez la commande suivante (remplacez &lt;MYCONTAINER&gt; par le nom du paquet de votre famille de CPU) :

source: Or for an Intel machine copy the appropriate blob using this command:
fr: Ou pour une machine intel copiez le blob approprié en utilisant cette commande :

source: Now prepare the initrd:
fr: Maintenant préparez l'initrd :

source: You will now need to reconfigure and rebuild your kernel.
fr: Vous devez maintenant reconfigurer et reconstruire votre noyau.

source: It is safer to either add/change the EXTRAVERSION in the kernel's configuration and install the newer kernel with a new name, or else (unless you have a machine which requires an early firmware update) wait for the next SUBLEVEL kernel release so that you can fall back to the existing kernel in the event that something goes wrong.
fr: Il est prudent pour chaque d'ajouter/changer l'EXTRAVERSION dans la configuration du noyau et d'installer le nouveau noyau avec un nouveau nom, ou alors (à moins que vous ayez une machine qui requiert une mise à jour du firmware "tôt") attendre la prochaine publication SUBLEVEL du noyau de sorte que vous puissiez revenir au noyau existant dans le cas où quelque chose irait mal.

source: You will also need to add a new entry to /boot/grub/grub.cfg and here you should add a new line after the linux line within the stanza.
fr: Vous devrez également ajouter une nouvelle entrée à /boot/grub/grub.cfg et vous devrez ajouter une ligne apres la ligne linux.

source: If /boot is a separate mountpoint:
fr: Si /boot est dans une partition séparée :

source: or this if it is not:
fr: ou sinon :

source: You must also change the kernel config:
fr: Vous devez également modifier la config du noyau :

source: Retain the setting for INTEL or AMD microcode.
fr: Retenez l'initialisation pour le microcode INTEL ou AMD.

source: When you have saved the .config file, either CONFIG_MICROCODE_INTEL_EARLY=y or CONFIG_MICROCODE_AMD_EARLY=y should be set, together with CONFIG_MICROCODE_EARLY=y.
fr: Quand vous avez sauvegardé le fichier .config, soit CONFIG_MICROCODE_INTEL_EARLY=y ou CONFIG_MICROCODE_AMD_EARLY=y doit être initialisé, avec CONFIG_MICROCODE_EARLY=y.

source: When you have installed and booted this kernel, you should check the output of dmesg to confirm that the early load worked.
fr: Quand vous avez installé et démarré ce noyau, vous pouvez vérifier la sortie de dmesg pour confirmer que le chargement "tôt" fonctionne.

source: The places and times where this happens are very different in AMD and Intel machines.
fr: Les endroits et les temps ou cela se passent sont très différents sur les machines AMD et Intel.

source: First, an Intel example where a development kernel is being tested, showing that the first notification comes before the kernel version is mentioned:
fr: En premier, un exemple d'Intel ou un noyau de développment est testé, regardez que la première notification vient avant que la version du noyau soit indiquée :

source: A second AMD example is where the machine was running a stable kernel on an older version of LFS.
fr: Un deuxième exemple AMD ou la machine lance un noyau stable sur une ancienne version de LFS.

source: Note that here there is no mention of the previous microcode version &mdash; compare this output to the AMD late loading messages (above) from the same machine:
fr: Notez que ici, il n'est pas indiqué la version du microcode précédent &mdash; comparez cette sortie aux messages de chargement "tard" (aprés) de la même machine :

source: Firmware for ATI video chips (R600 and later)
fr: Firmware pour les puces video ATI (R600 et plus)

source: These instructions do NOT apply to old radeons before the R600 family.
fr: Ces instructions NE s'applique pas aux anciennes radaeons avant la famille R600.

source: For those, the firmware is in the kernel's _F1477_ directory.
fr: Pour elles, le firmware est dans le répertoire du noyau _F1477_.

source: Nor do they apply if you intend to avoid a graphical setup such as Xorg and are content to use the default 80x25 display rather than a framebuffer.
fr: Appliquez les seulement si vous prévoyez d'éviter une configuration graphique tels que Xorg et que vous voulez vous contenter d'utiliser l'affichage 80x25 par défaut plutôt qu'un framebuffer.

source: Early radeon devices only needed a single 2K blob of firmware.
fr: Les périphériques radéon plus récent demande seulement un simple blod de 2Ko.

source: Recent devices need several different blobs, and some of them are much bigger.
fr: Les périphériques récents ont besoin de plusieurs blobs différents, et certain d'entre eux sont plus gros.

source: The total size of the radeon firmware directory is over 500K &mdash; on a large modern system you can probably spare the space, but it is still redundant to install all the unused files each time you build a system.
fr: La taille totale du répertoire des firmwares radéon est de plus de 500 ko &mdash; sur un gros système moderne vous pouvez probablement utiliser cet espace, mais cela reste redondant d'installer tous les fichiers inutiles chaque fois que vous construisez un système.

source: A better approach is to install _X747_ and then use
fr: Une meilleure approche est d'installer _X352_ et ensuite utiliser

source: to identify which VGA controller is installed.
fr: pour identifier quel controleur VGA est installé.

source: With that information, check the RadeonFeature page of the Xorg wiki for _L2740_ to identify the family (you may need to know this for the Xorg driver in BLFS &mdash; Southern Islands and Sea Islands use the radeonsi driver) and the specific model.
fr: Avec cette information, vérifiez la page RadeonFeature du wiki Xorg _L2740_ pour identifier la famille (vous aurez besoin de savoir cela pour identifier le pilote Xorg dans BLFS &mdash; Southern Islands et Sea Islands utilise le pilote radeonsi) et le modèle spécifique.

source: Now that you know which controller you are using, consult the _L2741_ page of the Gentoo wiki which has a table listing the required firmware blobs for the various chipsets.
fr: Maintenant que vous savez quel contrôleur vous allez utiliser, consultez la page _L2741_ du wiki Gentoo qui a un tableau listant les blobs de firmware requis pour les différentes puces.

source: Note that Southern Islands and Sea Islands chips use different firmware for kernel 3.17 and later compared to earlier kernels.
fr: Notez que les puces Southern Islands et Sea Islands utilise des firmwares différents pour les noyaux 3.17 et supérieur en comparaison des kernels antérieurs.

source: Identify and download the required blobs then install them:
fr: Identifiez et téléchargez les blobs requis et ensuite installez les :

source: There are actually two ways of installing this firmware.
fr: Il y a actuellement deux façons d'installer ces firmwares.

source: BLFS, in the 'Kernel Configuration for additional firmware' section part of the _X671_ section gives an example of compiling the firmware into the kernel - that is slightly faster to load, but uses more kernel memory.
fr: BLFS, dans le sous-chapitre 'Configuration du noyau pour les firmwares supplémentaires' du chapitre _X671_ donne un exemple de compilation des firmwares dans le noyau - c'est légèrement plus rapide à charger, mais utilises plus de mémoire pour le noyau.

source: Here we will use the alternative method of making the radeon driver a module.
fr: Ici nous utiliserons la méthode alternative en faisant un module du pilote radeon.

source: In your kernel config set the following:
fr: Dans votre configuration du noyau initialisez la suite :

source: Loading several large blobs from /lib/firmware takes a noticeable time, during which the screen will be blank.
fr: Le chargement de plusieurs blobs volumineux dans /lib/firmware prend un temps notable, pendant lequel l'écran est blanc.

source: If you do not enable the penguin framebuffer logo, or change the console size by using a bigger font, that probably does not matter.
fr: Si vous n'avez pas activé le logo framebuffer du pingouin, ou changé la taille de la console en utilisant une police plus grosse, cela n'a probablement pas d'importance.

source: If desired, you can slightly reduce the time if you follow the alternate method of specifying 'y' for CONFIG_DRM_RADEON covered in BLFS at the link above &mdash; you must specify each needed radeon blob if you do that.
fr: Si vous le souhaitez, vous pouvez légèrement réduire le temps si vous vuivez la méthode alternative en spécifiant 'y' pour CONFIG_DRM_RADEON couvert dans BLFS au lien précédent &mdash; vous devez spécifier chaque blob radéon utile si vous faite cela.

source: Firmware for Network Interfaces
fr: Firmware pour les interfaces réseaux

source: Therefore, you can boot the kernel, check dmesg for messages about this missing firmware, and if necessary download the firmware and put it in the specified directory in /lib/firmware so that it will be found on subsequent boots.
fr: Cependant, vous pouvez démarrer le noyau, vérifiez dmesg pour les messages à propos de firmwares manquants, et si nécessaire télécharger les firmwares et les mettre dans un répertoire spécifique dans /lib/firmware afin qu'ils puissent être trouvés pendant la séquence de démarrage.

source: Note that with current kernels this works whether or not the driver is compiled in or built as a module, there is no need to build this firmware into the kernel.
fr: Notez qu'avez les noyaux actuels cela fonctionne que le pilote soit compilé dedans ou construit comme un module, il n'est pas utile de construire ce firmware dans le noyau.

source: Here is an example where the R8169 driver has been compiled in but the firmware was not made available.
fr: Ici un exemple ou le pilote R8169 a été compilé dedans mais le firmware n'est pas disponible.

source: Once the firmware had been provided, there was no mention of it on later boots.
fr: Une fois que le firmware a été fourni, il n'y est plus fait mention dans les démarrages suivants.
