Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/config/logon.xml.1.chaine.po
Languages: fr

source: Customizing your Logon with /etc/issue
fr: Personnaliser votre écran de connexion avec /etc/issue

source: When you first boot up your new LFS system, the logon screen will be nice and plain (as it should be in a bare-bones system).
fr: Quand vous démarrez pour la première fois votre nouveau système LFS, votre écran de connexion sera tout beau et brut (comme s'il devait être un système squelettique).

source: Many people however, will want their system to display some information in the logon message.
fr: De nombreuses personnes voudront néanmoins que leur système affiche des informations dans le message de connexion.

source: This can be accomplished using the file _F596_ .
fr: On peut faire cela en utilisant le fichier _F596_.

source: The _F596_ file is a plain text file which will also accept certain escape sequences (see below) in order to insert information about the system.
fr: Le fichier _F596_ est un fichier en texte brut qui acceptera certaines séquences d'échappement (voir ci-dessous) afin d'insérer des informations sur le système.

source: There is also the file _F597_ which can be used when logging on remotely.
fr: Il y a aussi un fichier _F597_ qui peut être utilisé pour les connexions à distance.

source: not
fr: non

source: interpret the escape sequences shown below.
fr: les séquences d'échappement décrites ci-dessous.

source: One of the most common things which people want to do is clear the screen at each logon.
fr: Une des choses les plus courantes que veulent faire les gens est de vider l'écran à chaque connexion.

source: The easiest way of doing that is to put a "clear" escape sequence into _F596_ .
fr: La manière la plus facile de faire cela est de mettre une séquence d'échappement « clear » dans _F596_.

source: A simple way of doing this is to issue the command _C1421_ .
fr: Une façon simple de faire cela est d'exécuter la commande _C1421_.

source: This will insert the relevant escape code into the start of the _F596_ file.
fr: Ceci insérera le mode d'échappement adéquat au début du fichier _F596_.

source: Terminal escape sequences are special codes recognized by the terminal.
fr: Les séquences du terminal sont des codes spéciaux reconnus par le terminal.

source: The ^[ represents an ASCII ESC character.
fr: ^[ représente un caractère d'échappement ASCII.

source: The sequence ESC[ H puts the cursor in the upper left hand corner of the screen and ESC 2 J erases the screen.
fr: La séquence ESC[ H met le curseur dans le coin tout en haut à gauche de l'écran et ESC 2 J vide l'écran.

source: For more information on terminal escape sequences see _L4204_
fr: Pour plus d'informations sur les séquences d'échappement du terminal, voir _L4204_

source: The following sequences are recognized by _C1422_ (the program which usually parses _F596_ ).
fr: Les séquences suivantes sont reconnues par _C1422_ (le programme qui analyse en général _F596_).

source: This information is from _C1423_ where you can find extra information about the logon process.
fr: Ces information proviennent de _C1423_ où vous pouvez trouver des informations supplémentaires sur le processus de connexion.

source: The _F598_ file can contain certain character sequences to display various information.
fr: Le fichier _F598_ file peut contenir certaines séquences de caractères pour afficher diverses informations.

source: All _F598_ sequences consist of a backslash () immediately followed by one of the letters explained below (so _O167_ in _F596_ would insert the current date).
fr: Toutes les séquences _F598_ consistent dans une barre oblique inversée () suivie immédiatement d'une des lettres expliquées ci-dessous (donc _O167_ dans _F596_ insérait la date actuelle).
