Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/config/profile.xml.1.chaine.po
Languages: fr

source: The Bash Shell Startup Files
fr: Les fichiers de démarrage du shell Bash

source: Each file has a specific use and may affect login and interactive environments differently.
fr: Chaque fichier a une utilisation spécifique et il peut concerner différemment la connexion et les environnements interactifs.

source: The files in the _F233_ directory generally provide global settings.
fr: Les fichiers du répertoire _F233_ fournissent en général les paramètres globaux.

source: If an equivalent file exists in your home directory it may override the global settings.
fr: Si un fichier équivalent existe dans votre répertoire home, il peut remplacer les paramètres globaux.

source: An interactive login shell is started after a successful login, using _F602_ , by reading the _F594_ file.
fr: Un shell de connexion interactif démarre après une connexion réussie, en utilisant _F602_ , en lisant le fichier _F594_.

source: This shell invocation normally reads _F603_ and its private equivalent _F604_ upon startup.
fr: Cet appel du shell lit normalement _F603_ et son équivalent privé _F604_ au démarrage.

source: An interactive non-login shell is normally started at the command-line using a shell program (e.g.,
fr: Un shell de non connexion interactif démarre normalement en ligne de commande en utilisant un programme de shell (comme

source: An interactive non-login shell is also started with a terminal program such as _C678_ or _C1426_ from within a graphical environment.
fr: Un shell de non-connexion interactif démarre également avec un programme de terminal tel que _C678_ ou _C1426_ depuis un environnement graphique.

source: A non-interactive shell is usually present when a shell script is running.
fr: Un shell non interactif est présent en général lorsqu'un script shell s'exécute.

source: It is non-interactive because it is processing a script and not waiting for user input between commands.
fr: Il n'est pas interactif car il exécute un script et n'attend pas d'entrée de l'utilisateur entre les commandes.

source: For these shell invocations, only the environment inherited from the parent shell is used.
fr: Pour ces appels de shell, seul l'environnement hérité du shell parent est utilisé.

source: The file _F285_ is not used for an invocation of the shell.
fr: Le fichier _F285_ n'est pas utilisé pour un appel du shell.

source: It is read and executed when a user exits from an interactive login shell.
fr: Il est lu et exécuté lorsqu'un utilisateur quitte un shell de connexion interactif.

source: Many distributions use _F606_ for system wide initialization of non-login shells.
fr: De nombreuses distributions utilisent _F606_ pour l'initialisation pour tout le système de shells de non connexion.

source: This convention is followed in this section.
fr: On suit cette convention dans cette section.

source: For more information see _C1428_ --
fr: Pour plus d'informations, voir _C1428_ --

source: Bash Startup Files and Interactive Shells
fr: Bash Startup Files et Interactive Shells

source: Most of the instructions below are used to create files located in the _F133_ directory structure which requires you to execute the commands as the _U3_ user.
fr: La plupart des instructions ci-dessous sont utilisées pour créer des fichiers qui se trouvent dans la structure de répertoires _F133_ , ce qui implique que vous exécutiez les commandes en tant qu'utilisateur _U3_.

source: Here is a base _F603_ .
fr: Voici un _F603_ de base.

source: This file starts by setting up some helper functions and some basic parameters.
fr: Ce fichier démarre en paramétrant des fonctions d'aide et quelques paramètres de base.

source: It specifies some _C1427_ history parameters and, for security purposes, disables keeping a permanent history file for the _U1_ user.
fr: Il spécifie des paramètres d'historique de _C1427_ et, pour des raisons de sécurité, il désactive la conservation d'un fichier d'historique permanent pour l'utilisateur _U1_.

source: It also sets a default user prompt.
fr: Il paramètre aussi une invite utilisateur par défaut.

source: It then calls small, single purpose scripts in the _F607_ directory to provide most of the initialization.
fr: Il appelle ensuite de petits scripts à finalité unique dans le répertoire _F607_ pour fournir la plupart de l'initialisation.

source: For more information on the escape sequences you can use for your prompt (i.e., the _E24_ environment variable) see _C1428_ --
fr: Pour plus d'informations sur les séquences d'échappement que vous pouvez utiliser pour votre invite (à savoir la variable d'environnement _E24_) voir _C1428_ --

source: The /etc/profile.d Directory
fr: Le répertoire /etc/profile.d

source: Now create the _F607_ directory, where the individual initialization scripts are placed:
fr: Maintenant créez le répertoire _F607_ , où sont mis les scripts d'initialisation individuels :

source: This script uses the _F608_ and _F609_ files to control the colors of file names in a directory listing.
fr: Ce script utilise les fichiers _F608_ et _F609_ pour contrôler les couleurs des noms de fichiers dans la liste du contenu d'un répertoire.

source: They control colorized output of things like _C1429_ .
fr: Ils contrôlent la sortie en couleurs d'éléments tels que _C1429_.

source: The explanation of how to initialize these files is at the end of this section.
fr: L'explication de la façon d'initialiser ces fichiers se trouvent à la fin de cette section.

source: This script sets up the default _F610_ configuration file.
fr: Ce script règle le fichier de configuration _F610_ par défaut.

source: If the user does not have individual settings, it uses the global file.
fr: Si l'utilisateur n'a pas de paramètres individuels, il utilise le fichier global.

source: Setting the _C1430_ value is important for security.
fr: Le paramétrage de la valeur _C1430_ est important pour la sécurité.

source: Here the default group write permissions are turned off for system users and when the user name and group name are not the same.
fr: Ici, les droits d'écriture par défaut du groupe sont désactivés pour les utilisateurs systèmes et quand le nom d'utilisateur et le nom du groupe ne sont pas les mêmes.

source: This script sets an environment variable necessary for native language support.
fr: Ce script règle une variable d'environnement nécessaire au support des langues natives.

source: A full discussion on determining this variable can be found on the _L2744_ page.
fr: Vous pouvez trouver un point complet sur la détermination de cette variable sur la page _L2744_ page.

source: Other Initialization Values
fr: Autres valeurs d'Initialisation

source: Other initialization can easily be added to the _F611_ by adding additional scripts to the _F607_ directory.
fr: On peut facilement ajouter d'autres réglages à _F611_ en ajoutant des scripts supplémentaires au répertoire _F607_.

source: Here is a base _F606_ .
fr: Voici un _F606_ de base.

source: Comments in the file should explain everything you need.
fr: Les commentaires dans ce fichier devraient vous expliquer tout ce dont vous avez besoin.

source: Here is a base _F604_ .
fr: Voici un _F604_ de base.

source: If you want each new user to have this file automatically, just change the output of the command to _F612_ and check the permissions after the command is run.
fr: Si vous voulez que chaque nouvel utilisateur ait automatiquement ce fichier, renvoyez seulement la sortie de la commande vers _F612_ et vérifiez les droits après l'exécution de la commande.

source: Here is a base _F605_ .
fr: Voici un _F605_ de base.

source: The comments and instructions for using _F582_ for _F585_ above also apply here.
fr: Les commentaires et les instructions d'utilisation de _F582_ pour _F585_ ci-dessus s'appliquent aussi ici.

source: Only the target file names are different.
fr: Seuls les noms de fichiers cibles sont différents.

source: This is an empty _F285_ that can be used as a template.
fr: C'est un _F285_ vide qui peut être utilisé comme modèle.

source: You will notice that the base _F285_ does not include a
fr: Vous remarquerez que le _F285_ de base n'inclut pas de commande

source: This is because the clear is handled in the _F596_ file.
fr: Ceci car le vidage se gère dans le fichier _F596_.

source: If you want to use the _F613_ capability, then run the following command.
fr: Si vous utilisez la possibilité _F613_ , lancez la commande suivante.

source: The _F582_ setup steps shown above also can be used here to provide a _F608_ file when a new user is set up.
fr: Les étapes de paramétrage de _F582_ indiquées ci-dessus peuvent être utilisées ici pour avoir un fichier _F608_ lors du réglage d'un nouvel utilisateur.

source: As before, just change the output file name on the following command and assure the permissions, owner, and group are correct on the files created and/or copied.
fr: Comme tout à l'heure, envoyez simplement le nom du fichier sorti vers la commande suivante et assurez-vous que les droits, le propriétaire et le groupe conviennent aux fichiers créés et/ou soient copiés.

source: If you wish to customize the colors used for different file types, you can edit the _F609_ file.
fr: Si vous souhaitez personnaliser les couleurs utilisées pour différents types de fichiers, vous devez éditer le fichier _F609_.

source: The instructions for setting the colors are embedded in the file.
fr: Les instructions pour régler les couleurs sont comprises dans le fichier.

source: Finally, Ian Macdonald has written an excellent collection of tips and tricks to enhance your shell environment.
fr: Enfin, Ian Macdonald a écrit un ensemble excellent de modèles et de bidouillages pour améliorer votre environnement de shell.

source: You can read it online at _L2745_ .
fr: Vous pouvez le lire en ligne sur _L2745_.
