Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/config/skel.xml.1.chaine.po
Languages: fr

source: Configuring for Adding Users
fr: Configuration de l'ajout d'utilisateurs

source: Together, the _C584_ command and _F193_ directory (both are easy to set up and use) provide a way to assure new users are added to your LFS system with the same beginning settings for things such as the _E13_, keyboard processing and other environmental variables.
fr: Ensemble, la commande _C584_ et le répertoire _F193_ (on peut les paramétrer et les utiliser facilement) offrent un moyen de garantir que les nouveaux utilisateurs soient ajoutés à votre système LFS avec les mêmes réglages de base d'éléments tels que le _E13_, le traitement du clavier et d'autres variables d'environnement.

source: Using these two facilities makes it easier to assure this initial state for each new user added to the system.
fr: L'utilisation de ces deux possibilités facilite la garantie de cet état initial pour tous les nouveaux utilisateurs ajoutés au système.

source: The _F193_ directory holds copies of various initialization and other files that may be copied to the new user's home directory when the _C584_ program adds the new user.
fr: Le répertoire _F193_ contient des copies de divers fichiers d'initialisation ou autres qui peuvent être copiés dans le répertoire home du nouvel utilisateur lorsque la commande _C584_ ajoute le nouvel utilisateur.

source: The _C585_ program uses a collection of default values kept in _F973_ .
fr: Le programme _C585_ utilise un ensemble de valeurs par défaut contenues dans _F973_.

source: This file is created in a base LFS installation by the _A326_ package.
fr: Ce fichier est créé dans une installation de LFS de base par le paquet _A326_.

source: If it has been removed or renamed, the _C585_ program uses some internal defaults.
fr: S'il a été supprimé ou renommé, le programme _C585_ utilise des paramètres par défaut internes.

source: You can see the default values by running _C586_ .
fr: Vous pouvez voir les valeurs par défaut en lançant _C586_.

source: To change these values, simply modify the _F973_ file as the _U2_ user.
fr: Pour modifier ces valeurs, modifiez simplement le fichier _F973_ en tant qu'utilisateur _U2_.

source: An alternative to directly modifying the file is to run _C585_ as the _U2_ user while supplying the desired modifications on the command line.
fr: Une alternative à la modification directe du fichier consiste à exécuter _C585_ en tant qu'utilisateur _U2_ en fournissant les modifications désirées sur la ligne de commande.

source: Information on how to do this can be found in the _C585_ man page.
fr: Vous pouvez trouver des informations sur la façon de faire cela dans la page de man de _C585_.

source: To get started, create an _F193_ directory and make sure it is writable only by the system administrator, usually _U2_.
fr: Pour commencer, créez un répertoire _F193_ et assurez-vous qu'il n'est modifiable en écriture que par l'administrateur du système, en général _U2_.

source: Creating the directory as _U2_ is the best way to go.
fr: La création de ce répertoire en tant que _U2_ est la meilleure manière de faire.

source: The mode of any files from this part of the book that you put in _F193_ should be writable only by the owner.
fr: Les droits des fichiers issus de cette partie du livre que vous mettez dans _F193_ devraient n'être modifiables que par leur propriétaire.

source: Also, since there is no telling what kind of sensitive information a user may eventually place in their copy of these files, you should make them unreadable by "group" and "other".
fr: En outre, puisqu'il n'existe pas de règle sur le genre d'informations sensibles qu'un utilisateur peut éventuellement mettre dans leur copie de ces fichiers, vous devriez les rendre inaccessibles en lecture par « group » et « other ».

source: You can also put other files in _F193_ and different permissions may be needed for them.
fr: Vous pouvez également mettre d'autres fichiers dans _F193_ et il se peut que différents droits leur soient nécessaires.

source: Decide which initialization files should be provided in every (or most) new user's home directory.
fr: Décidez des fichiers d'initialisation qui devraient être fournis dans chaque (ou la plupart) répertoire home d'un nouvel utilisateur.

source: The decisions you make will affect what you do in the next two sections, _X188_ and _X189_ .
fr: Les décisions que vous prendrez changeront ce que vous ferez dans les deux prochaines sections, _X188_ et _X189_.

source: Some or all of those files will be useful for _U2_, any already-existing users, and new users.
fr: Certains ou tous ces fichiers seront utiles à _U2_, aux utilisateurs qui existent déjà et aux nouveaux utilisateurs.

source: The files from those sections that you might want to place in _F193_ include _F974_ , _F975_ , _F976_ , _F977_ , _F978_ , and _F979_ .
fr: Les fichiers de ces sections que vous pourriez vouloir mettre dans _F193_ comprennent _F974_ , _F975_ , _F976_ , _F977_ , _F978_ et _F979_.

source: If you are unsure which of these should be placed there, just continue to the following sections, read each section and any references provided, and then make your decision.
fr: Si vous n'êtes pas sûr qu'ils devraient être mis là, poursuivez simplement les sections suivantes, lisez chaque section et les références fournies, puis prenez votre décision.

source: You will run a slightly modified set of commands for files which are placed in _F193_ .
fr: Vous lancerez un jeu de commandes légèrement différent pour les fichiers qui se trouvent dans _F193_.

source: Each section will remind you of this.
fr: Chaque section vous le rappellera.

source: In brief, the book's commands have been written for files
fr: En bref, les commandes du livre ont été écrites pour des fichiers

source: not
fr: non

source: added to _F193_ and instead just sends the results to the user's home directory.
fr: ajoutés à _F193_ et elles envoient simplement les résultats dans le répertoire home de l'utilisateur.

source: If the file is going to be in _F193_ , change the book's command (s) to send output there instead and then just copy the file from _F193_ to the appropriate directories, like _F175_ , _F194_ or the home directory of any other user already in the system.
fr: Si le fichier va être dans _F193_ , modifiez la/les commande (x) du livre pour y envoyer la sortie au lieu de juste copier le fichier de _F193_ vers les répertoires adéquats, comme _F175_ , _F194_ ou le répertoire home d'un autre utilisateur déjà sur le système.

source: When Adding a User
fr: Lors de l'ajout d'un utilisateur

source: When adding a new user with _C585_ , use the _O79_ parameter, which tells _C585_ to create the user's home directory and copy files from _F193_ (can be overridden) to the new user's home directory.
fr: Lors de l'ajout d'un nouvel utilisateur avec _C585_ , utilisez le paramètre _O79_ qui dit à _C585_ de créer le répertoire home de l'utilisateur et copiez les fichiers de _F193_ (il peut être écrasé) vers le répertoire home du nouvel utilisateur.

source: For example (perform as the _U2_ user):
fr: Par exemple (effectuez ceci en tant qu'utilisateur _U6_) :
