Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/config/vimrc.xml.1.chaine.po
Languages: fr

source: The vimrc Files
fr: Les fichiers /etc/vimrc et ~/.vimrc

source: The /etc/vimrc and ~/.vimrc Files
fr: Les fichiers /etc/vimrc et ~/.vimrc

source: The LFS book installs _A563_ as its text editor.
fr: Le livre LFS installe _A563_ comme éditeur de texte.

source: At this point it should be noted that there are a
fr: Vous devriez noter ici qu'il y a

source: lot
fr: beaucoup

source: of different editing applications out there including _A599_ , _A605_ , _A606_ and many more.
fr: d'applications d'édition différentes de celle-là, comprenant _A599_ , _A605_ , _A606_ et plus encore.

source: Anyone who has been around the Internet (especially usenet) for a short time will certainly have observed at least one flame war, usually involving _A563_ and _A599_ users!
fr: Tous ceux qui ont parcouru un peu Internet (surtout usenet) auront certainement remarqué au moins une guerre de feu impliquant généralement les utilisateurs de _A563_ et d'_A599_ !

source: The LFS book creates a basic _F614_ file.
fr: Le livre LFS crée un fichier _F614_ de base.

source: At startup, _C350_ reads the global configuration file (_F557_ ) as well as a user-specific file (_F558_ ).
fr: Au démarrage, _C350_ lit le fichier de configuration global (_F557_) ainsi qu'un fichier spécifique à l'utilisateur (_F558_).

source: Either or both can be tailored to suit the needs of your particular system.
fr: L'un et/ou l'autre peut être adapté pour correspondre aux besoins de votre système particulier.

source: Here is a slightly expanded _F589_ that you can put in _F558_ to provide user specific effects.
fr: Voici un _F589_ légèrement étendu que vous pouvez mettre dans _F558_ pour produire des effets spécifiques à l'utilisateur.

source: Of course, if you put it into _F615_ instead, it will be made available to users you add to the system later.
fr: Bien entendu, si vous le mettez plutôt dans _F615_ , il sera disponible pour tous les utilisateurs que vous ajouterez plus tard au système.

source: You can also copy the file from _F615_ to the home directory of users already on the system, such as _U3_ .
fr: Vous pouvez aussi copier le fichier de _F615_ vers le répertoire home des utilisateurs déjà existants sur le système, tels que _U3_.

source: Be sure to set permissions, owner, and group if you do copy anything directly from _F582_ .
fr: Assurez-vous de régler les droits, le propriétaire et le groupe si vous copiez quelque chose directement depuis _F582_.

source: Note that the comment tags are " instead of the more usual # or //.
fr: Remarquez que les drapeaux de commentaire sont " au lieu du # or du // plus habituels.

source: This is correct, the syntax for _F614_ is slightly unusual.
fr: C'est correct, la syntaxe de _F614_ est légèrement inhabituelle.

source: This simply sets the number of columns used on the screen.
fr: Ceci règle simplement le nombre de colonnes utilisées à l'écran.

source: This is the number of characters from the right window border where wrapping starts.
fr: C'est le numéro du caractère depuis le côté droit de la fenêtre où commence l'enveloppe.

source: This makes _C350_ show the current row and column at the bottom right of the screen.
fr: Ceci fait afficher à _C350_ en bas à droite de l'écran la ligne et la colonne.

source: More information on the
fr: Vous pouvez trouver plus d'informations sur les

source: many
fr: beaucoup

source: Do this by typing _C1432_ _O175_ in _C350_ to get the general help, or by typing _C1432_ _O176_ to view the User Manual Table of Contents.
fr: Faites cela en tapant _C175_ 350_O1432_ dans _C1432_ pour voir l'aide générale ou en tapant _C176_ _O_ pour lire la table des matières du manuel de l'utilisateur.
