Repository: espindula/br-lfs
Catalog: blfs/*/kde/add/add-pkgs.po
Languages: fr

source: Further KDE4 packages
fr: Paquets KDE4 supplémentaires

source: This section did not provide instructions for all of the available packages in the KDE4 Software Compilation. The included packages were selected based on what most people would want to use on a standard desktop computer.
fr: Cette section ne vous a pas fourni les instructions pour l'ensemble des paquets de la <foreignphrase>KDE4 Software Compilation</foreignphrase>. Les paquets inclus ont été sélectionnés sur la base de ce que les gens veulent utiliser sur un ordinateur bureau standard.

source: For a full list of available packages, have a look on the KDE4 servers at <ulink url="&kde-download-http;applications/&kde-version;/src/"> &kde-download-http;applications/&kde-version;/src/</ulink> or <ulink url="&kde-download-ftp;applications/&kde-apps-version;/src/"> &kde-download-ftp;applications/&kde-apps-version;/src/</ulink>.
fr: Pour une liste complète des paquets disponibles, jetez un &oelig;il sur <ulink url="&kde-download-http;applications/&kde-version;/src/"> &kde-download-http;applications/&kde-version;/src/</ulink> ou <ulink url="&kde-download-ftp;applications/&kde-apps-version;/src/"> &kde-download-ftp;applications/&kde-apps-version;/src/</ulink>.

source: Some packages, such as konsole, kate, and gwenview listed in the links above are only for the new KDE Frameworks 5 and cannot be used with KDE4.
fr: Certains paquets, comme konsole, kate, et gwenview listés dans le lien ne concernent seulement que le nouveau KDE 5 et ne peuvent pas être utilisés avec KDE4.

source: Some additional packages worth mentioning are:
fr: Certains paquets supplémentaires valent le coup d'être indiqués&nbsp;:

source: Kdeartwork: Collection of wallpapers, icon themes, screensavers, widget styles etc.
fr: Kdeartwork: Ensemble de fonds d'écran, thèmes d’icônes, économiseurs d'écran, styles de widget etc.

source: Juk: A lightweight music player.
fr: Juk: Un lecteur de musique léger.

source: Dragon: A video player.
fr: Dragon: Un lecteur vidéo.

source: Kcalc: A scientific calculator.
fr: Kcalc: Une calculatrice scientifique.

source: PyKDE4: Python bindings.
fr: PyKDE4: Des liaisons Python.

source: Kaccessible: Accessibility utilities.
fr: Kaccessible&nbsp;: Outils d'accessibilité.

source: Kwalletmanager: Credentials management application.
fr: Kwalletmanager&nbsp;: Application de gestion des autorisations.

source: Marble: A global map program.
fr: Marble>&nbsp;: Un programme de cartes mondiales.

source: audiocd-kio: A library to access CD-ROM audio files.
fr: audiocd-kio: Une bibliothèque pour accéder aux fichiers audio sur CDROM.

source: libkcompactdisc: A library to control CD-ROM drives.
fr: libkcompactdisc: Une bibliothèque pour contrôler les lecteurs CD-ROM.

source: Most of these packages can be built with the standard KDE4 instructions:
fr: La plupart de ces paquets peuvent être construit avec les instructions générales pour KDE4&nbsp;:

source: And as the <systemitem class="username">root</systemitem> user:
fr: Et en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:
