Repository: espindula/br-lfs
Catalog: blfs/*/kde/add/ark.po
Languages: fr

source: 236 KB
fr: 236 Kio

source: 10.1 MB
fr: 10.1 Mio

source: Introduction to Ark
fr: Introduction à Ark

source: This package provides an archiving utility for KDE.
fr: Ce paquet fournit un utilitaire d'archive pour KDE.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&ark-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&ark-download-http;"/>

source: Download (FTP): <ulink url="&ark-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&ark-download-ftp;"/>

source: Download MD5 sum: &ark-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &ark-md5sum;

source: Download size: &ark-size;
fr: Taille du téléchargement&nbsp;: &ark-size;

source: Estimated disk space required: &ark-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &ark-buildsize;

source: Estimated build time: &ark-time;
fr: Estimation du temps de construction&nbsp;: &ark-time;

source: Ark Dependencies
fr: Dépendances de Ark

source: Required
fr: Requises

source: <xref linkend="kde-baseapps"/> and <xref linkend="libarchive"/>
fr: <xref linkend="kde-baseapps"/> et <xref linkend="libarchive"/>

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/ark"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/ark"/>

source: Installation of Ark
fr: Installation de Ark

source: Install <application>Ark</application> by running the following commands:
fr: Installez <application>Ark</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: libkerfuffle.so and several in &kde-dir;/lib/kde4
fr: libkerfuffle.so et plusieurs dans &kde-dir;/lib/kde4

source: several in &kde-dir;/share
fr: plusieurs dans &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: is the KDE archiving utility.
fr: est l'utilitaire d'archivage de KDE.
