Repository: espindula/br-lfs
Catalog: blfs/*/kde/add/kate.po
Languages: fr

source: 2.6 MB
fr: 2.6 Mio

source: 108 MB
fr: 108 Mio

source: Introduction to Kate
fr: Introduction à Kate

source: This package provides two texteditors: Kate and KWrite. Kate is a powerful programmer's text editor with syntax highlighting for many programming and scripting languages. KWrite is the lightweight cousin of Kate.
fr: Ce paquet fournit deux éditeurs de texte: Kate et KWrite. Kate est un éditeur de texte de programmeur extrêmement puissant avec coloration syntaxique pour de nombreux langages de programmation et de script. KWrite est le cousin plus léger de Kate.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kate-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kate-download-http;"/>

source: Download (FTP): <ulink url="&kate-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kate-download-ftp;"/>

source: Download MD5 sum: &kate-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kate-md5sum;

source: Download size: &kate-size;
fr: Taille du téléchargement&nbsp;: &kate-size;

source: Estimated disk space required: &kate-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kate-buildsize;

source: Estimated build time: &kate-time;
fr: Estimation du temps de construction&nbsp;: &kate-time;

source: Kate Dependencies
fr: Dépendances de Kate

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Facultatives

source: <xref linkend="qjson"/> and <ulink url="&kde-download-http;&kde-old-version;/src/">PyKDE4</ulink>
fr: <xref linkend="qjson"/> et <ulink url="&kde-download-http;&kde-old-version;/src/">PyKDE4</ulink>

source: User Notes: <ulink url="&blfs-wiki;/kate"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kate"/>

source: Installation of Kate
fr: Installation de Kate

source: Install <application>Kate</application> by running the following commands:
fr: Installez <application>Kate</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <option>-DINSTALL_PYTHON_FILES_IN_PYTHON_PREFIX=TRUE</option>: This option is set to install the KDE Python objects in the correct place.
fr: <option>-DINSTALL_PYTHON_FILES_IN_PYTHON_PREFIX=TRUE</option>: Cette option est ajoutée pour installer les objets KDE Python au bon endroit.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: kate and kwrite
fr: kate et kwrite

source: libkateinterfaces.so, libkatepartinterfaces.so, libkdeinit4_kate.so, libkdeinit4_kwrite.so and several in &kde-dir;/lib/kde4
fr: libkateinterfaces.so, libkatepartinterfaces.so, libkdeinit4_kate.so, libkdeinit4_kwrite.so et plusieurs dans &kde-dir;/lib/kde4

source: &kde-dir;/include/kate and several in &kde-dir;/share
fr: &kde-dir;/include/kate et plusieurs dans &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: is the KDE text editor.
fr: est l'éditeur de texte de KDE.

source: is a text editor for KDE, that is a light version of <command>kate</command>.
fr: est un éditeur de texte pour KDE, c'est une version plus légère de <command>kate</command>.
