Repository: espindula/br-lfs
Catalog: blfs/*/kde/add/kmix.po
Languages: fr

source: 384 KB
fr: 384 Kio

source: 10.0 MB
fr: 10.0 Mio

source: Introduction to Kmix
fr: Introduction à Kmix

source: This packages provides an audio mixer application for KDE.
fr: Ce paquet fournit une application de mixage audio pour KDE.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&kmix-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&kmix-download-http;"/>

source: Download (FTP): <ulink url="&kmix-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&kmix-download-ftp;"/>

source: Download MD5 sum: &kmix-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &kmix-md5sum;

source: Download size: &kmix-size;
fr: Taille du téléchargement&nbsp;: &kmix-size;

source: Estimated disk space required: &kmix-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &kmix-buildsize;

source: Estimated build time: &kmix-time;
fr: Estimation du temps de construction&nbsp;: &kmix-time;

source: Kmix Dependencies
fr: Dépendances de Kmix

source: Required
fr: Requises

source: Optional
fr: Facultatives

source: <xref linkend="pulseaudio"/> and <xref linkend="libcanberra"/>
fr: <xref linkend="pulseaudio"/> et <xref linkend="libcanberra"/>

source: User Notes: <ulink url="&blfs-wiki;/kmix"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/kmix"/>

source: Installation of Kmix
fr: Installation de Kmix

source: Install <application>Kmix</application> by running the following commands:
fr: Installez <application>Kmix</application> en lançant les commandes suivantes&nbsp;:

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: Command Explanations
fr: Explication des commandes

source: <option>-DCMAKE_AUTOMOC=TRUE</option>: This switch is used to avoid an invalid error return in cmake-3.3 and later.
fr: <option>-DCMAKE_AUTOMOC=TRUE</option>&nbsp;: Ce paramètre est utilisé pour empêcher un retour d'erreurs invalide dans cmake-3.3 ou supérieur.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: kmix and kmixctrl
fr: kmix et kmixctrl

source: libkdeinit4_kmix.so, libkdeinit4_kmixctrl.so, kded_kmixd.so and plasma_engine_mixer.so
fr: libkdeinit4_kmix.so, libkdeinit4_kmixctrl.so, kded_kmixd.so et plasma_engine_mixer.so

source: several in &kde-dir;/share
fr: plusieurs dans &kde-dir;/share

source: Short Descriptions
fr: Descriptions courtes

source: is the KDE Volume Control.
fr: est le contrôle du volume de KDE.

source: is used to save or restore the settings of <command>kmix</command>.
fr: est utilisé pour enregistrer ou restaurer les paramètres de <command>kmix</command>.
