Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/cdwriteutils/k3b.xml.1.chaine.po
Languages: fr

source: 9.5 MB
fr: 9.5 Mo

source: 326 MB
fr: 326 Mo

source: Introduction to K3b
fr: Introduction à K3b

source: The _A1051_ package contains a KDE-based graphical interface to the _A1052_ and _A2008_ CD/DVD manipulation tools.
fr: Le paquet _A1051_ contient une interface graphique basée sur KDE avec es outils de manipulation de CD/DVD _A1052_ et _A2009_.

source: It also combines the capabilities of many other multimedia packages into one central interface to provide a simple-to-operate application that can be used to handle many of your CD/DVD recording and formatting requirements.
fr: Il associe aussi les possibilités de nombreux autres paquets multimédia dans une interface centrale pour fournir une application simple à utiliser qui peut être utilisée pour gérer beaucoup de vos exigences en matière de formatage et de gravure de CD/DVD.

source: It is used for creating audio, data, video and mixed-mode CDs as well as copying, ripping and burning CDs and DVDs.
fr: C'est utile pour créer des CDs audio, de données, vidéo et en mode mélangé, ainsi que pour copier, encoder et graver des CDs et des DVDs.

source: Though _A1051_ can be used to copy almost any DVD to similar medium, it does not provide a way to copy, or reproduce a double-layer DVD onto single-layer medium.
fr: Bien que _A1051_ puisse être utilisé pour copier presque n'importe quel DVD sur un mdia identique, il n'offre pas de moyens de copier ou de reproduire un DVD double couches sur un média d'une seule couche.

source: Of course, there is not a program anywhere on any platform that can make an exact duplicate of a double-layer DVD onto a single-layer disk, there are programs on some platforms that can compress the data on a double-layer DVD to fit on a single-layer DVD producing a duplicate, but compressed, image.
fr: Aucun programme, nul part et sur aucune plate-forme n'est bien entendu capable de faire une duplication exacte d'un DVD double couches sur un disque d'une seule couche, il y a des programmes sur certaines plate-formes qui peuvent compresser les données d'un DVD double-couches pour s'adapter à un DVD monocouche, produisant une image dupliquée mais compressée.

source: If you need to copy the contents of a double-layer DVD to single-layer medium, you may want to look at the _L2401_ package.
fr: Si vous avez besoin de copier le contenu d'un DVD double couches sur un média d'une seule couche, il se peut que vous vouliez regarder du côté du paquet _L2401_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: K3b Dependencies
fr: Dépendances de K3b

source: Required
fr: Requises

source: There are programs from three packages that _A1051_ will look for at runtime:
fr: Il y a les programmes de 3 paquets que demande _A1051_ pendant l'exécution :

source: If you don't need the capability provided by any of the three packages, you don't have to install it.
fr: Si vous n'avez pas besoin de la fonctionnalité offerte par un des trois paquets, vous n'êtes pas obligé de l'installer.

source: However, a warning message will be generated every time you run the _C2086_ program if any are not installed.
fr: Cependant, un message d'avertissement sera généré à chaque fois que vous exécuterez le programme _C2086_ si certains ne sont pas installés.

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of K3b
fr: Installation de K3b

source: Install _A1051_ by running the following commands:
fr: Installez _A1051_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: k3b and k3bsetup
fr: k3b et k3bsetup

source: libk3b.so, libk3bdevice.so and numerous modules for the installed dependencies
fr: libk3b.so, libk3bdevice.so et de nombreux modules pour les dépendances installées

source: The following subdirectories of _E149_/share/:
fr: Les sous-répertoires suivants de _E404_/share/ :

source: Short Descriptions
fr: Descriptions courtes

source: is the graphical CD/DVD program.
fr: est un programme de CD/DVD graphique.

source: is a script used to launch the k3bsetup2 KControlModule for setting up the CD/DVD hardware and device files on your system.
fr: est un script utilisé pour lancer le KControlModule de k3bsetup2 pour paramétrer le matériel CD/DVD et les fichiers de périphériques de votre système.
