Repository: espindula/br-lfs
Catalog: blfs/traduc/po/multimedia/cdwriteutils/simpleburn.xml.1.chaine.po
Languages: fr

source: 44 KB
fr: 44 Ko

source: 1.7 MB
fr: 1.7 Mo

source: Introduction to SimpleBurn
fr: Introduction à SimpleBurn

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: SimpleBurn Dependencies
fr: Dépendances de SimpleBurn

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of SimpleBurn
fr: Installation de SimpleBurn

source: Install _A1497_ by running the following commands:
fr: Installez _A1497_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: All optical devices are not accessible for any user except _U2_ and members of the
fr: Tous les périphériques optiques ne sont pas accessibles pour tous les utilisateurs à l'exception de _U2_ et les membres du groupe

source: Add any users that might use the optical devices to that group:
fr: Ajoutez tous les utilisateurs qui peuvent utiliser les périphériques optiques à ce groupe :

source: Command Explanations
fr: Explications des commandes

source: Ensure the documentation is installed in /usr/share/doc.
fr: Assure que la documentation est installée dans /usr/share/doc.

source: This switch changes the burning suite from the default cdrtools.
fr: Ce paramètre change la suite de gravage vers cdrtools par défaut.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: simpleburn, simpleburn-abort-operation, simpleburn-blank-media, simpleburn-burn-audio, simpleburn-burn-data, simpleburn-burning-suite, simpleburn-burn-iso, simpleburn-copy-audio, simpleburn-copy-data, simpleburn-extract-audio, simpleburn-extract-iso, simpleburn-gauges, simpleburn-get-datasize, simpleburn-media-detection, simpleburn-ripdvd-detection, and simpleburn-ripdvd-encoding
fr: simpleburn, simpleburn-abort-operation, simpleburn-blank-media, simpleburn-burn-audio, simpleburn-burn-data, simpleburn-burning-suite, simpleburn-burn-iso, simpleburn-copy-audio, simpleburn-copy-data, simpleburn-extract-audio, simpleburn-extract-iso, simpleburn-gauges, simpleburn-get-datasize, simpleburn-media-detection, simpleburn-ripdvd-detection, et simpleburn-ripdvd-encoding

source: None
fr: Aucun

source: /usr/share/doc/simpleburn-&simpleburn-version; and /usr/share/simpleburn
fr: /usr/share/doc/simpleburn-&simpleburn-version; et /usr/share/simpleburn

source: Short Descriptions
fr: Descriptions courtes

source: is the graphical program.
fr: est un programme graphique.

source: is a bash script to abort an operation.
fr: est un script batch pour arrêter une opération.

source: is a bash script used to blank a CD.
fr: est un script batch utilisé pour effacer un CD.

source: is a bash script used to burn an audio CD.
fr: est un script batch utilisé pour graver un CD audio.

source: is a bash script used to burn a data CD.
fr: est un script batch utilisé pour graver un CD de données.

source: is a bash script used to print information about the burn tools.
fr: est un script batch utilisé pour afficher des informations sur les outils de gravage.

source: is a bash script used to burn an iso CD.
fr: est un script batch utilisé pour graver un CD iso.

source: is a bash script used to copy an audio CD.
fr: est un script batch utilisé pour copier un CD audio.

source: is a bash script used to copy a data CD.
fr: est un script batch utilisé pour copier un CD de données.

source: is a bash script used to extract audio files from an audio CD.
fr: est un script batch utilisé pour extraire les fichiers audio d'un CD audio.

source: is a bash script to write an ISO file from a CD.
fr: est un script batch pour écrire un fichier ISO depuis un CD.

source: is a program used to display a gauge.
fr: est un programme utilisé pour afficher une gauge.

source: is a bash script used to get the size of a media.
fr: est un script batch utilisé pour obtenir la taille d'un média.

source: is a bash script used to print information about a media.
fr: est un script batch utilisé pour afficher des informations à propos d'un média.

source: is a bash script used to print information about the content of a video DVD.
fr: est un script batch utilisé pour afficher des informations à propos du contenu d'un DVD vidéo.

source: is a bash script used to rip a DVD.
fr: est un script batch utilisé pour ripper un DVD.
