Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/cacerts.xml.1.chaine.po
Languages: fr

source: 6 MB
fr: 6 Mo

source: The Public Key Infrastructure is used for many security issues in a Linux system.
fr: La _fpo_Public Key Infrastructure_fpf_.

source: In order for a certificate to be trusted, it must be signed by a trusted agent called a Certificate Authority (CA).
fr: Pour qu'un certificat soit fiable, il doit être signé par un agent de confiance, qu'on appelle l'autorité de certificat (_fpo_Certificate Authority_fpf_).

source: The certificates can also be used by other applications either directly of indirectly through _A488_ .
fr: Les certificats peuvent également être utilisés par d'autres applications, directement ou indirectement via _A488_.

source: Introduction to Certificate Authorities
fr: Introduction à Certificate Authorities

source: Package Information
fr: Informations sur le paquet

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: The certfile.txt file above is actually retrieved from _L1231_ .
fr: Le fichier certfile.txt dessous est actuellement pris sur _L1231_.

source: It is really an HTML file, but the text file can be retrieved indirectly from the HTML file.
fr: C'est vraiment un fichier HTML, mais le fichier texte peut être pris indirectement depuis le fichier HTML.

source: The Download URL above automates that process and also adds a line where the date can be extracted as a revision number by the scripts below.
fr: L'URL dessous automatise ce processus et aussi ajoute une ligne ou la date peut être extraite en tant que numéro de révision par le script.

source: Certificate Authority Certificates Dependencies
fr: Dépendances de Certificate Authority Certificates

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: User Notes:
fr: Notes utilisateur :

source: Installation of Certificate Authority Certificates
fr: Installation de Certificate Authority Certificates

source: First create a script to reformat a certificate into a form needed by _A488_ .
fr: Créez d'abord un script pour reformatter un certificat en forme dont a besoin _A488_.

source: As the _U1_ user:
fr: En tant qu'utilisateur _U1_ :

source: The following script creates the certificates and a bundle of all the certificates.
fr: Le script suivant crée les certificats et un bouquet de tous les certificats.

source: It creates a _F469_ directory and _F470_ .
fr: Il crée un répertoire _F469_ et _F470_.

source: Again create this script as the _U1_ user:
fr: Créez de nouveau ce script en tant qu'utilisateur _U1_ :

source: Add a short script to remove expired certificates from a directory.
fr: Ajoutez un script bref pour supprimer les certificats expirés d'un répertoire.

source: The following commands will fetch the certificates and convert them to the correct format.
fr: Les commandes suivantes récupèreront les certificats et les convertiront dans le bon format.

source: If desired, a web browser may be used instead of _A565_ but the file will need to be saved with the name _F471_ .
fr: Si vous le désirez, vous pouvez utiliser un navigateur Internet plutôt que _A565_ mais le fichier devra être enregistré sous le nom _F471_.

source: These commands can be repeated as necessary to update the CA Certificates.
fr: Ces commandes peuvent être répétées autant de fois que nécessaire pour mettre à jour les Certificats CA.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Finally, clean up the current directory:
fr: Enfin, nettoyez le répertoire courant :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: make-ca.sh, make-cert.pl and remove-expired-certs.sh
fr: make-ca.sh, make-cert.pl et remove-expired-certs.sh

source: None
fr: Aucun

source: Short Descriptions
fr: Descriptions courtes

source: is a shell script that reformats the _F471_ file for use by _A488_ .
fr: est un script du shell qui reformate le fichier _F471_ pour que _A488_ l'utilise.

source: is a utility _A344_ script that converts a single binary certificate (.der format) into .pem format.
fr: est un script _A344_ qui convertit un certificat binaire unique (format .der) au format .pem.

source: is a utility shell script that removes expired certificates from a directory.
fr: est un script shell qui supprime les certificats expirés d'un répertoire.

source: The default directory is _F472_ .
fr: Le répertoire par défaut est _F472_.
