Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/cracklib.xml.1.chaine.po
Languages: fr

source: 628 KB
fr: 628 Ko

source: 3.8 MB
fr: 3.8 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: 5.3 MB
fr: 5.3 Mo

source: Introduction to CrackLib
fr: Introduction à CrackLib

source: The _A574_ package contains a library used to enforce strong passwords by comparing user selected passwords to words in chosen word lists.
fr: Le paquet _A574_ contient une bibliothèque utilisée pour renforcer les mots de passe forts en comparant les mots de passe sélectionnés par l'utilisateur avec des mots dans des listes de mots choisies.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Recommended word list for English-speaking countries (size:
fr: Liste de mots recommandée pour les pays anglophones (taille :

source: There are additional word lists available for download, e.g., from _L2363_ .
fr: Il y a des listes de mots supplémentaires disponibles en téléchargement, par exemple sur _L2363_.

source: Users tend to base their passwords on regular words of the spoken language, and crackers know that.
fr: Les utilisateurs ont tendance à baser leur mot de passe sur des mots ordinaires de leur langue et les pirates le savent.

source: To accomplish this, the word list (s) for use with _A574_ must be an exhaustive list of words and word-based keystroke combinations likely to be chosen by users of the system as (guessable) passwords.
fr: Pour faire cela, la/les liste (x) de mots à utiliser avec _A574_ doit/doivent être exhaustive (s) et contenir les mots, les combinaisons de touche qui ont des chances d'être choisies par les utilisateurs du système comme mots de passe.

source: The default word list recommended above for downloading mostly satisfies this role in English-speaking countries.
fr: La liste de mots par défaut dont on a recommandé plus haut le téléchargement joue en général ce rôle dans les pays anglophones.

source: Note that word lists suitable for spell-checking are not usable as _A574_ word lists in countries with non-Latin based alphabets, because of
fr: Remarquez que les listes de mots adaptées à la vérification de l'orthographe ne sont pas utilisables comme listes de mots pour _A574_ dans des pays ayant des alphabets à base non latine à cause des

source: word-based keystroke combinations
fr: combinaisons de touche basées sur le mot

source: that make bad passwords.
fr: qui produisent de mauvais mots de passe.

source: CrackLib Dependencies
fr: Dépendances de CrackLib

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of CrackLib
fr: Installation de CrackLib

source: Install _A574_ by running the following commands:
fr: Installez _A574_ en lançant les commandes suivantes :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Issue the following commands as the _U1_ user to install the recommended word list and create the _A574_ dictionary.
fr: Lancez les commandes suivantes en tant qu'utilisateur _U1_ pour installer la liste de mots recommandée et créer le dictionnaire _A574_.

source: Other word lists (text based, one word per line) can also be used by simply installing them into _F487_ and adding them to the _C1277_ command.
fr: D'autres listes de mots (basées sur le texte, un mot par ligne) peuvent être utilisées, simplement en les installant dans _F487_ et en les ajoutant à la commande _C1277_.

source: If desired, check the proper operation of the library as an unprivileged user by issuing the following command:
fr: Si vous le désirez, vérifiez le bon fonctionnement de la bibliothèque en tant qu'utilisateur non privilégié en lançant la commande suivante :

source: If you are installing _A574_ after your LFS system has been completed and you have the _A556_ package installed, you must reinstall _X338_ if you wish to provide strong password support on your system.
fr: Si vous installez _A574_ après avoir terminé votre système LFS, et si vous avez installé le paquet _A556_ , vous devez réinstaller _X338_ si vous souhaitez fournir le support des mots de passe forts sur votre système.

source: If you are now going to install the _X130_ package, you may disregard this note as _A556_ will be reinstalled after the _A256_ installation.
fr: Si vous allez installer le paquet _X130_ maintenant, vous pouvez ignorer cette remarque vu que _A556_ sera réinstallé après l'installation de _A256_.

source: Command Explanations
fr: Explications des commandes

source: Remove a meaningless warning.
fr: Supprime un avertissement incompréhensible.

source: This parameter forces the installation of the _A574_ dictionary to the _F407_ hierarchy.
fr: Ce paramètre oblige l'installation du dictionnaire _A574_ à se faire dans la hiérarchie _F407_.

source: These two commands move the _F488_ library and associated symlink from _F408_ to _F407_ , then recreates the _F489_ symlink pointing to the relocated file.
fr: Ces deux commandes déplacent la bibliothèque _F488_ et les liens associés de _F408_ vers _F407_ , puis recréent le lien symbolique _F489_ qui pointe vers le fichier replacé.

source: The word list is linked to _F490_ as historically, _F491_ is the primary word list in the _F487_ directory.
fr: La liste de mots est liée à _F490_ vu qu'historiquement, _F491_ est la liste de mots primaire dans le répertoire _F487_.

source: Omit this command if you already have a _F490_ file installed on your system.
fr: Supprimez cette commande si vous avez déjà installé un fichier _F490_ sur votre système.

source: The value of _C1284_ is echoed to a file called _F492_ .
fr: La valeur de _C1284_ est envoyée dans un fichier nommé _F492_.

source: This command creates the _A574_ dictionary from the word lists.
fr: Cette commande crée le dictionnaire _A574_ à partir des listes de mots.

source: Modify the command to add any additional word lists you have installed.
fr: Modifiez la commande pour ajouter une liste de mots supplémentaire que vous avez installée.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: cracklib-check, cracklib-format, cracklib-packer, cracklib-unpacker and create-cracklib-dict
fr: cracklib-check, cracklib-format, cracklib-packer, cracklib-unpacker et create-cracklib-dict

source: libcrack.so and the _cracklibmodule.so _A82_ module
fr: libcrack.so et le module _A82_ cracklibmodule.so

source: /lib/cracklib, /usr/share/dict and /usr/share/cracklib
fr: /lib/cracklib, /usr/share/dict et /usr/share/cracklib

source: Short Descriptions
fr: Descriptions courtes

source: is used to determine if a password is strong.
fr: est utilisé pour déterminer si un mot de passe est fort.

source: is used to format text files (lowercases all words, removes controle characters and sorts the lists).
fr: est utilisé pour formater des fichiers textes (minuscules pour tous les mots, suppression des caractères de contrôle et tri des lites).

source: creates a database with words read from standard input.
fr: crée une base de données avec les mots lus depuis l'entrée standard.

source: displays on standard output the database specified.
fr: affiche sur la sortie standard la base de données spécifiées.

source: is used to create the _A574_ dictionary from the given word list (s).
fr: est utilisé pour créer le dictionnaire _A574_ à partir de la/des liste (x).

source: provides a fast dictionary lookup method for strong password enforcement.
fr: fournit une méthode de parcours rapide du dictionnaire à la recherche de renforcement de mots de passe forts.
