Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/cyrus-sasl.xml.1.chaine.po
Languages: fr

source: 30 MB
fr: 30 Mo

source: Introduction to Cyrus SASL
fr: Introduction à Cyrus SASL

source: The _A590_ package contains a Simple Authentication and Security Layer, a method for adding authentication support to connection-based protocols.
fr: Le paquet _A590_ contient une _fpo_Simple Authentication and Security Layer_fpf_.

source: To use SASL, a protocol includes a command for identifying and authenticating a user to a server and for optionally negotiating protection of subsequent protocol interactions.
fr: Pour utiliser SASL, un protocole inclut une commande d'identification et d'authentification d'un utilisateur sur un serveur et la négociation éventuelle de la protection des interactions consécutives du protocole.

source: If its use is negotiated, a security layer is inserted between the protocol and the connection.
fr: Si son utilisation est négociée, une couche de sécurité est insérée entre le protocole et la connexion.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: Cyrus SASL Dependencies
fr: Dépendances de Cyrus SASL

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Cyrus SASL
fr: Installation de Cyrus SASL

source: Install _A590_ by running the following commands:
fr: Installez _A590_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: If you are planning on using the GSSAPI authentication mechanism, it is recommended to test it after installing the package using the sample server and client programs which were built in the preceding step.
fr: Si vous envisagez d'utiliser le mécanisme d'authentification GSSAPI, il est recommandé de le tester après l'installation d'un paquet utilisant le serveur d'échantillon et les programmes client qui ont été construits à l'étape précédente.

source: Instructions for performing the tests can be found at _L3363_ .
fr: Vous pouvez trouver des instructions pour effectuer cela sur _L3363_.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch forces the _C1361_ database to be created in _F533_ instead of _F233_ .
fr: Ce paramètre force la base de données _C1361_ à être créée dans _F533_ au lieu de _F233_.

source: This switch forces _C1362_ to use the FHS compliant directory _F534_ for variable run-time data.
fr: Ce paramètre oblige _C1362_ à utiliser les données en cours d'exécution de la variable du répertoire _F534_ conforme à la FHS.

source: This switch enables SASLDB authentication backend.
fr: Ce paramètre active l'authentification SASLDB.

source: This switch forces _A336_ to be used instead of _A320_ .
fr: Ce paramètre oblige l'utilisation de _A336_ au lieu de _A320_.

source: This switch enables the _A578_ support.
fr: Ce paramètre active l'utilisation avec _A578_.

source: This switch enables the LDAPDB authentication backend.
fr: Ce paramètre active le fondement d'authentication LDAPDB.

source: There is a circular dependency with this parameter.
fr: Il y a une dépendance circulaire avec ce paramètre.

source: See _L3362_ for a solution to this problem.
fr: Voir _L3362_ pour une solution à ce problème.

source: This switch enables compiling of the _A287_ support libraries.
fr: Cette option active la compilation des bibliothèques de support de _A287_.

source: This option enables unsupported LOGIN authentication.
fr: Cette option active l'authentification LOGIN non supportée.

source: This option enables unsupported NTLM authentication.
fr: Cette option active l'authentification NTLM non supportée.

source: These commands install documentation which is not installed by the _C846_ command.
fr: Ces commandes installent la documentation qui n'est pas installée par la commande _C846_.

source: This directory must exist when starting _C1362_ or using the sasldb plugin.
fr: Ces répertoires doivent exister au démarrage de _C1362_ ou pendant l'utilisation de l'extension sasldb.

source: Configuring Cyrus SASL
fr: Configuration de Cyrus SASL

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: See _L3364_ for information on what to include in the application configuration files.
fr: Voir _L3364_ pour des informations sur ce que contiennent les fichiers de configuration de l'application.

source: See _L3365_ for configuring _C1362_ with _A578_ .
fr: Voir _L3365_ pour la configuration de _C1362_ avec _A578_.

source: See _L3366_ for configuring _C1362_ with _A580_ .
fr: Voir _L3366_ pour la configuration de _C1362_ avec _A580_.

source: Init Script
fr: Script de démarrage

source: If you need to run the _C1362_ daemon at system startup, install the _F537_ init script included in the _X203_ package using the following command:
fr: Si vous devez exécuter le démon _C1362_ au démarrage du système, installez le script de démarrage _F537_ fourni dans le paquet _X203_ en utilisant la commande suivante :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: pluginviewer, saslauthd, sasldblistusers2, saslpasswd2 and testsaslauthd
fr: pluginviewer, saslauthd, sasldblistusers2, saslpasswd2 et testsaslauthd

source: /usr/include/sasl, /usr/lib/sasl2, /usr/share/doc/cyrus-sasl-&cyrus-sasl-version; and /var/lib/sasl
fr: /usr/include/sasl, /usr/lib/sasl2, /usr/share/doc/cyrus-sasl-&cyrus-sasl-version; et /var/lib/sasl

source: Short Descriptions
fr: Descriptions courtes

source: is used to list loadable SASL plugins and their properties.
fr: est utilisé pour lister les greffons SASL chargeables et leurs propriétés.

source: is the SASL authentication server.
fr: est le serveur d'authentication SASL.

source: is used to list the users in the SASL password database _F538_ .
fr: est utilisé pour lister les utilisateurs de la base de données de mots de passe SASL _F538_.

source: is a test utility for the SASL authentication server.
fr: est un outil de test pour le serveur d'authentification SASL.

source: is a general purpose authentication library for server and client applications.
fr: est une bibliothèque d'authentication généraliste pour des applications serveur et client.
