Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/firewalling.xml.1.chaine.po
Languages: fr

source: Firewalling
fr: Pare-feu

source: Setting Up a Network Firewall
fr: Paramétrer un pare-feu réseau

source: Before you read this part of the chapter, you should have already installed iptables as described in the previous section.
fr: Avant de lire cette partie du chapitre, vous devriez avoir déjà installé iptables comme décrit dans la section précédente.

source: Firewalling Introduction
fr: Introduction aux pare-feux

source: Introduction to Firewall Creation
fr: Introduction à la création d'un pare-feu

source: The general purpose of a firewall is to protect a computer or a network against malicious access.
fr: L'objectif général d'un pare-feu est de protéger un ordinateur ou un réseau contre les accès malveillants.

source: In a perfect world, every daemon or service on every machine is perfectly configured and immune to flaws such as buffer overflows or other problems regarding its security.
fr: Dans un monde parfait, tout démon et tout service sur la machine est parfaitement configuré et immunisé contre des fléaux tels que les débordements de mémoire ou d'autres problèmes liés à leur sécurité.

source: Furthermore, you trust every user accessing your services.
fr: De plus, vous faites confiance aux utilisateurs qui accèdent à vos services.

source: In this world, you do not need to have a firewall.
fr: Dans ce monde, vous n'avez pas besoin de pare-feu.

source: In the real world however, daemons may be misconfigured and exploits against essential services are freely available.
fr: Mais dans le monde réel, les démons peuvent être mal configurés et les exploits contre des services essentiels sont librement disponibles.

source: You may wish to choose which services are accessible by certain machines or you may wish to limit which machines or applications are allowed external access.
fr: Vous pouvez souhaiter choisir les services qui sont accessibles à certaines machines ou vous pourriez souhaiter limiter les machines ou les applications qui sont autorisés à y accéder depuis l'extérieur.

source: Alternatively, you may simply not trust some of your applications or users.
fr: Sinon, vous pouvez tout simplement ne pas faire confiance à certaines de vos applications ou à certains de vos utilisateurs.

source: You are probably connected to the Internet.
fr: Vous êtes probablement connectés à Internet.

source: In this world, a firewall is essential.
fr: Dans ce monde, un pare-feu est essentiel.

source: Don't assume however, that having a firewall makes careful configuration redundant, or that it makes any negligent misconfiguration harmless.
fr: N'imaginez toutefois pas qu'un pare-feu rend redondante les mauvaises configurations, ni qu'il ôte tout risque d'une mauvaise configuration par négligence.

source: It doesn't prevent anyone from exploiting a service you intentionally offer but haven't recently updated or patched after an exploit went public.
fr: Il n'empêche personne d'exploiter un service que vous offrez intentionnellement, mais que vous n'avez pas mis à jour récemment ou que vous n'avez pas corrigé après qu'un exploit a été publié.

source: Despite having a firewall, you need to keep applications and daemons on your system properly configured and up to date.
fr: Bien qu'ayant un pare-feu, vous avez besoin d'avoir sur votre système des applications et des démons configurés correctement et à jour.

source: A firewall is not a cure all, but should be an essential part of your overall security strategy.
fr: Un pare-feu n'est pas le remède à tout, mais il devrait être une partie essentielle de votre stratégie globale de sécurité.

source: Meaning of the Word "Firewall"
fr: Signification du mot « Pare-feu »

source: The word firewall can have several different meanings.
fr: Le mot « pare-feu » peut avoir plusieurs sens différents.

source: This is a hardware device or software program commercially sold (or offered via freeware) by companies such as Symantec which claims that it secures a home or desktop computer connected to the Internet.
fr: C'est un périphérique matériel ou un logiciel disponible sur le commerce (ou offert gratuitement) par des sociétés telles que Symantec qui prétend que cela sécurise un ordinateur familial ou de bureau connecté à Internet.

source: This type of firewall is highly relevant for users who do not know how their computers might be accessed via the Internet or how to disable that access, especially if they are always online and connected via broadband links.
fr: Ce type de pare-feu est fort pertinent pour les utilisateurs qui ne savent pas comment on pourrait accéder à leur ordinateur par Internet ou comment désactiver cet accès, surtout s'ils sont toujours en ligne et connectés par des liens à connexion illimitée.

source: This is a system placed between the Internet and an intranet.
fr: C'est un système placé entre Internet et l'intranet.

source: To minimize the risk of compromising the firewall itself, it should generally have only one role&mdash;that of protecting the intranet.
fr: Pour minimiser le risque de compromettre le pare-feu lui-même, il ne devrait en général jouer qu'un rôle&mdash;celui de protéger l'intranet.

source: Although not completely risk free, the tasks of doing the routing and IP masquerading (rewriting IP headers of the packets it routes from clients with private IP addresses onto the Internet so that they seem to come from the firewall itself) are commonly considered relatively secure.
fr: Bien que cela ne soit pas sans risques, la tâche de routage et de masquage d'IPs (réécrire des en-têtes IP de paquets qu'il route depuis les clients avec des adresses privées sur Internet afin qu'elles semblent venir du pare-feu lui-même) est en général considérée comme relativement sécurisée.

source: This is often an old computer you may have retired and nearly forgotten, performing masquerading or routing functions, but offering non-firewall services such as a web-cache or mail.
fr: C'est souvent un vieil ordinateur à la retraite et que vous avez presqu'oublié, qui fait du masquage ou des fonctions de routage mais qui offre des services de non pare-feu tels qu'un cache Web ou la messagerie.

source: This may be used for home networks, but is not to be considered as secure as a firewall only machine because the combination of server and router/firewall on one machine raises the complexity of the setup.
fr: Cela peut être utilisé pour des réseaux familiaux, mais ce n'est pas considéré comme sécurisé en tant que machine uniquement dédiée au pare-feu car la combinaison d'un serveur et d'un routeur/pare-feu sur une machine augmente la complexité du paramétrage.

source: Firewall with a Demilitarized Zone[Not Further Described Here]
fr: Pare-feu avec un Demilitarized Zone[Not Further Described Here]

source: This box performs masquerading or routing, but grants public access to some branch of your network which, because of public IPs and a physically separated structure, is essentially a separate network with direct Internet access.
fr: Cette machine effectue du masquage ou du routage mais elle autorise un accès public à certaines branches de votre réseau qui, du fait des IPs publiques et d'une structure physique séparée, est essentiellement un réseau séparé avec un accès direct à Internet.

source: The servers on this network are those which must be easily accessible from both the Internet and intranet.
fr: Les serveurs sur ce réseau sont les plus facilement accessibles, tant par Internet que depuis l'intranet.

source: The firewall protects both networks.
fr: Le pare-feu protège les deux réseaux.

source: This type of firewall has a minimum of three network interfaces.
fr: Ce type de pare-feu a un minimum de trois interfaces réseaux.

source: This type of firewall does routing or masquerading, but does not maintain a state table of ongoing communication streams.
fr: Ce type de pare-feu fait du routage et du masquage, mais il ne maintient pas un tableaux d'état de flux de communication en cours.

source: It is fast, but quite limited in its ability to block undesired packets without blocking desired packets.
fr: Il est rapide mais a des capacités de blocage des paquets indésirés très limitées sans bloquer les paquets désirés.

source: writing the firewalling-setup-scripts
fr: Ecrire firewalling-setup-scripts

source: Now You Can Start to Build your Firewall
fr: Maintenant vous pouvez commencer à construire votre pare-feu

source: This introduction on how to setup a firewall is not a complete guide to securing systems.
fr: Cette introduction sur la façon de paramétrer un pare-feu n'est pas un guide complet pour sécuriser des systèmes.

source: Firewalling is a complex issue that requires careful configuration.
fr: Le pare-feu est un sujet complexe qui exige une configuration soignée.

source: The scripts quoted here are simply intended to give examples of how a firewall works.
fr: Les scripts cités ici ne visent qu'à donner des exemples de la façon dont fonctionne un pare-feu.

source: They are not intended to fit into any particular configuration and may not provide complete protection from an attack.
fr: Ils n'ambitionnent pas de convenir à toute configuration particulière et ils peuvent ne pas offrir de protection complète contre une attaque.

source: Customization of these scripts for your specific situation will be necessary for an optimal configuration, but you should make a serious study of the iptables documentation and creating firewalls in general before hacking away.
fr: Une personnalisation de ces scripts pour votre situation spécifique sera nécessaire pour avoir une configuration optimale, mais vous devriez étudier sérieusement la documentation d'iptables et la création de pare-feux en général avant de toucher quoique ce soit.

source: Have a look at the list of _X626_ at the end of this section for more details.
fr: Jetez un &oelig;il sur la liste de _X626_ à la fin de cette section pour plus de détails.

source: There you will find a list of URLs that contain quite comprehensive information about building your own firewall.
fr: Vous y trouverez une liste de liens contenant des informations rapides et complètes sur la construction de votre propre pare-feu.

source: The firewall configuration script installed in the iptables section differs from the standard configuration script.
fr: Le script de configuration de pare-feu installé dans la section sur iptables diffère du script de configuration standard.

source: It only has two of the standard targets:
fr: Il n'a que deux des cibles standards :

source: start and status.
fr: start et status.

source: The other targets are clear and lock.
fr: Les autres cibles sont vides et verrouillées.

source: For instance if you issue:
fr: Par exemple, si vous lancez :

source: the firewall will be restarted just as it is upon system startup.
fr: le pare-feu sera redémarré comme s'il s'agissait du démarrage du système.

source: The status target will present a list of all currently implemented rules.
fr: La cible status présentera une liste de toutes les règles actuellement implémentées.

source: The clear target turns off all firewall rules and the lock target will block all packets in and out of the computer with the exception of the loopback interface.
fr: La cible vide désactive toutes les règles de pare-feu et la cible verrouillée.

source: The main startup firewall is located in the file _F1564_ .
fr: Le pare-feu de démarrage principal se trouve dans le fichier _F1564_.

source: The sections below provide three different approaches that can be used for a system.
fr: Les sections ci-dessous présentent trois approches différentes qu'on peut utiliser sur un système.

source: You should always run your firewall rules from a script.
fr: Vous devriez toujours exécuter vos règles de pare-feu à partir d'un script.

source: This ensures consistency and a record of what was done.
fr: Cela vous assure d'être cohérent et de vous souvenir de ce que vous avez fait.

source: It also allows retention of comments that are essential for understanding the rules long after they were written.
fr: Cela permet aussi de mettre des commentaires essentiels à la compréhension des règles longtemps après les avoir écrites.

source: Personal Firewall
fr: Pare-feu personnel

source: A Personal Firewall is designed to let you access all the services offered on the Internet, but keep your box secure and your data private.
fr: Un pare-feu personnel est conçu pour vous permettre un accès à tous les services offerts sur Internet, mais il garde votre machine ainsi que vos données privées en sécurité.

source: Below is a slightly modified version of Rusty Russell's recommendation from the _L3038_ .
fr: Voici ci-dessous une version légèrement modifiée de la recommandation de Rusty Russell sur le _L3038_.

source: It is still applicable to the Linux 2.6 kernels.
fr: Il s'applique encore aux noyaux Linux 2.6.

source: This script is quite simple, it drops all traffic coming into your computer that wasn't initiated from your computer, but as long as you are simply surfing the Internet you are unlikely to exceed its limits.
fr: Ce script est très simple, il accepte tout le trafic venant dans votre ordinateur qui a été initié par votre ordinateur, mais tant que vous surfez simplement sur Internet, il y a peu de chances que vous dépassiez ses limites.

source: If you frequently encounter certain delays at accessing FTP servers, take a look at _X627_ .
fr: Si vous rencontrez souvent un certains délais pour l'accès à vos serveurs FTP, jetez un &oelig;il sur _X627_.

source: Even if you have daemons or services running on your system, these will be inaccessible everywhere but from your computer itself.
fr: Même si vous avez des démons ou des services en fonction sur votre système, il sera inaccessible partout sauf par l'ordinateur lui-même.

source: If you want to allow access to services on your machine, such as _C934_ or _C2546_ , take a look at _X625_ .
fr: Si vous voulez permettre l'accès à des services sur votre machine tels que _C934_ ou _C2546_ , jetez un &oelig;il sur _X625_.

source: Masquerading Router
fr: Routeur Masquerading

source: A true Firewall has two interfaces, one connected to an intranet, in this example
fr: Un vrai pare-feu a deux interfaces, une connectée à un intranet, dans cet exemple

source: , and one connected to the Internet, here
fr: , et une connectée à Internet, ici

source: To provide the maximum security for the firewall itself, make sure that there are no unnecessary servers running on it such as _A583_ et al.
fr: Pour offrir le maximum de sécurité au pare-feu lui-même, assurez-vous qu'il n'y a pas de serveurs inutiles en fonction dessus tels que _A583_ et al.

source: As a general principle, the firewall itself should not access any untrusted service (think of a remote server giving answers that makes a daemon on your system crash, or even worse, that implements a worm via a buffer-overflow).
fr: En principe, le pare-feu lui-même ne devrait pas accéder à un service non routé (pensez à un serveur distant qui donne des réponses que fait planter un démon sur votre système, ou même pire, ceci implémente un travail par un débordement de mémoire).

source: With this script your intranet should be reasonably secure against external attacks.
fr: Avec ce script, votre intranet devrait être raisonnablement sécurisé contre les attaques externes.

source: No one should be able to setup a new connection to any internal service and, if it's masqueraded, makes your intranet invisible to the Internet.
fr: Personne ne devrait pouvoir paramétrer de nouvelle connexion pour n'importe quel service interne et, s'il est masqué, il rend votre intranet invisible depuis Internet.

source: Furthermore, your firewall should be relatively safe because there are no services running that a cracker could attack.
fr: En outre, votre pare-feu devrait être relativement sécurisé car il n'y a pas de services en fonction qu'un pirate pourrait attaquer.

source: If the interface you're connecting to the Internet doesn't connect via PPP, you will need to change
fr: Si l'interface par laquelle vous vous connectez à Internet ne se connecte pas par PPP, vous devrez modifier

source: to the name of the interface (e.g.,
fr: par le nom de l'interface (comme

source: ) which you are using.
fr: ) que vous utilisez.

source: This scenario isn't too different from the _X624_ , but additionally offers some services to your intranet.
fr: Ce scénario n'est pas très différent du _X624_ , mais il offre en plus des services à votre intranet.

source: Examples of this can be when you want to administer your firewall from another host on your intranet or use it as a proxy or a name server.
fr: On peut en avoir des exemples quand vous voulez administrer votre pare-feu à partir d'un autre hôte de votre Intranet ou l'utiliser en tant que proxy ou serveur DNS ou un serveur de de noms.

source: Outlining a true concept of how to protect a server that offers services on the Internet goes far beyond the scope of this document.
fr: Faire le tour de la question du vrai concept de protéger un serveur offrant des services sur Internet va beaucoup plus loin que l'objectif de ce document.

source: See the references at the end of this section for more information.
fr: Voir les références à la fin de cette section pour plus d'informations.

source: Be cautious.
fr: Faites attention.

source: Every service you have enabled makes your setup more complex and your firewall less secure.
fr: Chaque service que vous avez activé complexifie votre configuration et rend moins sécurisé votre pare-feu.

source: You are exposed to the risks of misconfigured services or running a service with an exploitable bug.
fr: Vous êtes exposé aux risques d'une mauvaise configuration des services ou d'exécution d'un service ayant un bogue exploitable.

source: A firewall should generally not run any extra services.
fr: Un général, un pare-feu ne devrait exécuter aucun service supplémentaire.

source: See the introduction to the _X624_ for some more details.
fr: Voir l'introduction au _X624_ pour des détails supplémentaires.

source: If you want to add services such as internal Samba or name servers that do not need to access the Internet themselves, the additional statements are quite simple and should still be acceptable from a security standpoint.
fr: Si vous voulez ajouter des services tels que Samba en interne ou un serveurs de DNS qui n'ont pas besoin d'accéder eux-mêmes à Internet, les réglages supplémentaires sont très simples et devraient être encore acceptables du point de vue de la sécurité.

source: Just add the following lines into the script
fr: Ajoutez simplement les lignes suivantes au script

source: before
fr: avant

source: the logging rules.
fr: les règles de connexion.

source: If daemons, such as squid, have to access the Internet themselves, you could open OUTPUT generally and restrict INPUT.
fr: Si des démons tels que squid, doivent accéder eux-mêmes à Internet, vous pouvez en général ouvrir OUTPUT et restreindre INPUT.

source: However, it is generally not advisable to leave OUTPUT unrestricted.
fr: Il n'est toutefois pas conseillé de laisser OUTPUT sans restrictions.

source: You lose any control over trojans who would like to "call home", and a bit of redundancy in case you've (mis-)configured a service so that it broadcasts its existence to the world.
fr: Vous perdez alors le contrôle des chevaux de Troie (trojan).

source: To accomplish this, you should restrict INPUT and OUTPUT on all ports except those that it's absolutely necessary to have open.
fr: Pour faire cela, vous devriez restreindre INPUT et OUTPUT sur tous les ports sauf ceux qu'il vous faut absolument ouvrir.

source: Which ports you have to open depends on your needs:
fr: Les ports que vous devez ouvrir dépendent de vos besoins :

source: mostly you will find them by looking for failed accesses in your log files.
fr: en général, vous les trouverez en découvrant des échecs d'accès dans vos fichiers journaux.

source: Have a Look at the Following Examples:
fr: Jetez un &oelig;il sur les exemples suivants :

source: Squid is caching the web:
fr: Squid met en cache Internet :

source: You want to be able to ping your computer to ensure it's still alive:
fr: Vous voulez pouvoir pinger votre ordinateur pour vérifier qu'il est toujours en vie :

source: If you are frequently accessing FTP servers or enjoy chatting, you might notice certain delays because some implementations of these daemons have the feature of querying an identd on your system to obtain usernames.
fr: Si vous accédez souvent à des serveurs FTP ou que vous aimez chatter, vous pourriez remarquer certains délais car certaines implémentations de ces démons ont une fonction de recherche d'un identd sur votre système pour obtenir des noms d'utilisateur.

source: Although there's really little harm in this, having an identd running is not recommended because many security experts feel the service gives out too much additional information.
fr: Bien qu'il y ait très peu de dangers, le fait d'avoir un identd en fonction n'est pas recommandé car de nombreux experts en sécurité trouvent que le service donnent trop d'informations supplémentaires.

source: To avoid these delays you could reject the requests with a 'tcp-reset':
fr: Pour éviter ces délais, vous pourriez rejeter les requêtes avec un 'tcp-reset' :

source: Anything coming from the outside should not have a private address, this is a common attack called IP-spoofing:
fr: Tout ce qui vient de l'extérieur ne devrait pas avoir d'adresse privée, c'est une attaque courante appelée IP-spoofing :

source: There are other addresses that you may also want to drop:
fr: Il y a d'autres adresses que vous pourriez aussi vouloir rejeter :

source: 0.0.0.0/8, 127.0.0.0/8, 224.0.0.0/3 (multicast and experimental), 169.254.0.0/16 (Link Local Networks), and 192.0.2.0/24 (IANA defined test network).
fr: 0.0.0.0/8, 127.0.0.0/8, 224.0.0.0/3 (multicast et expérimental), 169.254.0.0/16 (Link Local Networks, lien réseaux locaux), et 192.0.2.0/24 (réseau de test défini par IANA).

source: If your firewall is a DHCP client, you need to allow those packets:
fr: Si votre pare-feu est un client, vous devez autoriser ces paquets :

source: To simplify debugging and be fair to anyone who'd like to access a service you have disabled, purposely or by mistake, you could REJECT those packets that are dropped.
fr: Pour simplifier le débogage et éloigner ceux qui aimeraient accéder à un service que vous avez désactivé, par erreur ou volontairement, vous pourriez REJECT ces paquets qui sont rejetés.

source: Obviously this must be done directly after logging as the very last lines before the packets are dropped by policy:
fr: Cela doit évidemment se faire directement après avoir enregistré les toutes dernières lignes avant que les paquets ne soient rejetés par les règles :

source: These are only examples to show you some of the capabilities of the firewall code in Linux.
fr: Ce ne sont que des exemples pour vous montrer quelques possibilités du code de pare-feu de Linux.

source: Have a look at the man page of iptables.
fr: Jetez un &oelig;il sur la page de man d'iptables.

source: There you will find much more information.
fr: Vous y trouverez beaucoup plus d'informations.

source: The port numbers needed for this can be found in _F963_ , in case you didn't find them by trial and error in your log file.
fr: Vous pouvez trouver les numéros de port qui sont nécessaires dans _F963_ , au cas où vous ne les auriez pas trouvé à partir des compte-rendu et des erreurs dans votre fichier journal.

source: Finally, there is one fact you must not forget:
fr: En fin de compte, vous devez vous souvenir d'une chose :
