Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/firewalling.xml.1.chaine.po
Languages: fr

source: The effort spent attacking a system corresponds to the value the cracker expects to gain from it.
fr: l'effort employé pour attaquer un système dépend de la valeur ajoutée que s'attend à y trouver un pirate.

source: If you are responsible for valuable information, you need to spend the time to protect it properly.
fr: Si vous êtes responsables d'informations de valeur, vous devez passer du temps à les protéger correctement.

source: Extra Information
fr: Informations supplémentaires

source: Where to Start with Further Reading on Firewalls
fr: Où commencer des lectures complémentaires sur les pare-feu
