Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/gnutls.xml.1.chaine.po
Languages: fr

source: 6.4 MB
fr: 6.4 Mo

source: Introduction to GnuTLS
fr: Introduction à GnuTLS

source: The _A571_ package contains libraries and userspace tools which provide a secure layer over a reliable transport layer.
fr: Le paquet _A571_ contient une bibliothèque et des outils utilisateur qui offre une couche sécurisée pour une couche de transport fiable.

source: Quoting from the TLS protocol specification:
fr: Pour citer la spécification du protocole TLS :

source: The TLS protocol provides communications privacy over the Internet.
fr: Le protocole TLS offre de rendre confidentielles les communications sur Internet.

source: The protocol allows client/server applications to communicate in a way that is designed to prevent eavesdropping, tampering, or message forgery.
fr: Le protocole permet aux applications client/serveur de communiquer d'une manière conçue pour empêcher les indiscrétions.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: GnuTLS Dependencies
fr: Dépendances de GnuTLS

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: Note that if you do not install _X325_ , an older version shipped in the _A571_ tarball will be used instead.
fr: Notez que si vous installez _X325_ , une ancienne version chargée dans l'archive de _A571_ sera utilisée à la place.

source: User Notes:
fr: Notes utilisateur :

source: Install _A571_ by running the following commands:
fr: Installez _A571_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch tells _C121_ where to find the CA Certificates.
fr: Ce paramètre indique à _C121_ ou trouver les certificats CA.

source: Use this switch if you wish to build the OpenSSL compatibility library.
fr: Utilisez ce paramètre si vous souhaitez construire la bibliothèque de compatibilité OpenSSL.

source: use this switch if you have not installed _A572_ .
fr: utilisez ce paramètre si vous n'avez pas installé _A572_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: is used to generate X.509 certificates, certificate requests, and private keys.
fr: est utilisé pour générer des certificats X.509, des requêtes de certificat et des clés privées.

source: is a simple wrapper that waits for TLS/SSL connections, and proxies them to an unencrypted location.
fr: est une enveloppe simple attendant des connexions TLS/SSL et qui les renvoie vers un emplacement non chiffré.

source: Only installed if _X336_ is present.
fr: Seulement installé si _X336_ est présent.

source: is a tool used to generate and check DNS resource records for the DANE protocol.
fr: est un outil utilisé pour générer et vérifier les enregistrements des ressources DNS pour le protocole DANE.

source: is a simple client program to set up a TLS connection to some other computer.
fr: est un client simple pour paramétrer une connexion TLS à plusieurs autres ordinateurs.

source: is a simple client program to set up a TLS connection to some other computer and produces very verbose progress results.
fr: est un client simple pour paramétrer une connexion TLS à d'autres ordinateurs et produit des résultats de progression très verbeux.

source: is a simple server program that listens to incoming TLS connections.
fr: est un serveur simple qui écoute les connexions TLS entrantes.

source: is a program that can parse and print information about OCSP requests/responses, generate requests and verify responses.
fr: est un programme qui peut analyser et afficher des informations sur les requêtes/réponses OCSP, générer des requêtes et vérifier les réponses.

source: is a program that allows handling data from PKCS #11 smart cards and security modules.
fr: est un programme qui permet de gérer les données des cartes smart PKCS #11 et des modules de sécurité.

source: is a simple program that generates random keys for use with TLS-PSK.
fr: est un programme simple générant des clés aléatoires pour une utilisation avec TLS-PSK.

source: is a simple program that emulates the programs in the Stanford SRP (Secure Remote Password) libraries using GnuTLS.
fr: est un programme simple qui émule les programmes dans les bibliothèques SRP (Secure Remote Password, mot de passe distant sécurisé) de Stanford en utilisant GNU TLS.

source: contains the core API functions and X.509 certificate API functions.
fr: contient les fonctions de l'API du c&oelig;ur et les fonctions de l'API du certificat X.509.
