Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/iptables.xml.1.chaine.po
Languages: fr

source: 596 KB
fr: 596 Ko

source: 19 MB
fr: 19 Mo

source: Introduction to Iptables
fr: Introduction à Iptables

source: The next part of this chapter deals with firewalls.
fr: La partie suivante de ce chapitre traite des pare-feux.

source: The principal firewall tool for Linux is _A301_ .
fr: L'outil principal de pare-feu pour Linux est _A304_.

source: You will need to install _A301_ if you intend on using any form of a firewall.
fr: Vous devrez installer _A304_ si vous souhaitez utiliser une forme de pare-feu.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Iptables Dependencies
fr: Dépendances d'Iptables

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: A firewall in Linux is accomplished through a portion of the kernel called netfilter.
fr: Sur Linux, on a un pare-feu via une portion du noyau qui s'appelle netfilter.

source: The interface to netfilter is _A301_ .
fr: L'interface avec netfilter est _A304_.

source: To use it, the appropriate kernel configuration parameters are found in:
fr: Pour l'utiliser, les paramètres adéquats de configuration du noyau sont trouvés dans :

source: Installation of Iptables
fr: Installation d'Iptables

source: The installation below does not include building some specialized extension libraries which require the raw headers in the _A302_ source code.
fr: L'installation ci-dessous n'inclut pas la construction de quelques bibliothèques d'extension spécialisées qui exigent les en-têtes raw dans le code source de _A302_.

source: If you wish to build the additional extensions (if you aren't sure, then you probably don't), you can look at the _F966_ file to see an example of how to change the _P72_ parameter to point at the _A302_ source code.
fr: Si vous souhaitez construire des extensions supplémentaires (si vous n'êtes pas sûr, vous n'en avez probablement pas besoin), vous pouvez regarder le fichier _F966_ pour voir un exemple de la façon de modifier le paramètre _P72_ pour pointer vers le code source de _A302_.

source: Note that if you upgrade the kernel version, you may also need to recompile _A301_ and that the BLFS team has not tested using the raw kernel headers.
fr: Remarquez que si vous mettez à jour la version du noyau, il se peut que vous deviez aussi recompiler _A304_ et que l'équipe BLFS n'a pas testé l'utilisation des en-têtes du noyau raw.

source: For some non-x86 architectures, the raw kernel headers may be required.
fr: Pour certaines architectures non x86, il se peut qu'il faille les en-têtes du noyau raw.

source: In that case, modify the _P72_ parameter to point at the _A302_ source code.
fr: Dans ce cas, modifiez le paramètre _P72_ pour pointer vers le code source de _A302_.

source: Install _A301_ by running the following commands:
fr: Installez _A301_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This switch disables building nftables compat.
fr: Ce paramètre désactive la construction de la compatibilité nftables.

source: This switch enables building of _F182_ which can be used by some packages outside of BLFS.
fr: Ce paramètre active la construction de _F182_ qui peut être utilisé par certains paquets extérieurs à BLFS.

source: Ensure all _A301_ modules are installed in the _F183_ directory.
fr: Assure que les modules d'_A301_ sont installés dans le répertoire _F183_.

source: This switch enables installation of _A303_ SYNPROXY configuration tool.
fr: Ce paramètre active l'installation de l'outil de configuration SYNPROXY de _A303_.

source: Ensure the symbolic link for _C549_ is relative.
fr: Assure que le lien symbolique de _C549_ est relatif.

source: Configuring Iptables
fr: Configuration d'Iptables

source: Introductory instructions for configuring your firewall are presented in the next section:
fr: Des instructions d'introduction de configuration de votre pare-feu sont présentées dans la prochaine section :

source: Boot Script
fr: Script de démarrage

source: To set up the iptables firewall at boot, install the _F967_ init script included in the _X194_ package.
fr: Pour paramétrer le pare-feu d'iptables au démarrage, installez le script d'initialisation _F967_ fourni dans le paquet _X194_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: ip6tables, ip6tables-restore, ip6tables-save, iptables, iptables-restore, iptables-save, iptables-xml, nfsynproxy (optional) and xtables-multi
fr: ip6tables, ip6tables-restore, ip6tables-save, iptables, iptables-restore, iptables-save, iptables-xml, nfsynproxy (facultatif) et xtables-multi

source: Short Descriptions
fr: Descriptions courtes

source: is used to set up, maintain, and inspect the tables of IP packet filter rules in the Linux kernel.
fr: est utilisé pour paramétrer, maintenir et inspecter les tables de règles de filtrage de paquets IP du noyau Linux.

source: is used to restore IP Tables from data specified on STDIN.
fr: est utilisé pour restaurer des tables IP à partir de données spécifiées sur STDIN.

source: Use I/O redirection provided by your shell to read from a file.
fr: Utilise la redirection E/S fournie par votre shell pour lire un fichier.

source: is used to dump the contents of an IP Table in easily parseable format to STDOUT.
fr: est utilisé pour envoyer le contenu d'une table IP dans un format facilement analysable vers STDOUT.

source: Use I/O-redirection provided by your shell to write to a file.
fr: Utilisez la redirection E/S fournie par votre shell pour écrire dans un fichier.

source: is used to convert the output of _C552_ to an XML format.
fr: est utilisé pour convertir la sortie de _C552_ au format XML.

source: Using the _F968_ stylesheet converts the XML back to the format of _C551_ .
fr: L'utilisation de la feuille de style _F968_ convertit le fond XML au format _C551_.

source: are a set of commands for IPV6 that parallel the iptables commands above.
fr: sont un ensemble de commandes pour IPV6 qui sont similaires aux commandes iptables vu précédement.

source: (optional) configuration tool.
fr: (facultatif) outil de configuration.

source: SYNPROXY target makes handling of large SYN floods possible without the large performance penalties imposed by the connection tracking in such cases.
fr: La cible synproxy facilite la manipulation des grands afflux de SYN sans les lourdes pertes de performance imposées par le suivi des connexions dans de tels cas.

source: is a binary that behaves according to the name it is called by.
fr: est un binaire qui se comporte en fonction du nom par lequel il est appelé.
