Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/linux-pam.xml.1.chaine.po
Languages: fr

source: 33 MB (with tests)
fr: 33 Mo (avec les tests)

source: 0.3 SBU (with tests)
fr: 0.3 SBU (avec les tests)

source: 480 KB
fr: 480 Ko

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Optional Documentation
fr: Documentation facultative

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Install _A557_ by running the following commands:
fr: Installez _A557_ en lançant les commandes suivantes :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch sets install location for the _A570_ modules.
fr: Ce paramètre initialise l'emplacement pour les modules _A570_.

source: The _C1324_ helper program must be setuid so that non-_U1_ processes can access the shadow file.
fr: Le programme d'aide _C1324_ doit être setuid afin que les processus non-_U1_ puissent accéder au fichier shadow.

source: Configuring Linux-PAM
fr: Configuration de Linux-PAM

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Configuration information is placed in _F517_ .
fr: Les informations de configuration se trouvent dans _F517_.

source: Below is an example file:
fr: Voici ci-dessous un fichier exemple :

source: Now set up some generic files.
fr: Maintenant, initialisez certains fichiers génériques.

source: As root:
fr: En root :

source: The remaining generic file depends on wheather _X331_ is installed.
fr: Le fichier générique suivant dépend de l'installation de _X331_.

source: If it is installed, use:
fr: S'il est installé, utilisez :

source: In its default configuration, pam_cracklib will allow multiple case passwords as short as 6 characters, even with the _P173_ value set to 11.
fr: Dans la configuration par défaut, pam_cracklib permettra les mots de passe avec une case multiple d'au moins 6 caractères, avec la valeur _P173_ initialisée à 11.

source: You should review the pam_cracklib (8) man page and determine if these default values are acceptable for the security of your system.
fr: Vous devez revoir la page de man pam_cracklib (8) et déterminer si ces valeurs par défaut sont acceptable pour la sécurité de votre système.

source: If _X331_ is
fr: Si _X331_ n'est

source: NOT
fr: PAS

source: installed, use:
fr: installé, utilisez :

source: Now add a restrictive _F511_ configuration file.
fr: Maintenant ajoutez un fichier de configuration _F511_ restrictif.

source: With this file, programs that are PAM aware will not run unless a configuration file specifically for that application is created.
fr: Avec ce fichier, les programmes qui ne sont pas sous PAM ne pourront pas se lancer sans qu'un fichier de configration spécifique pour l'application ne soit créé.

source: The _A570_ man page (_C1325_ ) provides a good starting point for descriptions of fields and allowable entries.
fr: La page de man de _A570_ (_C1325_) offre un bon point de départ pour des descriptions des champs et des entrées autorisées.

source: The _L2851_ is recommended for additional information.
fr: Le _L2851_.

source: Refer to _L2852_ for a list of various third-party modules available.
fr: Référez vous à _L2852_ pour une liste des modules tiers disponibles.

source: You should now reinstall the _X338_ package.
fr: Vous devriez maintenant réinstaller le paquet _X338_.

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: mkhomedir_helper, pam_tally, pam_tally2, pam_timestamp_check, unix_chkpwd and unix_update
fr: mkhomedir_helper, pam_tally, pam_tally2, pam_timestamp_check, unix_chkpwd et unix_update

source: /etc/security, /lib/security, /usr/include/security and /usr/share/doc/Linux-PAM-&linux-pam-version;
fr: /etc/security, /lib/security, /usr/include/security et /usr/share/doc/Linux-PAM-&linux-pam-version;

source: Short Descriptions
fr: Descriptions courtes

source: is a helper binary that creates home directories.
fr: est un assistant binaire qui crée des répertoires home.

source: is used to interrogate and manipulate the login counter file.
fr: est utilisé pour interroger et manipuler le fichier compteur de login.

source: is used to interrogate and manipulate the login counter file, but does not have some limitations that _C1327_ does.
fr: est utilisé pour interroger et manipuler le fichier compteur de login sans certaines limitations de _C1327_.

source: is used to check if the default timestamp is valid
fr: est utilisé pour vérifier si l'horodatage par défaut est valide

source: is a helper binary that verifies the password of the current user.
fr: est un assistant binaire qui vérifie le mot de passe de l'actuel utilisateur.

source: is a helper binary that updates the password of a given user.
fr: est un assistant binaire qui met à jour le mot de passe d'un utilisateur donné.

source: provides the interfaces between applications and the PAM modules.
fr: fournit les interfaces entre les applications et les modules PAM.
