Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/mitkrb.xml.1.chaine.po
Languages: fr

source: 12 MB
fr: 12 Mo

source: 165 MB (additional 26 MB for the testsuite)
fr: 165 Mo (additional 26 Mo for the testsuite)

source: Introduction to MIT Kerberos V5
fr: Introduction à MIT Kerberos V5

source: Kerberos is a network authentication protocol.
fr: Kerberos est un protocole d'authentification réseau.

source: It centralizes the authentication database and uses kerberized applications to work with servers or services that support Kerberos allowing single logins and encrypted communication over internal networks or the Internet.
fr: Il centralise la base de données d'authentification et il utilise des applications kerberizées pour fonctionner avec des serveurs ou des services qui supportent Kerberos, ce qui permet des connexions isolées et une communication chiffrée sur des réseaux internes ou sur Internet.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: MIT Kerberos V5 Dependencies
fr: Dépendances de MIT Kerberos V5

source: Optional
fr: Optionnelles

source: Some sort of time synchronization facility on your system (like _X584_ ) is required since Kerberos won't authenticate if there is a time difference between a kerberized client and the KDC server.
fr: Certaines fonctionnalités de synchronisation du temps sur votre système (comme _X584_) sont nécessaires, étant donné que Kerberos n'authentifiera pas s'il y a une différence de temps entre un client kerberizé et le serveur KDC.

source: User Notes:
fr: Notes utilisateur :

source: Installation of MIT Kerberos V5
fr: Installation de MIT Kerberos V5

source: Build _A1113_ by running the following commands:
fr: Construisez _A1113_ en lançant les commandes suivantes :

source: To test the build, issue:
fr: Pour testez la construction, tapez :

source: You need at least _X161_ , which is used to drive the testsuite.
fr: Vous devez au moins avoir _X161_ , qui est utilisé pour piloter la suite de tests.

source: Furthermore, _X49_ must be available for some of the tests to run.
fr: De plus, _X49_ doit être disponible pour quelques tests.

source: If you have a former version of MIT Kerberos V5 installed, it may happen that the test suite pick up the installed versions of the libraries, rather than the newly built ones.
fr: Si vous avez une version de MIT Kerberos V5 d'installée, il peut arriver que la suite de tests utilisent les versions installées des bibliothèques, plutôt que celle fraichement construite.

source: If so, it is better to run the tests after the installation.
fr: Donc, il est mieux de lancer la suite de tests après l'installation.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: Configuring MIT Kerberos V5
fr: Configuration de MIT Kerberos V5

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Kerberos Configuration
fr: Configuration de Kerberos

source: You should consider installing some sort of password checking dictionary so that you can configure the installation to only accept strong passwords.
fr: Vous devriez songer à installer un dictionnaire de vérification des mots de passe afin de pouvoir configurer l'installation pour n'accepter que les mots de passe forts.

source: A suitable dictionary to use is shown in the _X383_ instructions.
fr: Un dictionnaire utilisable de manière convenable est indiqué dans les instructions pour _X383_.

source: Note that only one file can be used, but you can concatenate many files into one.
fr: Remarquez qu'on ne peut utiliser qu'un fichier, mais vous pouvez compacter plusieurs fichiers dans un seul.

source: The configuration file shown below assumes you have installed a dictionary to _F1438_ .
fr: Le fichier de configuration montré ci-dessous suppose que vous avez installé un dictionnaire dans _F1438_.

source: Create the Kerberos configuration file with the following commands issued by the _U2_ user:
fr: Créez le fichier de configuration Kerberos avec les commandes suivantes, que vous lancerez en tant qu'utilisateur _U2_ :

source: You will need to substitute your domain and proper hostname for the occurrences of the
fr: Vous devrez mettre votre nom de domaine et d'hôte à la place des occurrences des noms

source: and
fr: et

source: This isn't required, but both _A1114_ and MIT recommend it.
fr: Ce n'est pas nécessaire mais tant _A1114_ que MIT le recommandent.

source: It's not necessary and can be left off.
fr: Ce n'est pas nécessaire et vous pouvez le laisser désactivé.

source: If you leave it off, you can encrypt all traffic from the client to the server using a switch on the client program instead.
fr: Si vous le laissez désactivé, vous pouvez plutôt chiffrer tout le trafic du client vers le serveur en utilisant un paramètre sur le client.

source: The _O536_ parameters tell the client programs where to look for the KDC authentication services.
fr: Les paramètres _O537_ disent aux clients où chercher les services d'authentication KDC.

source: The _O307_ section maps a domain to a realm.
fr: La section _O307_ associe un nom de domaine à un domaine.

source: Create the KDC database:
fr: Créez la base de données KDC :

source: Now you should populate the database with principals (users).
fr: Maintenant vous devriez peupler la base de données avec des utilisateurs clés (utilisateurs).

source: For now, just use your regular login name or _U2_.
fr: Utilisez pour l'instant votre identifiant normal ou _U2_.

source: The KDC server and any machine running kerberized server daemons must have a host key installed:
fr: Le serveur KDC et les machines qui font fonctionner des démons kerberizés doivent avoir installée une clé d'hôte :

source: After choosing the defaults when prompted, you will have to export the data to a keytab file:
fr: Après avoir choisi les paramètres par défaut quand on vous y invite, vous devrez exporter les données vers un fichier de table de clé :

source: This should have created a file in _F175_ named _F1471_ (Kerberos 5).
fr: Cela devrait créer un fichier dans _F175_ nommé _F1471_ (Kerberos 5).

source: Keeping the keytab files from public access is crucial to the overall security of the Kerberos installation.
fr: ôter de l'accès public les fichiers de tables de clés est crucial pour toute la sécurité de l'installation de Kerberos.

source: Exit the _C2322_ program (use _C2323_ or _C1779_ ) and return back to the shell prompt.
fr: Quittez le programme _C2322_ (utilisez _C2323_ ou _C1779_) et retournez à l'invite du shell.

source: Start the KDC daemon manually, just to test out the installation:
fr: Démarrez à la main le démon KDC, simplement pour tester l'installation :

source: Attempt to get a ticket with the following command:
fr: Essayez d'obtenir un ticket avec la commande suivante :

source: You will be prompted for the password you created.
fr: On vous demandera le mot de passe que vous avez créé.

source: After you get your ticket, you can list it with the following command:
fr: Après avoir obtenu votre ticket, vous pouvez le lister avec la commande suivante :

source: Information about the ticket should be displayed on the screen.
fr: Des informations sur le ticket devrait apparaître à l'écran.

source: To test the functionality of the keytab file, issue the following command:
fr: Pour tester le fonctionnement du fichier de table de clé, exécutez la commande suivante :

source: This should dump a list of the host principal, along with the encryption methods used to access the principal.
fr: Cela devrait renvoyer une liste d'utilisateurs clés hôtes, ainsi que les méthodes de chiffrement utilisées pour accéder à l'utilisateur clé.

source: At this point, if everything has been successful so far, you can feel fairly confident in the installation and configuration of the package.
fr: À ce moment-là, si tout s'est bien passé jusqu'ici, vous pouvez avoir confiance dans l'installation, le paramétrage et la configuration du paquet.

source: Additional Information
fr: Informations supplémentaires

source: For additional information consult the _L2722_ on which the above instructions are based.
fr: Pour des informations supplémentaires, consultez _L2723_.

source: Init Script
fr: Script de démarrage

source: If you want to start _A1115_ services at boot, install the _F1472_ init script included in the _X194_ package using the following command:
fr: Si vous voulez démarrer des services _A1115_ au démarrage, installez le script de démarrage _F1472_ inclu dans le paquet _X194_ en utilisant la commande suivante :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: gss-client, gss-server, k5srvutil, kadmin, kadmin.local, kadmind, kdb5_ldap_util (optional), kdb5_util, kdestroy, kinit, klist, kpasswd, kprop, kpropd, kproplog, krb5-config, krb5kdc, krb5-send-pr, ksu, kswitch, ktutil, kvno, sclient, sim_client, sim_server, sserver, uuclient and uuserver
fr: gss-client, gss-server, k5srvutil, kadmin, kadmin.local, kadmind, kdb5_ldap_util (facultatif), kdb5_util, kdestroy, kinit, klist, kpasswd, kprop, kpropd, kproplog, krb5-config, krb5kdc, krb5-send-pr, ksu, kswitch, ktutil, kvno, sclient, sim_client, sim_server, sserver, uuclient et uuserver

source: libgssapi_krb5.so, libgssrpc.so, libk5crypto.so, libkadm5clnt_mit.so, libkadm5clnt.so, libkadm5srv_mit.so, libkadm5srv.so, libkdb_ldap.so (optional), libkdb5.so, libkrad.so, libkrb5.so, libkrb5support.so, libverto.so, and some plugins under the /usr/lib/krb5 tree
fr: libgssapi_krb5.so, libgssrpc.so, libk5crypto.so, libkadm5clnt_mit.so, libkadm5clnt.so, libkadm5srv_mit.so, libkadm5srv.so, libkdb_ldap.so (facultatif), libkdb5.so, libkrad.so, libkrb5.so, libkrb5support.so, libverto.so, et plusieurs plugins sous l'arborescence /usr/lib/krb5

source: /usr/include/{gssapi, gssrpc, kadm5, krb5}, /usr/lib/krb5, /usr/share/{doc/krb5-&mitkrb-version;, examples/krb5}, and /var/lib/{, run}/krb5kdc
fr: /usr/include/{gssapi, gssrpc, kadm5, krb5}, /usr/lib/krb5, /usr/share/{doc/krb5-&mitkrb-version;, examples/krb5}, et /var/lib/{, run}/krb5kdc

source: Short Descriptions
fr: Descriptions courtes

source: is a GSSAPI test client.
fr: est un client GSSAPI de tests.

source: is a GSSAPI test server.
fr: est un serveur GSSAPI de tests.

source: is a host keytable manipulation utility.
fr: est un outil de manipulation de tables de clés hôtes.

source: is a utility used to make modifications to the Kerberos database.
fr: est un utilitaire similaire à _C2322_ , mais si la base de données est db2, le client local _C2327_ , est prévu pour se lancer directement sur le KDC maitre sans authentification Kerberos.

source: is a utility similar at _C2322_ , but if the database is db2, the local client _C2327_ , is intended to run directly on the master KDC without Kerberos authentication.
fr: est un outil utilisé pour faire des modifications dans la base de données Kerberos.

source: is a server for administrative access to a Kerberos database.
fr: est un serveur d'accès pour administrer une base de données Kerberos.

source: allows an administrator to manage realms, Kerberos services and ticket policies.
fr: permet à l'administrateur de gérer realms, les services Kerberos et la politiques de billets.

source: is the KDC database utility.
fr: est l'outil de base de données KDC.

source: removes the current set of tickets.
fr: supprime le jeu de tickets actuel.

source: is used to authenticate to the Kerberos server as a principal and acquire a ticket granting ticket that can later be used to obtain tickets for other services.
fr: est utilisé pour s'authentifier sur le serveur Kerberos en tant qu'utilisateur clé et obtenir un ticket autorisant un ticket pouvant être utilisé plus tard pour obtenir des tickets pour d'autres services.

source: reads and displays the current tickets in the credential cache.
fr: lit et affiche les tickets actuels du cache de permissions.

source: is a program for changing Kerberos 5 passwords.
fr: est un programme pour modifier des mots de passe Kerberos 5.

source: takes a principal database in a specified format and converts it into a stream of database records.
fr: prend une base de données d'utilisateurs clés dans un format spécifié et la convertit dans un flux d'enregistrements de base de données.

source: receives a database sent by _C2335_ and writes it as a local database.
fr: reçoit une base de données envoyée par _C2335_ et l'écrit en tant que base de données locale.

source: displays the contents of the KDC database update log to standard output.
fr: affiche le contenu du log de mise à jour de la base de données KDC sur la sortie standard.

source: gives information on how to link programs against libraries.
fr: donne des informations sur la façon de lier des programmes aux bibliothèques.

source: is the _A1009_ server.
fr: est un serveur _A1009_.

source: send problem report (PR) to a central support site.
fr: envoi les signalements de problèmes (PR) sur un site centralisé.

source: is the super user program using Kerberos protocol.
fr: est le programme super utilisateur utilisant le protocole Kerberos.

source: Requires a properly configured _F669_ and _F1473_ containing principals authorized to become super users.
fr: Exige un _F669_ correctement configuré et un _F1473_ contenant des utilisateurs clés autorisés à devenir super utilisateurs.

source: makes the specified credential cache the primary cache for the collection, if a cache collection is available.
fr: met en cache les tickets sécifiés, le premier cache pour l'ensemble, si un groupe de caches est disponible.

source: is a program for managing Kerberos keytabs.
fr: est le programme de gestion des tables de clés Kerberos.

source: prints keyversion numbers of Kerberos principals.
fr: affiche des numéros de version de clés des utilisateurs clés Kerberos.

source: used to contact a sample server and authenticate to it using Kerberos 5 tickets, then display the server's response.
fr: utilisé pour contacter un serveur modèle et s'y authentifier en utilisant des tickets de Kerberos version 5, puis affiche la réponse du serveur.

source: is a simple UDP-based sample client program, for demonstration.
fr: est un programme exemple de client basé sur UDP pour démonstration.

source: is a simple UDP-based server application, for demonstration.
fr: est un programme exemple de serveur basé sur UDP pour démonstration.

source: is the sample Kerberos 5 server.
fr: est un modèle de serveur Kerberos version 5.

source: is an another sample client.
fr: est un autre exemple de client.

source: is an another sample server.
fr: est un autre exemple de serveur.

source: contain the Generic Security Service Application Programming Interface (GSSAPI) functions which provides security services to callers in a generic fashion, supportable with a range of underlying mechanisms and technologies and hence allowing source-level portability of applications to different environments.
fr: contient les fonctions _fpo_Generic Security Service Application Programming Interface_fpf_ (GSSAPI, interface de programmation d'application de service de sécurité générique) qui fournit des services de sécurité aux appelants de manière courante, supportable par une vaste gamme de mécanismes et de technologies sous-jacentes, permettant donc une portabilité au niveau du code source d'applications vers différents environnements.

source: contains the administrative authentication and password checking functions required by Kerberos 5 client-side programs.
fr: contient les fonctions de vérification de l'authentification et du mot de passe pour l'administration exigées par les programmes côté client Kerberos 5.

source: contain the administrative authentication and password checking functions required by Kerberos 5 servers.
fr: contient les fonctions de vérification de l'authentification et du mot de passe pour l'administration exigées par les serveurs Kerberos 5.

source: is a Kerberos 5 authentication/authorization database access library.
fr: est une bibliothèque d'accès à la base de données Kerberos 5 d'authentication/autorisation.

source: contains the internal support library for RADIUS functionality.
fr: contient la bibliothèque de support interne des fonctionnalités RADIUS.

source: is an all-purpose _A1009_ library.
fr: est une bibliothèque _A1009_ généraliste.
