Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/openssh.xml.1.chaine.po
Languages: fr

source: 1.5 MB
fr: 1.5 Mo

source: 43 MB (51 MB, with tests)
fr: 43 Mo (51 Mo, avec les tests)

source: Introduction to OpenSSH
fr: Introduction à OpenSSH

source: The _A321_ package contains _C819_ clients and the _C1205_ daemon.
fr: Le paquet _A321_ contient des clients _C819_ et le démon _C1205_.

source: This is useful for encrypting authentication and subsequent traffic over a network.
fr: C'est utile dans le cadre d'une authentification chiffrée et d'un trafic réseau consécutif sur un réseau.

source: The _C819_ and _C1206_ commands are secure implementions of _C764_ and _C1207_ respectively.
fr: Les commandes _C819_ et _C1206_ sont des implémentions sécurisées, respectivement de _C764_ et de _C1207_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: OpenSSH Dependencies
fr: Dépendances d'OpenSSH

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: Optional Runtime (Used only to gather entropy)
fr: Facultatives pour l'exécution (Utilisé seulement pour modifier l'entropie)

source: User Notes:
fr: Notes utilisateur :

source: Installation of OpenSSH
fr: Installation d'OpenSSH

source: The first process is a privileged process and controls the issuance of privileges as necessary.
fr: Le premier processus est un processus privilégié et il contrôle comme il faut l'émission de privilèges.

source: The second process communicates with the network.
fr: Le deuxième processus communique avec le réseau.

source: Additional installation steps are necessary to set up the proper environment, which are performed by issuing the following commands as the _U1_ user:
fr: Des étapes d'installation supplémentaires sont nécessaires pour paramétrer le bon environnement, effectuées en lançant les commandes suivantes en tant qu'utilisateur _U1_ :

source: Install _A321_ by running the following commands:
fr: Installez _A321_ en lançant les commandes suivantes :

source: The testsuite requires an installed copy of _C1206_ to complete the multiplexing tests.
fr: La suite de tests demande l'installation d'une copie de _C1206_ pour finir les tests de multiplexage.

source: To run the test suite, first copy the _C1206_ program to _F223_ , making sure that you back up any existing copy first.
fr: Pour lancer la suite de tests, commencez par copier le programme _C1206_ dans _F223_ , en faisant attention que vous ayez une sauvegarde de tous les fichiers existants.

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This prevents the configuration files from being installed in _F451_ .
fr: Ceci empêche les fichiers de configuration de s'installer dans _F451_.

source: This enables the use of MD5 passwords.
fr: C'est nécessaire avec la configuration par défaut de la suite de mots de passe Shadow dans LFS.

source: This parameter enables _A256_ support in the build.
fr: Ce paramètre active le support de _A256_ dans la construction.

source: Set the default location for the _C1208_ binary for X authentication.
fr: Règle l'emplacement par défaut du binaire _C1208_ pour l'authentication X.

source: Change the location if _C1208_ will be installed to a different path.
fr: Modifiez l'emplacement si _C1208_ sera installé à un autre endroit.

source: This can also be controlled from _F452_ with the XAuthLocation keyword.
fr: Vous pouvez aussi contrôler cela depuis _F452_ avec le mot-clé XAuthLocation.

source: You can omit this switch if _A200_ is already installed.
fr: Vous pouvez vous passer de cette option si _A200_ est déjà installé.

source: This option is used to include Kerberos 5 support in the build.
fr: Cette option est utilisée pour inclure le support Heimdal dans la construction.

source: This option enables line editing and history features for _C1209_ .
fr: Cette option active les possibilités d'édition de lignes et d'historique pour _C1209_.

source: Configuring OpenSSH
fr: Configuration d'OpenSSH

source: Config Files
fr: Fichiers de configuration

source: Boot Script
fr: Script de démarrage

source: To start the SSH server at system boot, install the _F457_ init script included in the _X203_ package.
fr: Pour lancer le serveur SSH au démarrage du système, installez le script de démarrage _F457_ fourni dans le paquet _X203_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: None
fr: Aucun

source: /etc/ssh, /usr/share/doc/openssh-&openssh-version;, and /var/lib/sshd
fr: /etc/ssh, /usr/share/doc/openssh-&openssh-version;, et /var/lib/sshd

source: Short Descriptions
fr: Descriptions courtes

source: is a file copy program that acts like _C1207_ except it uses an encrypted protocol.
fr: est un programme de copie de fichier agissant comme _C1207_ sauf qu'il utilise un protocole chiffré.

source: is an FTP-like program that works over the SSH1 and SSH2 protocols.
fr: est un programme de genre FTP fonctionnant sur les protocoles SSH1 et SSH2.

source: is a symlink to _C819_ .
fr: est un lien symbolique vers _C819_.

source: is an _C768_ /_C1213_ -like client program except it uses an encrypted protocol.
fr: est un client du type _C768_ /_C1213_ sauf qu'il utilise un protocole chiffré.

source: is a daemon that listens for _C819_ login requests.
fr: est un démon qui écoute les requêtes de connexion _C819_ login.

source: is a tool which adds keys to the _C1211_ .
fr: est un outil qui ajoute des clés à _C1211_.

source: is an authentication agent that can store private keys.
fr: est un agent d'authentication qui peut stocker des clés privées.

source: is a script that enables logins on remote machine using local keys.
fr: est un script qui active les logins sur la machine distante en utilisant les clés local.

source: is a key generation tool.
fr: est un outil de génération de clés.

source: is a utility for gathering public host keys from a number of hosts.
fr: est un outil pour réunir des clés d'hôte publiques à partir d'un certain nombre d'hôtes.
