Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/openssl.xml.1.chaine.po
Languages: fr

source: 5.1 MB
fr: 5.1 Mo

source: 63 MB (with tests)
fr: 63 Mo (avec les tests)

source: 1.5 SBU (with tests)
fr: 1.5 SBU (avec les tests)

source: Introduction to OpenSSL
fr: Introduction à OpenSSL

source: The _A587_ package contains management tools and libraries relating to cryptography.
fr: Le paquet _A587_ contient des outils et des bibliothèques de gestion en matière de chiffrement.

source: These are useful for providing cryptography functions to other packages, such as _A321_ , email applications and web browsers (for accessing HTTPS sites).
fr: Elles sont utiles pour fournir des fonctions de cryptographie à d'autres paquets, en particulier _A321_ , des applications de messagerie électronique et des navigateurs Internet (pour accéder à des sites commençant par HTTPS).

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: OpenSSL Dependencies
fr: Dépendances d'OpenSSL

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of OpenSSL
fr: Installation de OpenSSL

source: Install _A587_ with the following commands:
fr: Installez _A587_ avec les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: If you want to disable installing the static libraries, use this sed:
fr: Si vous voulez désactiver l'installation des bibliothèques statiques, utilisez la commande sed :

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This parameter forces the creation of shared libraries along with the static libraries.
fr: Ce paramètre oblige la création des bibliothèques partagées ainsi que des bibliothèques statiques.

source: This parameter adds compression/decompression functionality using the _F526_ library.
fr: Ce paramètre ajoute une fonction de compression/décompression en utilisant la bibliothèque _F526_.

source: When added to the _C1349_ command, this will eliminate the building of those encryption methods.
fr: Ajouté à la commande _C1349_ , cela éliminera la construction de ces méthodes de chiffrement.

source: Patent licenses may be needed for you to utilize either of those methods in your projects.
fr: Il se peut que des licences d'autorisation soient nécessaires pour que vous utilisiez une de ces méthodes dans vos projets.

source: This command installs _A587_ with the man pages in _F28_ instead of _F527_ and appends "ssl" suffix to the manual page names to avoid conflicts with manual pages installed by other packages.
fr: Cette commande installe _A587_ avec les pages de manuel dans _F28_ au lieu de _F527_ et ajoute le suffix "ssl" aux noms des pages de manuel pour éviter les conflits avec les pages de manuel installées par d'autres paquets.

source: Configuring OpenSSL
fr: Configuration d'OpenSSL

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Most users will want to install Certificate Authority Certificates for validation of downloaded certificates.
fr: La plupart des utilisateurs voudront installer les certificats de l'Autorité des certificats pour valider les certificats téléchargés.

source: or
fr: ou

source: Users who just want to use _A587_ for providing functions to other programs such as _A321_ and web browsers do not need to worry about additional configuration.
fr: Les utilisateurs qui veulent simplement utiliser _A587_ pour offrir les fonctions à d'autres programmes tels que _A321_ et des navigateurs Internet n'ont pas besoin de s'inquiéter de faire une configuration supplémentaire.

source: This is an advanced topic and so those who do need it would normally be expected to either know how to properly update _F528_ or be able to find out how to do it.
fr: C'est un sujet avancé et ceux qui en ont vraiment besoin devraient, en principe, soit savoir comment mettre à jour correctement _F528_ , soit être en mesure de trouver la manière de le faire.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: c_rehash and openssl
fr: c_rehash et openssl

source: libcrypto.{so, a} and libssl.{so, a}
fr: libcrypto.{so, a} et libssl.{so, a}

source: /etc/ssl, /usr/include/openssl, /usr/lib/engines and /usr/share/doc/openssl-&openssl-version;
fr: /etc/ssl, /usr/include/openssl, /usr/lib/engines et /usr/share/doc/openssl-&openssl-version;

source: Short Descriptions
fr: Descriptions courtes

source: is a _A107_ script that scans all files in a directory and adds symbolic links to their hash values.
fr: est un script _A107_ qui analyse tous les fichiers d'un répertoire et qui ajoute des liens symboliques à leurs valeurs hachées.

source: It can be used for various functions which are documented in _C1353_ .
fr: On peut l'utiliser pour diverses fonctions qui sont documentées dans _C1353_.

source: implements a wide range of cryptographic algorithms used in various Internet standards.
fr: implémente une grande variété d'algorithmes de chiffrement utilisés dans divers standards Internet.

source: The services provided by this library are used by the _A587_ implementations of SSL, TLS and S/MIME, and they have also been used to implement _A321_ , _A588_ , and other cryptographic standards.
fr: Les services offerts par cette bibliothèque sont utilisés par des implémentations _A587_ de SSL, de TLS et de S/MIME, et on les utilise aussi pour implémenter _A321_ , _A588_ , et d'autres standards de chiffrement.

source: It provides a rich API, documentation on which can be found by running _C1354_ .
fr: Elle offre une API riche, sur laquelle vous pouvez trouver de la documentation en lançant _C1354_.
