Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/polkit.xml.1.chaine.po
Languages: fr

source: 1.4 MB
fr: 1.4 Mo

source: 15 MB
fr: 15 Mo

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Required
fr: Requises

source: Optional (Required if building GNOME)
fr: Optionnelles (nécessaires si vous construisez GNOME)

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Polkit
fr: Installation de polkit

source: There should be a dedicated user and group to take control of the _C1199_ daemon after it is started.
fr: Il doit y avoir un utilisateur et un groupe dédié pour prendre le contrôle du démon _C1199_ après son démarrage.

source: Issue the following commands as the _U1_ user:
fr: Tapez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Install _A237_ by running the following commands:
fr: Installez _A237_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Note that system _A5_ daemon must be running for the testsuite to complete.
fr: Notez que le démon système _A5_ doit être lancé pour que la suite de tests puisse finir.

source: There is also a warning about _A40_ database not present, but that one can be safely ignored.
fr: Il y a également un avertisement à propos de l'absence de base de données _A40_ , mais il peut être ignoré sans danger.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This parameter fixes building without _A235_ , which is not part of LFS/BLFS.
fr: Ce paramètre corrige la construction sans _A235_ , qui ne fait pas partie de LFS/BLFS.

source: If you use _A235_ , replace "no" by "yes".
fr: Si vous utilisez _A235_ , remplacez "no" par "yes".

source: This parameter configures the package to use the _A556_ rather than the _A557_ Authentication framework.
fr: Ce paramètre configure le paquet pour utiliser le système d'authentification _A556_ au lieu de _A557_.

source: Remove it if you would like to use _A557_ .
fr: Supprimez-le si vous voulez utiliser _A557_.

source: Configuring Polkit
fr: Configuration de polkit

source: PAM Configuration
fr: Configuration de PAM

source: If you did not build _A237_ with _A557_ support, you can skip this section.
fr: Si vous n'avez pas construit _A237_ avec le support _A557_ , vous pouvez sauter cette section.

source: If you have built _A237_ with _A557_ support, you need to modify the default PAM configuration file which was installed by default to get _A237_ to work correctly with BLFS.
fr: Si vous avez construit _A557_ avec le support _A237_ , vous devrez modifier le fichier de configuration de pam qui a été installé par défaut pour que _A237_ fonctionne correctement avec BLFS.

source: Issue the following commands as the _U1_ user to create the configuration file for _A557_ :
fr: Tapez les commandes suivantes en tant qu'utilisateur _U1_ pour créer le fichier de configuration pour _A557_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: pkaction, pkcheck, pk-example-frobnicate, pkexec, pkttyagent and polkitd
fr: pkaction, pkcheck, pk-example-frobnicate, pkexec, pkttyagent et polkitd

source: libpolkit-agent-1.so and libpolkit-gobject-1.so
fr: libpolkit-agent-1.so et libpolkit-gobject-1.so

source: /etc/polkit-1, /usr/include/polkit-1, /usr/lib/polkit-1, /usr/share/gtk-doc/html/polkit-1 and /usr/share/polkit-1
fr: /etc/polkit-1, /usr/include/polkit-1, /usr/lib/polkit-1, /usr/share/gtk-doc/html/polkit-1 et /usr/share/polkit-1

source: Short Descriptions
fr: Descriptions courtes

source: is used to obtain information about registered PolicyKit actions.
fr: est utilisé pour obtenir des informations sur les actions PolicyKit enregistrées.

source: is used to check whether a process is authorized for action.
fr: est utilisé pour vérifier si un processus est autorisé à faire une action.

source: is an example program to test the _C1203_ command.
fr: est une programme exemple pour tester la commande _C1203_.

source: allows an authorized user to execute a command as another user.
fr: permet à un utilisateur autorisé d'exécuter une commande en tant qu'utilisateur différent.

source: is used to start a textual authentication agent for the subject.
fr: est utilisé pour démarrer un l'agent d'authentification en mode texte.

source: provides the org.freedesktop.PolicyKit1 _A5_ service on the system message bus.
fr: fournit le service _A5_ de org.freedesktop.PolicyKit1 sur le bus de message du système.

source: contains the _A237_ authentication agent API functions.
fr: contient les fonctions de l'API de _A237_ pour l'authentification.

source: contains the _A237_ authorization API functions.
fr: contient les fonctions de l'API d'authentification _A237_.
