Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/security.xml.1.chaine.po
Languages: fr

source: Security
fr: Sécurité

source: Security takes many forms in a computing environment.
fr: La sécurité revêt de nombreuses formes dans un environnement informatique.

source: After some initial discussion, this chapter gives examples of three different types of security:
fr: Après des considérations générales, ce chapitre donne des exemples de trois types différents de sécurité :

source: access, prevention and detection.
fr: l'accès, la prévention et la détection.

source: Access for users is usually handled by _C2131_ or an application designed to handle the login function.
fr: L'accès aux utilisateurs est géré en général par _C2131_ ou une application conçue pour gérer la fonction de connexion.

source: In this chapter, we show how to enhance _C2131_ by setting policies with _A587_ modules.
fr: Dans ce chapitre, nous indiquons la façon d'améliorer _C2131_ en mettant en place des règles avec des modules _A587_.

source: Access via networks can also be secured by policies set by _A304_ , commonly referred to as a firewall.
fr: L'Accès par des réseaux peut également être sécurisé par des règles définies par _A304_ , désignées en général sous le nom de pare-feu.

source: The Network Security Services (NSS) and Netscape Portable Runtime (NSPR) libraries can be installed and shared among the many applications requiring them.
fr: Les bibliothèques _fpo_Network Security Services_fpf_ (services de sécurité réseau) (NSS) et les _fpo_Netscape Portable Runtime_fpf_.

source: For applications that don't offer the best security, you can use the _A298_ package to wrap an application daemon inside an SSL tunnel.
fr: Pour des applications qui n'offrent pas la meilleure sécurité, vous pouvez utiliser le paquet _A298_ pour envelopper le démon d'une application dans un tunnel SSL.

source: Prevention of breaches, like a trojan, are assisted by applications like _A46_ , specifically the ability to confirm signed packages, which recognizes modifications of the tarball after the packager creates it.
fr: La prévention des infractions tels les trojans est assurée par des applications comme _A46_ , surtout la possibilité de confirmer les paquets signés, qui reconnaît les modifications des archives tar après que le packageur l'a créée.

source: Finally, we touch on detection with a package that stores "signatures" of critical files (defined by the administrator) and then regenerates those "signatures" and compares for files that have been changed.
fr: Enfin, nous travaillons sur la détection avec un paquet qui stocke les « signatures » de fichiers critiques (définis par l'administrateur) puis qui regénère ces « signatures » et les compare à la recherche de fichiers modifiés.
