Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/shadow.xml.1.chaine.po
Languages: fr

source: 1.5 MB
fr: 1.5 Mo

source: 53 MB
fr: 53 Mo

source: Introduction to Shadow
fr: Introduction à Shadow

source: If you have installed _A574_ after LFS, then reinstalling _A556_ will enable strong password support.
fr: Si vous avez installé _A574_ après LFS, la réinstallation de _A556_ activera le support des mots de passe renforcés.

source: If you have installed _A256_ , reinstalling _A556_ will allow programs such as _C1290_ and _C1369_ to utilize PAM.
fr: Si vous avez installé _A256_ , la réinstallation de _A556_ permettra à des programmes tels que _C1290_ et _C1369_ d'utiliser PAM.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Shadow Dependencies
fr: Dépendances de Shadow

source: Required
fr: Requises

source: User Notes:
fr: Notes utilisateur :

source: Installation of Shadow
fr: Installation de Shadow

source: The installation commands shown below are for installations where _A256_ has been installed (with or without a _A574_ installation) and _A556_ is being reinstalled to support the _A256_ installation.
fr: Les commandes d'installation indiquées ci-dessous valent pour les installations où on a installé _A256_ (avec ou sans installation _A574_) et _A556_ devra être réinstallé pour supporter l'installation _A256_.

source: If you are reinstalling _A556_ to provide strong password support using the _A574_ library without using _A256_ , ensure you add the _P188_ parameter to the _C121_ script below and also issue the following command:
fr: Si vous réinstallez _A556_ pour offrir le support des mots de passe forts en utilisant la bibliothèque _A574_ sans utiliser _A256_ , assurez-vous d'ajouter le paramètre _P188_ au script _C121_ ci-dessous et lancez aussi la commande suivante :

source: Reinstall _A556_ by running the following commands:
fr: Réinstallez _A556_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This sed is used to suppress the installation of the _C1371_ program as the version from the _A591_ package installed during LFS is preferred.
fr: Cette commande est utilisée pour supprimer l'installation du programme _C1371_ vu qu'on préfère la version issue du paquet _A591_ installé avec LFS.

source: This command is used to suppress the installation of the _C1371_ man pages so the existing ones installed from the _A591_ package are not replaced.
fr: Cette commande est utilisée pour supprimer l'installation des pages de man _C1371_ pour que ceux existant et issus du paquet _A591_ ne sont pas remplacés.

source: It also changes the obsolete _F540_ location for user mailboxes that _A556_ uses by default to the _F541_ location.
fr: Elle modifie aussi l'emplacement _F540_ obsolète pour les boîtes aux lettres utilisateur qu'utilise _A556_ par défaut en emplacement _F541_.

source: Make a minor change to make the default useradd consistent with the LFS groups file.
fr: Fait une modification mineur pour faire que l'ajout de l'utilisateur par défaut soit cohérent avec le fichier groups de LFS.

source: The maximum user name is 32 characters.
fr: Le nom d'utilisateur utilise au maximum 32 caractères.

source: Make the maximum group name the same.
fr: Faites la même chose pour le nom du groupe.

source: The _C766_ program may be needed during times when the _F190_ filesystem is not mounted so it is moved into the root partition.
fr: Le programme _C766_ peut être nécessaire aux moments où le système de fichiers _F190_ n'est pas monté pour qu'il soit déplacé dans la partition racine.

source: Configuring Shadow
fr: Configuration de Shadow

source: One default parameter causes _C1376_ to create a mailbox file for any newly created user.
fr: Un paramètre par défaut a pour conséquence que _C1376_ crée un fichier de boîte aux lettres pour chaque nouvel utilisateur créé.

source: If you would prefer that these mailbox files are not created by _C1376_ , issue the following command as the _U1_ user:
fr: Si vous préféreriez que ces fichiers boîtes aux lettres ne soient pas créés par _C1376_ , lancez la commande suivante en tant qu'utilisateur _U1_ :

source: Configuring Linux-PAM to Work with Shadow
fr: Configuration de Linux-PAM pour fonctionner avec Shadow

source: The rest of this page is devoted to configuring _A556_ to work properly with _A256_ .
fr: Le reste de cette page est consacré à la configuration de _A556_ pour fonctionner correctement avec _A256_.

source: If you do not have _A256_ installed, and you reinstalled _A556_ to support strong passwords via the _A574_ library, no further configuration is required.
fr: Si vous n'avez pas installé _A256_ et si vous avez réinstallé _A556_ pour supporter les mots de passe forts via la bibliothèque _A574_ , aucune configuration supplémentaire n'est nécessaire.

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Configuring your system to use _A256_ can be a complex task.
fr: La configuration de votre système pour utiliser _A256_ peut être une tâche complexe.

source: Review the information and links on the _X130_ page for further configuration information.
fr: Regardez les informations et les liens sur la page _X130_ pour des informations de configuration supplémentaires.

source: For information specific to integrating _A556_ , _A256_ and _A574_ , you can visit the following link:
fr: Pour des informations spécifiques à l'intégration de _A556_ , _A256_ et _A574_ , vous pouvez visiter les liens suivants :

source: Configuring /etc/login.defs
fr: Configuration de /etc/login.defs

source: The _C1290_ program currently performs many functions which _A256_ modules should now handle.
fr: Le programme _C1290_ effectue actuellement beaucoup de fonctions que les modules _A256_ devraient maintenant gérer.

source: Issue the following commands as the _U1_ user:
fr: Tapez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Configuring the /etc/pam.d/ Files
fr: Configuration des fichiers /etc/pam.d/

source: As mentioned previously in the _A256_ instructions, _A256_ has two supported methods for configuration.
fr: Comme indiqué précédemment dans les instructions pour _A256_ , _A256_ supporte deux méthodes de configuration.

source: You can optionally use a single _F250_ configuration file by using the text from the files below, and supplying the program name as an additional first field for each line.
fr: Vous pouvez éventuellement utiliser un seul fichier de configuration _F250_ en utilisant le texte de configuration des fichiers ci-dessous, en fournissant le nom du programme comme premier champ à chaque ligne.

source: As the _U1_ user, replace the following _A256_ configuration files in the _F517_ directory (or add the contents to the _F250_ file) using the following commands:
fr: En tant qu'utilisateur _U1_, remplacez les fichiers de configuration _A256_ suivants dans le répertoire _F517_ (ou ajoutez le contenu du fichier _F250_) en utilisant les commandes suivantes :

source: Other common programs
fr: Autres programmes utiles

source: At this point, you should do a simple test to see if _A556_ is working as expected.
fr: À cette étape, vous devriez faire un simple test pour voir si _A556_ fonctionne comme prévu.

source: Open another terminal and log in as a user, then _C1369_ to _U1_ .
fr: Ouvrez un autre terminal et connectez-vous en tant qu'utilisateur, puis _C1369_ en _U1_.

source: If you do not see any errors, then all is well and you should proceed with the rest of the configuration.
fr: Si vous ne voyez pas d'erreurs, tout va bien et vous devriez poursuivre le reste de la configuration.

source: If you did receive errors, stop now and double check the above configuration files manually.
fr: Si vous avez reçu des erreurs, arrêtez-vous maintenant et vérifiez à deux reprises les fichiers de configuration ci-dessus à la main.

source: You can also run the test suite from the _A256_ package to assist you in determining the problem.
fr: Vous pouvez aussi lancer la suite de tests à partir du paquet _A256_ pour vous aider à déterminer le problème.

source: If you cannot find and fix the error, you should recompile _A556_ adding the _O155_ switch to the _C121_ command in the above instructions (also move the _F543_ backup file to _F542_ ).
fr: Si vous n'arrivez pas à trouver et à corriger l'erreur, vous devriez recompiler _A556_ en ajoutant le paramètre _O155_ à la commande _C121_ dans les instructions ci-dessus (déplacez aussi le fichier de sauvegarde _F543_ dans _F542_).

source: If you fail to do this and the errors remain, you will be unable to log into your system.
fr: Si vous n'arrivez pas à faire cela et si les erreurs demeurent, vous ne pourrez pas vous connecter à votre système.

source: Configuring Login Access
fr: Configuration de l'accès Login

source: Instead of using the _F544_ file for controlling access to the system, _A256_ uses the _F545_ module along with the _F546_ file.
fr: Au lieu d'utiliser le fichier _F544_ pour contrôler l'accès au système, _A256_ utilise le module _F545_ ainsi que le fichier _F546_.

source: Rename the _F544_ file using the following command:
fr: Renommez le fichier _F544_ en utilisant la commande suivante :

source: Configuring Resource Limits
fr: Configuration des limitations de ressources

source: Instead of using the _F547_ file for limiting usage of system resources, _A256_ uses the _F548_ module along with the _F549_ file.
fr: Au lieu d'utiliser le fichier _F547_ pour limiter l'utilisation des ressources système, _A256_ utilise le module _F548_ ainsi que le fichier _F549_.

source: Rename the _F547_ file using the following command:
fr: Renommez le fichier _F547_ en utilisant la commande suivante :

source: Be sure to test the login capabilities of the system before logging out.
fr: Soyez certain de tester les possibilités de login sur le système avant de quitter.

source: Contents
fr: Contenu

source: A list of the installed files, along with their short descriptions can be found at _L3390_ .
fr: Vous pouvez trouver une liste des fichiers installés ainsi que leurs descriptions courtes sur _L3390_.
