Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/stunnel.xml.1.chaine.po
Languages: fr

source: 628 KB
fr: 628 Ko

source: 6.9 MB
fr: 6.9 Mo

source: Introduction to stunnel
fr: Introduction à Stunnel

source: The _A550_ package contains a program that allows you to encrypt arbitrary TCP connections inside SSL (Secure Sockets Layer) so you can easily communicate with clients over secure channels.
fr: Le paquet _A550_ contient un programme qui vous permet de chiffrer des connexions TCP de votre choix en SSL (Secure Sockets Layer) pour que vous puissiez communiquer facilement avec des clients par des canaux sécurisés.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: stunnel Dependencies
fr: Dépendances de Stunnel

source: Required
fr: Requises

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of stunnel
fr: Installation de Stunnel

source: The _C1182_ daemon will be run in a _C1183_ jail by an unprivileged user.
fr: Le démon _C1182_ sera lancé dans une cage _C1183_ par un utilisateur non privilégié.

source: Create the new user and group using the following commands as the _U1_ user:
fr: Créez le nouvel utilisateur et le nouveau groupe en utilisant les commandes suivantes en tant qu'utilisateur _U1_ :

source: A signed SSL Certificate and a Private Key is necessary to run the _C1182_ daemon.
fr: Un certificat SSL signé et une clé privée sont nécessaires pour lancer le démon _C1182_.

source: After the package is installed, there are instructions to generate them.
fr: Après que le paquet est installé, il y a des instructions pour les générer.

source: However, if you own or have already created a signed SSL Certificate you wish to use, copy it to _F435_ before starting the build (ensure only _U1_ has read and write access).
fr: Cependant si vous possédez ou si vous avez déjà créé un certificat SSL signé que vous souhaitez l'utiliser, copiez-le dans _F435_ avant de commencer la construction (assurez-vous que seul _U1_ a l'accès en lecture et écriture).

source: The _F436_ file must be formatted as shown below:
fr: Le fichier _F436_ doit être formaté comme décrit ci-dessous :

source: Install _A550_ by running the following commands:
fr: Installez _A550_ en lançant les commandes suivantes :

source: For some systems with _A552_ versions prior to 2.25, _C121_ may fail.
fr: Pour certains sytèmes avec une version de _A552_ inférieure à 2.25, _C121_ peut échouer.

source: If necessary, fix it either with:
fr: Si nécessaire, corrigez le avec :

source: or, if _X121_ with Clang is installed, you can replace _C1184_ with _C1185_ in the first command below.
fr: ou, si _X121_ est installé avec Clang, vous pouvez remplacer _C1184_ avec _C1185_ dans la première commande dessous.

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: If you do not already have a signed SSL Certificate and Private Key, create the _F437_ file in the _F438_ directory using the command below.
fr: si vous n'avez pas déjà un certificat SSL signé et une clé privé, créez le fichier _F437_ dans le répertoire _F438_ en utilisant la commande suivante.

source: You will be prompted to enter the necessary information.
fr: Vous aurez une invite pour rentrer les informations nécessaires.

source: Ensure you reply to the
fr: Assurez vous de répondre à

source: prompt with the name or IP address you will be using to access the service (s).
fr: répondre avec le nom ou l'adresse IP que vous utiliserez pour accéder au (x).

source: To generate a certificate, as the _U1_ user, issue:
fr: Pour générer un certificat, en tant qu'utilisateur _U1_, tapez :

source: Command Explanations
fr: Explications des commandes

source: This switch disables systemd socket activation support which is not available in BLFS.
fr: Ce paramètre désactive le support de l'activation de systemd, qui n'est pas disponible dans BLFS.

source: This command installs the package and changes the documentation installation directory to standard naming conventions.
fr: Cette commande installe le paquet et modifie le répertoire d'installation de la documentation en un nom conforme aux conventions.

source: Configuring stunnel
fr: Configuration de Stunnel

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: As the _U1_ user, create the directory used for the _F440_ file created when the _A550_ daemon starts:
fr: En tant qu'utilisateur _U1_, créez le répertoire utilisé pour le fichier _F440_ créé quand le démon _A550_ démarre :

source: Next, create a basic _F439_ configuration file using the following commands as the _U1_ user:
fr: Ensuite, créez un fichier de configuration _F439_ de base en utilisant les commandes suivantes en tant qu'utilisateur _U1_ :

source: Finally, add the service (s) you wish to encrypt to the configuration file.
fr: Enfin, ajoutez le (x) service.

source: The format is as follows:
fr: Le format ressemble à ce qui suit :

source: If you use _A550_ to encrypt a daemon started from _C1187_ , you may need to disable that daemon in the _F441_ file and enable a corresponding
fr: Si vous utilisez _A550_ pour chiffrer un démon lancé à partir de _C1187_ , il se peut que vous deviez désactiver ce démon dans le fichier _F441_ et activer un service

source: _stunnel service.
fr: _stunnel correspondant.

source: You may have to add an appropriate entry in _F442_ as well.
fr: Il se peut que vous deviez également ajouter une entrée adéquate dans _F442_.

source: For a full explanation of the commands and syntax used in the configuration file, issue _C1188_ .
fr: Pour une explication complète des commandes et de leurs syntaxes, utilisées dans le fichier de configuration, lancez _C1188_.

source: Boot Script
fr: Script de démarrage

source: To automatically start the _C1182_ daemon when the system is booted, install the _F443_ bootscript from the _X203_ package.
fr: Pour démarrer automatiquement le démon _C1182_ quand on démarre le système, installez le script de démarrage _F443_ du paquet _X203_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: /{etc, usr/lib, var/lib}/stunnel and /usr/share/doc/stunnel-&stunnel-version;
fr: /{etc, usr/lib, var/lib}/stunnel et /usr/share/doc/stunnel-&stunnel-version;

source: Short Descriptions
fr: Descriptions courtes

source: is a program designed to work as an SSL encryption wrapper between remote clients and local (_C1189_ -startable) or remote servers.
fr: est un programme conçu pour fonctionner en tant qu'enveloppe SSL chiffrée entre des clients distants et locaux (_C1189_ -startable) ou des serveurs distants.

source: contains the API functions required by _A550_ .
fr: contient les fonctions API exigées par _A550_.
