Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/sudo.xml.1.chaine.po
Languages: fr

source: 2.6 MB
fr: 2.6 Mo

source: 34 MB (with tests)
fr: 34 Mo (avec les tests)

source: 0.4 SBU (with tests)
fr: 0.4 SBU (avec les tests)

source: Introduction to Sudo
fr: Introduction à Sudo

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Sudo Dependencies
fr: Dépendances de Sudo

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of Sudo
fr: Installation de Sudo

source: Install _A568_ by running the following commands:
fr: Installez _A568_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Check the results with _C1241_ .
fr: Vérifiez les résultats avec _C1241_.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This switch controls where private programs are installed.
fr: Ce paramètre contrôle où les programmes privés sont installés.

source: Everything in that directory is a library, so they belong under _F408_ instead of _F383_ .
fr: Tous dans ce répertoire est une bibliothèque, alors ils sont mis dans _F408_ au lieu de _F383_.

source: This switch transparently adds _F290_ and _F474_ directories to the _E16_ environment variable.
fr: Ce paramètre ajoute de façon transparente les répertoires _F290_ et _F474_ dans la variable d'environnement _E16_.

source: This switch includes all the _A569_ insult sets.
fr: Ce paramètre inclut tous les paramètres d'insultes de _A569_.

source: This switch enables use of the environment variable EDITOR for _C1242_ .
fr: Ce paramètre active l'utilisation de la variable d'environnement EDITOR pour _C1242_.

source: This switch sets the prompt.
fr: Ce paramètre initialise le prompt.

source: Avoids building _A570_ support when _A570_ is installed on the system.
fr: empêche de construire le support _A570_ quand _A570_ est installé sur le système.

source: Check the _C1243_ output for a complete list.
fr: Regardez la sortie de _C1243_ pour une liste complète.

source: works around a bug in the installation process, which links to the previously installed version (if there is one) instead of the new one.
fr: contourne un bogue dans le process d'installation, qui lie à la version précédement installé (si elle est la) au lieu de la dernière.

source: Configuring Sudo
fr: Configuration de Sudo

source: Config File
fr: Fichier de configuration

source: Configuration Information
fr: Informations de configuration

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: group_file.so, libsudo_util.so, sudoers.so, sudo_noexec.so, and system_group.so
fr: group_file.so, libsudo_util.so, sudoers.so, sudo_noexec.so, et system_group.so

source: /etc/sudoers.d, /usr/lib/sudo, /usr/share/doc/sudo-&sudo-version;, and /var/{lib, run}/sudo
fr: /etc/sudoers.d, /usr/lib/sudo, /usr/share/doc/sudo-&sudo-version;, et /var/{lib, run}/sudo

source: Short Descriptions
fr: Descriptions courtes

source: executes a command as another user as permitted by the _F475_ configuration file.
fr: exécute une commande en tant qu'un autre utilisateur selon les permissions du fichier de configuration _F475_.

source: is a symlink to _C1246_ that implies the _O111_ option to invoke an editor as another user.
fr: est un lien symbolique vers _C1246_ qui inclut l'option _O111_ pour appeler un éditeur en tant qu'un autre utilisateur.

source: is used to play back or list the output logs created by _C1246_ .
fr: est utilisé pour rejouer ou afficher les logs de sorties créés par _C1246_.

source: allows for safer editing of the _F476_ file.
fr: permet une édition sécurisée du fichier _F476_.
