Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/tripwire.xml.1.chaine.po
Languages: fr

source: 704 KB
fr: 704 Ko

source: 31 MB
fr: 31 Mo

source: Introduction to Tripwire
fr: Introduction à Tripwire

source: The _A560_ package contains programs used to verify the integrity of the files on a given system.
fr: Le paquet _A560_ contient des programmes utilisés pour vérifier l'intégrité des fichiers sur un système donné.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Tripwire Dependencies
fr: Dépendances de Tripwire

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: An _X190_
fr: Un _X190_

source: User Notes:
fr: Notes utilisateur :

source: Installation of Tripwire
fr: Installation de Tripwire

source: Compile _A560_ by running the following commands:
fr: Compilez _A560_ en lançant les commandes suivantes :

source: The default configuration is to use a local MTA.
fr: La configuration par défaut consiste à utiliser un MTA local.

source: Otherwise the install will fail.
fr: Sans cela, l'installation échouera.

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: This command tells the package to install the program database and reports in _F459_ .
fr: Cette commande dit au paquet d'installer la base de données et les rapports du programme dans _F459_.

source: Fix a compilation issue with gcc-4.7.
fr: Corrige la compilation avec gcc-4.7.

source: Fix the location of the man and doc directories.
fr: Corrige l'emplacement des répertoires man et doc.

source: Fix compilation with gcc-4.9.
fr: Corrige la compilation avec gcc-4.9.

source: This command creates the _A560_ security keys as well as installing the binaries.
fr: Cette commande crée les clés de sécurité _A560_ et installe les binaires.

source: There are two keys:
fr: Il y a deux clés :

source: a site key and a local key which are stored in _F460_ .
fr: une clé distante et une clé locale qui sont stockées dans _F460_.

source: During _C846_ , several questions are asked, including passwords.
fr: Pendant _C846_ , plusieurs questions sont posées, incluant les mots de passe.

source: If you want to make a script, you have to apply a _A561_ before running _C846_ :
fr: Si vous voulez faire un script, vous devez appliquer un _A561_ avant de lancer _C846_ :

source: Of course, you should do this with dummy passwords and change them later.
fr: biensur, vous devez faire cela avec des mots de passe triviaux et les changer ensuite.

source: This command installs the _A562_ sample policy files with the other _A562_ documentation.
fr: Cette commande installe les fichiers de politique modèle _A562_ avec le reste de la documentation de _A562_.

source: Configuring Tripwire
fr: Configuration de Tripwire

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: The default policy file (_F462_ ) is for a default installation and will need to be updated for your system.
fr: Le fichier de règles par défaut (_F462_) vaut pour une installation par défaut et devra être mis à jour selon votre système.

source: Policy files should be tailored to each individual distribution and/or installation.
fr: Vous devriez adapter les fichiers de règles individuels à chaque distribution et/ou installation.

source: Some example policy files can be found in _F463_ .
fr: Vous pouvez trouver certains fichiers de règles d'exemples dans _F463_.

source: It is, however, recommended that you edit your policy file.
fr: Néanmoins, on vous recommande d'éditer votre propre fichier de règles.

source: Get ideas from the examples above and read _F465_ for additional information.
fr: Inspirez-vous des exemples ci-dessus et lisez _F465_ pour des informations supplémentaires.

source: After your policy file has been edited to your satisfaction you may begin the configuration steps (perform as the _U3_ ) user:
fr: Après que votre fichier de règles a été éditez selon vos désirs, vous pouvez commencer les étapes de configuration (effectuez en tant qu'utilisateur _U3_) user :

source: Depending on your system and the contents of the policy file, the initialization phase above can take a relatively long time.
fr: Selon votre système et le contenu du fichier de règles, la phase d'initialisation ci-dessus peut prendre un temps relativement long.

source: Usage Information
fr: Informations d'utilisation

source: Using _A560_ while making frequent changes to these directories will flag all these changes.
fr: L'utilisation de _A560_ si vous modifiez souvent ces répertoires marquera toutes ces modifications.

source: It is most useful after a system has reached a configuration that the user considers stable.
fr: C'est souvent utile après que le système a atteint une configuration considérée comme stable par l'utilisateur.

source: To use _A560_ after creating a policy file to run a report, use the following command:
fr: Pour utiliser _A560_ après avoir créé un fichier de règles pour lancer un signalement, utilisez la commande suivante :

source: View the output to check the integrity of your files.
fr: Observez la sortie pour vérifier l'intégrité de vos fichiers.

source: An automatic integrity report can be produced by using a cron facility to schedule the runs.
fr: Un rapport automatique d'intégrité peut être obtenu en utilisant une fonctionnalité cron pour programmer à l'avance les exécutions.

source: Reports are stored in binary and, if desired, encrypted.
fr: Les rapports sont stockés en binaire et, si vous le désirez, chiffrés.

source: View reports, as the _U1_ user, with:
fr: Observez les rapports, en tant qu'utilisateur _U1_, avec :

source: After you run an integrity check, you should examine the report (or email) and then modify the _A560_ database to reflect the changed files on your system.
fr: Après que vous avez lancé une vérification d'intégrité, vous devriez examiner le rapport (ou le message électronique) puis modifier la base de données _A560_ pour refléter les fichiers modifiés sur votre système.

source: This is so that _A560_ will not continually notify you that files you intentionally changed are a security violation.
fr: Ceci pour que _A560_ ne vous notifie pas en permanence que des fichiers que vous avez volontairement modifiés sont une violation de sécurité.

source: To do this you must first _C1224_ and note the name of the newest file which starts with your system name as presented by the command
fr: Pour faire cela, vous devez tout d'abord faire _C1224_ et remarquer le nom du fichier le plus récent qui commence par le nom de votre système tel que présenté par la commande

source: and ends in _F466_ .
fr: et qui finit par _F466_.

source: These files were created during report creation and the most current one is needed to update the _A560_ database of your system.
fr: Ces fichiers ont été créés pendant la création du rapport et le plus actuel est nécessaire pour mettre à jour la base de données _A560_ de votre système.

source: As the _U3_ user, type in the following command making the appropriate report name:
fr: En tant qu'utilisateur _U3_, entrez la commande suivante en faisant le nom du rapport adéquat :

source: You will be placed into _A563_ with a copy of the report in front of you.
fr: Vous serez mis dans _A563_ avec une copie du rapport face à vous.

source: If all the changes were good, then just type _C1225_ and after entering your local key, the database will be updated.
fr: Si tous les changements sont corrects, tapez simplement _C1225_ et après avoir entré votre clé locale, la base de données sera mise à jour.

source: Changing the Policy File
fr: Modifier le fichier de règles

source: If you are unhappy with your policy file and would like to modify it or use a new one, modify the policy file and then execute the following commands as the _U3_ user:
fr: Si vous n'êtes pas content de votre fichier de règles et si vous aimeriez le modifier ou en utiliser un nouveau, modifiez le fichier de règles puis exécutez les commandes suivantes en tant qu'utilisateur _U3_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: siggen, tripwire, twadmin, and twprint
fr: siggen, tripwire, twadmin, et twprint

source: None
fr: Aucun

source: /etc/tripwire, /var/lib/tripwire, and /usr/share/doc/tripwire
fr: /etc/tripwire, /var/lib/tripwire, et /usr/share/doc/tripwire

source: Short Descriptions
fr: Descriptions courtes

source: is a signature gathering utility that displays the hash function values for the specified files.
fr: est un outil rassembleur de signatures qui affiche les valeurs de la fonction de hachage pour les fichiers spécifiés.

source: is the main file integrity checking program.
fr: est le programme principal de vérification d'intégrité des fichiers.

source: administrative and utility tool used to perform certain administrative functions related to _A560_ files and configuration options.
fr: outil d'administration utilisé pour effectuer certaines fonctions administratives et certaines options de configuration liées aux fichiers _A560_.

source: prints _A560_ database and report files in clear text format.
fr: affiche une base de données et des fichiers de rapport _A560_ au format texte en clair.
