Repository: espindula/br-lfs
Catalog: blfs/traduc/po/postlfs/security/vulnerabilities.xml.1.chaine.po
Languages: fr

source: Vulnerabilities
fr: Failles de sécurité

source: About vulnerabilities
fr: À propos des failles de sécurité

source: All software has bugs.
fr: Tous les logiciels ont des bogues.

source: Sometimes, a bug can be exploited, for example to allow users to gain enhanced privileges (perhaps gaining a root shell, or simply accessing or deleting other user&apos;s files), or to allow a remote site to crash an application (denial of service), or for theft of data.
fr: Parfois, un bogue peut être exploité, pour autoriser, par exemple, des utilisateurs à obtenir des privilèges spéciaux (peut-être ceux d'un shell root ou simplement l'accès ou la faculté de supprimer les fichiers d'autres utilisateurs), ou pour permettre à un site distant de faire planter une application (un refus de service).

source: These bugs are labelled as vulnerabilities.
fr: On appelle ces bogues des failles de sécurité.

source: The main place where vulnerabilities get logged is _L3856_ .
fr: L'endroit majeur où les failles sont répertoriées est _L3856_.

source: Unfortunately, many vulnerability numbers (CVE-yyyy-nnnn) are initially only labelled as "reserved" when distributions start issuing fixes.
fr: Malheureusement, de nombreux numéros de failles (CVE-yyyy-nnnn) ne sont, à l'origine, identifiées que comme "réservées", quand les distributions commencent à faire des corrections.

source: Also, some vulnerabilities apply to particular combinations of _C101_ options, or only apply to old versions of packages which have long since been updated in BLFS.
fr: De plus, certaines failles s'appliquent à des combinaisons particulières d'options de _C101_ , ou ne s'appliquent qu'à d'anciennes versions des paquets qui ont été mis à jour depuis longtemps dans BLFS.

source: BLFS differs from distributions - there is no BLFS security team, and the editors only become aware of vulnerabilities after they are public knowledge.
fr: BLFS est différent d'une distribution - il n'y a pas d'équipe BLFS de sécurité et les rédacteurs n'ont connaissance des failles qu'après leur publication.

source: Sometimes, a package with a vulnerability will not be updated in the book for a long time.
fr: Parfois, un paquet ayant une faille ne sera pas mis à jour dans le livre pendant longtemps.

source: Issues can be logged in the Trac system, which might speed up resolution.
fr: Les problèmes peuvent être enregistrés dans le système de suivi, ce qui pourrait accélérer leur résolution.

source: The normal way for BLFS to fix a vulnerability is, ideally, to update the book to a new fixed release of the package.
fr: La façon normale dont BLFS corrige une faille de sécurité est, dans l'idéal, de mettre à jour le livre vers une nouvelle version corrigée du paquet.

source: Sometimes that happens even before the vulnerability is public knowledge, so there is no guarantee that it will be shown as a vulnerability fix in the Changelog.
fr: Parfois, cela arrive avant même que la faille ne soit publique, donc il n'est pas certain que la mise à jour soit indiquée comme corrigeant une faille dans l'historique des changements.

source: Alternatively, a _C99_ command, or a patch taken from a distribution, may be appropriate.
fr: De même, il se peut qu'une commande _C99_ ou un correctif issu d'une distribution soit adapté.

source: The bottom line is that you are responsible for your own security, and for assessing the potential impact of any problems.
fr: Tout ça pour dire que vous êtes responsable de votre propre sécurité et de l'évaluation de l'impact potentiel des problèmes.

source: To keep track of what is being discovered, you may wish to follow the security announcements of one or more distributions.
fr: Pour suivre ce qui est découvert au fur et à mesure, il se peut que vous souhaitiez suivre les annonces de sécurité d'une ou plusieurs distributions.

source: For example, Debian has _L3857_ .
fr: Par exemple, debian a _L3866_.

source: Fedora's links on security are at _L3858_ .
fr: Les liens fedora sur la sécurité se trouvent sur _L3867_.

source: Details of Gentoo linux security announcements are discussed at _L3859_ .
fr: Les détails des annonces de sécurité de Linux par gentoo sont évoqués sur _L3868_.

source: Finally, the Slackware archives of security announcements are at _L3860_ .
fr: Et enfin les archives des annonces de sécurité de Slackware se trouvent sur _L3869_.

source: The most general English source is perhaps _L3861_ , but please read the comment on that page.
fr: La source anglophone la plus généraliste se trouve peut-être sur _L3861_ , mais merci de lire le commentaire sur cette page.

source: If you use other languages you may prefer other sites such as http://www.heise.de/security _L3862_ (German) or _L3863_ (Croatian).
fr: Si vous utilisez d'autres langues, il se peut que vous préfériez d'autres sites comme http://www.heise.de/security _L3862_ (allemand) ou _L3863_ (Croate).

source: These are not linux-specific.
fr: Ils ne sont pas spécifiques à Linux.

source: There is also a daily update at lwn.net for subscribers (free access to the data after 2 weeks, but their vulnerabilities database at _L3864_ is unrestricted).
fr: Une mise à jour quotidienne existe sur lwn.net pour les abonnés (accès libre aux données après 2 semaines).

source: For some packages, subscribing to their &apos;announce&apos; lists will provide prompt news of newer versions.
fr: Pour certains paquets, s'inscrire sur leurs listes &apos;announce&apos; apportera des nouvelles actualisées sur les versions récentes.

source: User Notes:
fr: Notes utilisateur :
