Repository: espindula/br-lfs
Catalog: blfs/traduc/po/xfce/core/xfce4-session.xml.1.chaine.po
Languages: fr

source: 1.2 MB
fr: 1.2 Mo

source: 14 MB
fr: 14 Mo

source: Introduction to Xfce4 Session
fr: Introduction à Xfce4 Session

source: Its task is to save the state of your desktop (opened applications and their location) and restore it during a next startup.
fr: Son boulot consiste à sauvegarder l'état de votre bureau (applications ouvertes et leur emplacement) et à le restaurer lors du redémarrage suivant.

source: You can create several different sessions and choose one of them on startup.
fr: Vous pouvez créer plusieurs sessions différentes et choisier une d'entre elles au démarrage.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Xfce4 Session Dependencies
fr: Dépendances de Xfce4 Session

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Required Runtime
fr: Requises pour l'éxécution

source: User Notes:
fr: Notes utilisateur :

source: Installation of Xfce4 Session
fr: Installation de Xfce4 Session

source: Install _A39_ by running the following commands:
fr: Installez _A39_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U1_ user:
fr: Maintenant, en tant qu'utilisateur _U1_ :

source: Command Explanations
fr: Explications des commandes

source: Configuring Xfce4 Session
fr: Configurer la session Xfce4

source: There are several optional run time dependencies for _A36_ :
fr: Il y a plusieurs dépendances d'exécution facultative pour _A36_ :

source: When building an _A36_ package, some configuration files are installed in _F10_ , _F11_ , and _F12_ .
fr: Pendant la construction d'un paquet _A36_ , certains fichiers de configuration sont installés dans _F10_ , _F11_ , et _F12_.

source: In order to use those files in your _A36_ session, you need to update various databases.
fr: Afin d'utiliser ces fichiers dans votre session _A36_ , vous devez mettre à jour différentes bases de données.

source: Do that by running, as the _U2_ user (you need to have the recommended dependencies installed):
fr: Faite cela en lançant, en tant qu'utilisateur _U2_ (vous avez besoin d'avoir les dépendances recommandées d'installées) :

source: You can start _A36_ from runlevel 3, using _X50_ , or from runlevel 5, using a Display Manager, such as _X51_ .
fr: Vous pouvez démarrer _A36_ depuis le runlevel 3, en utilisant _X50_ , ou depuis le runlevel 5, en utilisant un gestionnaire d'affichage, comme _X51_.

source: To start _A36_ using _X50_ , run the following commands:
fr: Pour démarrer _A36_ en utilisant _X50_ , lancez les commandes suivantes :

source: The X session starts on the first unused virtual terminal, normally vt7.
fr: La session X démarrer dans le premier terminal virtuel inutilisé, normallement vt7.

source: You can switch to another vt
fr: VOus pouvez passer à un autre vt

source: simultaneously pressing the keys Ctrl-Alt-F
fr: en appuyant simultanément les touches Ctrl-Alt-F

source: To switch back to the X session, normally started at vt7, use Ctrl-Alt-F7.
fr: Pour aller sur la session X, normallement démarrée sur vt7, utilisez Ctrl-Alt-F7.

source: The vt where the command _C40_ was executed will display many messages, including X starting messages, applications automatically started with the session, and eventually, some warning and error messages.
fr: Le vt ou la commande _C40_ est exacuté affichera beaucoup de messages, incluant les messages de demarrage de X, les applications automatiquement démarrées avec la session, et eventuellement, quelques avertissements et messages d'erreur.

source: You may prefer to redirect those messages to a log file, which not only will keep the initial vt uncluttered, but can also be used for debugging purposes.
fr: Vous pouvez préférer rediriger ces messages dans un fichier de log, qui non seulement laissera le vt initial propre, mais pourra aussi être utilisé pour des questions de deboguage.

source: This can be done starting X with:
fr: Cela peut être fait en démarrant X avec :

source: However some capabilities such as mounting or umounting file systems from a file manager will not be possible, or the reboot option will be absent or inoperative, among other problems.
fr: Cependant quelques fonctionnalités comme le montage ou le démontage des sytèmes de fichier depuis un gestionnaire de fichiers ne seront pas possible, ou les options de redémarra$ seront absent ou non fonctionnelles, entre autres problèmes.

source: When shutting down or rebooting, the shutdown messages appear on the vt where X was running.
fr: Au redémarrage ou à l'arret, les messages d'arrêt apparaissent sur le vt ou X était lancé.

source: If you wish to see those messages, simultaneously press keys Alt-F7 (assuming that X was running on vt7).
fr: si vous voulez voir ces messages, appuyez simultanément sur Alt-F7 (en considérant que X était lancé sur vt7).

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directories
fr: Répertoires installés

source: xfce4-session, xfce4-session-logout, xfce4-session-settings and xfce4-tips
fr: xfce4-session, xfce4-session-logout, xfce4-session-settings et xfce4-tips

source: /usr/include/xfce4/xfce4-session-4.6, /usr/share/xfce4/tips and /usr/share/doc/xfce4-session-&xfce4-session-version;
fr: /usr/include/xfce4/xfce4-session-4.6, /usr/share/xfce4/tips et /usr/share/doc/xfce4-session-&xfce4-session-version;

source: Short Descriptions
fr: Descriptions courtes

source: starts up the _A10_ Desktop Environment.
fr: démarre l'environnement de bureau _A10_.

source: logs out from _A10_ .
fr: se déconnecte de _A10_.

source: is a _A6_ GUI which allows you to alter your preferences for your _A41_ .
fr: est une interface _A6_ qui vous permet de modifier vos préférences pour your _A41_.

source: is a _A6_ GUI which displays tips when you log in to an _A41_ .
fr: est une interface graphique _A6_ qui affiche des astuces lorsque vous vous connectez à une _A41_.

source: contains the _A41_ API functions.
fr: contient les fonctions de l'API de _A41_.
