Repository: espindula/br-lfs
Catalog: blfs/traduc/po/lxqt/desktop/pre-install.xml.1.chaine.po
Languages: fr

source: LXQt Desktop Pre-Install Instructions
fr: Instruction de pré-installation du bureau LXQt

source: LXQt can be installed in /usr or /opt/lxqt.
fr: LXQt peut etre installé dans /usr ou /opt/lxqt.

source: Installing in /usr
fr: Installation dans /usr

source: Installing in _F153_ creates a simpler setup.
fr: Installer dans _F153_ crée une initialisation simple.

source: Run:
fr: Lancez :

source: Either add that to your own _F975_ so that it will still be set if you build the packages over a period of time, or else add it to the system profile as the _U2_ user:
fr: Sinon ajoutez cela à votre _F975_ pour qu'il reste initialisé si vous construisez le paquet sur longtemps, ou sinon ajoutez le à votre profile système en tant qu'utilisateur _U2_ :

source: The rest of this page is for people who wish to use the alternative prefix.
fr: Le reste de cette page est pour les personnes qui veulent utiliser un préfixe alternatif.

source: Installing in /opt/lxqt
fr: Installation dans /opt/lxqt

source: Installing in _F355_ may simplify upgrading to a later version of LXQt.
fr: Installer dans _F355_ peut simplifier la mise à jour à des versions futures de LXQT.

source: Some variables need to be defined in your system profile, as the _U2_ user:
fr: Quelques variables doivent être définies dans votre profile système, en tant qu'utilisateur _U2_ :

source: Expand your _F1015_ file:
fr: Complêter votre fichier _F1015_ :

source: Before starting to install the packages in the following pages, remember to execute:
fr: Avant de commencer l'installation les paquets des pages suivantes, pensez à lancer :

source: Some packages may also install icons from the "hicolor" icon set.
fr: Quelques paquets peuvent aussi installer des icônes de l'ensemble "hicolor".

source: Since that icon set is used by many packages, it is a good idea to create a symlink to the one in _F356_ to avoid having multiple installations of _X116_ .
fr: Depuis que cet ensemble d'icônes est utilisé par beaucoup de paquets, c'est une bonne idée de créer un lien symbolique vers un ensemble dans _F356_ pour éviter d'avoir des installations multiples de _X116_.

source: Run the following commands as the _U2_ user:
fr: LAncez la commande suivante en tant qu'utilisateur _U2_ :

source: Sometimes, the installation paths are hardcoded into installed files.
fr: Parfois, les chemins d'installation sont codés en durs dans les fichiers installés.

source: This is the reason why _F355_ is used as installation prefix instead of _F1181_ .
fr: C'est la raison pourquoi _F355_ est utilisé comme préfx d'installation au lieu de _F1181_.

source: After installing _A658_ , you may rename the directory and create a symlink:
fr: Après l'installation de _A658_ , vous pouvez renommer le répertoire et créer un lien symbolique :

source: Later on, you may want to install other versions of _A658_ .
fr: Plus tard, vous pouvez vouloir installer d'autres versions de _A658_.

source: To do that, just remove the symlink and use _F355_ as the prefix again.
fr: Pour faire cela, supprimez juste le lien symbolique et utilisez _F355_ de nouveau comme préfix.

source: Which version of _A658_ you use depends only on where the symlink points.
fr: La version de _A658_ que vous utilisez dépend seulement d'où pointe le lien symbolique.

source: No other reconfiguration will be needed.
fr: Pas d'autres reconfiguration seront nécessaire.
