Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/printing/cups.xml.1.chaine.po
Languages: fr

source: 8.5 MB
fr: 8.5 Mo

source: 72 MB (116 MB with tests)
fr: 72 Mo (116 Mo avec les tests)

source: Introduction to Cups
fr: Introduction à Cups

source: The Common Unix Printing System (CUPS) is a print spooler and associated utilities.
fr: Le _fpo_Common Unix Printing System_fpf_ (Cups) .

source: It is based on the "Internet Printing Protocol" and provides printing services to most PostScript and raster printers.
fr: Il se base sur l'"Internet Printing Protocol".

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Cups Dependencies
fr: Dépendances de Cups

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: Required (Postinstall)
fr: Requises (après l'installation)

source: Optional (Postinstall)
fr: Optionnelles (après l'installation)

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: There used to be a conflict between the _A1537_ _A87_ backend and the usblp kernel driver.
fr: Il existait un conflit entre la fondation _A87_ de _A1537_ et le pilote usblp du noyau.

source: This is no longer the case and cups will work with both of these enabled.
fr: Ce n'est plus le cas et cups fonctionnera avec les deux activés.

source: If you have a parallel printer, enable the following options in your kernel configuration and recompile the kernel:
fr: Si vous avez une imprimante en port parallèle, activez les options suivantes dans la configuration de votre noyau et recompilez le noyau :

source: Build _A1537_ by running the following commands:
fr: Construisez _A1537_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: An already active graphical session with bus address is necessary to run the tests.
fr: Une session graphique déjà active avec une adresse dbus est nécessaire pour lancer les tests.

source: Some tests fail for unknown reasons.
fr: Quelques tests peuvent échouer en fonction des options activées dans le noyau.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: Fix files and directories permissions.
fr: Corrige les permissions des fichiers et répertoires.

source: This sed prevents compression of the man pages by default.
fr: Ce sed empêche la compression des pages de manuel par défaut.

source: Prevent _C101_ script from searching _C111_ , because _A55_ is not used anywere else in the package.
fr: Empêche le script _C101_ de chercher _C111_ , car _A55_ n'est pas utilisé ailleurs dans le paquet.

source: This environment variable ensures that gcc is used, if clang is installed.
fr: Cette variable d'environnement assure que gcc est utilisé, si clang est installé.

source: Remove it, if you prefer to use clang.
fr: Supprimez le, si vous préférez utiliser clang.

source: Using clang almost doubles build time and slightly decreases build disk space.
fr: En utilisant clang, le temps de construction est doublé et l'espace disque pour la construction est légèrement plus faible.

source: Installed disk space is not appreciably modified.
fr: L'espace disque installé n'est pas significativement modifié.

source: Systemd is not supported by BLFS.
fr: Systemd n'est pas supporté par BLFS.

source: This switch tells the build process to install the shipped bootscript into _F364_ instead of _F805_ .
fr: Ce paramètre dit au processus de construction d'installer le script de démarrage inclu dans _F364_ et non dans _F805_.

source: This switch ensures that only _U26_ will be used as the _A1537_ administrative group.
fr: Ce paramètre garantit que seul _U26_ sera utilisé comme groupe d'administration de _A1537_.

source: Use this switch if you have installed _X53_ , but wish to use the kernel usblp driver.
fr: Utilisez ce paramètre si vous avez installé _X53_ , mais si vous souhaitez le pilote usblp du noyau.

source: Use this switch if you have installed _A72_ and wish to use it with _A1537_ .
fr: Utilisez ce paramètre si vous avez installé _A72_ et si vous souhaitez l'utiliser avec _A1537_.

source: Configuring Cups
fr: Configuration de Cups

source: Config Files
fr: Fichiers de configuration

source: Configuration Information
fr: Informations de configuration

source: Normally, printers are set up via a web browser.
fr: Normalement, les imprimantes sont initialisées via un navigateur web.

source: The _A1537_ server will normally connect via the url http://localhost:631.
fr: Le serveur _A1537_ sera accessible normalement par l'url http://localhost:631.

source: From there printers, print jobs, and the server configuration can be set up and managed.
fr: Les imprimantes, les travaux d'impressions, et la configuration du serveur peuvent être initialisés et gérés.

source: Remote system administration can also be set up.
fr: L'administration de système distant peut également être initialisée.

source: Configuration can also be done from the command line via the _C2938_ , _C2939_ , and _C2940_ commands.
fr: La configuration peut également être faite depuis la ligne de commande via les commandes _C2938_ , _C2939_ , et _C2940_.

source: Configuration of _A1537_ is dependent on the type of printer and can be complex.
fr: La configuration de _A1537_ dépend du type d'imprimante et elle peut être complexe.

source: Generally, PostScript printers are easier.
fr: En général, les imprimantes PostScript sont plus simples.

source: For detailed instructions on configuration and use of _A1537_ , see _L3238_ .
fr: Pour des instructions détaillées sur la configuration et l'utilisation de _A1537_ , voir _L3238_.

source: For non-PostScript printers to print with _A1537_ , you need to install _X150_ to convert PostScript to raster images and a driver (e.g.
fr: Le _fpo_Software Administrators Manual_fpf_ (e.g.

source: from _X497_ ) to convert the resulting raster images to a form that the printer understands.
fr: Pour que des imprimantes non PostScript impriment avec _A1537_ , vous devez installer _X150_ pour convertir PostScript en images raster et un pilote) .

source: Linux PAM Configuration
fr: Configuration de Linux PAM

source: If _A444_ has been built with _A404_ support, you need to create a _A587_ configuration file to get it working correctly with BLFS.
fr: Si _A444_ a été construit avec le support _A404_ , vous devez créer un fichier de configuation _A587_ , pour le rendre fonctionnel correctement avec BLFS.

source: Issue the following command as the _U2_ user to create the configuration file for _A404_ :
fr: Tapez la commande suivante en tant qu'utilisateur _U2_ pour créer le fichier de configuration pour _A404_ :

source: Boot Script
fr: Script de démarrage

source: If you want the _A1537_ print service to start automatically when the system is booted, install the init script included in the _X194_ package:
fr: Si vous voulez que _A1537_ démarre automatiquement lors du démarrage du système, installez le script de démarrage inclu dans le paquet _X194_ :

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: accept, cancel, cupsaccept, cupsaddsmb, cups-config, cupsctl, cupsd, cupsdisable, cupsenable, cupsfilter, cupsreject, cupstestdsc, cupstestppd, ippfind, ipptool, lp, lpadmin, lpc, lpinfo, lpmove, lpoptions, lpq, lpr, lprm, lpstat, ppdc, ppdhtml, ppdi, ppdmerge, ppdpo, and reject
fr: accept, cancel, cupsaccept, cupsaddsmb, cups-config, cupsctl, cupsd, cupsdisable, cupsenable, cupsfilter, cupsreject, cupstestdsc, cupstestppd, ippfind, ipptool, lp, lpadmin, lpc, lpinfo, lpmove, lpoptions, lpq, lpr, lprm, lpstat, ppdc, ppdhtml, ppdi, ppdmerge, ppdpo, et reject

source: Short Descriptions
fr: Descriptions courtes

source: instructs the printing system to accept print jobs to the specified destinations.
fr: demande au système d'impression d'accepter les tâches d'impression sur les destinations spécifiées.

source: cancels existing print jobs from the print queues.
fr: annule les tâches d'impression existantes dans les queues d'imprimante.

source: accept jobs sent to a destination.
fr: accepte les travaux envoyés à une destination.

source: exports printers to the _A108_ software for use with Windows clients.
fr: exporte les imprimantes vers le logiciel _A108_ pour une utilisation avec des clients Windows.

source: is a _A1537_ program configuration utility.
fr: est un outil de configuration _A1537_.

source: updates or queries the cupsd.conf file for a server.
fr: Met à jour ou interroge le fichier cupsd.conf pour un serveur.

source: is the scheduler for the Common Unix Printing System.
fr: est le programmeur de tâches du _fpo_Common Unix Printing System_fpf_.

source: stop printers and classes.
fr: arrête les imprimantes et les classes.

source: start printers and classes.
fr: démarre les imprimantes et les classes.

source: is a front-end to the _A1537_ filter subsystem which allows you to convert a file to a specific format.
fr: est une interface avec le sous-système de filtre de _A1537_ qui vous permet de convertir un fichier dans un format spécifique.

source: reject jobs sent to a destination.
fr: rejète les travaux envoyés à une destination.

source: tests the conformance of PostScript files.
fr: teste la conformité des fichiers PostScript.

source: tests the conformance of PPD files.
fr: teste la conformité des fichiers PPD.

source: finds internet printing protocol printers.
fr: trouve les imprimantes IPP.

source: sends IPP requests to the specified URI and tests and/or displays the results.
fr: envoie des requêtes IPP à l'adresse spécifiée et teste et/ou affiche les résultats.

source: submits files for printing or alters a pending job.
fr: soumet des fichiers pour qu'ils soient imprimés ou modifie des tâches en attente.

source: configures printer and class queues provided by _A1537_ .
fr: configure les queues d'une imprimante ou d'une classe fournies par _A1537_.

source: provides limited control over printer and class queues provided by _A1537_ .
fr: offre un contrôle limité des queues d'imprimante ou de classe fournies par _A1537_.

source: lists the available devices or drivers known to the _A1537_ server.
fr: liste les périphériques ou les pilotes disponibles connus du serveur _A1537_.

source: moves the specified job to a new destination.
fr: envoie la tâche spécifiée vers une nouvelle destination.

source: displays or sets printer options and defaults.
fr: affiche ou règle les options de l'imprimante et ceux par défaut.

source: shows the current print queue status on the named printer.
fr: affiche le statut actuel de la queue d'impression de l'imprimante mentionnée.

source: submits files for printing.
fr: soumet des fichiers pour qu'ils soient imprimés.

source: cancels print jobs that have been queued for printing.
fr: annule des tâches d'impression envoyées pour impression vers la queue.

source: displays status information about the current classes, jobs, and printers.
fr: affiche des informations statutaires sur les classes, les tâches et les imprimantes actuelles.

source: compiles PPDC source files into one or more PPD files.
fr: compile des fichiers sources PPDC en un ou plusieurs fichiers PPD.

source: reads a driver information file and produces a HTML summary page that lists all of the drivers in a file and the supported options.
fr: lit le fichier d'informations d'un pilote et donne une page de résumé en HTML qui liste tous les pilotes d'un fichier et les options supportées.

source: imports one or more PPD files into a PPD compiler source file.
fr: importe un ou plusieurs fichiers PPD dans un fichier source pour le compilateur PPD.

source: merges two or more PPD files into a single, multi-language PPD file.
fr: synchronise deux ou plusieurs fichiers PPD dans un seul fichier PPD multi-langages.

source: extracts UI strings from PPDC source files and updates either a GNU gettext or Mac OS X strings format message catalog source file for translation.
fr: extrait des chaînes UI de fichiers source PPDC et met à jour soit un fichier de traduction source d'un catalogue GNU gettext ou de chaînes au format Mac OS X.

source: instructs the printing system to reject print jobs to the specified destinations.
fr: demande au système d'impression de rejeter les tâches d'impression des destinations spécifiées.

source: contains the _A1537_ API functions.
fr: contient les fonctions de l'API de _A1537_.
