Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/printing/gutenprint.xml.1.chaine.po
Languages: fr

source: 6.3 MB
fr: 6.3 Mo

source: 81 MB (without tests)
fr: 81 Mo (without tests)

source: Introduction to Gutenprint
fr: Introduction à Gutenprint

source: The _A492_ (formerly _A493_ ) package contains high quality drivers for many brands and models of printers for use with _X150_ , _X137_ , _L409_ , and the _A494_ .
fr: Le paquet _A492_ (anciennement _A493_) contient des pilotes de grande qualité pour de nombreuses marques et de nombreux modèles d'imprimantes pour une utilisation avec _X150_ , _X137_ , _L409_ , et _A494_.

source: See a list of supported printers at _L410_ .
fr: Voir une liste des imprimantes supportées sur _L410_.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Gutenprint Dependencies
fr: Dépendances de Gutenprint

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: Optional (to Regenerate Documentation)
fr: Optionnelles (pour régénérer la documentation)

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: If you intend to use _A495_ with a USB-connected Epson Stylus printer for commands such as _C926_ which need to access the raw device, you must enable the kernel's usblp driver.
fr: Si vous prevoyez d'utiliser _A495_ avec une imprimante Epson Stylus connecté en USB pour les commandes comme _C926_ qui demande d'accéder au périphérique, vous devez activer le pilote usblp du noyau.

source: Enable the following options in your kernel configuration and recompile the kernel:
fr: Activez les options suivantes dans votre noyau et recompilez le noyau :

source: Install _A492_ by running the following commands:
fr: Installez _A492_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: This command is used so that the package documentation is installed in the conventional _F285_ directory structure instead of _F286_ .
fr: Cette commande est utilisée pour qu la documentation du paquet soit installée dans la structure habituelle du répertoire _F285_ et non dans _F286_.

source: This switch prevents the static libraries being installed.
fr: Ce paramètre empêche les bibliothèques statiques de s'installer.

source: Configuring Gutenprint
fr: Configuration de Gutenprint

source: Configuration Information
fr: Informations de configuration

source: For _A444_ to see newly installed print drivers, it has to be restarted (as the _U2_ user):
fr: Pour que _A444_ voie les drivers nouvellement installés, il faut le erdémarrer (en tant qu'utilisatekr _U2_) :

source: Then point your web browser to _L414_ to add a new printer to _A444_ .
fr: Puis, faites pointer votre navigateur Internet vers _L414_ pour ajouter une nouvelle imprimante à _A444_.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: cups-calibrate, cups-genppd.5.2, cups-genppdupdate, escputil, ijsgutenprint.5.2 (if compiled using ijs), and testpattern
fr: cups-calibrate, cups-genppd.5.2, cups-genppdupdate, escputil, ijsgutenprint.5.2 (if compiled using ijs), et testpattern

source: libgutenprint.so, libgutenprintui2.so and optionally, various _A444_ filters and backend drivers under /usr/lib/gutenprint/5.2/modules/
fr: libgutenprint.so, libgutenprintui2.so et eventuellement, divers filtres _A444_ et des pilotes sous /usr/lib/gutenprint/5.2/modules/

source: /usr/{include, lib, share}/gutenprint, /usr/include/gutenprintui2 and /usr/share/doc/gutenprint-&gutenprint-version;
fr: /usr/{include, lib, share}/gutenprint, /usr/include/gutenprintui2 et /usr/share/doc/gutenprint-&gutenprint-version;

source: Short Descriptions
fr: Descriptions courtes

source: calibrates the color output of printers using the _A492_ , _A444_ or _A496_ drivers.
fr: calibre la sortie en couleurs des imprimantes en utilisant les pilotes _A492_ , _A444_ ou _A496_.

source: generate Gutenprint PPD files for use with CUPS.
fr: génère les fichiers PPD de Gutenprint pour utiliser avec CUPS.

source: regenerates the Gutenprint PPD files in use by CUPS.
fr: régénère les fichiers PPD de Gutenprint pour utiliser avec CUPS.

source: is a command line utility to perform various maintenance tasks on Epson Stylus inkjet printers.
fr: est un outil en ligne de commande pour effectuer diverses tâches de maintenance sur des imprimantes Epson Stylus à jet d'encre.

source: is a Ghostscript driver for HP inkjet and laserjet printers.
fr: est un pilote Ghostscript pour les imrpimantes HP laser ou à jet d'encre.

source: is a test programm to learn how to use libgutenprint.
fr: est un programme de test pour apprendre comment utiliser libgutenprint.
