Repository: espindula/br-lfs
Catalog: blfs/*/general/genutils/tidy.po
Languages: fr

source: 632 KB
fr: 632 Ko

source: 16 MB
fr: 16 Mo

source: Introduction to Tidy HTML5
fr: Introduction à Tidy HTML5

source: The <application>Tidy HTML5</application> package contains a command line tool and libraries used to read HTML, XHTML and XML files and write cleaned up markup. It detects and corrects many common coding errors and strives to produce visually equivalent markup that is both W3C compliant and compatible with most browsers.
fr: Le paquet <application>Tidy HTML5</application> contient un outil en ligne de commande et des bibliothèques utilisées pour lire des fichiers en HTML, XHTML et en XML et écrire des fichiers correctement présentés. Il détecte et corrige beaucoup d'erreurs de code courantes et s'efforce de produire une présentation visuellement équivalente qui plaît à la fois à W3C et qui soit compatible avec la plupart des navigateurs.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP): <ulink url="&tidy-download-http;"/>
fr: Téléchargement (HTTP)&nbsp;: <ulink url="&tidy-download-http;"/>

source: Download (FTP): <ulink url="&tidy-download-ftp;"/>
fr: Téléchargement (FTP)&nbsp;: <ulink url="&tidy-download-ftp;"/>

source: Download MD5 sum: &tidy-md5sum;
fr: Somme de contrôle MD5 du téléchargement&nbsp;: &tidy-md5sum;

source: Download size: &tidy-size;
fr: Taille du téléchargement&nbsp;: &tidy-size;

source: Estimated disk space required: &tidy-buildsize;
fr: Estimation de l'espace disque requis&nbsp;: &tidy-buildsize;

source: Estimated build time: &tidy-time;
fr: Estimation du temps de construction&nbsp;: &tidy-time;

source: The <application>Tidy HTML5</application> source tarball shown above downloads with the correct name, tidy-html5-&tidy-version;.tar.gz, if using a browser such as Firefox. If you prefer to use a command line program such as wget, you normally would obtain &tidy-version;.tar.gz. To obtain this package with the proper filename, run: <placeholder type="screen" id="0"/>
fr: L'archive <application>Tidy HTML5</application> montrée ci-dessus se télécharge avec le bon nom, tidy-html5-&tidy-version;.tar.gz si vous utilisez un navigateur comme Firefox. Si vous préférez utiliser un programme en ligne de commande comme wget, vous obtiendrez normalement &tidy-version;.tar.gz. Pour obtenir ce paquet avec le bon nom, lancez&nbsp;: <placeholder type="screen" id="0"/>

source: Tidy HTML5 Dependencies
fr: Dépendances de Tidy HTML5

source: Required
fr: Requises

source: Recommended
fr: Recommandées

source: Optional
fr: Facultatives

source: User Notes: <ulink url="&blfs-wiki;/tidy"/>
fr: Notes utilisateur&nbsp;: <ulink url="&blfs-wiki;/tidy"/>

source: Installation of Tidy HTML5
fr: Installation de Tidy HTML5

source: Install <application>Tidy HTML5</application> by running the following commands:
fr: Installez <application>Tidy HTML5</application> en lançant les commandes suivantes&nbsp;:

source: This package does not come with a test suite.
fr: Ce paquet n'est pas fourni avec une suite de tests.

source: Now, as the <systemitem class="username">root</systemitem> user:
fr: Maintenant, en tant qu'utilisateur <systemitem class="username">root</systemitem>&nbsp;:

source: If you wish to install the API documentation you must have <xref linkend="doxygen"/> installed, then change directories into the <filename class='directory'>documentation</filename> directory of the source tree and issue the command <command>doxygen doxygen.cfg</command>. Then as the <systemitem class="username">root</systemitem> user copy the <filename class='directory'>documentation/temp/tidylib_api</filename> directory to <filename class='directory'>/usr/share/doc/tidy-&tidy-version;.</filename>
fr: Si vous souhaitez installer la documentation de l'API, vous devez avoir installé <xref linkend="doxygen"/> puis vous rendre dans le répertoire <filename class='directory'>documentation</filename> de l'arborescence des sources, puis lancez la commande <command>doxygen doxygen.cfg</command>. Puis, en tant qu'utilisateur <systemitem class="username">root</systemitem>, copiez le répertoire <filename class='directory'>documentation/temp/tidylib_api</filename> dans <filename class='directory'>/usr/share/doc/tidy-&tidy-version;</filename>.

source: Command Explanations
fr: Explication des commandes

source: <parameter>-DCMAKE_BUILD_TYPE=Release</parameter>: This switch is used to build the release library without any debug `assert` in the code.
fr: <parameter>-DCMAKE_BUILD_TYPE=Release</parameter>&nbsp;: Ce paramètre permet de construire version release de la bibliothèque sans un «&nbsp;assert&nbsp;» de débogage dans le code.

source: <parameter>-DBUILD_TAB2SPACE=ON</parameter>: This switch is used to enable building the <command>tab2space</command> utility.
fr: <parameter>-DBUILD_TAB2SPACE=ON</parameter>&nbsp;: Ce paramètre active la construction de l'utilitaire <command>tab2space</command>.

source: Configuring Tidy HTML5
fr: Configuration de Tidy HTML5

source: Config Files
fr: Fichiers de configuration

source: The absolute path of the file specified in <envar>$HTML_TIDY</envar>.
fr: Le chemin absolu du fichier est spécifié dans <envar>$HTML_TIDY</envar>.

source: Configuration Information
fr: Informations sur la configuration

source: The default configuration options can be set in the file defined in <envar>$HTML_TIDY</envar>. Additional configuration options can be passed to <command>tidy</command> via command line parameters or the <option>-config &lt;file&gt;</option> parameter.
fr: Les options de configuration par défaut peuvent être réglées dans le fichier défini dans <envar>$HTML_TIDY</envar>. Vous pouvez passer d'autres options de configuration à <command>tidy</command> via des paramètres en ligne de commande ou le paramètre <option>-config &lt;file&gt;</option>.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Library
fr: Bibliothèque installée

source: Installed Directory
fr: Répertoire installé

source: tab2space and tidy
fr: tab2space et tidy

source: libtidy.so and libtidys.a
fr: libtidy.so et libtidys.a

source: Short Descriptions
fr: Descriptions courtes

source: is a utility to expand tabs and ensure consistent line endings.
fr: est un outil pour étendre les tabulations et assurer des fins de lignes cohérentes.

source: validates, corrects, and pretty-prints HTML files.
fr: valide, corrige et améliore l'affichage de fichiers HTML.

source: <filename class='libraryfile'>libtidy.so and libtidys.a</filename>
fr: <filename class='libraryfile'>libtidy.so et libtidys.a</filename>

source: library provides the <application>Tidy HTML5</application> API functions to <command>tidy</command> and can also be called by other programs.
fr: bibliothèque qui fournit l'API des fonctions <application>Tidy HTML5</application> pour <command>tidy</command> et qui peuvent aussi être appelées par d'autres programmes.
