Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/connect/dhcpcd.xml.1.chaine.po
Languages: fr

source: 176 KB
fr: 176 Ko

source: 2.6 MB
fr: 2.6 Mo

source: less than 0.1 SBU
fr: moins de 0.1 SBU

source: Introduction to dhcpcd
fr: Introduction à dhcpcd

source: A DHCP client is useful for connecting your computer to a network which uses DHCP to assign network addresses.
fr: Un client DHCP sert à connecter votre ordinateur à un réseau qui utilise DHCP pour affecter les adresses réseau.

source: dhcpcd strives to be a fully featured, yet very lightweight DHCP client.
fr: dhcpcd vise à être un client très complet mais toujours très léger.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: dhcpcd Dependencies
fr: Dépendances de dhcpcd

source: Optional
fr: Optionnelles

source: User Notes:
fr: Notes utilisateur :

source: Installation of dhcpcd
fr: Installation de dhcpcd

source: Install _A874_ by running the following commands:
fr: Installez _A874_ en lançant les commandes suivantes :

source: This package does not come with a test suite.
fr: Ce paquet n'a pas de suite de tests.

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Command Explanations
fr: Explications des commandes

source: The default _F486_ is not FHS-compliant.
fr: le répertoire par défaut _F486_ n'est pas compatible FHS.

source: Since this directory may need to be available early in the boot, _F261_ cannot be used either.
fr: Depuis que le répertoire doit être disponible plus tôt dans le démarrage, _F261_ ne peut pas être utilisé non plus.

source: The default _F487_ is not FHS-compliant
fr: le répertoire par défaut _F487_ n'est pas compatible FHS

source: You can optionally install more hooks, for example to install some configuration files such as _F1298_ .
fr: Vous pouvez facultativement installer plus de crochets, par exemple pour installer quelques fichiers de configuration comme _F1298_.

source: The set of hooks is in the _F488_ directory in the build tree.
fr: L'ensemble des crochets est dans le répertoire _F488_ dans l'arbre de construction.

source: Configuring dhcpcd
fr: Configurer dhcpcd

source: Config Files
fr: Fichiers de configuration

source: General Configuration Information
fr: Informations de configuration

source: To configure _C1661_ , you need to first install the network service script, _F1300_ included in the _X194_ package (as user _U2_):
fr: Pour configurer _C1661_ , vous avez tout d'abord besoin d'installer le script du service réseau, _F1300_ inclu dans le paquet _X194_ (en tant qu'utilisateur) :

source: Whenever _C1661_ configures or shuts down a network interface, it executes hook scripts.
fr: Chaque fois que _C1661_ configure ou éteint une interface réseau, il exécute les scripts.

source: For more details about those scripts, see the _C1662_ and _C1661_ man pages.
fr: Pour plus de détails sur ces scripts, voir la page de manuel de _C1662_ et de _C1661_.

source: Finally, as the _U2_ user create the _F1089_ configuration file using the following commands.
fr: Enfin, en tant qu'utilisateur _U2_, créez le fichier de configuration _F1089_ en utilisant les commandes suivantes.

source: Adjust appropriately for additional interfaces:
fr: Ajustez de façon appropriée les interfaces supplémentaires :

source: For more information on the appropriate _E23_ and _E24_ values, examine the man page for _C1661_ .
fr: Pour plus d'informations sur les valeurs appropriées de _E24_, consultez la page de man de _C1661_.

source: The default behavior of _C1661_ sets the hostname and mtu settings.
fr: Le comportement par défaut de _C1661_ est de régler le nom de l'hôte et les paramètres du MTU.

source: It also overwrites _F1151_ and _F1060_ .
fr: Il écrasee aussi _F1151_ et _F1060_.

source: These modifications to system files and settings on system configuration files are done by hooks which are stored in _F490_ .
fr: Toutes les modifications des fichiers de système et les paramétrages des fichiers de configuration système sont faites par les scripts conservés dans _F490_.

source: Setup _C1661_ by removing or adding hooks from/to that directory.
fr: Paramétrez _C1661_ en supprimant ou en ajoutant des scripts dans ce répertoire.

source: The execution of hooks can be disabled by using the _O237_) command line option or by the _O238_ option in the _F1299_ file.
fr: Vous pouvez désactiver l'exécution des scripts en utilisant l'option _O237_) de la ligne de commande ou via l'option _O238_ du fichier _F1299_.

source: Review the _C1661_ man page for switches to add to the _E23_ value.
fr: Voir la page de man de _C1661_ pour les paramètres à ajouter à la valeur de _E23_.

source: Configuration Information:
fr: Informations de configuration :

source: fixed ip
fr: ip fixe

source: Although not usual, it is possible that you need to configure _A874_ to use a fixed ip.
fr: Même si c'est pas commun, il est possible que vous vouliez configurer _A874_ pour utiliser une ip fixe.

source: Here, we give an example.
fr: Ici, nous donnons un exemple.

source: As the _U2_ user create the _F1089_ configuration file using the following commands.
fr: En tant qu'utilisateur _U2_ créez le fichier de configuration _F1089_ en utilisant les commandes suivantes.

source: Adjust appropriately for additional interfaces and for the actual ip and router you need:
fr: Ajustez comme il le faut pour les interfaces supplémentaires et pour l'ip actuelle et le routeur dont vous avez besoin :

source: You can either use DNS servers in _F1151_ from another system, your preferred servers, or just the example _F1301_ file below as is:
fr: Vous pouvez également utiliser les serveurs DNS de _F1151_ par un autre système, vos serveurs préférés, ou juste le ficher d'exemple _F1301_ dessous :

source: Contents
fr: Contenu

source: Installed Program
fr: Programme installé

source: Installed Library
fr: Bibliothèque installée

source: Installed Directory
fr: Répertoire installé

source: Short Descriptions
fr: Descriptions courtes

source: is an implementation of the DHCP client specified in RFC2131.
fr: est une implémentation du client DHCP spécifiée dans RFC2131.

source: add udev support for interface arrival and departure; this is because udev likes to rename the interface, which it can't do if dhcpcd grabs it first.
fr: ajoute le support udev pour les arrivées et départs d'interface; C'est parce que udev aime renommer les interfaces ce qui ne peut pas se faire si dhcpcd la jette avant.
