Repository: espindula/br-lfs
Catalog: blfs/traduc/po/networking/connect/dhcp.xml.1.chaine.po
Languages: fr

source: 8.8 MB
fr: 8.8 Mo

source: 212 MB
fr: 212 Mo

source: Introduction to ISC DHCP
fr: Introduction à ISC DHCP

source: The _A789_ package contains both the client and server programs for DHCP.
fr: Le paquet _A789_ contient le client et le serveur DHCP.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Additional Downloads
fr: Téléchargements supplémentaires

source: Required patch:
fr: Correctif requis :

source: Optional patch:
fr: Correctif facultatif :

source: User Notes:
fr: Notes utilisateur :

source: Kernel Configuration
fr: Configuration du noyau

source: You must have Packet Socket support:
fr: Vous devez avoir le support Packet Socket :

source: If you do not have IPv6 support:
fr: Si vous n'aves par le support IPv6 :

source: compiled in, then you must use the
fr: compilé, ensutie vous devez utiliser le correctif

source: Installation of ISC DHCP
fr: Installation d'ISC DHCP

source: This package does not support parallel build.
fr: Ce paquet ne supporte pas la construction parallèle.

source: If you have not compiled IPv6 support into the kernel, apply the missing_ipv6 patch:
fr: Si vous n'avez pas compilé en dur dans le noyau le support d'IPV6, appliquez le correctif missing_patch :

source: Be careful with the instructions below.
fr: Faite attention avec les instructions qui suivent.

source: The single and double quotes are important because the defined variables are used verbatim in the code.
fr: Le simple et le double quotes son important car les variables définies sont utilisés mot pour mot dans le code.

source: Install _A789_ by running the following commands:
fr: Installez _A789_ en lançant les commandes suivantes :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: If you only want to install the _A789_ client, issue the following commands as the _U1_ user:
fr: Si vous ne souhaitez installer que le client _A789_ , lancez les commandes suivantes en tant qu'utilisateur _U1_ :

source: Skip to _X471_ in order to configure the client
fr: Passez au _X471_ pour configurer le client

source: If you only want to install the _A789_ server, issue the following command as the _U1_ user:
fr: Si vous ne voulez installer que le serveur _A789_ , lancez la commande suivante en tant qu'utilisateur _U1_ :

source: Skip to _X472_ in order to configure the server.
fr: Passez au _X472_ pour configurer le serveur.

source: Alternatively, you can install whole package which includes the client, server, relay, static libraries and development headers by running the following commands as the _U1_ user:
fr: Vous pouvez aussi installer tout le paquet, incluant le client, le serveur, le relai, les bibliothèques statiques et les en-têtes de développement, en lançant les commandes suivantes en tant qu'utilisateur _U1_ :

source: Configuring ISC DHCP
fr: Configuration d'ISC DHCP

source: Config Files
fr: Fichiers de configuration

source: Client Configuration
fr: Configuration du client

source: Create basic _F921_ by running the following command as the _U1_ user:
fr: Créez un _F921_ de base en lançant la commande suivante en tant qu'utilisateur _U1_ :

source: See _C2166_ for additional options.
fr: Voir _C2166_ pour des options supplémentaires.

source: Now create the _F923_ directory which will contain DHCP Client leases by running the following command as the _U1_ user:
fr: Maintenant, créez le répertoire _F923_ qui contiendra les interfaces client DHCP en lançant la commande suivante en tant qu'utilisateur _U1_ :

source: At this point you can test if _C2164_ is behaving as expected by running the following command as the _U1_ user:
fr: À cet instant, vous pouvez tester si _C2164_ se comporte comme prévu en lançant la commande suivante en tant qu'utilisateur _U1_ :

source: Replace
fr: Remplacez

source: with your desired interface.
fr: par votre interface désirée.

source: If you want more verbose output, add the _C2167_ parameter to the command above.
fr: Si vous voulez une sortie plus verbeuse, ajoutez le paramètre _C2167_ à la commande ci-dessus.

source: If you want to configure network interfaces at boot using _C2164_ , you need to install the _F924_ script included in _X203_ package:
fr: Si vous voulez configurer des interfaces réseaux au démarrage en utilisant _C2164_ , vous devez installer le script _F924_ inclus dans le paquet _X203_ :

source: Next, create the _F925_ configuration file with the following commands as the _U1_ user:
fr: Ensuite, créez le fichier de configuration _F925_ avec les commandes suivantes en tant qu'utilisateur _U1_ :

source: Adjust the file to suit your needs.
fr: Ajustez le fichier pour correspondre à vos besoins.

source: For more information on the appropriate _E45_ and _E46_ values see _C2168_ .
fr: Pour plus d'informations sur les bonnes valeurs de _E45_ 46_E2168_, voir _C_.

source: Server Configuration
fr: Configuration du serveur

source: Note that you only need the DHCP server if you want to issue LAN addresses over your network.
fr: Remarquez que vous n'avez du serveur DHCP que si vous voulez donner des adresses LAN sur votre réseau.

source: Start with creating _F922_ by running the following command as the _U1_ user:
fr: Commencez par créer _F922_ en lançant la commande suivante en tant qu'utilisateur _U1_ :

source: See _C2169_ for additional options.
fr: Voir _C2169_ pour des options supplémentaires.

source: Now create the _F926_ directory which will contain DHCP Server leases by running the following command as the _U1_ user:
fr: Créez maintenant le répertoire _F926_ qui contiendra les interfaces du serveur DHCP en lançant la commande suivante en tant qu'utilisateur _U1_ :

source: If you want to start the DHCP Server at boot, install the _F927_ init script included in the _X203_ package:
fr: Si vous voulez démarrer le serveur DHCP au démarrage, installez le script de démarrage _F927_ inclus dans le paquet _X203_ :

source: You will need to edit the _F928_ in order to set the interface on which _C2165_ will serve the DHCP requests.
fr: Vous devrez éditer _F928_ pour régler l'interface sur laquelle _C2165_ adressera ses requêtes DHCP.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: dhclient, dhclient-script, dhcpd, dhcrelay and omshell
fr: dhclient, dhclient-script, dhcpd, dhcrelay et omshell

source: libdhcpctl.a, libdst.a and libomapi.a
fr: libdhcpctl.a, libdst.a et libomapi.a

source: /etc/dhcp, /usr/include/dhcpctl, /usr/include/isc-dhcp, /usr/include/omapip, /var/lib/dhclient and /var/lib/dhcpd
fr: /etc/dhcp, /usr/include/dhcpctl, /usr/include/isc-dhcp, /usr/include/omapip, /var/lib/dhclient et /var/lib/dhcpd

source: Short Descriptions
fr: Descriptions courtes

source: is the implementation of the DHCP client.
fr: est l'implémentation du client DHCP.

source: is used by dhclient to (re)configure interfaces.
fr: est utilisé par dhclient pour (re)configurer les interfaces.

source: It can make extra changes by invoking custom dhclient-{entry,exit}-hooks.
fr: Il peut faire des modifications supplémentaires en appelant un dhclient-{entry,exit}-hooks personnalisé.

source: implements Dynamic Host Configuration Protocol (DHCP) and Internet Bootstrap Protocol (BOOTP) requests for network addresses.
fr: implémente les requêtes _fpo_Dynamic Host Configuration Protocol_fpf_ (DHCP, protocole de configuration d'hôte dynamique) et _fpo_Internet Bootstrap Protocol_fpf_ (BOOTP) pour les adresses réseaux.

source: provides a means to accept DHCP and BOOTP requests on a subnet without a DHCP server and relay them to a DHCP server on another subnet.
fr: offre un moyen d'accepter des requêtes DHCP et BOOTP sur un sous-réseau sans serveur DHCP et les relayer vers le serveur DHCP d'un autre sous-réseau.
