Repository: espindula/br-lfs
Catalog: lfs/*/chapter10/grub.po
Languages: fr, pt_br

source: Using GRUB to Set Up the Boot Process
fr: Utiliser GRUB pour paramétrer le processus de démarrage
pt_br: Usando o GRUB para Configurar o Processo de Inicialização

source: If your system has UEFI support and you wish to boot LFS with UEFI, you should skip this page, and configure GRUB with UEFI support using the instructions provided in <ulink url="&blfs-book;postlfs/grub-setup.html">the BLFS page</ulink>.
pt_br: Se seu sistema tiver suporte UEFI e você desejar inicializar o LFS com UEFI, [então] você deveria pular esta página e configurar o GRUB com suporte UEFI usando as instruções fornecidas na <ulink url="&blfs-book;postlfs/grub-setup.html">página do BLFS</ulink>.

source: Introduction
pt_br: Introdução

source: Configuring GRUB incorrectly can render your system inoperable without an alternate boot device such as a CD-ROM or bootable USB drive. This section is not required to boot your LFS system. You may just want to modify your current boot loader, e.g. Grub-Legacy, GRUB2, or LILO.
fr: Une mauvaise configuration de GRUB peut rendre votre système inutilisable si vous n'avez pas d'autre périphérique d'amorçage comme un cédérom. Cette section n'est pas obligatoire pour démarrer votre système LFS. Il se peut que vous vouliez simplement modifier votre chargeur de démarrage actuel, comme Grub-Legacy, GRUB2 ou LILO.
pt_br: Configurar o GRUB incorretamente pode tornar seu sistema inoperável sem um dispositivo alternativo de inicialização, como um CD-ROM ou unidade USB inicializável. Esta seção não é exigida para inicializar seu sistema LFS. Você possivelmente apenas queira modificar seu carregador de inicialização atual, por exemplo, Grub-Legacy, GRUB2 ou LILO.

source: Ensure that an emergency boot disk is ready to <quote>rescue</quote> the computer if the computer becomes unusable (un-bootable). If you do not already have a boot device, you can create one. In order for the procedure below to work, you need to jump ahead to BLFS and install <userinput>xorriso</userinput> from the <ulink url="&blfs-book;multimedia/libisoburn.html"> libisoburn</ulink> package.
fr: Assurez-vous d'avoir un disque de démarrage de façon à pouvoir <quote>dépanner</quote> l'ordinateur si celui-ci devenait inutilisable (non amorçable). Si vous n'avez pas déjà de périphérique de démarrage, vous pouvez en créer un. Afin que la procédure ci-dessous fonctionne, vous devez faire un tour du côté de BLFS et installer <userinput>xorriso</userinput> qui est dans le paquet <ulink url="&blfs-book;multimedia/libisoburn.html">libisoburn</ulink>.
pt_br: Certifique-se de que um disco de inicialização de emergência esteja pronto para <quote>resgatar</quote> o computador se o computador se tornar inutilizável (não inicializável). Se você ainda não tiver um dispositivo de inicialização, [então] você pode criar um. Para a finalidade de que o procedimento abaixo funcione, você precisa saltar para a frente para o BLFS e instalar <userinput>xorriso</userinput> oriundo do pacote <ulink url="&blfs-book;multimedia/libisoburn.html">libisoburn</ulink>.

source: GRUB Naming Conventions
fr: Conventions de nommage de GRUB
pt_br: Convenções de Nomenclatura do GRUB

source: GRUB uses its own naming structure for drives and partitions in the form of <emphasis>(hdn,m)</emphasis>, where <emphasis>n</emphasis> is the hard drive number and <emphasis>m</emphasis> is the partition number. The hard drive numbers start from zero, but the partition numbers start from one for normal partitions (from five for extended partitions). Note that this is different from earlier versions where both numbers started from zero. For example, partition <filename class="partition">sda1</filename> is <emphasis>(hd0,1)</emphasis> to GRUB and <filename class="partition">sdb3</filename> is <emphasis>(hd1,3)</emphasis>. In contrast to Linux, GRUB does not consider CD-ROM drives to be hard drives. For example, if using a CD on <filename class="partition">hdb</filename> and a second hard drive on <filename class="partition">hdc</filename>, that second hard drive would still be <emphasis>(hd1)</emphasis>.
pt_br: O GRUB usa estrutura de nomenclatura própria dele para unidades e partições na forma de <emphasis>(hdn,m)</emphasis>, onde <emphasis>n</emphasis> é o número da unidade rígida e <emphasis>m</emphasis> é o número da partição. Os números da unidade rígida começam do zero, porém os números da partição começam do um para partições normais (do cinco para partições estendidas). Observe que isso é diferente de versões anteriores, onde ambos os números começavam do zero. Por exemplo, a partição <filename class="partition">sda1</filename> é <emphasis>(hd0,1)</emphasis> para o GRUB e <filename class="partition">sdb3</filename> é <emphasis>(hd1,3)</emphasis>. Em contraste com o Linux, GRUB não considera unidades de CD-ROM como unidades rígidas. Por exemplo, se usar um CD em <filename class="partition">hdb</filename> e uma segunda unidade rígida em <filename class="partition">hdc</filename>, [então] aquela segunda unidade rígida ainda seria <emphasis>(hd1)</emphasis>.

source: Setting Up the Configuration
fr: Réglage de la configuration
pt_br: Definindo a Configuração

source: GRUB works by writing data to the first physical track of the hard disk. This area is not part of any file system. The programs there access GRUB modules in the boot partition. The default location is /boot/grub/.
fr: GRUB fonctionne en écrivant les données sur le premier secteur physique du disque dur. Ce secteur ne fait partie d'aucun système de fichiers. Les programmes accèdent alors aux modules de GRUB dans la partition de démarrage. L'emplacement par défaut est /boot/grub/.
pt_br: O GRUB funciona escrevendo dados na a primeira trilha física do disco rígido. Essa área não é parte de nenhum sistema de arquivos. Os aplicativos lá acessam módulos do GRUB na partição de inicialização. O local padrão é /boot/grub/.

source: The location of the boot partition is a choice of the user that affects the configuration. One recommendation is to have a separate small (suggested size is 200 MB) partition just for boot information. That way each build, whether LFS or some commercial distro, can access the same boot files and access can be made from any booted system. If you choose to do this, you will need to mount the separate partition, move all files in the current <filename class="directory">/boot</filename> directory (e.g. the Linux kernel you just built in the previous section) to the new partition. You will then need to unmount the partition and remount it as <filename class="directory">/boot</filename>. If you do this, be sure to update <filename>/etc/fstab</filename>.
pt_br: O local da partição de inicialização é uma escolha do(a) usuário(a) que afeta a configuração. Uma recomendação é ter uma partição pequena (tamanho sugerido é 200 MB) separada somente para informação de inicialização. Dessa forma, cada construção, seja LFS ou alguma distribuição comercial, consegue acessar os mesmos arquivos de inicialização e o acesso pode ser feito a partir de qualquer sistema inicializado. Se você escolher fazer isso, [então] você precisará montar a partição separada, mover todos os arquivos no diretório <filename class="directory">/boot</filename> atual (por exemplo, o núcleo Linux que você recém construiu na seção anterior) para a nova partição. Você então precisará desmontar a partição e remontá-la como <filename class="directory">/boot</filename>. Se você fizer isso, [então] tenha certeza de atualizar <filename>/etc/fstab</filename>.

source: Leaving <filename class="directory">/boot</filename> on the current LFS partition will also work, but configuration for multiple systems is more difficult.
pt_br: Deixar <filename class="directory">/boot</filename> na partição LFS atual também funcionará, porém a configuração para múltiplos sistemas é mais complicada.

source: Using the above information, determine the appropriate designator for the root partition (or boot partition, if a separate one is used). For the following example, it is assumed that the root (or separate boot) partition is <filename class="partition">sda2</filename>.
fr: En utilisant les informations ci-dessus, déterminez le nom adapté à la partition racine (ou partition de démarrage, s'il en existe une distincte). Pour l'exemple suivant, supposons que la partition racine (ou la partition de démarrage) est <filename class="partition">sda2</filename>.
pt_br: Usando a informação acima, determine o designador apropriado para a partição raiz (ou partição de inicialização, se uma separada for usada). Para o exemplo seguinte, é assumido que a partição raiz (ou inicialização separada) é <filename class="partition">sda2</filename>.

source: Install the GRUB files into <filename class="directory">/boot/grub</filename> and set up the boot track:
fr: Installez les fichiers de GRUB dans <filename class="directory">/boot/grub</filename> et paramétrez le secteur d'amorçage&nbsp;:
pt_br: Instale os arquivos do GRUB em <filename class="directory">/boot/grub</filename> e configure a trilha de inicialização:

source: The following command will overwrite the current boot loader. Do not run the command if this is not desired, for example, if using a third party boot manager to manage the Master Boot Record (MBR).
fr: La commande suivante va écraser le chargeur de démarrage actuel. Ne lancez pas la commande si ce n'est pas ce que vous désirez, par exemple si vous utilisez un gestionnaire de démarrage extérieur pour gérer le Master Boot Record (MBR).
pt_br: O seguinte comando sobrescreverá o carregador de inicialização atual. Não execute o comando de isso não for desejado, por exemplo, se usar um gerenciador de inicialização de terceiro para gerenciar o Master Boot Record (MBR).

source: If the system has been booted using UEFI, <command>grub-install</command> will try to install files for the <emphasis>x86_64-efi</emphasis> target, but those files have not been installed in <xref linkend="chapter-building-system"/>. If this is the case, add <option>--target i386-pc</option> to the command above.
pt_br: Se o sistema tiver sido inicializado usando UEFI, [então] o <command>grub-install</command> tentará instalar arquivos para o alvo <emphasis>x86_64-efi</emphasis>, porém aqueles arquivos não foram instalados no <xref linkend="chapter-building-system"/>. Se esse for o caso, [então] adicione <option>--target i386-pc</option> ao comando acima.

source: Creating the GRUB Configuration File
fr: Créer le fichier de configuration de GRUB
pt_br: Criando o Arquivo de Configuração do GRUB

source: Generate <filename>/boot/grub/grub.cfg</filename>:
fr: Générez <filename>/boot/grub/grub.cfg</filename>&nbsp;:
pt_br: Gere o <filename>/boot/grub/grub.cfg</filename>:

source: From <application>GRUB</application>'s perspective, the kernel files are relative to the partition used. If you used a separate /boot partition, remove /boot from the above <emphasis>linux</emphasis> line. You will also need to change the <emphasis>set root</emphasis> line to point to the boot partition.
fr: Du point de vue de <application>GRUB</application>, les fichiers du noyau sont relatifs à la partition utilisée. Si vous avez utilisé une partition /boot distincte, supprimez /boot de la ligne <emphasis>linux</emphasis> ci-dessus. Vous devrez aussi modifier la ligne <emphasis>set root</emphasis> pour pointer vers la partition d'amorçage.
pt_br: A partir da perspectiva do <application>GRUB</application>, os arquivos do núcleo estão relativos à partição usada. Se você usou uma partição /boot separada, [então] remova /boot da linha <emphasis>linux</emphasis> acima. Você também precisará mudar a linha <emphasis>set root</emphasis> para apontar para a partição de inicialização.

source: The GRUB designator for a partition may change if you added or removed some disks (including removable disks like USB thumb devices). The change may cause boot failure because <filename>grub.cfg</filename> refers to some <quote>old</quote> designators. If you wish to avoid such a problem, you may use the UUID of a partition and the UUID of a filesystem instead of a GRUB designator to specify a device. Run <command>lsblk -o UUID,PARTUUID,PATH,MOUNTPOINT</command> to show the UUIDs of your filesystems (in the <literal>UUID</literal> column) and partitions (in the <literal>PARTUUID</literal> column). Then replace <literal>set root=(hdx,y)</literal> with <literal>search --set=root --fs-uuid <replaceable>&lt;UUID of the filesystem where the kernel is installed&gt;</replaceable></literal>, and replace <literal>root=/dev/sda2</literal> with <literal>root=PARTUUID=<replaceable>&lt;UUID of the partition where LFS is built&gt;</replaceable></literal>.
pt_br: O designador do GRUB para uma partição possivelmente mude se você adicionou ou removeu alguns discos (incluindo discos removíveis, como dispositivos USB miniatura). A mudança possivelmente cause falha de inicialização, pois o <filename>grub.cfg</filename> se refere a alguns designadores <quote>antigos</quote>. Se você deseja evitar tal problema, [então] você possivelmente use o UUID de uma partição e o UUID de um sistema de arquivos, em vez de um designador do GRUB para especificar um dispositivo. Execute <command>lsblk -o UUID,PARTUUID,PATH,MOUNTPOINT</command> para exibir os UUIDs dos seus sistemas de arquivos (na coluna <literal>UUID</literal>) e das suas partições (na coluna <literal>PARTUUID</literal>). Então substitua <literal>set root=(hdx,y)</literal> por <literal>search --set=root --fs-uuid <replaceable>&lt;UUID do sistema de arquivos onde o núcleo está instalado&gt;</replaceable></literal>; e substitua <literal>root=/dev/sda2</literal> por <literal>root=PARTUUID=<replaceable>&lt;UUID da partição onde o LFS está construído&gt;</replaceable></literal>.

source: Note that the UUID of a partition is completely different from the UUID of the filesystem in this partition. Some online resources may instruct you to use <literal>root=UUID=<replaceable>&lt;filesystem UUID&gt;</replaceable></literal> instead of <literal>root=PARTUUID=<replaceable>&lt;partition UUID&gt;</replaceable></literal>, but doing so will require an initramfs, which is beyond the scope of LFS.
pt_br: Observe que o UUID de uma partição é completamente diferente do UUID do sistema de arquivos nessa partição. Alguns recursos online possivelmente instruam você a usar o <literal>root=UUID=<replaceable>&lt;UUID do sistema de arquivos&gt;</replaceable></literal>, em vez do <literal>root=PARTUUID=<replaceable>&lt;UUID da partição&gt;</replaceable></literal>, porém fazer isso exigirá um initramfs, o qual está além do escopo do LFS.

source: The name of the device node for a partition in <filename class='directory'>/dev</filename> may also change (this is less likely than a GRUB designator change). You can also replace paths to device nodes like <literal>/dev/sda1</literal> with <literal>PARTUUID=<replaceable>&lt;partition UUID&gt;</replaceable></literal>, in <filename>/etc/fstab</filename>, to avoid a potential boot failure in case the device node name has changed.
pt_br: O nome do nó de dispositivo para uma partição em <filename class='directory'>/dev</filename> também possivelmente mude (isso é menos provável que uma mudança do designador do GRUB). Você também pode substituir caminhos para nós de dispositivo, como <literal>/dev/sda1</literal>, por <literal>PARTUUID=<replaceable>&lt;UUID da partição&gt;</replaceable></literal>, em <filename>/etc/fstab</filename>, para evitar uma potencial falha de inicialização no caso do nome do nó de dispositivo tiver mudado.

source: GRUB is an extremely powerful program and it provides a tremendous number of options for booting from a wide variety of devices, operating systems, and partition types. There are also many options for customization such as graphical splash screens, playing sounds, mouse input, etc. The details of these options are beyond the scope of this introduction.
fr: GRUB est un programme extrêmement puissant et il offre un très grand nombre d'options pour démarrer depuis une large gamme de périphériques, de systèmes d'exploitation et de types de partition. Il a aussi beaucoup d'options de personnalisation telles que les écrans d'accueil graphiques, les annonces sonores, l'entrée à la souris, etc. Les détails de ces options vont au-delà des objectifs de cette introduction.
pt_br: O GRUB é um aplicativo extremamente poderoso e ele fornece um tremendo número de opções para inicializar a partir de uma ampla variedade de dispositivos, sistemas operacionais e tipos de partição. Existem também muitas opções para personalização, tais como telas gráficas de abertura; reprodução de sons; entrada gerada de mouse; etc. Os detalhes dessas opções estão além do escopo desta introdução.

source: There is a command, <application>grub-mkconfig</application>, that can write a configuration file automatically. It uses a set of scripts in /etc/grub.d/ and will destroy any customizations that you make. These scripts are designed primarily for non-source distributions and are not recommended for LFS. If you install a commercial Linux distribution, there is a good chance that this program will be run. Be sure to back up your grub.cfg file.
fr: Il existe une commande, <application>grub-mkconfig</application> qui peut écrire automatiquement un fichier de configuration. Elle utilise un ensemble de scripts situés dans /etc/grub.d/ et elle détruira les personnalisations que vous aurez faites. Ces scripts sont d'abord conçus pour des distributions qui ne se basent pas sur les sources et ils ne sont pas recommandés pour LFS. Si vous installez une distribution Linux commerciale, il est fort probable que ce programme soit lancé. Assurez-vous de sauvegarder votre fichier grub.cfg.
pt_br: Existe um comando, <application>grub-mkconfig</application>, que consegue escrever um arquivo de configuração automaticamente. Ele usa um conjunto de scripts em /etc/grub.d/ e destruirá quaisquer personalizações que você fizer. Esses scripts são projetados primariamente para distribuições não fonte e não são recomendados para o LFS. Se você instalar uma distribuição comercial do Linux, [então] existe uma boa chance de que esse aplicativo seja executado. Tenha certeza de produzir uma cópia de segurança do seu arquivo grub.cfg.

source: If your system has UEFI support and you wish to boot LFS with UEFI, you should skip this page, and config GRUB with UEFI support using the instructions provided in <ulink url="&blfs-book;postlfs/grub-setup.html">the BLFS page</ulink>.
fr: Si votre système prend en charge l'UEFI et que vous souhaitez démarrer LFS en UEFI, vous devriez sauter cette page, et configurer GRUB avec la prise en charge de l'UEFI avec les instructions de <ulink url="&blfs-book;postlfs/grub-setup.html">la page BLFS</ulink>.

source: GRUB uses its own naming structure for drives and partitions in the form of <emphasis>(hdn,m)</emphasis>, where <emphasis>n</emphasis> is the hard drive number and <emphasis>m</emphasis> is the partition number. The hard drive number starts from zero, but the partition number starts from one for normal partitions and five for extended partitions. Note that this is different from earlier versions where both numbers started from zero. For example, partition <filename class="partition">sda1</filename> is <emphasis>(hd0,1)</emphasis> to GRUB and <filename class="partition">sdb3</filename> is <emphasis>(hd1,3)</emphasis>. In contrast to Linux, GRUB does not consider CD-ROM drives to be hard drives. For example, if using a CD on <filename class="partition">hdb</filename> and a second hard drive on <filename class="partition">hdc</filename>, that second hard drive would still be <emphasis>(hd1)</emphasis>.
fr: GRUB utilise sa propre nomenclature de disques et partitions, de la forme <emphasis>(hdn,m)</emphasis>, où <emphasis>n</emphasis> est le numéro du disque dur et <emphasis>m</emphasis> le numéro de la partition. Le numéro du disque dur commence à zéro, mais le numéro de la partition commence à un pour les partitions normales et à cinq pour les partitions étendues. Remarquez que ceci diffère des versions précédentes où les deux numéros commençaient à zéro. Par exemple, les partitions <filename class="partition">sda1</filename> correspond à <emphasis>(hd0,1)</emphasis> pour GRUB et <filename class="partition">sdb3</filename> correspond à <emphasis>(hd1,3)</emphasis>. Contrairement à Linux, GRUB ne considère pas les lecteurs de cédérom comme des disques durs. Par exemple, si un CD se trouve sur <filename class="partition">hdb</filename> et un second disque dur sur <filename class="partition">hdc</filename>, ce dernier disque sera malgré tout <emphasis>(hd1)</emphasis>."

source: The location of the boot partition is a choice of the user that affects the configuration. One recommendation is to have a separate small (suggested size is 200 MB) partition just for boot information. That way each build, whether LFS or some commercial distro, can access the same boot files and access can be made from any booted system. If you choose to do this, you will need to mount the separate partition, move all files in the current <filename class="directory">/boot</filename> directory (e.g. the linux kernel you just built in the previous section) to the new partition. You will then need to unmount the partition and remount it as <filename class="directory">/boot</filename>. If you do this, be sure to update <filename>/etc/fstab</filename>.
fr: L'emplacement de la partition de démarrage est un choix de l'utilisateur qui conditionne la configuration. Une bonne pratique consiste à avoir une petite partition distincte (la taille suggérée est de 200&nbsp;Mo) pour les informations d'amorçage. De cette façon, chaque construction, que ce soit LFS ou d'autres distributions commerciales, peut accéder aux mêmes fichiers de démarrage et n'importe quel système amorcé peut y accéder. Si vous choisissez cette option, vous aurez besoin de monter la partition séparément, de déplacer tous les fichiers du répertoire <filename class="directory">/boot</filename> actuel (par exemple, le noyau linux que vous venez de construire à l'étape précédente) vers la nouvelle partition. Vous aurez ensuite besoin de démonter la partition puis de la remonter en tant que <filename class="directory">/boot</filename>. Si vous le faites, assurez-vous de mettre à jour <filename>/etc/fstab</filename>.

source: Using the current lfs partition will also work, but configuration for multiple systems is more difficult.
fr: L'utilisation de la partition lfs actuelle fonctionnera également, mais la configuration de plusieurs systèmes sera plus difficile.

source: If the system has been booted using UEFI, <command>grub-install</command> will try to install files for the <emphasis>x86_64-efi</emphasis> target, but those files have not been installed in chapter 6. If this is the case, add <option>--target i386-pc</option> to the command above.
fr: Si le système a été démarré en UEFI, <command>grub-install</command> essayera d'installer des fichiers pour la cible <emphasis>x86_64-efi</emphasis>, mais ces fichiers n'ont pas été installés au chapitre 6. Si c'est le cas, ajoutez <option>--target i386-pc</option> à la commande ci-dessus.
