Repository: espindula/br-lfs
Catalog: lfs/*/chapter10/grub.po
Languages: fr, pt_br

source: <userinput>cat &gt; /boot/grub/grub.cfg &lt;&lt; "EOF" <literal># Begin /boot/grub/grub.cfg set default=0 set timeout=5 insmod ext2 set root=(hd0,2) menuentry "GNU/Linux, Linux &linux-version;-lfs-&version;" { linux /boot/vmlinuz-&linux-version;-lfs-&version; root=/dev/sda2 ro }</literal> EOF</userinput>
fr: <userinput>cat &gt; /boot/grub/grub.cfg &lt;&lt; "EOF" <literal># Début de /boot/grub/grub.cfg set default=0 set timeout=5 insmod ext2 set root=(hd0,2) menuentry "GNU/Linux, Linux &linux-version;-lfs-&version;" { linux /boot/vmlinuz-&linux-version;-lfs-&version; root=/dev/sda2 ro }</literal> EOF</userinput>

source: <userinput>cat &gt; /boot/grub/grub.cfg &lt;&lt; "EOF" <literal># Begin /boot/grub/grub.cfg set default=0 set timeout=5 insmod ext2 set root=(hd0,2) menuentry "GNU/Linux, Linux &linux-version;-lfs-&versiond;" { linux /boot/vmlinuz-&linux-version;-lfs-&versiond; root=/dev/sda2 ro }</literal> EOF</userinput>
fr: <userinput>cat &gt; /boot/grub/grub.cfg &lt;&lt; "EOF" <literal># Début de /boot/grub/grub.cfg set default=0 set timeout=5 insmod ext2 set root=(hd0,2) menuentry "GNU/Linux, Linux &linux-version;-lfs-&versiond;" { linux /boot/vmlinuz-&linux-version;-lfs-&versiond; root=/dev/sda2 ro }</literal> EOF</userinput>
