Repository: espindula/br-lfs
Catalog: lfs/*/chapter10/kernel.po
Languages: fr, pt_br

source: <filename>System.map</filename> is a symbol file for the kernel. It maps the function entry points of every function in the kernel API, as well as the addresses of the kernel data structures for the running kernel. It is used as a resource when investigating kernel problems. Issue the following command to install the map file:
fr: <filename>System.map</filename> est un fichier de symboles pour le noyau. Il cartographie les points d'entrée de chaque fonction dans l'API du noyau, ainsi que les adresses de ses structures de données pendant l'exécution. Il sert de référence lors des investigations sur les problèmes de noyau. Lancez la commande suivante pour installer le fichier de symboles&nbsp;:
pt_br: <filename>System.map</filename> é um arquivo de símbolo para o núcleo. Ele mapeia os pontos de entrada de função de cada função na API do núcleo, bem como os endereços das estruturas de dados do núcleo para o núcleo em execução. Ele é usado como um recurso quando se investigar problemas do núcleo. Emita o seguinte comando para instalar o arquivo de mapa:

source: The kernel configuration file <filename>.config</filename> produced by the <command>make menuconfig</command> step above contains all the configuration selections for the kernel that was just compiled. It is a good idea to keep this file for future reference:
fr: Le fichier de configuration du noyau <filename>.config</filename> produit à l'étape <command>make menuconfig</command> ci-dessus contient toutes les options de configuration choisies pour le noyau qui vient d'être compilé. Conserver ce fichier est une bonne idée pour pouvoir s'y référer plus tard&nbsp;:
pt_br: O arquivo de configuração do núcleo <filename>.config</filename> produzido pelo passo <command>make menuconfig</command> acima contém todas as seleções de configuração para o núcleo que foi recém compilado. É uma boa ideia manter esse arquivo para futura referência:

source: Install the documentation for the Linux kernel:
fr: Installez la documentation du noyau Linux&nbsp;:
pt_br: Instale a documentação para o núcleo Linux:

source: It is important to note that the files in the kernel source directory are not owned by <emphasis>root</emphasis>. Whenever a package is unpacked as user <emphasis>root</emphasis> (like we did inside chroot), the files have the user and group IDs of whatever they were on the packager's computer. This is usually not a problem for any other package to be installed because the source tree is removed after the installation. However, the Linux source tree is often retained for a long time. Because of this, there is a chance that whatever user ID the packager used will be assigned to somebody on the machine. That person would then have write access to the kernel source.
fr: Il est important de noter que les fichiers dans le répertoire des sources du noyau n'appartiennent pas à <emphasis>root</emphasis>. Chaque fois qu'un paquet est déballé par l'utilisateur <emphasis>root</emphasis> (comme on a fait dans chroot), les fichiers ont les ID de l'utilisateur et du groupe de l'empaqueteur sur son système hôte. En principe ce n'est pas un problème car l'arborescence des sources est supprimée après l'installation. En revanche, l'arborescence de Linux est souvent conservée longtemps. Du coup, il y a des chances que tout ce que l'ID de l'utilisateur ayant déballé le paquet a utilisé ne soit affecté à quelqu'un d'autre sur la machine. Cette personne pourrait alors avoir un droit d'écriture sur les sources du noyau.
pt_br: É importante observar que os arquivos no diretório do fonte do núcleo não são de propriedade do(a) <emphasis>root</emphasis>. Sempre que um pacote é desempacotado como o(a) usuário(a) <emphasis>root</emphasis> (como nós fizemos dentro do chroot), os arquivos tem os IDs de usuário(a) e de grupo do que quer que fossem no computador do(a) empacotador(a). Isso geralmente não é um problema para qualquer outro pacote ser instalado, pois a árvore do fonte é removida depois da instalação. Entretanto, a árvore do fonte do Linux frequentemente é mantida por um longo tempo. Devido a isso, existe uma chance de que qualquer ID de usuário(a) que o(a) empacotador(a) usou seja atribuído para alguém na máquina. Essa pessoa então teria acesso de escrita ao fonte do núcleo.

source: In many cases, the configuration of the kernel will need to be updated for packages that will be installed later in BLFS. Unlike other packages, it is not necessary to remove the kernel source tree after the newly built kernel is installed.
fr: Dans de nombreux cas, la configuration du noyau aura besoin d'être mise à jour pour les paquets qui serojnt installés plutard dans BLFS. Contrairement aux autres paquets, il n'est pas nécessaire de supprimer les sources du noyau après l'installation du noyau nouvellement construit.
pt_br: Em muitos casos, a configuração do núcleo precisará ser atualizada para pacotes que serão instalados posteriormente no BLFS. Diferente de outros pacotes, não é necessário remover a árvore do fonte do núcleo depois que o recém construído núcleo for instalado.

source: If the kernel source tree is going to be retained, run <command>chown -R 0:0</command> on the <filename class="directory">linux-&linux-version;</filename> directory to ensure all files are owned by user <emphasis>root</emphasis>.
fr: Si vous conservez l'arborescence des sources du noyau, lancez <command>chown -R 0:0</command> sur le répertoire <filename class="directory">linux-&linux-version;</filename> pour vous assurer que tous les fichiers appartiennent à <emphasis>root</emphasis>.
pt_br: Se a árvore do fonte do núcleo será mantida, [então] execute <command>chown -R 0:0</command> no diretório <filename class="directory">linux-&linux-version;</filename> para assegurar que todos os arquivos sejam de propriedade do(a) usuário(a) <emphasis>root</emphasis>.

source: Some kernel documentation recommends creating a symlink from <filename class="symlink">/usr/src/linux</filename> pointing to the kernel source directory. This is specific to kernels prior to the 2.6 series and <emphasis>must not</emphasis> be created on an LFS system as it can cause problems for packages you may wish to build once your base LFS system is complete.
fr: Certaines documentations du noyau recommandent de créer un lien symbolique à partir de <filename class="symlink">/usr/src/linux</filename> pointant vers le répertoire des sources du noyau. Ceci est spécifique aux noyaux antérieurs à la série 2.6 et <emphasis>ne doit pas</emphasis> être réalisé sur un système LFS car il peut poser des problèmes pour les paquets que vous souhaitez construire une fois votre système LFS de base complet.
pt_br: Alguma documentação do núcleo recomenda criar um link simbólico a partir de <filename class="symlink">/usr/src/linux</filename> apontando para o diretório do fonte do núcleo. Isso é específico para núcleos anteriores à série 2.6 e <emphasis>precisa não</emphasis> ser criado em um sistema LFS, uma vez que ele pode causar problemas para pacotes que você possivelmente deseje construir tão logo seu sistema base LFS esteja completo.

source: The headers in the system's <filename class="directory">include</filename> directory (<filename class="directory">/usr/include</filename>) should <emphasis>always</emphasis> be the ones against which Glibc was compiled, that is, the sanitised headers installed in <xref linkend="ch-tools-linux-headers"/>. Therefore, they should <emphasis>never</emphasis> be replaced by either the raw kernel headers or any other kernel sanitized headers.
fr: Les en-têtes du répertoire système <filename class="directory">include</filename> (<filename class="directory">/usr/include</filename>) devraient <emphasis>toujours</emphasis> être ceux avec lesquels Glibc a été compilée, à savoir, les en-têtes nettoyés installés au <xref linkend="ch-tools-linux-headers"/>. Donc, ils ne devraient <emphasis>jamais</emphasis> être remplacés par les en-têtes du noyau brut ou par d'autres en-têtes nettoyés du noyau.
pt_br: Os cabeçalhos no diretório <filename class="directory">include</filename> do sistema (<filename class="directory">/usr/include</filename>) deveriam <emphasis>sempre</emphasis> ser aqueles contra os quais a Glibc foi compilada, isto é, os cabeçalhos sanitizados instalados na <xref linkend="ch-tools-linux-headers"/>. Portanto, eles <emphasis>nunca</emphasis> deveriam ser substituídos nem pelos cabeçalhos crus do núcleo nem por quaisquer outros cabeçalhos sanitizados do núcleo.

source: Configuring Linux Module Load Order
fr: Configuration de l'ordre de chargement des modules Linux
pt_br: Configurando a Ordem de Carregamento de Módulo do Linux

source: Most of the time Linux modules are loaded automatically, but sometimes it needs some specific direction. The program that loads modules, <command>modprobe</command> or <command>insmod</command>, uses <filename>/etc/modprobe.d/usb.conf</filename> for this purpose. This file needs to be created so that if the USB drivers (ehci_hcd, ohci_hcd and uhci_hcd) have been built as modules, they will be loaded in the correct order; ehci_hcd needs to be loaded prior to ohci_hcd and uhci_hcd in order to avoid a warning being output at boot time.
fr: La plupart du temps, les modules Linux sont chargés automatiquement, mais il faut parfois des directives supplémentaires. Le programme qui charge les modules, <command>modprobe</command> ou <command>insmod</command>, utilise <filename>/etc/modprobe.d/usb.conf</filename> à cette fin. Il faut créer ce fichier afin que, si les pilotes USB (ehci_hcd, ohci_hcd et uhci_hcd) ont été construits en module, ils soient chargés dans le bon ordre&nbsp;; ehci_hcd doit être chargé avant ohci_hcd et uhci_hcd afin d'éviter un avertissement au moment du démarrage.
pt_br: Na maior parte do tempo, os módulos do Linux são carregados automaticamente, porém algumas vezes precisa-se de alguma direção específica. O aplicativo que carrega os módulos, <command>modprobe</command> ou o <command>insmod</command>, usa <filename>/etc/modprobe.d/usb.conf</filename> para esse propósito. Esse arquivo precisa ser criado, de forma que, se os controladores do USB (ehci_hcd, ohci_hcd e uhci_hcd) tiverem sido construídos como módulos, [então] eles sejam carregados na ordem correta; ehci_hcd precisa ser carregado antes de ohci_hcd e uhci_hcd para a finalidade de evitar um aviso sendo produzido em tempo de inicialização.

source: Create a new file <filename>/etc/modprobe.d/usb.conf</filename> by running the following:
fr: Créez un nouveau <filename>/etc/modprobe.d/usb.conf</filename> en lançant ce qui suit&nbsp;:
pt_br: Crie um novo arquivo <filename>/etc/modprobe.d/usb.conf</filename> executando o seguinte:

source: <userinput>install -v -m755 -d /etc/modprobe.d cat &gt; /etc/modprobe.d/usb.conf &lt;&lt; "EOF" <literal># Begin /etc/modprobe.d/usb.conf install ohci_hcd /sbin/modprobe ehci_hcd ; /sbin/modprobe -i ohci_hcd ; true install uhci_hcd /sbin/modprobe ehci_hcd ; /sbin/modprobe -i uhci_hcd ; true # End /etc/modprobe.d/usb.conf</literal> EOF</userinput>
fr: <userinput>install -v -m755 -d /etc/modprobe.d cat &gt; /etc/modprobe.d/usb.conf &lt;&lt; "EOF" <literal># Début de /etc/modprobe.d/usb.conf install ohci_hcd /sbin/modprobe ehci_hcd ; /sbin/modprobe -i ohci_hcd ; true install uhci_hcd /sbin/modprobe ehci_hcd ; /sbin/modprobe -i uhci_hcd ; true # Fin de /etc/modprobe.d/usb.conf</literal> EOF</userinput>
pt_br: <userinput>install -v -m755 -d /etc/modprobe.d cat &gt; /etc/modprobe.d/usb.conf &lt;&lt; "EOF" <literal># Início do /etc/modprobe.d/usb.conf install ohci_hcd /sbin/modprobe ehci_hcd ; /sbin/modprobe -i ohci_hcd ; true install uhci_hcd /sbin/modprobe ehci_hcd ; /sbin/modprobe -i uhci_hcd ; true # Fim do /etc/modprobe.d/usb.conf</literal> EOF</userinput>

source: Contents of Linux
fr: Contenu de Linux
pt_br: Conteúdo do Linux

source: Installed files
fr: Fichiers installés
pt_br: Arquivos instalados

source: Installed directories
fr: Répertoires installés
pt_br: Diretórios instalados

source: config-&linux-version;, vmlinuz-&linux-version;-lfs-&version;, and System.map-&linux-version;
pt_br: config-&linux-version;, vmlinuz-&linux-version;-lfs-&version; e System.map-&linux-version;

source: /lib/modules, /usr/share/doc/linux-&linux-version;
pt_br: /lib/modules e /usr/share/doc/linux-&linux-version;

source: Short Descriptions
fr: Descriptions courtes
pt_br: Descrições Curtas

source: Contains all the configuration selections for the kernel
fr: Contient toutes les options de configuration choisies pour le noyau
pt_br: Contém todas as seleções de configuração para o núcleo

source: The engine of the Linux system. When turning on the computer, the kernel is the first part of the operating system that gets loaded. It detects and initializes all components of the computer's hardware, then makes these components available as a tree of files to the software and turns a single CPU into a multitasking machine capable of running scores of programs seemingly at the same time
fr: Le moteur du système Linux. Au démarrage de l'ordinateur, le noyau est la première partie du système d'exploitation à être chargée. Il détecte et initialise tous composants matériels de l'ordinateur, puis rend disponible les composants dans une arborescence de fichiers pour les logiciels qui en ont besoin, et transforme une machine monoprocesseur en une machine multitâche capable d'exécuter plusieurs programmes quasi simultanément
pt_br: O motor do sistema Linux. Quando se liga o computador, o núcleo é a primeira parte do sistema operacional que se torna carregada. Ele detecta e inicializa todos os componentes do hardware do computador, então torna esses componentes disponíveis como uma árvore de arquivos para o software e transforma uma CPU individual em uma máquina multitarefa capaz de executar dezenas de aplicativos aparentemente ao mesmo tempo

source: A list of addresses and symbols; it maps the entry points and addresses of all the functions and data structures in the kernel
fr: Une liste d'adresses et de symboles donnant la correspondance entre les points d'entrée, et les adresses de toutes les fonctions et structures de données du noyau
pt_br: Uma lista de endereços e símbolos; ele mapeia os pontos de entrada e endereços de todas as funções e estruturas de dados no núcleo

source: <parameter>LANG=&lt;host_LANG_value&gt; LC_ALL=</parameter>
fr: <parameter>LANG=&lt;valeur_LANG_de_l_hote&gt; LC_ALL=</parameter>

source: For general information on kernel configuration see <ulink url="&hints-root;kernel-configuration.txt"/>. BLFS has some information regarding particular kernel configuration requirements of packages outside of LFS at <ulink url="&blfs-book;longindex.html#kernel-config-index"/>. Additional information about configuring and building the kernel can be found at <ulink url="http://www.kroah.com/lkn/"/>
fr: Pour des informations d'ordre général sur la configuration du noyau, consultez <ulink url="http://www.fr.linuxfromscratch.org/view/astuces/kernel-configuration-fr.txt"/>. BLFS offre aussi quelques informations complémentaires concernant les besoins particuliers de configuration pour les paquets en dehors de LFS sur <ulink url="&blfs-book;longindex.html#kernel-config-index"/>. Vous pouvez trouver des informations supplémentaires sur la configuration et la construction du noyau sur <ulink url="http://www.kroah.com/lkn/"/>

source: There are several other options that may be desired depending on the requirements for the system. For a list of options needed for BLFS packages, see the <ulink url="&lfs-root;blfs/view/&short-version;/longindex.html#kernel-config-index">BLFS Index of Kernel Settings</ulink> (&lfs-root;blfs/view/&short-version;/longindex.html#kernel-config-index).
fr: Vous pourriez souhaiter d'autres options selon les besoins de votre système. Pour une liste des options nécessaires pour les paquets BLFS, voir <ulink url="http://www.fr.linuxfromscratch.org/view/blfs-svn/longindex.html#kernel-config-index">L'index des options du noyau pour BLFS</ulink> (&blfs-book;/longindex.html#kernel-config-index).

source: If your host hardware is using UEFI, then the 'make defconfig' above should automatically add in some EFI-related kernel options.
fr: Si votre matériel utilise UEFI, alors le «&nbsp;make defconfig&nbsp;» ci-dessus devrait automatiquement ajouter certaines options du noyau liées à EFI.

source: In order to allow your LFS kernel to be booted from within your host's UEFI boot environment, your kernel must have this option selected:
fr: Pour permettre à votre noyau LFS de démarrer depuis l'environnement de démarrage UEFI de votre hôte, vous devez avoir sélectionné cette option dans votre noyau&nbsp;:

source: A fuller description of managing UEFI environments from within LFS is covered by the lfs-uefi.txt hint at <ulink url="&hints-root;lfs-uefi.txt"/>.
fr: Une description plus avancée sur la gestion des environnements UEFI dans LFS est disponible dans l'astuce lfs-uefi.txt sur <ulink url="http://fr.linuxfromscratch.org/view/astuces/lfs-uefi-fr.txt" />.

source: Having this option set may interfere with device management when using Udev/Eudev.
fr: L'activation de cette option peut interférer avec la gestion de périphériques quand on utilise Udev/Eudev.

source: This will create automated device nodes which are populated by the kernel, even without Udev running. Udev then runs on top of this, managing permissions and adding symlinks. This configuration item is required for all users of Udev/Eudev.
fr: Ceci créera des n&oelig;uds de périphérique automatiquement, générés par le noyau même sans Udev. Udev fonctionne alors sur cette base pour gérer les droits et l'ajout de liens symboliques. Cet élément de configuration est nécessaire pour tous les utilisateurs d'udev/eudev.

source: If the host system has a separate /boot partition, the files copied below should go there. The easiest way to do that is to bind /boot on the host (outside chroot) to /mnt/lfs/boot before proceeding. As the root user in the <emphasis>host system</emphasis>:
fr: Si le système hôte a une partition /boot séparée, les fichiers copiés ci-dessous devraient aller là. La manière la plus simple de procéder est de lier /boot sur l’hôte (en dehors du chroot) à /mnt/lfs/boot avant de continuer. En tant qu'utilisateur root sur le <emphasis>système hôte</emphasis>&nbsp;:

source: config-&linux-version;, <phrase revision="sysv">vmlinuz-&linux-version;-lfs-&version;,</phrase> <phrase revision="systemd">vmlinuz-&linux-version;-lfs-&versiond;,</phrase> and System.map-&linux-version;
fr: config-&linux-version;, <phrase revision="sysv">vmlinuz-&linux-version;-lfs-&version;,</phrase> <phrase revision="systemd">vmlinuz-&linux-version;-lfs-&versiond;,</phrase> et System.map-&linux-version;
