Repository: espindula/br-lfs
Catalog: clfs/*/final-system/common/linux-headers.po
Languages: fr

source: Linux-&linux-version2; Headers
fr: En-têtes Linux-&linux-version2;

source: Linux Headers
fr: En-têtes Linux

source: The Linux Kernel contains a <command>make</command> target that installs <quote>sanitized</quote> kernel headers.
fr: Le noyau Linux contient une cible <command>make</command> qui installe les en-têtes du noyau <quote>nettoyées</quote>.

source: Installation of Linux Headers
fr: Installation de Linux Headers

source: For this step you will need to unpack the kernel tarball (<filename>linux-&linux-version;.tar.xz</filename>) and <command>cd</command> into its source directory before entering the commands on this page.
fr: Pour cette étape, vous aurez besoin de décompresser l'archive du noyau (<filename>linux-&linux-version;.tar.xz</filename>) et de vous <command>cd</command> dans le répertoire des sources avant d'entrer les commandes de cette page.

source: Install the kernel header files:
fr: Installez les fichiers d'en-têtes du noyau&nbsp;:

source: The meaning of the make commands:
fr: Voici la signification des commandes make&nbsp;:

source: Ensures that the kernel source dir is clean.
fr: S'assure que le répertoire des sources du noyau est propre.

source: Sanitizes the raw kernel headers so that they can be used by userspace programs.
fr: Nettoie les en-têtes bruts du noyau pour qu'ils puissent être utilisés par les programmes en espace utilisateur.

source: This will install the kernel headers into <filename class="directory">/usr/include</filename>.
fr: Cela installera les en-têtes du noyau dans <filename class="directory">/usr/include</filename>.

source: Removes a number of unneeded debugging files that were installed.
fr: Supprime un certain nombre du fichiers de débogage inutiles qui ont été installés.

source: Contents of Linux Headers
fr: Contenu de Linux Headers

source: Installed headers
fr: En-têtes installés

source: Installed directories
fr: Répertoires installés

source: Short Descriptions
fr: Descriptions courtes

source: The Linux API headers
fr: Les en-têtes de l'API Linux
