Repository: espindula/br-lfs
Catalog: clfs/*/final-system/common/temp-perl.po
Languages: fr

source: Temporary Perl-&perl-version;
fr: Perl-&perl-version; temporaire

source: temporary tools
fr: outils temporaires

source: Installation of Perl
fr: Installation de Perl

source: In this section, we will add Perl to the temporary system in <filename class="directory">/tools</filename>. This package installation should technically be part of <xref linkend="chapter-temp-system"/>, but Perl has often had problems with cross-compiling, so we will compile and install it while in the final build environment.
fr: Dans cette section, nous ajouterons Perl au système temporaire dans <filename class="directory">/tools</filename>. L'installation de ce paquet devrait techniquement avoir lieu dans <xref linkend="chapter-temp-system"/>, mais Perl a souvent eu des problèmes avec la compilation croisée, donc nous le compilerons et l'installeront depuis l'environnement de construction du système final.

source: Change a hardcoded path from <filename class="directory">/usr/include</filename> to <filename class="directory">/tools/include</filename>:
fr: Modifiez un chemin codé en dur de <filename class="directory">/usr/include</filename> vers <filename class="directory">/tools/include</filename>&nbsp;:

source: Prepare Temporary Perl for compilation:
fr: Préparez le perl temporaire pour la compilation&nbsp;:

source: The meaning of the configure option:
fr: Voici la signification de l'option de configure&nbsp;:

source: Tells Perl to use <command>gcc</command> instead of the default <command>cc</command>.
fr: Dit à Perl d'utiliser <command>gcc</command> à la place du <command>cc</command> par défaut.

source: Compile the package:
fr: Compilez le paquet&nbsp;:

source: Although Perl comes with a test suite, it is not recommended to run it at this point, as this Perl installation is only temporary. The test suite can be run later in this chapter if desired.
fr: Bien que Perl soit fourni avec une suite de tests, il n'est pas recommandé de l'exécuter à ce moment, vu que cette installation de Perl n'est que temporaire. Vous pouvez lancer la suite de tests plus tard dans ce chapitre si vous le souhaitez.

source: Install the package:
fr: Installez le paquet&nbsp;:

source: Finally, create a necessary symlink:
fr: Enfin, créez un lien symbolique nécessaire&nbsp;:

source: Details on this package are located in <xref linkend="contents-perl" role="."/>
fr: Des détails sur ce paquet se trouvent sur <xref linkend="contents-perl" role="."/>
