Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/typesetting/texlive.xml.1.chaine.po
Languages: fr

source: 44 MB
fr: 44 Mo

source: 4.0 GB including the additional download
fr: 4.0 Go including the additional download

source: 1.8 GB
fr: 1.8 Go

source: Introduction to TeX Live from source
fr: Introduction à TeX Live from source

source: Most of TeX Live can be built from source without a pre-existing installation, but _A560_ (for indexing) needs working versions of _C2050_ and _C2051_ when configure is run, and the testsuite and install for _C1424_ (for vector graphics) will fail if TeX has not already been installed.
fr: La plupart de TeX Live peut être construit depuis les sources sans une installation pré-existante, mais _A560_ (pour l'indexage) demande des versions en fonctionnement de _C2050_ et _C2051_ quand configure est lancé, et les suites de tests et l'installation de _C1424_ (pour les graphiques vectoriels) échoueront si TeX n'a pas déjà été installé.

source: Additionally, _A572_ is not provided within the _A419_ source.
fr: En supplément, _A572_ n'est pas fournit dans les sources de _A419_.

source: All of those packages are dealt with on their own pages and can be built after installing this package.
fr: L'ensemble de ses paquets sont expliqués dans leurs propres pages et peuvent être construit après l'installation de ce paquet.

source: If you have not already done so, you should start at _X360_ so that the final commands to initialise the new installation will be found.
fr: si vous ne l'avez pas encore fait, vous pouvez démarrer par _X360_ pour que les dernières commandes pour initialiser la nouvelle installation soit trouvées.

source: Package Information
fr: Informations sur le paquet

source: Download (HTTP):
fr: Téléchargement (HTTP) :

source: Download (FTP):
fr: Téléchargement (FTP) :

source: Download MD5 sum:
fr: Somme de contrôle MD5 du téléchargement :

source: Download size:
fr: Taille du téléchargement :

source: Estimated disk space required:
fr: Estimation de l'espace disque requis :

source: Estimated build time:
fr: Estimation du temps de construction :

source: Required Additional Download
fr: Téléchargement supplémentaire requis

source: Much of the texlive environment (including scripts, documentation, fonts and various other files) is not part of the source tarball.
fr: Beaucoup de l'environnement texlive (incluant scripts, documentation, polices et différents autres fichiers) ne sont pas dans l'archive des sources.

source: You must download it separately.
fr: Vous devez les télécharger séparément.

source: This will give you all of the additional files which are provided by a full install of the binary version, there is no realistic way to restrict which parts get installed.
fr: Cela vous donnera tous les fichiers supplémentaires qui sont fournis par une isntallation complète de la version binaire, ce n'est pas réaliste de limiter les parties à installer.

source: Because of the size of this package, it is unlikely to be mirrored by BLFS mirrors.
fr: A cause de la taille de ce paquet, il n'est pas en mirroir sur les mirroirs BLFS.

source: In case of difficulty, go to http://www.ctan.org/mirrors/ to find a more-accessible mirror.
fr: En cas de problème, allez sur http://www.ctan.org/mirrors/ pour trouver un mirroir plus accessible.

source: TeX Live from source Dependencies
fr: Dépendances de TeX Live depuis les sources

source: Recommended
fr: Recommandées

source: Optional
fr: Optionnelles

source: Runtime dependencies
fr: Dépendances d'exécution

source: User Notes:
fr: Notes utilisateur :

source: Installation of TeX Live
fr: Installation de TeX Live

source: Install TeX Live by running the following commands:
fr: Installez TeX Live en lançant la suite :

source: The shared libraries will be installed into a texlive directory.
fr: Les bibliothèques partagées seront installées dans le répertoire de texlive.

source: As the _U2_ user, add it to your _F1015_ :
fr: En tant qu'utilisateur _U2_, ajoutez le à votre _F1015_ :

source: From 2015 onwards, a successful install requires some texlive commands to be run as the root user, so we will export the TEXARCH variable to let _U2_ use it.
fr: Depuis la version 2015, une installation complête demande que des commandes de texlive soient lancées en tant qu'utilisateur root, donc nous exporterons la variable TEXARCH pour que _U2_ l'utilise.

source: Now, as a normal user:
fr: Maintenant, en tant qu'utilisateur normal :

source: To test the results, issue:
fr: Pour tester les résultats, lancez :

source: Now, as the _U2_ user:
fr: Maintenant, en tant qu'utilisateur _U2_ :

source: Only run _C2052_ once.
fr: Lancez _C2052_ seulement une fois.

source: If it is rerun, it can change all the program symlinks so that they point to themselves and are useless.
fr: S'il est relancé, il peut changer tous les liens symboliques des programmes pour qu'ils pointent sur eux-même et soient inutiles.

source: Now install the additional files as the _U2_ user:
fr: Et maintenant, installez les fichiers supplémentaires en tant qu'utilisateur _U2_ :

source: Still as the _U2_ user, initialise the new system (the commands _C2053_ and _C2054_ will produce a
fr: Restez en utilisateur _U2_, initialisez le nouveau système (les commandes _C2053_ et _C2054_ produiront

source: lot
fr: beaucoup

source: of output):
fr: de lignes d'affichage) :

source: You can now proceed to _X536_ , _X715_ and / or _X359_ if you wish to install them.
fr: Vous pouvez maintenant faire _X536_ , _X715_ et / ou _X359_ si vous souhaitez les installer.

source: Command Explanations
fr: Explications des commandes

source: use this if you do not have Xorg installed.
fr: utilisez cela si vous n'avez pas installé Xorg.

source: this runs the texlinks.sh script to create symbolic links from formats to engines.
fr: cela lance le script texlinks.sh pour créer les liens symboliques depuis les formats du moteur.

source: In practice, several of the targets such as _C2055_ are now separate binaries and for these it will report "file already exists".
fr: En pratique, plusieurs des cibles comme _C2055_ sont maintenant des binaires séparés et pour ceux la signalera "fichiers existants".

source: the tarball contains the files for the texmf-dist directory, and because of its size we do not want to waste time and space untarring it and then copying the files.
fr: L'archive contient les fichiers pour le répertoire texmf-dist, et à cause de sa taille nous ne voulons pas gaspiller de temps et d'espace à le déballer et ensuite copier les fichiers.

source: This puts the perl modules _F1423_ and _F1424_ into the directory where the binary installer puts them - it is at the start of the perl @INC@ PATH within texlive when installed using the above configure switches.
fr: cela met les modules perl _F1423_ et _F1424_ dans le repertoire ou l'installateur binaire les place - c'est au début du PATH perl @INC@ dans texlive quand l'installation utilise les paramêtres de configuration suivant.

source: Without these modules, texlive is unusable.
fr: Sans ces modules, texlive est inutilisable.

source: Create an _F1425_ file which lists what was installed - this is used by kpathsea to find files.
fr: Crée un fichier _F1425_ qui liste ce qui a été installé - c'est utilisé par kpathsea pour trouver les fichiers.

source: This initialises the TeX formats, Metafont bases and Metapost mems.
fr: Cela initialise les formats TeX, les bases de Metafont et les memoires de Metapost.

source: This initialise the ConTeXt system.
fr: Cela initialise le système ConTeXt.

source: Contents
fr: Contenu

source: Installed Programs
fr: Programmes installés

source: Installed Libraries
fr: Bibliothèques installées

source: Installed Directories
fr: Répertoires installés

source: Over 300 binaries and symlinks to scripts
fr: Plus de 300 binaires et liens symboliques vers des scripts

source: Short Descriptions
fr: Descriptions courtes

source: (kpathsearch) exists to look up a file in a list of directories and is used by _C2057_ .
fr: (kpathsearch) existe pour rechercher un fichier dans une liste de répertoires et est utilisé par _C2057_.

source: is a library for Japanese pTeX (publishing TeX).
fr: est une bibliothèque pour pTeX japonnais (publishing TeX).

source: provides Lua 5.2, modified for use with LuaTeX.
fr: fournit Lua 5.2, modifié pour fonctionner avec LuaTeX.

source: provides LuaJIT, modified for use with LuaJITTeX.
fr: fournit LuaJIT, modifié pour fonctionner avec LuaJITTeX.
