Repository: espindula/br-lfs
Catalog: blfs/traduc/po/pst/typesetting/typesetting.xml.1.chaine.po
Languages: fr

source: Typesetting
fr: Typographie

source: This chapter includes _A419_ applications that create output equivalent to typesetting.
fr: Ce chapitre inclut des applications _A419_ qui créent une sortie équivalente à de la typographie.

source: There are two alternative routes through this chapter:
fr: Il y a deux routes différentes pour parcourir ce chapitre :

source: Some people may wish to use the binary installer, either because of the complexity of installing all of _A419_ from source, or because they only want a part of the package, or perhaps because they wish to get updates as soon as those are available (the source is only updated annually, but the binaries and associated tex and sty files are updated for approximately 10 months).
fr: Certain peuvent souhaiter utiliser l'installateur binaire, soit à cause de la complexité d'installation de tous _A419_ depuis les sources, ou car ils ne veulent qu'une partie du paquet, ou peut être car ils souhaitent mettre à jour seulement quand elles sont disponibles (les sources sont seulement mis à jour annuellement, mais les binaires et les fichier tex et sty associés sont mis à jour apprixamitivement tous les 10 mois).

source: These people should begin at _X360_ and then follow the _X39_ instructions, .
fr: Ces personnes peuvent commnencer par _X360_ et ensuite suivre les instructions de _X39_.

source: After installing, they can run _C1141_ to update their system.
fr: Après l'installation, ils peuvent lancer _C1141_ pour mettre à jour leur système.

source: Most people reading BLFS will wish to build from source.
fr: La plupart des personnes lisant BLFS souhaiteront construire depuis les sources.

source: BLFS used to start by installing _A418_ and then use that to bootstrap the build.
fr: BLFS utilise pour commencer l'installation de _A418_ et ensuite utilise cela pour bootstrapper la construction.

source: Nowadays, we build almost the whole of _A419_
fr: Actuellement, nous construisons la majeure partie de _A419_

source: without
fr: sans

source: a binary install, by adding the separately-packaged texmf files into this build.
fr: une installation binaire, en ajoutant les fiohiers de texmf paquagés séparément dans la construction.

source: For this, begin at _X360_ then go to _X47_ which will install most of _A419_ , together with
fr: Pour cela, commencez par _X360_ et ensuite aller à _X47_ qui installera la plupart de _A419_ , avec

source: all
fr: tous

source: of the supporting files.
fr: les fichiers supportés.

source: This almost-complete install can then be used to build the remaining parts of _A419_ :
fr: Une installation encore plus complète peut ensuite utilisée pour construire les parties manquantes de _A419_ :

source: Because the texmf files (including documentation, fonts, scripts and supporting files) are all in one tarball, it is not practical to limit what gets extracted in a sensible way (you could exclude one or other of the typesetting engines, not its many supporting files) when building from source in this manner.
fr: Coome les fichiers texmf (incluant la documentation, les polices, les scripts et les fichiers supportés) sont tous dans une seule archive, ce n'est pas pratique de limiter ce qui doit être extrait dans une étape sensible (vous pouvez exclure un ou l'autre des moteurs typographiques, pas l'ensemble des fichiers supportés) quand on construit depuis les sources de cette manière.

source: In either case, BLFS installs into _F313_ .
fr: Dans tous les cas, BLFS installe dans _F313_.

source: Also, please note that texlive is released annually, and updating from the previous year to the current year is no longer supported.
fr: Aussi, merci de noter que texlive est publié annuellmeent, et que les mises à jours de l'année précédentes vers l'année courante ne sont pas longtemps supportées.

source: If for some reason you wish to keep versions for multiple years, for most things you can mount the old or new system at /opt/texlive and fix up your PATH as necessary.
fr: Si pour certaines raisons vous souhaitez garder des versions sur plusieurs années, pour beaucoup de choses vous pouvez monter l'ancien ou le nouveau système à /opt/texlive et corriger votre PATH si nécessaire.

source: However doing that will not preserve any changes in _F314_ and if you build from source and try to run a newer version of _A572_ with an older version of _A573_ it is unlikely to work.
fr: Cependant faire cela ne préservera pas des modifications dans _F314_ et si vous construisez depuis les sources et tentez de lancer une nouvelle version de _A572_ avec une ancienne version de _A573_ cela ne fonctionnera malheureusement pas.
