Repository: espindula/br-lfs
Catalog: lfs/*/chapter08/fstab.po
Languages: fr

source: Creating the /etc/fstab File
fr: Créer le fichier /etc/fstab

source: The <filename>/etc/fstab</filename> file is used by some programs to determine where file systems are to be mounted by default, in which order, and which must be checked (for integrity errors) prior to mounting. Create a new file systems table like this:
fr: Le fichier <filename>/etc/fstab</filename> est utilisé par quelques programmes pour déterminer les systèmes de fichiers à monter par défaut, dans quel ordre, et lesquels doivent être vérifiés (recherche d'erreurs d'intégrité) avant le montage. Créez une nouvelle table des systèmes de fichiers comme ceci&nbsp;:

source: Replace <replaceable>&lt;xxx&gt;</replaceable>, <replaceable>&lt;yyy&gt;</replaceable>, and <replaceable>&lt;fff&gt;</replaceable> with the values appropriate for the system, for example, <filename class="partition">sda2</filename>, <filename class="partition">sda5</filename>, and <systemitem class="filesystem">ext4</systemitem>. For details on the six fields in this file, see <command>man 5 fstab</command>.
fr: Remplacez <replaceable>&lt;xxx&gt;</replaceable>, <replaceable>&lt;yyy&gt;</replaceable> et <replaceable>&lt;fff&gt;</replaceable> par les valeurs appropriées pour votre système, par exemple <filename class="partition">sda2</filename>, <filename class="partition">sda5</filename> et <systemitem class="filesystem">ext4</systemitem>. Pour tous les détails sur les six champs de cette table, voyez <command>man 5 fstab</command>.

source: Filesystems with MS-DOS or Windows origin (i.e. vfat, ntfs, smbfs, cifs, iso9660, udf) need a special option, utf8, in order for non-ASCII characters in file names to be interpreted properly. For non-UTF-8 locales, the value of <option>iocharset</option> should be set to be the same as the character set of the locale, adjusted in such a way that the kernel understands it. This works if the relevant character set definition (found under File systems -&gt; Native Language Support when configuring the kernel) has been compiled into the kernel or built as a module. However, if the character set of the locale is UTF-8, the corresponding option <option>iocharset=utf8</option> would make the file system case sensitive. To fix this, use the special option <option>utf8</option> instead of <option>iocharset=utf8</option>, for UTF-8 locales. The <quote>codepage</quote> option is also needed for vfat and smbfs filesystems. It should be set to the codepage number used under MS-DOS in your country. For example, in order to mount USB flash drives, a ru_RU.KOI8-R user would need the following in the options portion of its mount line in <filename>/etc/fstab</filename>:
fr: Les systèmes de fichiers ayant pour origine MS-DOS ou Windows (c-à-d. vfat, ntfs, smbfs, cifs, iso9660, udf) ont besoin d'une option spéciale, utf8, pour que les caractères non-ascii dans les noms de fichiers soient interprétés correctement. Pour les paramètres linguistiques non-utf-8, la valeur de <option>iocharset</option> devrait être la même que le jeu de caractères de votre locale, ajustée de telle sorte que le noyau la comprenne. Cela fonctionne si la définition du codage adéquat (que vous trouverez sous File systems -&gt; Native Language Support lors de la configuration du noyau) a été compilée en dur dans le noyau ou en module. Cependant, si le jeu de caractères des paramètres linguistiques est UTF-8, l'option correspondante <option>iocharset=utf8</option> rendrait le système de fichier sensible à la casse. Pour corriger cela, utilisez l'option spéciale <option>utf8</option> au lieu de <option>iocharset=utf8</option> pour les paramètres linguistiques UTF-8. L'option <quote>codepage</quote> est aussi nécessaire aux systèmes de fichiers vfat et smbfs. Elle devrait être paramétrée pour correspondre à la page de code utilisée sous MS-DOS dans votre pays. Par exemple, pour monter des lecteurs flash USB, un utilisateur ru_RU.KOI8-R aurait besoin de ce qui suit dans la partie des options de sa ligne de montage dans <filename>/etc/fstab</filename>&nbsp;:

source: The corresponding options fragment for ru_RU.UTF-8 users is:
fr: Le fragment d'options correspondantes pour les utilisateurs ru_RU.UTF-8 est&nbsp;:

source: Note that using <option>iocharset</option> is the default for <literal>iso8859-1</literal> (which keeps the file system case insensitive), and the <option>utf8</option> option tells the kernel to convert the file names using UTF-8 so they can be interpreted in the UTF-8 locale.
fr: Remarquez que l'utilisation de <option>iocharset</option> se fait par défaut pour <literal>iso8859-1</literal> (ce qui laisse le système de fichiers insensible à la casse) et l'option <option>utf8</option> dit au noyau de convertir les noms de fichiers en UTF-8 pour qu'ils puissent être interprétés dans les paramètres linguistiques UTF-8.

source: It is also possible to specify default codepage and iocharset values for some filesystems during kernel configuration. The relevant parameters are named <quote>Default NLS Option</quote> (<option>CONFIG_NLS_DEFAULT)</option>, <quote>Default Remote NLS Option</quote> (<option>CONFIG_SMB_NLS_DEFAULT</option>), <quote>Default codepage for FAT</quote> (<option>CONFIG_FAT_DEFAULT_CODEPAGE</option>), and <quote>Default iocharset for FAT</quote> (<option>CONFIG_FAT_DEFAULT_IOCHARSET</option>). There is no way to specify these settings for the ntfs filesystem at kernel compilation time.
fr: Il est aussi possible de spécifier les valeurs de page de code et de codage entrée/sortie (iocharset) par défaut pour certains systèmes de fichiers pendant la configuration du noyau. Les paramètres pertinents sont nommés <quote>Default NLS Option</quote> (<option>CONFIG_NLS_DEFAULT)</option>, <quote>Default Remote NLS Option</quote> (<option>CONFIG_SMB_NLS_DEFAULT</option>), <quote>Default codepage for FAT</quote> (<option>CONFIG_FAT_DEFAULT_CODEPAGE</option>) et <quote>Default iocharset for FAT</quote> (<option>CONFIG_FAT_DEFAULT_IOCHARSET</option>). Il n'y a aucun moyen de spécifier ces paramètres pour les systèmes de fichiers ntfs au moment de la compilation du noyau.

source: It is possible to make the ext3 filesystem reliable across power failures for some hard disk types. To do this, add the <option>barrier=1</option> mount option to the appropriate entry in <filename>/etc/fstab</filename>. To check if the disk drive supports this option, run <ulink url="&blfs-book;general/hdparm.html">hdparm</ulink> on the applicable disk drive. For example, if:
fr: Il est possible de rendre le système de fichiers ext3 résistant aux coupures de courant pour certains types de disques durs. Pour cela, ajoutez l'option de montage <option>barrier=1</option> à l'entrée appropriée dans <filename>/etc/fstab</filename>. Pour vérifier si le périphérique supporte cette option, lancez <ulink url="&blfs-book;general/hdparm.html">hdparm</ulink> sur le périphérique où elle s'appliquera. Par exemple, si&nbsp;:

source: returns non-empty output, the option is supported.
fr: ne retourne pas une sortie non vide, l'option est supportée.

source: Note: Logical Volume Management (LVM) based partitions cannot use the <option>barrier</option> option.
fr: Remarque&nbsp;: Les partitions basées sur <foreignphrase>Logical Volume Management</foreignphrase> (LVM) ne peuvent pas utiliser l'option <option>barrier</option>.
