Repository: espindula/br-lfs
Catalog: lfs/*/chapter08/pkgmgt.po
Languages: fr, pt_br, zh_cn

source: This is a simplistic package management technique that does not need a special program to manage the packages. Each package is installed in a separate directory. For example, package foo-1.1 is installed in <filename class='directory'>/usr/pkg/foo-1.1</filename> and a symlink is made from <filename>/usr/pkg/foo</filename> to <filename class='directory'>/usr/pkg/foo-1.1</filename>. When a new version foo-1.2 comes along, it is installed in <filename class='directory'>/usr/pkg/foo-1.2</filename> and the previous symlink is replaced by a symlink to the new version.
fr: C'est une technique de gestion des paquets simple qui ne nécessite aucun paquet supplémentaire pour gérer les installations. Chaque paquet est installé dans un répertoire distinct. Par exemple, le paquet foo-1.1 est installé dans <filename class='directory'>/usr/pkg/foo-1.1</filename> et un lien symbolique est créé depuis <filename>/usr/pkg/foo</filename> vers <filename class='directory'>/usr/pkg/foo-1.1</filename>. Lors de la mise à jour vers la nouvelle version foo-1.2, elle est installée dans <filename class='directory'>/usr/pkg/foo-1.2</filename> et l'ancien lien symbolique est remplacé par le lien symbolique qui mène à la nouvelle version.
pt_br: Esse é um gerenciamento de pacote simplista que não necessita de um aplicativo especial para gerenciar os pacotes. Cada pacote é instalado em um diretório separado. Por exemplo, o pacote foo-1.1 é instalado em <filename class='directory'>/usr/pkg/foo-1.1</filename> e um link simbólico é feito de <filename>/usr/pkg/foo</filename> para <filename class='directory'>/usr/pkg/foo-1.1</filename>. Quando uma nova versão foo-1.2 vier junto, ela é instalada em <filename class='directory'>/usr/pkg/foo-1.2</filename> e o link simbólico anterior é substituído por um link simbólico para a nova versão.

source: Environment variables such as <envar>PATH</envar>, <envar>LD_LIBRARY_PATH</envar>, <envar>MANPATH</envar>, <envar>INFOPATH</envar> and <envar>CPPFLAGS</envar> need to be expanded to include <filename>/usr/pkg/foo</filename>. If you install more than a few packages, this scheme becomes unmanageable.
fr: Les variables d'environnement telles que <envar>PATH</envar>, <envar>LD_LIBRARY_PATH</envar>, <envar>MANPATH</envar>, <envar>INFOPATH</envar> et <envar>CPPFLAGS</envar> ont besoin d'être étendues pour inclure <filename>/usr/pkg/foo</filename>. Si vous installez beaucoup de paquets, ce système devient ingérable.
pt_br: Variáveis de ambiente, tais como <envar>PATH</envar>, <envar>LD_LIBRARY_PATH</envar>, <envar>MANPATH</envar>, <envar>INFOPATH</envar> e <envar>CPPFLAGS</envar>, precisam ser expandidas para incluir <filename>/usr/pkg/foo</filename>. Se você instalar mais que uns poucos pacotes, [então] esse esquema se torna ingerenciável.

source: Symlink Style Package Management
fr: Gestion de paquets par lien symbolique
pt_br: Gerenciamento de Pacote Estilo Link Simbólico
zh_cn: 符号链接风格的软件包管理

source: This is a variation of the previous package management technique. Each package is installed as in the previous scheme. But instead of making the symlink via a generic package name, each file is symlinked into the <filename class='directory'>/usr</filename> hierarchy. This removes the need to expand the environment variables. Though the symlinks can be created by the user, many package managers use this approach, and automate the creation of the symlinks. A few of the popular ones include Stow, Epkg, Graft, and Depot.
fr: Il s’agit d’une variante de la technique précédente. Chaque paquet est installé de façon similaire au système précédent. Mais au lieu de créer le lien symbolique avec un nom générique pour chaque paquet, chaque fichier dispose d'un lien symbolique dans la hiérarchie <filename class='directory'>/usr</filename>. Il n’y a alors plus besoin d'étendre les variables d'environnement. Même si les liens symboliques peuvent être créés par l'utilisateur, beaucoup de gestionnaires de paquets utilisent cette approche pour automatiser la création de liens symboliques. Parmi les plus populaires, on retrouve Stow, Epkg, Graft et Depot.
pt_br: Essa é uma variação da técnica de gerenciamento de pacote anterior. Cada pacote é instalado como no esquema anterior. Mas, em vez de fazer o link simbólico via um nome genérico de pacote, cada arquivo é simbolicamente vinculado à hierarquia <filename class='directory'>/usr</filename>. Isso remove a necessidade de expandir as variáveis de ambiente. Ainda que os links simbólicos possam ser criados pelo(a) usuário(a), muitos gerenciadores de pacote usam essa abordagem e automatizam a criação dos links simbólicos. Alguns dos populares inclui Stow, Epkg, Graft, e Depot.

source: The installation script needs to be fooled, so the package thinks it is installed in <filename class="directory">/usr</filename> though in reality it is installed in the <filename class="directory">/usr/pkg</filename> hierarchy. Installing in this manner is not usually a trivial task. For example, suppose you are installing a package libfoo-1.1. The following instructions may not install the package properly:
fr: Le script d'installation doit être faussé de façon à ce que chaque paquet pense qu'il est installé dans le répertoire <filename class="directory">/usr</filename>, alors qu'en réalité il est installé dans l'arborescence <filename class="directory">/usr/pkg</filename>. Réaliser l’installation de cette manière n'est généralement pas tâche aisée. Par exemple, supposons que vous installez un paquet libfoo-1.1. Les instructions suivantes peuvent ne pas installer correctement le paquet&nbsp;:
pt_br: O script de instalação precisa ser falseado, de modo que o pacote pense que está instalado em <filename class="directory">/usr</filename>, ainda que, na realidade, ele esteja instalado na hierarquia <filename class="directory">/usr/pkg</filename>. Instalar dessa maneira geralmente não é uma tarefa trivial. Por exemplo, suponha que você está instalando um pacote libfoo-1.1. As seguintes instruções possivelmente não instalem adequadamente o pacote:

source: The installation will work, but the dependent packages may not link to libfoo as you would expect. If you compile a package that links against libfoo, you may notice that it is linked to <filename class='libraryfile'>/usr/pkg/libfoo/1.1/lib/libfoo.so.1</filename> instead of <filename class='libraryfile'>/usr/lib/libfoo.so.1</filename> as you would expect. The correct approach is to use the <envar>DESTDIR</envar> variable to direct the installation. This approach works as follows:
fr: L'installation fonctionnera, mais les paquets dépendants peuvent ne pas se lier à libfoo de la manière prévue. Si vous compilez un paquet lié à libfoo, vous verrez que qu’il est aussi lié à <filename class='libraryfile'>/usr/pkg/libfoo/1.1/lib/libfoo.so.1</filename> au lieu de <filename class='libraryfile'>/usr/lib/libfoo.so.1</filename> comme attendu. La bonne approche consiste à utiliser la stratégie <envar>DESTDIR</envar> pour diriger l'installation du paquet. Cette approche fonctionne ainsi&nbsp;:
pt_br: A instalação funcionará, mas os pacotes dependentes possivelmente não se vinculem à libfoo conforme você esperaria. Se você compilar um pacote que se vincula contra a libfoo, [então] você possivelmente perceba que ele está vinculado a <filename class='libraryfile'>/usr/pkg/libfoo/1.1/lib/libfoo.so.1</filename> em vez de <filename class='libraryfile'>/usr/lib/libfoo.so.1</filename> como você esperaria. A abordagem correta é a de usar a variável <envar>DESTDIR</envar> para direcionar a instalação. Essa abordagem funciona como se segue:

source: Most packages support this approach, but there are some which do not. For the non-compliant packages, you may either need to install the package manually, or you may find that it is easier to install some problematic packages into <filename class='directory'>/opt</filename>.
fr: La plupart des paquets prennent en charge cette approche, mais elle pose problème à certains utilisateurs. Pour les paquets non compatibles, vous pouvez soit les installer manuellement, soit opter pour une méthode plus simple en installant les paquets posant problème dans <filename class='directory'>/opt</filename>.
pt_br: A maioria dos pacotes suporta essa abordagem, mas existem alguns que não. Para os pacotes não conformes, você possivelmente ou precise instalar manualmente o pacote, ou você possivelmente ache que é mais fácil instalar alguns pacotes problemáticos em <filename class='directory'>/opt</filename>.

source: Timestamp Based
fr: Basé sur l’horodatage
pt_br: Baseado em Carimbo de Tempo
zh_cn: 基于时间戳的方案

source: In this technique, a file is timestamped before the installation of the package. After the installation, a simple use of the <command>find</command> command with the appropriate options can generate a log of all the files installed after the timestamp file was created. A package manager that uses this approach is install-log.
fr: Avec cette technique, un fichier est horodaté avant l'installation du paquet. Après l'installation, une simple exécution de la commande <command>find</command> avec les options appropriées peut générer une trace de tous les fichiers installés après la création du fichier horodaté. Le gestionnaire de paquets install-log utilise ce système.
pt_br: Nessa técnica, um arquivo é carimbado temporalmente antes da instalação do pacote. Depois da instalação, um simples uso do comando <command>find</command> com as opções apropriadas consegue gerar um registro de todos os arquivos instalados após o arquivo de carimbo de tempo ser criado. Um gerenciador de pacote que use essa abordagem é instalação-registro.

source: Though this scheme has the advantage of being simple, it has two drawbacks. If, during installation, the files are installed with any timestamp other than the current time, those files will not be tracked by the package manager. Also, this scheme can only be used when packages are installed one at a time. The logs are not reliable if two packages are installed simultaneously from two different consoles.
fr: Bien que ce schéma ait l'avantage d'être simple, il a deux inconvénients. Si à l'installation les fichiers sont installés dans autre horodatage que celui de l'heure actuelle, ils ne seront pas suivis par le gestionnaire de paquets. De plus, ce système peut être utilisé seulement lorsqu'un seul paquet est installé à la fois. Les traces ne sont pas fiables si deux paquets sont installés depuis deux consoles différentes.
pt_br: Ainda que esse esquema tenha a vantagem de ser simples, ele tem duas desvantagens. Se, durante a instalação, os arquivos forem instalados com algum outro carimbo de tempo que não a hora atual, [então] aqueles arquivos não serão rastreados pelo gerenciador de pacote. Além disso, esse esquema pode ser usado apenas quando um pacote for instalado de cada vez. Os registros não são confiáveis se dois pacotes forem instalados simultaneamente a partir de dois consoles.

source: Tracing Installation Scripts
fr: Tracer les scripts d'installation
pt_br: Scripts de Rastreamento de Instalação
zh_cn: 追踪安装脚本

source: In this approach, the commands that the installation scripts perform are recorded. There are two techniques that one can use:
fr: Avec cette approche, les commandes que les scripts d'installation exécutent sont enregistrées. Il existe deux techniques&nbsp;:
pt_br: Nessa abordagem, os comandos que os scripts de instalação realizam são gravados. Existem duas técnicas que se pode usar:
zh_cn: 在这种方式中，安装脚本执行的命令被记录下来。有两种技术可以进行记录：

source: The <envar>LD_PRELOAD</envar> environment variable can be set to point to a library to be preloaded before installation. During installation, this library tracks the packages that are being installed by attaching itself to various executables such as <command>cp</command>, <command>install</command>, <command>mv</command> and tracking the system calls that modify the filesystem. For this approach to work, all the executables need to be dynamically linked without the suid or sgid bit. Preloading the library may cause some unwanted side-effects during installation. Therefore, it's a good idea to perform some tests to ensure that the package manager does not break anything, and that it logs all the appropriate files.
fr: Vous pouvez initialiser la variable d'environnement <envar>LD_PRELOAD</envar> pour qu'elle pointe vers une bibliothèque à précharger avant l'installation. Lors de l'installation de cette dernière, la bibliothèque trace les paquets en cours d'installation en s'attachant aux différents exécutables comme <command>cp</command>, <command>install</command>, <command>mv</command> et trace les appels système qui modifient le système de fichiers. Pour que cette approche fonctionne, tous les exécutables ont besoin d'être liés dynamiquement sans bit suid ou sgid. Le préchargement de la bibliothèque peut provoquer des effets secondaires indésirables lors de l'installation&nbsp;; effectuez donc quelques tests pour vous assurer que le gestionnaire de paquets n’endommage rien et trace bien les fichiers nécessaires.
pt_br: A variável de ambiente <envar>LD_PRELOAD</envar> pode ser configurada para apontar para uma biblioteca a ser pré-carregada antes da instalação. Durante a instalação, essa biblioteca rastreia os pacotes que estão sendo instalados anexando-se a vários executáveis, tais como o <command>cp</command>, o <command>install</command>e o <command>mv</command>, e rastreando as chamadas de sistema que modificam o sistema de arquivos. Para essa abordagem funcionar, todos os executáveis precisam ser dinamicamente vinculados sem o bit suid ou sgid. Pré-carregar a biblioteca possivelmente cause alguns efeitos colaterais indesejados durante a instalação. Portanto, é uma boa ideia realizar alguns testes para garantir que o gerenciador de pacote não quebre nada e que ele registre todos os arquivos adequados.

source: Another technique is to use <command>strace</command>, which logs all the system calls made during the execution of the installation scripts.
fr: La seconde technique consiste à utiliser la commande <command>strace</command>, qui trace tous les appels du système effectués pendant l'exécution des scripts d'installation.
pt_br: Outra técnica é a de usar o <command>strace</command>, que registra todas as chamadas de sistema feitas durante a execução dos scripts de instalação.

source: Creating Package Archives
fr: Créer des archives de paquets
pt_br: Criando Arquivamentos de Pacote
zh_cn: 创建软件包档案

source: In this scheme, the package installation is faked into a separate tree as previously described in the symlink style package management section. After the installation, a package archive is created using the installed files. This archive is then used to install the package on the local machine or even on other machines.
fr: Dans ce système, l'installation d'un paquet est déplacé pour de faux dans un répertoire séparé comme décrit plus haut. Après l'installation, une archive du paquet est créée grâce aux fichiers installés. L'archive est ensuite utilisée pour installer le paquet, soit sur la machine locale, soit sur d'autres machines.
pt_br: Nesse esquema, a instalação do pacote é falseada em uma árvore separada como descrito previamente na seção do gerenciamento de pacote estilo Link Simbólico. Depois da instalação, um arquivamento de pacote é criado usando os arquivos instalados. Esse arquivamento é então usado para instalar o pacote na máquina local ou até mesmo em outras máquinas.

source: This approach is used by most of the package managers found in the commercial distributions. Examples of package managers that follow this approach are RPM (which, incidentally, is required by the <ulink url="https://refspecs.linuxfoundation.org/lsb.shtml">Linux Standard Base Specification</ulink>), pkg-utils, Debian's apt, and Gentoo's Portage system. A hint describing how to adopt this style of package management for LFS systems is located at <ulink url="&hints-root;fakeroot.txt"/>.
fr: Cette approche est utilisée par la plupart des gestionnaires de paquets trouvés dans les distributions commerciales. Les exemples de gestionnaires qui suivent cette approche sont RPM, qui d'ailleurs est requis par la <ulink url="https://refspecs.linuxfoundation.org/lsb.shtml">Spécification de base de Linux Standard</ulink>, pkg-utils, apt de Debian et le système de portage de Gentoo. Une astuce montrant comment adopter ce style de gestion de paquets pour les systèmes LFS se trouve ici&nbsp;: <ulink url="http://www.fr.linuxfromscratch.org/view/astuces/fakeroot-fr.txt"/>.
pt_br: Essa abordagem é a usada pela maioria dos gerenciadores de pacote encontrados nas distribuições comerciais. Exemplos de gerenciadores de pacote que seguem essa abordagem são RPM (o qual, incidentalmente, é exigido pela <ulink url="http://refspecs.linuxfoundation.org/lsb.shtml">Linux Standard Base Specification</ulink>), pkg-utils, apt do Debian, e sistema Portage do Gentoo. Uma dica descrevendo como adotar esse estilo de gerenciamento de pacote para sistemas LFS está localizada em <ulink url="&hints-root;fakeroot.txt"/>.

source: The creation of package files that include dependency information is complex, and beyond the scope of LFS.
fr: La création de fichiers de paquet qui incluent des informations de dépendance est complexe et va au-delà de l'objectif de LFS.
pt_br: A criação de arquivos de pacote que incluem informação de dependência é complexa e além do escopo do LFS.

source: Slackware uses a <command>tar</command>-based system for package archives. This system purposely does not handle package dependencies as more complex package managers do. For details of Slackware package management, see <ulink url="https://www.slackbook.org/html/package-management.html"/>.
fr: Slackware utilise un système basé sur <command>tar</command> pour les archives de paquets. Ce système ne gère volontairement pas les dépendances de paquets car d'autres gestionnaires de paquets plus complexes le font. Pour plus d’informations sur la gestion des paquets, voir <ulink url="https://www.slackbook.org/html/package-management.html"/>.
pt_br: O Slackware usa um sistema baseado em <command>tar</command> para arquivamentos de pacote. Esse sistema intencionalmente não manuseia dependências de pacote como gerenciadores de pacote mais complexos fazem. Para detalhes de gerenciamento de pacote do Slackware, veja-se <ulink url="http://www.slackbook.org/html/package-management.html"/>.

source: User Based Management
fr: Gestion basée sur les utilisateurs
pt_br: Gerenciamento Baseado em Usuária(o)
zh_cn: 基于用户的软件包管理

source: This scheme, unique to LFS, was devised by Matthias Benkmann, and is available from the <ulink url="&hints-root;">Hints Project</ulink>. In this scheme, each package is installed as a separate user into the standard locations. Files belonging to a package are easily identified by checking the user ID. The features and shortcomings of this approach are too complex to describe in this section. For the details please see the hint at <ulink url="&hints-root;more_control_and_pkg_man.txt"/>.
fr: Cette méthode, unique à LFS, a été décrite par Matthias Benkmann et est disponible sur le <ulink url="&hints-root;">Hints Project</ulink>. Selon cette méthode, chaque paquet est installé en tant qu'utilisateur séparé dans les emplacements standards. Les fichiers appartenant à un paquet sont facilement identifiables grâce à l'identifiant de l'utilisateur. Les avantages et inconvénients de cette approche sont trop complexes pour pouvoir tous les décrire dans cette section. Pour plus d’informations, voir l'astuce sur <ulink url="http://www.fr.linuxfromscratch.org/view/astuces/gestionnaire-paquets-utilisateur.txt"/>.
pt_br: Esse esquema, único para LFS, foi concebido por Matthias Benkmann e está disponível a partir do <ulink url="&hints-root;">Hints Project</ulink>. Nesse esquema, cada pacote é instalado como uma(m) usuária(o) separada(o) nos locais padrão. Arquivos pertencentes a um pacote são facilmente identificados checando o ID de usuária(o). As características e deficiências dessa abordagem são muito complexas para serem descritas nesta seção. Para os detalhes, por favor veja-se a dica em <ulink url="&hints-root;more_control_and_pkg_man.txt"/>.
zh_cn: 这种架构是 LFS 特有的，由 Matthias Benkmann 提出，可以在 <ulink url="&hints-root;">Hints Project</ulink> 查阅。在该架构中，每个软件包都由一个单独的用户安装到标准位置。只要检查文件所有者，就能找出属于一个软件包的所有文件。它的优缺点十分复杂，无法在本节讨论。如果想详细了解，请访问 <ulink url="&hints-root;more_control_and_pkg_man.txt"/> 阅读。

source: Deploying LFS on Multiple Systems
fr: Déployer LFS sur plusieurs systèmes
pt_br: Implantando o LFS em Múltiplos Sistemas
zh_cn: 在多个系统上部署 LFS
