Repository: espindula/br-lfs
Catalog: lfs/*/chapter08/pkgmgt.po
Languages: fr, pt_br, zh_cn

source: Package Management
fr: Gestion des paquets
pt_br: Gerenciamento de Pacote
zh_cn: 软件包管理

source: Package Management is an often requested addition to the LFS Book. A Package Manager tracks the installation of files, making it easier to remove and upgrade packages. A good package manager will also handle the configuration files specially to keep the user configuration when the package is reinstalled or upgraded. Before you begin to wonder, NO&mdash;this section will not talk about nor recommend any particular package manager. What it does provide is a roundup of the more popular techniques and how they work. The perfect package manager for you may be among these techniques, or it may be a combination of two or more of these techniques. This section briefly mentions issues that may arise when upgrading packages.
fr: On nous a souvent demandé d’ajouter la gestion des paquets au livre LFS. Un gestionnaire de paquets permet de suivre l'installation des fichiers, simplifiant ainsi la suppression ou la mise à jour des paquets. Un bon gestionnaire de paquets gère également les fichiers de configuration pour conserver la configuration spécifique de l'utilisateur lorsque le paquet est réinstallé ou mis à jour. Avant toute chose, cette section ne parle pas et ne recommande pas un gestionnaire de paquets en particulier. Elle résume les techniques les plus populaires et leur fonctionnement. Le gestionnaire de paquets qui vous convient le mieux peut se trouver parmi ces techniques ou être une combinaison d'une ou plusieurs techniques. Cette section mentionne brièvement les problèmes qui peuvent survenir lors de la mise à jour de paquets.
pt_br: Gerenciamento de Pacote é uma adição frequentemente solicitada ao Livro LFS. Um Gerenciador de Pacote rastreia a instalação de arquivos, tornando mais fácil remover e atualizar pacotes. Um bom gerenciador de pacote também lidará com os arquivos de configuração, especialmente para manter a configuração do(a) usuário(a) quando o pacote for reinstalado ou atualizado. Antes que você comece a questionar, NÃO&mdash;esta seção não falará nem recomendará qualquer gerenciador de pacote em particular. O que ela fornece é um resumo acerca das técnicas mais populares e como elas funcionam. O gerenciador de pacote perfeito para você possivelmente esteja entre essas técnicas ou possivelmente seja uma combinação de duas ou mais dessas técnicas. Esta seção menciona brevemente problemas que possivelmente surjam quando da atualização de pacotes.

source: Some reasons why no package manager is mentioned in LFS or BLFS include:
fr: Voici la raison pour laquelle aucun gestionnaire de paquets n’est mentionné dans LFS ou BLFS&nbsp;:
pt_br: Algumas razões porque nenhum gerenciador de pacote é mencionado no LFS ou no BLFS incluem:
zh_cn: LFS 或 BLFS 不介绍任何包管理器的原因包括：

source: Dealing with package management takes the focus away from the goals of these books&mdash;teaching how a Linux system is built.
fr: La gestion des paquets ne fait pas partie de l’objectif de ces livres, qui visent à apprendre aux utilisateurs à construire un système Linux.
pt_br: Lidar com gerenciamento de pacote retira o foco das finalidades desses livros&mdash;ensinar como um sistema Linux é construído.
zh_cn: 处理软件包管理会偏离这两本手册的目标 —— 讲述如何构建 Linux 系统。

source: There are multiple solutions for package management, each having its strengths and drawbacks. Finding one solution that satisfies all audiences is difficult.
fr: Il existe de nombreuses solutions pour gérer des paquets. Chacune a ses points forts et ses points faibles. En trouver une qui satisfait tout le monde est difficile.
pt_br: Existem múltiplas soluções para gerenciamento de pacote, cada uma tendo seus pontos fortes e fracos. Encontrar uma solução que satisfaça todas as audiências é difícil.

source: There are some hints written on the topic of package management. Visit the <ulink url="&hints-root;">Hints Project</ulink> and see if one of them fits your needs.
fr: Nous avons évoqué quelques astuces sur le sujet de la gestion des paquets. Consultez le <ulink url="&hints-root;">Hints Project</ulink> et trouvez le gestionnaire qui correspond à vos besoins.
pt_br: Existem algumas dicas escritas no tópico do gerenciamento de pacote. Visite o <ulink url="&hints-root;">Hints Project</ulink> e veja se uma delas se adéqua às suas necessidades.

source: Upgrade Issues
fr: Problèmes de mise à jour
pt_br: Problemas de Atualização
zh_cn: 升级问题

source: A Package Manager makes it easy to upgrade to newer versions when they are released. Generally the instructions in the LFS and BLFS books can be used to upgrade to the newer versions. Here are some points that you should be aware of when upgrading packages, especially on a running system.
fr: Un gestionnaire de paquets facilite la mise à jour des nouvelles versions au moment de leur sortie. Généralement, les instructions contenues dans les livres LFS et BLFS peuvent être utilisées pour mettre à jour les paquets vers de nouvelles versions. Voici quelques points à connaître pour mettre à jour vos paquets, spécifiquement sur un système en cours de fonctionnement.
pt_br: Um Gerenciador de Pacote torna fácil atualizar para versões mais novas quando elas são liberadas. Geralmente as instruções nos livros LFS e BLFS podem ser usadas para atualizar para as versões mais novas. Aqui estão alguns pontos que você deveria estar ciente quando da atualização de pacotes, especialmente em um sistema em execução.
zh_cn: 使用包管理器可以在软件包新版本发布后容易地完成升级。一般来说，使用 LFS 或者 BLFS 手册给出的构建方法即可升级软件包。下面是您在升级时必须注意的重点，特别是升级正在运行的系统时。

source: If the Linux kernel needs to be upgraded (for example, from 5.10.17 to 5.10.18 or 5.11.1), nothing else needs to be rebuilt. The system will keep working fine thanks to the well-defined interface between the kernel and userspace. Specifically, Linux API headers need not be (and should not be, see the next item) upgraded along with the kernel. You will merely need to reboot your system to use the upgraded kernel.
fr: Si le noyau Linux doit être mis à jour, et passer par exemple de la version 5.10.17 à la version 5.10.18 ou 5.11.1, vous n’avez pas besoin de reconstruire d'autres éléments. Le système continuera de fonctionner correctement grâce à l'interface bien définie entre le noyau et l'espace utilisateur. Plus précisément, les headers de l'API Linux n'ont pas besoin d'être mis à jour (et ne doivent pas l'être, voir le point suivant) en même temps que le noyau. Vous devrez simplement redémarrer votre système pour utiliser le noyau à jour.
pt_br: Se o núcleo Linux precisar ser atualizado (por exemplo, de 5.10.17 para 5.10.18 ou 5.11.1), [então] nada mais precisa ser reconstruído. O sistema seguirá funcionando bem graças à interface bem definida entre o núcleo e o espaço de usuária(o). Especificamente, os cabeçalhos da API do Linux não precisam ser (e não deveriam ser, veja-se o próximo item) atualizados juntamente com o núcleo. Você meramente precisará reiniciar seu sistema para usar o núcleo atualizado.

source: If the Linux API headers or Glibc need to be upgraded to a newer version, (e.g., from Glibc-2.31 to Glibc-2.32), it is safer to rebuild LFS. Though you <emphasis>may</emphasis> be able to rebuild all the packages in their dependency order, we do not recommend it.
fr: Si les headers de l'API Linux ou de glibc doivent être mis à jour vers une nouvelle version, et passer par exemple de la version glibc-2.31 à glibc-2.32, il est plus sécurisé de reconstruire LFS. Même si vous <emphasis>pourriez</emphasis> être capable de reconstruire tous les paquets dans leur ordre de dépendance, nous vous le déconseillons.
pt_br: Se os cabeçalhos da API do Linux ou os da Glibc precisarem ser atualizados para uma versão mais nova (por exemplo, da Glibc-2.31 para a Glibc-2.32), [então] é mais seguro reconstruir o LFS. Ainda que você <emphasis>possivelmente</emphasis> seja capaz de reconstruir todos os pacotes na ordem de dependência deles, nós não recomendamos isso.

source: If a package containing a shared library is updated, and if the name of the library changes, then any packages dynamically linked to the library must be recompiled, to link against the newer library. (Note that there is no correlation between the package version and the name of the library.) For example, consider a package foo-1.2.3 that installs a shared library with the name <filename class='libraryfile'>libfoo.so.1</filename>. Suppose you upgrade the package to a newer version foo-1.2.4 that installs a shared library with the name <filename class='libraryfile'>libfoo.so.2</filename>. In this case, any packages that are dynamically linked to <filename class='libraryfile'>libfoo.so.1</filename> need to be recompiled to link against <filename class='libraryfile'>libfoo.so.2</filename> in order to use the new library version. You should not remove the old libraries until all the dependent packages have been recompiled.
fr: Si un paquet contenant une bibliothèque partagée est mis à jour et si le nom de cette dernière est modifié, alors les paquets liés dynamiquement à la bibliothèque devront être recompilés pour être liés à la nouvelle bibliothèque. Notez qu'il n'y a aucune corrélation entre la version du paquet et le nom de la bibliothèque. Par exemple, prenez un paquet foo-1.2.3 qui installe une bibliothèque partagée appelée <filename class='libraryfile'>libfoo.so.1</filename>. Partons du principe que vous mettez à jour le paquet avec une nouvelle version foo-1.2.4 qui installe une bibliothèque partagée appelée <filename class='libraryfile'>libfoo.so.2</filename>. Dans ce cas, tous les paquets liés dynamiquement à <filename class='libraryfile'>libfoo.so.1</filename> doivent être recompilés pour être liés à <filename class='libraryfile'>libfoo.so.2</filename>. Vous ne devez pas supprimer les anciennes bibliothèques avant que les paquets indépendants ne soient tous recompilés.
pt_br: Se um pacote contendo uma biblioteca compartilhada for atualizado e se o nome da biblioteca mudar, então quaisquer pacotes dinamicamente vinculados à biblioteca precisam ser recompilados, para vincular contra a biblioteca mais nova. (Observe que não existe correlação entre a versão de pacote e o nome da biblioteca). Por exemplo, considere um pacote foo-1.2.3 que instala uma biblioteca compartilhada com o nome <filename class='libraryfile'>libfoo.so.1</filename>. Suponha que você atualize o pacote para uma versão mais nova foo-1.2.4 que instala uma biblioteca compartilhada com o nome <filename class='libraryfile'>libfoo.so.2</filename>. Nesse caso, quaisquer pacotes que estiverem dinamicamente vinculados à <filename class='libraryfile'>libfoo.so.1</filename> precisam ser recompilados para vincular contra <filename class='libraryfile'>libfoo.so.2</filename> com a finalidade de usar a nova versão da biblioteca. Você não deveria remover as bibliotecas antigas até que todos os pacotes dependentes tenham sido recompilados.

source: If a package is (directly or indirectly) linked to both the old and new names of a shared library (for example, the package links to both <filename class='libraryfile'>libfoo.so.2</filename> and <filename class='libraryfile'>libbar.so.1</filename>, while the latter links to <filename class='libraryfile'>libfoo.so.3</filename>), the package may malfunction because the different revisions of the shared library present incompatible definitions for some symbol names. This can be caused by recompiling some, but not all, of the packages linked to the old shared library after the package providing the shared library is upgraded. To avoid the issue, users will need to rebuild every package linked to a shared library with an updated revision (e.g. libfoo.so.2 to libfoo.so.3) as soon as possible.
fr: Si un paquet est (directement ou indirectement) lié à la fois à l'ancien et au nouveau nom d'une bibliothèque partagée (par exemple, le paquet se lie à la fois à <filename class='libraryfile'>libfoo.so.2</filename> et à <filename class='libraryfile'>libbar.so.1</filename>, alors que cette dernière est un lien vers <filename class='libraryfile'>libfoo.so.3</filename>), le paquet peut ne pas fonctionner correctement car les différentes versions des bibliothèques partagées fournissent des définitions incompatibles pour certains noms de symboles. Cela peut arriver en recompilant certains paquets, mais en en oubliant d'autres, liés à d'anciennes bibliothèques après la mise à jour du paquet qui fournit la bibliothèque partagée. Pour éviter ce problème, vous devrez recompiler tous les paquets liés à une bibliothèque partagée qui possède une nouvelle révision (p.&nbsp;ex. libfoo.so.2 devient libfoo.so.3) le plus vite possible.

source: If a package containing a shared library is updated, and the name of the library doesn't change, but the version number of the library <emphasis role="bold">file</emphasis> decreases (for example, the library is still named <filename class='libraryfile'>libfoo.so.1</filename>, but the name of the library file is changed from <filename class='libraryfile'>libfoo.so.1.25</filename> to <filename class='libraryfile'>libfoo.so.1.24</filename>), you should remove the library file from the previously installed version (<filename class='libraryfile'>libfoo.so.1.25</filename> in this case). Otherwise, a <command>ldconfig</command> command (invoked by yourself from the command line, or by the installation of some package) will reset the symlink <filename class='libraryfile'>libfoo.so.1</filename> to point to the old library file because it seems to be a <quote>newer</quote> version; its version number is larger. This situation may arise if you have to downgrade a package, or if the authors change the versioning scheme for library files.
fr: Si vous mettez à jour un paquet qui contient une bibliothèque partagée et que le nom de la bibliothèque ne change pas, mais que le numéro de version du <emphasis role="bold">fichier</emphasis> de la bibliothèque décroît (par exemple le nom reste <filename class='libraryfile'>libfoo.so.1</filename>, mais le nom du fichier de la bibliothèque change de <filename class='libraryfile'>libfoo.so.1.25</filename> à <filename class='libraryfile'>libfoo.so.1.24</filename>), vous devez supprimer le fichier de bibliothèque de la version précédente (<filename class='libraryfile'>libfoo.so.1.25</filename> dans ce cas). Sinon, en exécutant <command>ldconfig</command> manuellement via la ligne de commande, ou en installant un paquet, vous réinitialiserez le lien symbolique <filename class='libraryfile'>libfoo.so.1</filename> vers l'ancien fichier de bibliothèque, car sa version est <quote>plus récente</quote>, puisque le numéro est plus grand. Cette situation arrive quand vous installez une version précédente d'un paquet, ou que l’auteur du paquet change de pratique de nommage des versions.
pt_br: Se um pacote contendo uma biblioteca compartilhada for atualizado e o nome da biblioteca não mudar, porém o número de versão do <emphasis role="bold">arquivo</emphasis> da biblioteca decrescer (por exemplo, a biblioteca ainda é chamada de <filename class='libraryfile'>libfoo.so.1</filename>, porém o nome do arquivo da biblioteca for mudado de <filename class='libraryfile'>libfoo.so.1.25</filename> para <filename class='libraryfile'>libfoo.so.1.24</filename>), [então] você deveria remover o arquivo da biblioteca originário da versão previamente instalada (<filename class='libraryfile'>libfoo.so.1.25</filename> nesse caso). Do contrário, um comando <command>ldconfig</command> (invocado por você mesmo(a) a partir da linha de comando ou pela instalação de algum pacote) reconfigurará o link simbólico <filename class='libraryfile'>libfoo.so.1</filename> para apontar para o antigo arquivo da biblioteca, pois ele aparenta ser uma versão <quote>mais nova</quote>; o número de versão dele é mais largo. Essa situação possivelmente surge se você tiver que desatualizar um pacote ou se os(as) autores(as) mudarem o esquema de versionamento para arquivos de biblioteca.

source: If a package containing a shared library is updated, and the name of the library doesn't change, but a severe issue (especially, a security vulnerability) is fixed, all running programs linked to the shared library should be restarted. The following command, run as <systemitem class="username">root</systemitem> after the update is complete, will list which processes are using the old versions of those libraries (replace <replaceable>libfoo</replaceable> with the name of the library):
fr: Si vous mettez à jour un paquet qui contient une bibliothèque partagée et que le nom de la bibliothèque ne change pas, mais qu'un problème important, comme une vulnérabilité de sécurité, est corrigé, tous les programmes en cours d'exécution liés à la bibliothèque partagée doivent être redémarrés. La commande suivante, lancée en tant qu’utilisateur <systemitem class="username">root</systemitem> après la mise à jour, affiche les processus qui utilisent les anciennes versions de ces bibliothèques (remplacez <replaceable>libfoo</replaceable> par le nom de la bibliothèque)&nbsp;:
pt_br: Se um pacote contendo uma biblioteca compartilhada for atualizado e o nome da biblioteca não mudar, porém um problema severo (especialmente, uma vulnerabilidade de segurança) for corrigido, [então] todos os aplicativos em execução vinculados à biblioteca compartilhada deveriam ser reiniciados. O seguinte comando, executado como <systemitem class="username">root</systemitem> depois que a atualização estiver completa, listará quais processos estão usando as versões antigas daquelas bibliotecas (substitua <replaceable>libfoo</replaceable> pelo nome da biblioteca):

source: If <application>OpenSSH</application> is being used to access the system and it is linked to the updated library, you must restart the <command>sshd</command> service, then logout, login again, and run the preceding command again to confirm that nothing is still using the deleted libraries.
fr: Si <application>OpenSSH</application> est utilisé pour accéder au système et qu'il est lié à la bibliothèque mise à jour, vous devez redémarrer le service <command>sshd</command>, vous déconnecter, vous reconnecter et relancer la commande précédente pour confirmer qu’aucun processus n'utilise les bibliothèques supprimées.

source: If the <command>systemd</command> daemon (running as PID 1) is linked to the updated library, you can restart it without rebooting by running <command>systemctl daemon-reexec</command> as the <systemitem class='username'>root</systemitem> user.
fr: Si le démon <command>systemd</command> (qui tourne en tant que PID 1) est lié à une bibliothèque mise à jour, vous pouvez le recharger sans redémarrage en exécutant la commande <command>systemctl daemon-reexec</command> en tant qu'utilisateur <systemitem class='username'>root</systemitem>.
pt_br: Se o daemon <command>systemd</command> (executando como o PID 1) for vinculado à biblioteca atualizada, [então] você pode reiniciá-lo sem reinicializar executando <command>systemctl daemon-reexec</command> como o(a) usuário(a) <systemitem class='username'>root</systemitem>.

source: If an executable program or a shared library is overwritten, the processes using the code or data in that program or library may crash. The correct way to update a program or a shared library without causing the process to crash is to remove it first, then install the new version. The <command>install</command> command provided by <application>coreutils</application> has already implemented this, and most packages use that command to install binary files and libraries. This means that you won't be troubled by this issue most of the time. However, the install process of some packages (notably Mozilla JS in BLFS) just overwrites the file if it exists; this causes a crash. So it's safer to save your work and close unneeded running processes before updating a package.
fr: Si un programme ou une bibliothèque partagée est écrasé, les processus utilisant le code ou les données du programme ou de la bibliothèque peuvent planter. La bonne manière de mettre à jour un programme ou une bibliothèque partagée sans interruption anormale du processus est de le supprimer d'abord, puis d'installer la nouvelle version. La commande <command>install</command> fournie par <application>coreutils</application> implémente déjà cela et la plupart des paquets l'utilisent pour installer des binaires et des bibliothèques. Cela signifie que vous n'aurez pas ce problème la plupart du temps. Cependant, le processus d'installation de certains paquets, notamment Mozilla JS dans BLFS, se contente de réécrire sur le fichier s'il existe déjà et cause un crash, donc il est plus prudent de sauvegarder votre travail et de fermer les processus inutiles avant de mettre à jour un paquet.
pt_br: Se um aplicativo executável ou uma biblioteca compartilhada for sobrescrito, [então] os processos usando o código ou os dados naquele aplicativo ou biblioteca possivelmente quebrem. A maneira correta para atualizar um aplicativo ou uma biblioteca compartilhada sem causar quebra ao processo é a de removê-lo primeiro, então instalar a versão nova. O comando <command>install</command> fornecido por <application>coreutils</application> já implementou isso e a maioria dos pacotes usa esse comando para instalar arquivos binários e bibliotecas. Isso significa que você não estaria encrencada(o) por esse problema a maior parte do tempo. Entretanto, o processo de instalação de alguns pacotes (notadamente Mozilla JS no BLFS) apenas sobrescreve o arquivo se ele existir; isso causa uma quebra. Assim, é mais seguro salvar seu trabalho e fechar processos em execução desnecessários antes de atualizar um pacote.

source: Package Management Techniques
fr: Techniques de gestion des paquets
pt_br: Técnicas de Gerenciamento de Pacote
zh_cn: 软件包管理技术

source: The following are some common package management techniques. Before making a decision on a package manager, do some research on the various techniques, particularly the drawbacks of each particular scheme.
fr: Voici une liste des techniques les plus courantes en gestion de paquets. Avant de choisir un gestionnaire de paquets, cherchez les différentes techniques et notamment les points faibles de chaque système.
pt_br: As seguintes são algumas técnicas comuns de gerenciamento de pacote. Antes de se decidir acerca de um gerenciador de pacote, pesquise sobre as várias técnicas, particularmente os pontos fracos de cada esquema em particular.

source: It is All in My Head!
fr: Tout est dans ma tête&nbsp;!
pt_br: Está Tudo na Minha Cabeça!
zh_cn: 这都在我的脑袋里！

source: Yes, this is a package management technique. Some folks do not need a package manager because they know the packages intimately and know which files are installed by each package. Some users also do not need any package management because they plan on rebuilding the entire system whenever a package is changed.
fr: Oui, c'est une technique de gestion des paquets. Certains n'ont pas besoin d'un gestionnaire de paquets parce qu'ils connaissent très bien les paquets et connaissent les fichiers installés pour chaque paquet. D’autres n'en ont pas besoin parce qu'ils planifient la reconstruction entière de LFS dès qu'un paquet est modifié.
pt_br: Sim, essa é uma técnica de gerenciamento de pacote. Algumas pessoas não necessitam de um gerenciador de pacote, pois elas conhecem os pacotes intimamente e sabem quais arquivos estão instalados por cada pacote. Alguns(mas) usuários(as) também não precisam de qualquer gerenciamento de pacote, pois eles(as) planejam reconstruir o sistema inteiro sempre que um pacote for mudado.

source: Install in Separate Directories
fr: Installation dans des répertoires distincts
pt_br: Instalação em Diretórios Separados
zh_cn: 安装到独立目录
